{
  "1": "ExLibris\nRapidILL\nRapid #: -21368416\nCROSS REF ID: 4649252260007446\nLENDER:\nUUM (University of Utah) :: Marriott Library\nBORROWER:\nTYPE:\nJOURNAL TITLE:\nEZ9 (University of Exeter) :: Electronic\nArticle CC:CCL\nLe Muséon\nUSER JOURNAL TITLE: Le Museon\nDie Überlieferung der ältesten arabischen Handschrift von Pseudo-Aristoteles 'De Mundo'\nFelix Klein-Franke\nARTICLE TITLE:\nARTICLE AUTHOR:\nVOLUME:\n87\nISSUE:\nMONTH:\nYEAR:\n1974\nPAGES:\n59-65\nISSN:\n0771-6494\nOCLC #:\nProcessed by RapidX:\n10/3/2023 11:01:49 AM\nThe copyright law of the United States (Title 17, United States Code) governs the making of photocopies or other\nreproductions of copyrighted materials. Under certain conditions specified in the law, libraries and archives are authorized to\nfurnish a photocopy or other reproduction. One of these specified conditions is that the photocopy or reproduction is not to\nbe \"used for any purpose other than private study, scholarship, or research\". If a user makes a request for, or later uses, a\nphotocopy or reproduction for purposes in excess of \"fair use\", that user may be liable for copyright infringement. This\ninstitution reserves the right to refuse to accept a copying order if, in its judgment, fulfillment of the order would involve\nviolation of copyright law.",
  "2": "University of Utah Marriott Library ILL\nILLiad TN: 1817021\nT ALL BEAT READ STEIN TORE BREE OLE LITE\nOctober 3, 2023\nBorrower: RAPID:EZ9\nLending String:\nJournal/Book Title: Le Museón\nVolume: 87\nIssue:\nMonth/Year: 1974\nPages: 59-65\nArticle Author: Felix Klein-Franke\nArticle Title: Die Überlieferung der ältesten\narabischen Handschrift von Pseudo-Aristoteles 'De\nMundo'\nCall #: ARC DS1 .M87 v.87 1974\nNotes:\nBilling Category: Exempt\nMaxcost:\nDelivery Method: Send via Odyssey\nemail:\nEMAIL:\nShipping Address:\nNEW: Electronic\nILL Number: -21368416\nNOTICE WARNING CONCERNING COPYRIGHT RESTRICTIONS\nThe copyright law of the United States [Title 17, United States Code] governs the making of photocopies or the other reproductions\nof copyrighted material.\nUnder certain conditions specified in the law, libraries and archives are authorized to furnish a photocopy or other reproduction. One\nof these specified conditions is that the reproduction is not to be used for any purpose other than private study, scholarship, or\nresearch. If a user makes a request for, or later uses, a photocopy or reproduction for purposes in excess of fair use, that use may\nbe liable for copyright infringement.\nThis institution reserves the right to refuse to accept a copying order if, in its judgment, fulfillment of the order would involve\nviolation of copyright law. No further reproduction and distribution of this copy is permitted by transmission or any other means.",
  "3": "DIE ÜBERLIEFERUNG\nDER ÄLTESTEN ARABISCHEN HANDSCHRIFT\nVON PSEUDO-ARISTOTELES DE MUNDO >\nDie arabischen Verzeichnisse der aristotelischen Schriften bei Ibn\nan-Nadim (gest. 990), Ibn al-Qifti (1172-1248) und Ibn Abi Usaibi'a\n(1194-1269) enthalten eine große Anzahl von Werken, die dem Stagiriten\nzugeschrieben, den Arabern aber wohl nie bekannt geworden waren.\nSolche Titel stammen aus syrischen Schriftverzeichnissen und sind\nvon den arabischen Pinakographen aus Gründen der Vollständigkeit\nin die eigenen Listen aufgenommen worden. Aber auch der umgekehrte\nFall ist bezeugt, daß die arabische Übersetzung einer aristotelischen\nSchrift vorlag, die nicht namentlich in den arabischen Verzeichnissen\naufgeführt war. Dies trifft auf Ps.-Aristoteles' De Mundo zu; das\nWerk war den Arabern nämlich nicht als Einzelschrift bekannt,\nsondern als Teil einer umfangreichen Korrespondenz zwischen Aristo-\nteles und seinem Schüler Alexander dem Großen und ist unter die\nBriefe des Aristoteles aufgenommen worden. Aus diesem Grunde ist\nman auf die arabischen Übersetzungen von «De Mundo » erst sehr\nspät aufmerksam geworden, während die syrische, armenische und\nlateinische Version längst bekannt war.\nS. M. Stern hat an dieser Stelle eine sehr gründliche Studie über\ndie arabischen Übersetzungen von «De mundo» veröffentlicht, die\nweit über den Rahmen einer textkritischen Untersuchung hinaus\neinen wichtigen Beitrag zur literarischen Tradition des arabischen\nAlexanderromans darstellt. Seine Studie stützt sich auf zwei Hand-\nschriften: Istanbul, Fātiḥ 5323 (aus dem Jahre 1316/7) und Princeton\nUniversity, Yahuda 308. Beide Handschriften gehen auf eine syrische\nÜbersetzung zurück; im Falle des Ms. Princeton ist dies durch einen\nHinweis im Kolophon bezeugt, bezüglich der Stambuler Handschrift\nhat Stern den Nachweis durch einen Vergleich der syrischen und der\narabischen Fassung mit dem griechischen Original erbracht.\n1 S. M. STERN, The Arabic Translations of the Pseudo-Aristotelian treatise De Mundo,\nLe Muséon 77 (1964), S. 187-204.\nR. Walzer hat diese Handschrift beschrieben in: R. WALZER, Greek into Arabic,\n1962, S. 139 f.\n3 S. M. STERN, a.a.O., S. 193.\n59",
  "4": "60\n60\nF. KLEIN-FRANKE\nIn einer später veröffentlichten Studie 4 zog Stern einen dritten\nTextzeugen heran. Ich bin auf diese dritte arabische Handschrift\nunabhängig von Sterns Studie gestoßen und bin in meiner Unter-\nsuchung dieser Handschrift zu Ergebnissen gelangt, die von jenen\nSterns teilweise sehr verschieden sind. Diese älteste arabische Version\nvon De mundo >> befindet sich in der Stambuler Handschrift Köprülü\n1608, foll. 182 b 189 b, welche die «Nawadir al-falāsifa » des Ḥunain\nibn Ishaq enthält. Das bekräftigt von neuem die Vermutung, daß\nHunain ibn Ishaq in seine Sammlung vornehmlich Pseudepigraphisches\naufnahm.\nNoch unter dem Eindruck der beiden ersten Handschriften, neigte\nStern zu der Annahme, daß auch diese dritte Handschrift aus einer\nsyrischen Zwischenübersetzung entstanden sei. Eine Stichprobe aus\nder ersten Seite des Textes bestärkte ihn : « Eine ausführlichere Unter-\nsuchung des Textes würde auf die Frage (scil. ob die arabische Über-\nsetzung aus einer syrischen Zwischenübersetzung entstanden sei)\neine sichere Antwort geben; es scheint, daß unsere Übersetzung, wie\ndie beiden anderen, aus dem Syrischen hergestellt worden ist » 5.\nDie arabischen Übersetzungen, die auf eine syrische Zwischenüber-\nsetzung zurückgehen, überwiegen in der Zahl gegenüber den arabischen\nVersionen, die direkt aus dem griechischen Originaltext hervor-\ngegangen sind. Jene sind der Normalfall. Umso interessanter sind die\nselteneren arabischen Übertragungen aus dem Griechischen. Ihre\nZahl is deshalb viel geringer. weil nur wenige arabische Übersetzer\ndes Griechischen mächtig waren. Es läßt sich, wie ich glaube, einwand-\nfrei nachweisen, daß diese dritte Handschrift direkt aus dem Grie-\nchischen übersetzt worden ist. Daher gewinnt sie sehr an Bedeutung,\nsowohl für den Orientalisten wie auch für den Klassischen Philologen.\nIch werde im Folgenden versuchen, die Frage nach der Art der Über-\nsetzung und deren Vorlage zu beantworten, sowie ob Hunain ibn Isḥāq\n(808-873), der die Schrift in seine Sammlung aufgenommen hat, der\nmögliche Übersetzer ist.\nGegen Sterns Annahme spricht schon ein äußerliches Moment: das\nProoemium der arabischen Übersetzung hat nichts mit demjenigen\nder syrischen Version gemeinsam. Man könnte jedoch einwenden,\ndaß es noch andere syrische Übersetzungen von De mundo gegeben\n4 Id., The Third Arabic Translation of the Pseudo-Aristotelian Treatise De Mundo,\nLe Muséon 78 (1965), S. 381-393.\n5 Ibid., S. 387.\n6 P. DE LAGARDE, Analecta Syriaca, 1858 (Nachdruck 1967), S. 134-158; A. BAUM-\nSTARK, Geschichte der Syrischen Literatur, 1922, S. 168.",
  "5": ". DE MUNDO\n61\nhaben mag, die ein Prooemium hatten, das der arabischen Version\nals Vorlage gedient hatte. Immerhin läßt sich feststellen, daß die\neinzige bekannte syrische Version keinesfalls die Vorlage unserer\narabischen Übertragung ist. Wir wollen uns jedoch nun dem Text\nselber zuwenden, fol. 184 a 13 f. steht:\nفاما الطبيعة التي تلى الفلك من الهواء الهوى im Text) * قضا خالصة\nسحبه يتلهب من وهج الفلك وعطفه\nSo wie dieser Satz dasteht, ist er kaum noch zu verstehen und muß\nin seinem Hauptgefüge etwa lauten: «Das Element, das sich der\nHimmelssphäre anschließt, ist aus Luft... sie entzündet sich infolge\nder Glut und des Mitleids (!) der Himmelssphäre ».\nDer Satz lautet im griechischen Original (ed. I. Bekker 392 b 5-8):\nἑξῆς δὲ ταύτης ὁ ἀὴρ ὑποκέχυται, ζοφώδης ὢν καὶ παγετώδης\nτὴν φύσιν · ὑπὸ δὲ κινήσεως λαμπόμενος ἅμα καὶ διακαιόμενος\nλαμπρότερός τε γίνεται καὶ ἀλεεινός.\nDarunter anschließend breitet sich die Luft aus, die ihrer Natur nach dunkel\nund eisig ist; infolge Bewegung leuchtet sie jedoch auf und fängt zugleich\nFeuer und wird dadurch strahlender und warm.\nDas völlig deplazierte Wort «'atf» (= Mitleid) der arabischen Version\nkann nur auf eine griechische Vorlage zurückgehen, in der nicht\ndλeevós, sondern èλeevós stand. Die syrische Version (a.a.O. S. 138, 6)\nhat das normale. Ich möchte sogar annehmen, daß das arabische\n<hālaṣa » die Translitteration von xáλašai (Z. 11) darstellt.\nfol. 186 b 14 f. heißt es:\nومن الشهب ما تمكث هنية ( هويا im Text) ومنها ما يحمد ساعتها\nEs gibt Sternschnuppen, die eine Zeitlang bestehen, und solche, die sofort\ngepriesen (!) werden.\nIm griechischen Original heißt es (395 b 9 f):\nΠολλάκις δὲ τῶν σελάων τὰ μὲν ἐπιμένει πλείονα χρόνον, τὰ δὲ\nπαραχρῆμα σβέννυται.\nEinige Lichtstrahlen verweilen oft längere Zeit, andere hingegen verlöschen\nsofort.\nDas an dieser Stelle nichtssagende «yuḥmad» der arabischen Über-\nsetzung weist darauf hin. daß die Vorlage der griechische Text war,\nin welchem die richtige Form σβέννυται wahrscheinlich in σέβεται",
  "6": "62\nF. KLEIN-FRANKE\n(=yuḥmad ») korrumpiert war. Der syrische Text (a.a.O. S. 145, 9)\nfol. 189 a 11 f.\n..ܕܥܟܝܢ hat die rechte Tesart\nوأشياء كثيرة تكون فى هذا الهواء الهوى im Text) وبها يكون جرى\nالانهار وحبس البحار\nViele Dinge gibt es in dieser Luft (?), z.B. der Lauf der Flüsse und das\nAbsperren (!) der Meere.\nDer griechische Text lautet (399 a 26 f.):\nἕπονται δὲ τούτοις ποταμῶν ἐκροαί, θαλάσσης ἀνοιδήσεις ...\nDiesen folgt das Hervorfließen der Flüsse, das Aufwogen des Meeres...\nDas in diesem Kontext bedeutungslose «habs» (= Absperren) der\narabischen Version kann nur aus einem griechischen Text erklärt\nwerden, in dem nicht mehr avoidñoes stand, sondern dvádeois. Der\nsyrische Text (a.a.O. S. 153, 14) hat die rechte Lesart Rai. Das\nsingularische Baλáoons steht dem pluralischen, und\ngegenüber; auf Grund solcher Übereinstimmungen des syrischen und\ndes arabischen Textes kann aber nicht schon eine Abhängigkeit\nkonstatiert werden.\nEine andere Fehlerart der arabischen Übersetzung geht nicht auf\nKorruptelen im griechischen Text zurück, sondern auf die Fehl-\ninterpretation des Übersetzers. Dafür ein Beispiel der Verfasser\nvon De mundo» vergleicht Gott mit einem Chorleiter und die Sterne\nmit einem Chor von Männern und Frauen ἐν διαφόροις φωναῖς ...\nμίαν ἁρμονίαν ἐμμελῆ κεραννύντων (399 a 16 f.), d.h. die mit ver-\nschiedenen Stimmen eine einzige, wohlklingende Harmonie mischen.\nDie appovía uueλns war dem arabischen Übersetzer ein unbekannter\nBegriff in der Musik; er übersetzte «Harmonie» metaphorisch durch\n,(fol 189a3f كجماعة رجال ونسائهم عنده وقلبهم واحد Herz »\nd.h. wie eine Gruppe von Männern und deren Frauen mit einem\neinzigen Herzen ».\nEs sollen auch solche Fälle erwähnt werden, in denen die arabische\nVersion eine sowohl von der syrischen Übersetzung wie auch vom\ngriechischen textus receptus abweichende Lesart bietet. Bei der\nSchilderung der Erde teilt der Verfasser von De mundo» die Flüsse\nin solche ein, die sich über die Erde hin winden, bzw. sich in das Meer\nergießen : τοῖς μὲν ἀνὰ γῆν ἑλιττομένοις, τοῖς δὲ ἀνερευγομένοις εἰς\nBáλaoσav (392 b 16 f.). Der arabische Übersetzer schreibt (fol. 184 b 3):\nall digit, d.h. «einige von ihnen (scil. den Flüssen)",
  "7": ".DE MUNDO,\n63\n33\nwerden vernichtet, andere winden sich». Das Wort «mutlaf » (= ver-\nnichtet) ist problematisch man kann es als einen Schreibfehler\nerklären, den man durch Umstellung zweier Buchstaben leicht in\n<multaff >> verbessern kann. Eine andere Erklärung ist jedoch eben-\nfalls denkbar der Autor der mittellateinischen «Versio Manfrediana >>\nübersetzt diese Stelle «his quidem a terra sorptis, aliis in mare intranti-\nbus >> : < von den Flüssen werden die einen von der Erde verschlungen,\ndie anderen ergießen sich ins Meer ». Lorimer nahm an, daß die\ngriechische Vorlage der Versio Manfrediana» nicht irroμévois\noder ἀνελιττομένοις (so bei Stobaeus) vorwies, sondern ἀναλισκομένοις.\nLorimers geschickte Konjektur erhält durch die Lesart der arabischen\nVersion eine plausible Stütze (ávaloкóμevos =). Die syrische\nÜbersetzung dagegen hat eine verderbte Lesart, die uns nicht weiter-\nhilft.\nDamit kommen wir zur zweiten Frage, welcher Art die griechische\nVorlage unserer arabischen Übersetzung war. Daß sie an vielen Stellen\nkorrumpiert war, können wir auf Grund der soeben angeführten Bei-\nspiele vermuten. Wahrscheinlich war sie eine späte byzantinische\nKopie. Doch wir wollen wieder den arabischen Text befragen. Dort\nlesen wir fol. 183 b 6 f. :\nفاذا تأملت رأيت المحور كانه نافذ الى الطرفين كلاهما والارض في وسط\nWenn du also betrachtes, siehst du, daß die Achse (des Weltalls) gleichsam\nin die beiden Seiten (des Alls) hineindringt, und daß die Erde in der Mitte ist.\nDie griechischen Mss. teilen sich in die Lesarten μέσην bzw. μέσον,\nd.h. also die Himmelsache geht mitten durch die Erde (μéony),\nbzw. die Erde liegt im Mittelpunkt des Alls (péσov). Die letztere\nLesart wird von einer Reihe von Handschriften geführt, unter ihnen\ndie syrische Übersetzung, die beiden lateinischen des Apuleius und\ndes Nicholaus Siculus. Die gleiche Lesart wurde, wie wir sehen, auch\nvon der griechischen Vorlage unserer arabischen Übersetzung geführt.\nDie gleiche handschriftliche Überlieferung tritt uns auch im geo-\ngraphischen Kapitel unserer Schrift entgegen. Bei der Aufzählung\nder sieben Inseln (393 a 12) bildet unsere arabische Version zusammen\nmit Stobaeus, Apuleius und der syrischen Übersetzung eine gemein-\nsame Gruppe, die unter den sieben Inseln auch die Peloponnes auf-\nzählt. Bei den übrigen Handschriften fehlt die Peloponnes im Insel-\n7 W. L. LORIMER, The Text Tradition of Pseudo-Aristotle De Mundo », 1924, S. 48, 17 f.\n* Id., Some Notes on the Text of Pseudo-Aristotle De Mundo», 1925, S. 75-78.\nLORIMER (1925), S. 74 f.",
  "8": "64\n70\nF. KLEIN-FRANKE\nkatalog (schon Ptolemaeus erwähnt die Peloponnes-Geog. VII.5.11).\nZusammenfassend kann man feststellen, daß die arabische Über-\nsetzung von << De mundo» in der Stambuler Handschrift Köprülü 1608\naus einer griechischen Handschrift übersetzt worden ist, die, trotz\nvieler Korruptelen, eine Verwandtschaft zu Stobaeus und der von\nApuleius benutzten Vorlage erkennen läßt. Da die syrische Über-\nsetzung und die lateinischen Versionen des Mittelalters mit der gleichen\nRezension in Berührung stehen, ergeben sich gelegentlich Überein-\nstimmungen.\nAus dem vorher Gesagten ergibt sich schon von selber die Antwort\nauf die dritte Frage, ob Hunain ibn Ishaq der Übersetzer unserer\narabischen Version sein kann. Hunain, dieser Meisterübersetzer, hätte\nsich weder solche Fehlübersetzungen zu Schulden kommen lassen,\nnoch hätte er eine so korrumpierte Handschrift als Vorlage gewählt.\nStern hat schon darauf hingewiesen, daß diese arabische Übersetzung\nbereits gegen Ende des 8. Jahrhunderts bzw. zu Beginn des 9. Jahr-\nhunderts bestand; Hunain hat sie also fertig vorgefunden. Daß er\nselber nicht eine Übersetzung von «De mundo» angefertigt hat, zeigt,\ndaß er die Schrift für pseudepigraphisch hielt. Auch der Stil wie die\nWortwahl sprechen gegen eine Annahme, Ḥunain sei der Übersetzer.\nDer breite, pleonastische Ausdruck, die häufige Verwendung von\nHendiadyoin, Wörter wie «kilä-» +Suffix u.ä. gehören nicht zur\nAusdrucksweise Hunains 10.\nDer arabische Übersetzer hat eine nicht geringe Zahl von Zusätzen\nin seine Übersetzung aufgenommen, die für die Beurteilung der Hand-\nschrift nicht unerheblich sind. Bei der Beschreibung der Himmels-\nsphäre lesen wir (fol. 183 b 4 f.):\nوهي كاللؤلؤة المستديرة والارض فى جوفها كالمح في البيضة\nSie ist wie eine Perle, die sich dreht, und die Erde in ihrem Innern ist wie der\nDotter im Ei.\nDem gleichen Bilde begegnen wir wieder in der Risalat al-mabda'\nwa -l-ma'ād des Ismā'ili Sayyidunā al-Husain ibn 'Ali ibn Muḥammad\nibn al-Walid, des VIII. da'i im Jemen (gest. 667/1268) 11:\nفوقفت في وسط الفلك وصار الفلك محيطا بها من جميع جهاتها، والارض\nوما عليها واقفة في وسطه كمثل مح البيضة الاصفر المحيط به البياض\nوالقشر من جميع جهاتها.\n10 Vgl. G. BERGSTRÄSSER, Hunain ibn Isḥāk und seine Schule, 1913, passim.\n11 Ed. H. CORBIN, Trilogie Ismaélienne, 1961, S. 107.",
  "9": "⚫ DE MUNDO.\n99\n65\nSie (scil. die Erde) steht im Mittelpunkt der Himmelsphäre; die Sphäre\numgibt sie von allen Seiten, und die Erde und alles, was sich auf ihr befindet,\nsteht in ihrem Mittelpunkt wie der gelbe Eidotter, den das Eiweiß und die\nSchale ringsum umgeben 12.\nDie Ähnlichkeit zwischen Pseudo-Aristoteles und dieser ismailischen\nSchrift ist jedoch nur mehr eine entfernte der Äther. beispielsweise,\nist von seiner hohen Stellung als fünftes Element bei dem Ismaili zu\neinem der vier Elemente hinabgesunken 13.\nJerusalem,\nThe Hebrew University,\nInstitute of Asian and African Studies.\nFelix KLEIN-FRANKE.\n12 Das gleiche Bild verwendet auch Šams ad-Din Abū 'Abdallah Muḥammad ad-\nDimašqi (gest. 727/1327) in seinem kosmographischen Werk (ed. M. A. F. MEHREN,\n1866, S. 9, wo es natürlich muḥhund niet muhh heißen muß).\n13 Bezüglich des griechischen Textes von Ps.-Aristoteles verweise ich besonders\nauf P. FESTUGIÈRE, La Révélation d'Hermès Trismegiste, Bd. 2 (1949), S. 460 ff. und\ndie dort angegebene Literatur."
}