{
  "1": "120\nCHAPTER SIX\nPTOLEMY\n1. FROM THE GREEK INTO ARABIC AND\nFROM ARABIC INTO LATIN\nThe Optics of Ptolemy was first published in Latin by Gilberto\nGovi in 1885, but it remained unknown to historians of art\nand perspective until 1957, when Decio Gioseffi mentioned it\nfor the first time. However, this scholar limited his analysis to\njust a few lines of paragraph 4 of book III, a paragraph that will\nalso be analyzed in this chapter. From that point on, Ptolemy's\nOptics has not, as far as I know, been taken into consideration\nby historians of art and perspective.\nThe principal reason that scholars have abstained from\nstudying Ptolemy's Optics is especially because of the diffi-\nculty of the Latin language in which the work has come down\nto us. The admiral Eugenius of Sicily, who lived in the second\nhalf of the twelfth century at the court of the Norman kings in\nPalermo, translated Ptolemy's Optics from Arabic into Latin; the\nArabic version was, in its turn, a translation from the Greek, the\nlanguage in which Ptolemy, living in the first half of the second\ncentury A.D., had written the work. Govi was the first to rightly\nunderscore that the Latin is quite often obscure because it was a\nliteral translation from Arabic and that the geometric concepts\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "2": "PTOLEMY\nare often improper as a result of the translator's ignorance of\nthe correct expressions needed to be able to translate them from\nArabic into Latin. There is no known documentation regarding\nthe existence of the Arabic text from which the Latin is derived,\nnor is there any information regarding the original Greek text\nfrom which the Arabic is derived.\nThese same difficulties of interpretation were expressed by\nAlbert Lejeune, who spoke of a translation of a translation,\nsuch that it could discourage any reader in good faith, and by\nA. Mark Smith, who spoke of a text difficult to penetrate, being\nso tortuous and confused that it is often incomprehensible.³\nAgain, it is worth noting that both Lejeune and Smith, in\nproviding their first translations in French and in English, took\nupon themselves an onerous task, not unlike that of paleogra-\nphers, when these scholars attempt to decipher deep layers of\na palimpsest. For this reason, Lejeune and Smith were forced\nto adhere scrupulously to an exegetic reconstruction of a very\ndifficult text.\nMy task, however, has been first of all to take a look at the\nentire reconstructed work of the Ptolemaic text by Lejeune\nand Smith, then successively to go beyond it in an attempt to\nspecifically illustrate some passages of the Optics with draw-\nings, and finally to compare them in modern terms with the\ngeometric theories of representation.\"\nLet us begin with Sermo Tertius De Opticis Tholomei, that is to\nsay \"The Third Speech on the Optics of Ptolemy\" - also known\nas \"The Third Book (or Sermon)\" on the Optics, according to\nhow we prefer to translate the Latin word Sermo-naturally\nlimiting our attention to an analysis of flat mirrors only.\n2. THE THREE PRINCIPLES RELATIVE\nTO THE SCIENCE OF MIRRORS\nWe begin with paragraph 3:\nSince, therefore, in every field in which one turns to science\nthere is the necessity of a number of general principles, that is\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n121",
  "3": "122\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nto say, how the objects place themselves, in an unfailing and\nindisputable manner, in front of us, effectively as well as cor-\nrectly, from the demonstrations of which one can make deduc-\ntions, we must say that the principles that one requires for\nthe science of mirrors are specifically three, and that these are\nprimary elements of knowledge that are possible to learn by\noneself. The first [principle] is that by which one recognizes\nthat the objects, which can be seen in mirrors, appear in con-\nformity with the direction of the visual ray, which falls upon\nthe objects by means of its own reflection. This [reflection]\nis verified in conformity with the position of the pupil with\nrespect to the mirror. The second [principle], without a doubt,\nis that by which one recognizes that the single [points] that\none sees in the mirrors appear on the perpendicular line that\nfalls from the object that is seen onto the surface of the mir-\nror and penetrates it. The third [principle], instead, is that by\nwhich one recognizes that the position of the bent ray, which\nis found between the pupil and the mirror and between the\nmirror and the thing that is to be seen, is such that each of\nthese two [segments] arrives at the point in respect to which\nthe break occurs, while they contain, parting from the mirror,\nangles equal with the perpendicular line that exits from the\nvery same point.\nHere the general principles relative to the science of flat\nmirrors are described, and it is specified that they are pri-\nmary notions that one can verify by oneself. The first thing\nthat stands out as evident is that the mirrors constitute a\nfield in which one may turn to science. This is an authentic\ninvitation to experimental verification as to how objects are\ndistributed in front of us in an unfailing and indisputable\nmanner.\nIn order to better illustrate and render visible what we have\nto say (Fig. 83), we begin by assigning:\na. A vertical flat mirror\nb. The position O of our pupil, or of our eye, which orthogo-\nnally fixes the mirror at point O' (the principal point)\nc. The real object\nd. The reflected image of the real object\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "4": "Principal point = O'\nEye O\nReal object\n83\nThe science of mirrors.\nPTOLEMY\nReflected image\nof the real object\nVertical flat mirror\nThese elements are indispensable for the best visual under-\nstanding of the operation, which will be discussed and dem-\nonstrated shortly.\nFor the first principle (Fig. 84), the objects that are seen in\na mirror appear in conformity with the direction of the visual\nray, which falls upon a mirror through a reflection, which is\nverified in conformity with the position of the pupil in respect\nto the mirror.\nIt is certainly natural to conduct the visual ray from the eye\nwhich ends at point A': this is the image reflected in the mirror\nof the real point A.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n123",
  "5": "PERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nA'\nA\nVertical flat mirror\n84 First principle. OA' = visual ray; A = real point; A' = reflected image of A.\nFor the second principle (Fig. 85), the single points that are\nseen in a mirror appear to be found on the other side of the\nmirror, on the perpendicular line, which parts from the real\nobject toward the surface of the mirror and penetrates the mir-\nror itself. The image point A', therefore, appears as if it were\nto be found on the other side of the mirror, precisely at the\nvirtual point A\", on the perpendicular line r conducted from\nA to the mirror.\nFor the third principle (Fig. 86), one recognizes that the\nposition of the fractured ray, which is found between the pupil\nand the mirror and between the mirror and the real object, is\n124\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "6": "PTOLEMY\nA\nVertical flat mirror\n85\nSecond principle. A\" = virtual point of A; A = real point; r = perpendicular line\nfrom A to the mirror; A' = reflected image of A.\nsuch that each of the two segments arrives at the point where\nthe fracture occurs, forming, between the mirror and the per-\npendicular line p to the mirror at point A', two equal angles,\non one side and on the other side of the perpendicular line p.\nThe reason why we have added the dashed lines O'O\" and O\"A\"\nto the figure will be made clear shortly.\nFor the moment, let us consider the plane formed by the\nperpendicular line r and the visual ray passing through the\npupil and through A'. This plane is orthogonal to the mirror\nand contains the pupil, the visual ray OA' and the refracted\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n125",
  "7": "86\n126\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nY\nY\nA\nVertical flat mirror\nThird principle. p = perpendicular line to the mirror at A'; AA' = refracted ray;\nO\"= virtual eye.\nray AA', the objective point A, the image A' of the objective\npoint, the perpendicular line p, the virtual point A\", and the\npoint T where the perpendicular from A intersects the plane of\nthe mirror. This same orthogonal plane intersects the mirror in\nthe line that passes through O', through the reflected image A'\nof point A, and through the point T. Let us also observe that\nthe visual ray and the reflected ray (to this latter we assign\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "8": "PTOLEMY\nthe direction that goes from the objective point A to the image\nA')º form, parting from the line O'A'T (which is found on the\nmirror), on one side and on the other of the perpendicular line\np to the mirror in A', two angles equal among themselves. That\nis to say that angle ẞ on one side is equal to angle B on the other\nand that angle y on one side is equal to the angle y on the\nother. That this is true is easily demonstrated by the dashed\nlines O'O\"A'-A'AT that complete the drawing when seen as\na spatial vision. If we now free such an orthogonal plane from\nthe spatial vision of the preceding illustration and represent it\nas it effectively exists on the plane (Fig. 87), we may observe\nthat the two angles ẞ and the two angles y are equal among\nthemselves because of two elementary laws of geometry: that\nof the similarity of the triangles 00\"A'-A'AA\"; and that of the\nequality of the triangles A'O'O-A'O'O\" and of the triangles\nA'TA\"-A'TA.\n3. THE FUNDAMENTAL OPERATIONS\nParagraph 4:\nOF EXPERIMENTATION\nThe topics relative to the principles set forth will now be made\nmanifest through the objects that appear, as we will show.\nIn effect, for all mirrors, we have discovered that if on the\nsurface of each of these we will have marked the points in the\nplaces in which the objects to be observed appear, and we will\nhave connected them, certainly the form of the object to be\nseen will not then appear. Certainly after, when we will have\ncomposed one object after another and we will have turned\nour gaze toward the places investigated, the marked points and\nthe form of the thing to be observed will appear together, in\nconformity with the alignment of the origin of the visual ray.\nAnd when we will have raised upon the surfaces of the mir-\nrors at right angles some long objects in a straight line and the\ndistance will be established, the images of those objects will\nappear in a straight line: that is, these same ones in truth and\nin addition to the objects that are observed.\"\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n127",
  "9": "PERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nβ\nΟ\nβ\nY\nI\nT\nA\n87\nThird principle, illustrated on the plane. p = perpendicular line to the mirror at A';\n0 = eye; 0\" = virtual eye; A' = reflected image of A; A\" = virtual point of A; A =\nreal point; O'-T = mirror.\nIn this paragraph two invitations can be found. The first\nconsists of marking - or, better yet, tracing - the points that\nappear on the mirror and then opportunely interweaving them.\nThe second consists of observing the traced images in a way\nthat makes them coincide with the reflected images, because,\nafter having completed the operation of tracing, it will no\nlonger be possible to have the marked points and the reflected\nimages coincide, without conforming oneself to the alignment\nof the origin of the visual ray and to the distance of this origin\nfrom the mirror.\nTherefore, once the tracing of the points has been realized,\none cannot choose another pupil O*, or another eye, in order to\nobserve the traced image (Fig. 88). Only from point O, in fact,\nwill one see the traced images coincide with those reflected, and\nthe conditions as described in the previously analyzed \"third\nprinciple\" will be respected. The point A', in fact, observed\nfrom O*, would not be seen in A\" but would distance itself\n128\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "10": "88\nPTOLEMY\nVertical flat mirror\nNew viewpoint randomly chosen. O* = new viewpoint randomly chosen; 0 = eye;\nO\" = virtual eye; A' = reflected image of A; A\" = virtual point of A; A = real point.\nbeyond measure farther on the same perpendicular line that\nis traced from A to the mirror; and furthermore the original\northogonal plane would also be changed: this original plane\npasses through the principal ray 00' and through the perpen-\ndicular line from A to the mirror.\nThis is the paragraph that Decio Gioseffi translated and\npublished in 1957.12 The exposition did not confirm the\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n129",
  "11": "130\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nexpectations that the scholar had imagined. That which\nGioseffi maintained was soon forgotten: the few lines that he\nanalyzed, though important for the theory of tracing, were\nstill too generic to remove the doubts that his affirmations\nprovoked regarding the origins of perspective of the ancients.\nWhat is more, the scientific and geometric context in which\nPtolemy had presented such experiments had been completely\nneglected - a context that was much more ample, embracing,\nas we will now see, the very concept of the vanishing point of\northogonal lines.\nIt was necessary to translate, read, and illustrate paragraph\n3, which we have analyzed, as well as not a few of the para-\ngraphs following paragraph 4. The tracing, the observation of\nthe images to be realized under the conditions described, and\nthe rectilinear correspondence are fundamental observations\nthat required verifications and deductions, which Ptolemy\nhimself prepares to illustrate in all their wide-ranging, prob-\nlematic nature.\n4. THE FIVE GEOMETRIC DEDUCTIONS\nParagraph 5:\nFrom both of these things [is derived]: that the object to be seen\nmust appear in the mirror at the place of the point in which are\nconnected the visual ray and the perpendicular line, which\nfalls from the object to be observed onto the mirror; that also\nthe site of these two aforementioned lines is found on the same\nsurface because the one [of the two] meets the other; and that\nthe surface itself, in which they find themselves, is orthogonal\nto the surface of the mirror at right angles, because one of these\ntwo [lines] is perpendicular to the surface of the mirror; and\nthat the visual ray, when it will have fractured in the direction\nof the object to be observed, finds itself on the same surface of\nwhich we have spoken; and that the perpendicular line, exit-\ning from the point of reflection on the surface of the mirror, is\nthe common distinction of all the different surfaces that form\nthemselves around the reflection of the visual rays.¹³\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "12": "ΟΙ\nPTOLEMY\nVertical flat mirror\n89\nThe eye and its proper reflection. p = perpendicular line to the mirror at A'; 0 = eye;\nO\" = virtual eye; A' = reflected image of A; A\" = virtual point of A; A = real point.\nAfter having analyzed, in the preceding paragraph, the two\nfundamental operations of tracing and of observation accord-\ning to the origin of the ray and according to the distance,\nPtolemy sets forth the five deductions that are obtained from\nthese operations (Fig. 89). Such deductions, which we have\nalready anticipated in part in order to better introduce the\ndrawings examined, are as follows:\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n131",
  "13": "132\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\n1. The object to be seen A (res videnda) appears in the mirror\nin the point where point A\" appears, in which the visual\nray OA' and the perpendicular r conducted from point A\nto the mirror are joined: the object to be seen, therefore, is\nas if it were positioned in A\".\n2. The two aforementioned lines, that is to say the visual ray\nOA' and the perpendicular r, conducted from point A to\nthe mirror, form, as we have already anticipated, a surface\nsince one meets the other, connecting in A\".\n3. This surface is orthogonal to that of the mirror at right\nangles because the line AA\", which goes from the point to\nbe observed to the mirror, is perpendicular to the mirror.\n4. The segment of the refracted ray AA' is found on the same\nsurface that is orthogonal to that of the mirror.\n5. The perpendicular p, exiting from the point of reflection A'\non the surface of the mirror, constitutes a distinction com-\nmon to all the diverse surfaces that form themselves around\nthe reflection of the rays.\nIt is necessary to fix well in one's mind that the five geometric\ndeductions now described lead us to the following construc-\ntions in space, namely:\n1. Construction of the vertical plane OA\"O1, which contains\nthe ray OA\" and serves to find the virtual point A\"\n2. Construction of the plane that projects through the eye the\nline r, orthogonal to the surface of the mirror: this plane\nintersects the surface of the mirror according to the line\nO'T, which is the perspective or the image of the line r\northogonal to the plane of the mirror; the line O'T must\npass thus through O'\n5. MONOCULAR VISION AS CONDITIO\nSINE QUA NON\nParagraph 6:\nFurthermore, [all this] is verified in this manner since the dis-\nposition of the eyes is constituted as if the one saw the other\nin the same instant, which is what happens since from the one\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "14": "PTOLEMY\nand from the other the vision falls on a unique and same point\nbetween those [two] that are on the mirror. If it does not occur\nin this way, it transpires that neither of these is aware of the\nother, and that signifies that the rays of sight reflect themselves\nfrom one part and from the other. From these things, it results\nalso that the reflection is at equal angles. There will be in fact a\nsingle and same angle because of the loss of one of the two rays\non the mirror and because of the reflection of one of the two\n[rays] parting from the mirror.14\nIn this paragraph, it is specified that the disposition of the\neyes is constituted as if the one sees the other in the same instant\non a single and same point between the two that one sees on the\nmirror. If this were not so, the eyes would operate separately,\neach for itself in such a way as to have a double reflection: one\nfor each eye. Thus it is clear that the double reflection did not\nexist for the ancients, as it does not exist for us, because this\nentailed, then as now, the visual alteration to which has been\ngiven the name dyplopia.\nTherefore, the fundamental notion that is at the base of\nvision remains certified: the cyclopic unity of sight, with the\nconsequent coincidence of the two optical axes in one princi-\npal visual axis. This unity, scientifically linked to the loss, in\nthe reflection of the mirrors, of one of the two optical axes,15\nbecomes the conditio sine qua non, placed at the base of the the-\nory of vision, and allows us to mark a single eye O, or one sole\npupil, instead of two (Fig. 89).\nLet us now analyze the motivations that justify the presence\nof the points O' and O\" that we have marked and what are the\neffective meanings that Ptolemy gives them.\n6. THE DOUBLE AND OPPOSITE VIEW,\nParagraph 16:\nTHE NECESSITY OF A SIGN\nSince [the rays] proceed also perpendicularly from [the posi-\ntion of sight to the mirror, the image will occur according to\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n133",
  "15": "134\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nthe dimension rendered of the established object in conformity\nwith the gaze, which is set straightforward. Each of these rays\n[orthogonal to the mirror], in fact, is seen on the perpendicular\nline that passes through the pupil. The rays in fact that transit\nthrough one who looks and that extend themselves toward the\npupil parting from the origin, whose position is found within,\nat the center of the spherical globe, are all perpendicular to\nthe surface of the pupil, which assumes the nature of a curved\nmirror, with a form and configuration of its own. For this rea-\nson we are able to know also the forms of things, exactly as the\nsight positions receive them, which are, on one side and on the\nother, opposite. When the reflection, which should occur from\nthe objects to be observed to the pupils according to a direc-\ntion and an opposition, is transferred to the mirrors, since it\nconserves the disposition that would be from the pupils to the\nobjects themselves, there will be at this point the coincidence\nalso of the line that proceeds from the [position of] sight with\nthe same ray that, in that case, there is between the pupil and\nthe object to be observed. It is just as it occurs in the things\nthat appear opposite from one part and from the other, when\nthe gaze will fall at right angles onto the mirror and it reflects\nupon itself. Thus there will be a sign of this [reflection], in\nconformity to which occurs the appearance of the object, one\nonly in the quantity and in the position, which is that through\nwhich [the ray] arranges itself in a straight line perpendicu-\nlarly to the mirror and to the pupil. And consequently there\nwill be a double and opposite view of the object in the dimen-\nsion rendered and in characteristics: one that certainly goes\nfrom the [position of] sight to the thing that appears, the other\nthat goes instead from the thing that appears to the [position\nof sight.16\nThis is the key paragraph, which constitutes a true turning\npoint in the interpretation and in the scientific collocation of\nPtolemy's Optics within the outline of the history of perspec-\ntive. The sequence of the passages is as follows.\nSince the visual rays (Fig. 89) can proceed also perpendic-\nularly from the position of sight to the mirror (the ray 00'\nis perpendicular to the mirror), the image of the object to be\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "16": "PTOLEMY\nobserved will be a function of the gaze that is set straightfor-\nward in respect to the mirror. But each point of these orthogo-\nnal rays, including that [the point] that individuates the center\nof the pupil, as specified by Ptolemy, is seen on the perpendic-\nular line that passes through the pupil orthogonally to the mir-\nror. In other words, the pupil, or the eye, must have a proper\nreflection, that is to say, a virtual correspondent of its own\nbeyond the mirror on the orthogonal line to the mirror, pass-\ning through the pupil.\nOne could not better grasp the importance of the rays\northogonal to the surface of a flat mirror if not through the\nreflection of the pupil itself. Being in front of a mirror, in fact,\nthe real pupil indicates to us the exact position from where one\nperceives that given vision which we see in the mirror. But we\nimmediately realize that the pupil is reflected onto the mirror\nupon the extension of the ray orthogonal from the pupil to the\nmirror, individuating the virtual pupil whose distance from\nthe mirror, on the opposite side, is exactly as much as the dis-\ntance of the real one from the mirror. We are able, therefore, to\ndraw the corresponding virtual 0\" of O from the other part of\nthe mirror, onto the orthogonal line through O to the mirror, so\nthat O'O\" is equal to O'O.\nBut pay close attention, again says Ptolemy, for since the\nperpendicular line through the pupil to the mirror, or through\nthe eye, intercepts the mirror, it reflects itself and returns on\nitself, and, returning upon itself, it is well that, in the point\nwhere the perpendicular line from the position of sight strikes\nthe mirror, there should be a \"sign\" (a nutus, says the Latin) of\nthe point of this reflection. This is the point \"in conformity to\nwhich the apparition of the object occurs\" (a quo fit apparitio\nrei). But Ptolemy specifies again that this point must be unus\nin numero et situ, that is to say \"one only in quantity and in\nposition.\" The sign must be one only \"in quantity\" because\nthe eyes, as we have seen, even though they are two and both\nappear in the mirror, create just one single reflection of the\nimage; it must be one only \"in position\" because that point\nmust be placed upon the mirror where the perpendicular from\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n135",
  "17": "136\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nthe real pupil strikes the mirror. Thus, the positioning of the\npoint O' remains justified, in reference to which we have estab-\nlished our constructions.\nThe first, immediate conclusions that are deduced, once the\ndrawings based on these indications have been made, consist\nof the fact that there are:\n1. Two eyes, the true one O and the virtual one O\"\n2. Two points, the true one A and the virtual one A\"\n3. A single image A' for both eyes and for both points\nIt is easy, in fact, to realize that the true eye O sees the point A'\nas if it were positioned in A\" and that the virtual eye O\" sees\nthe same point A' as if it were positioned in A.\nTherefore the point A' is an image twice.\nTo better illustrate what has been said up to now, let us\nobserve the two cubes: the real one and the virtual one (Fig. 90).\nWe repeat: let us observe the ray from O orthogonal to the mir-\nror. Upon the perpendicular 00'0\" to the mirror is found the\nvirtual pupil O\", which is opposite the first one, on the other\nside of the mirror, and which is the same distance from the\nmirror as the pupil O.\nThe segments of the visual rays, which we have traced from\nthe real pupil toward the image on the mirror, and their exten-\nsion, onto the points of the virtual object, form a first pyramid\nwith vertex O. The form that we have traced, or the reflected\nimage, must therefore be understood as a straightforward image\nof the virtual object. Naturally, it is this image, which is after\nall that of perspective, that Ptolemy wants to develop. We will\nexamine, in the paragraphs that follow, what is implied by the\nreflected image that is \"associated\" with the straightforward\nvision of the virtual object. The segments of the reflected rays,\ninstead, which part from objective points in order to reach the\nimages on the mirror, once prolonged starting from the mir-\nror, converge beyond the mirror in the vertex O\" of a second\npyramid.\nTo summarize: for \"a double and opposite view of the object\nin the dimension rendered and in characteristics\" (aspectus rei\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "18": "O' = The 'Meta'\n90\na\nPTOLEMY\nTa\n'Res Congregata'\nThe Associate Image\nReal object\nVirtual object\nть\nTc\nA double and opposite view of the object.\nduplex et diversus in proportione et virtute), which generates or\nnaturally implies also two visual pyramids having vertices in\nthe two points O and O\", we understand the reflected image\nthat we have traced of the true object; this image coincides also\nwith the straightforward image of the virtual object.\"\nBut let us again pause for a moment upon the fact that\nPtolemy felt the necessity to put that sign, or rather that nutus,\nthere where the ray orthogonal through the pupil to the mirror\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n137",
  "19": "138\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nis fractured upon the mirror itself. Though the Latin text pres-\nents evident interpretative difficulties and is not easy reading,\nas Lejeune himself affirms, 18 it stands out in any case and is\nimmediately evident that here are introduced two great con-\ncepts of modern perspective:\n1. Ptolemy's nutus is none other than the principal vanishing\npoint.\n2. The orthogonal ray, which goes from the pupil to the mir-\nror, is none other than the principal ray.\nFor a long time I have been in search of further clarifications\nof this \"sign.\" Every effort has been futile. In the Latin text\nthat Lejeune quotes later, I have not found any reference to\nthat nutus.\nIn the end, after having attentively reread several times the\nparagraphs that precede paragraph 16 as well as those which\nfollow it, my attention fell upon the Latin text that goes from\n<secundum id quod pretaxavimus up to penes rem vere videndam\nad prope>, which is quoted in Lejeune twice. It is, in fact, part\nof paragraph 1 and of the entire following paragraph 13, as\nwell as of the entire paragraph 60.19\nIn this text, there is a phrase that caught my attention: et\nconservat hanc metam cum eo quod ex utrisque apparet, which\ntranslates \"and conserve this meta [destination point] with that\nwhich from both [the conformations] appears.\" I was unable to\nfind any connection of this phrase in Lejeune with the texts\nthat immediately follow or precede the paragraphs 1 and 13; in\nthe same way, I was unable to find any connection of the same\nphrase with the texts that immediately follow or precede the\nparagraph 60.\nI maintain that the entire passage that goes from <secundum\nid quod pretaxavimus up to penes rem vere videndam ad prope>\nmust be placed immediately after paragraph 16, where it con-\nstitutes, as we will now see, the missing link. Let us give it the\nname paragraph 16a, and let us read it attentively in continuity\nwith the text preceding it.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "20": "PTOLEMY\n7. THE ASSOCIATED IMAGE, THE VIRTUAL\nOBJECT, AND THE META OR THE\nParagraph 16a:\nPRINCIPAL VANISHING POINT\nAnd consequently there will be a double and opposite view\nof the object in the dimension rendered and in its character-\nistics: one that certainly goes from the [position of] sight to\nthe thing that appears, the other that goes instead from the\nthing that appears to the [position of] sight, in conformity with\nthat which we have discussed before, where it was said that\nthe images of things erected upon the mirrors at right angles\nare seen according to straight lines without folds and appear\npositioned on the same side toward which the objects move.\nIn conformity with the scientific concept, in fact, that within\nthe mirror we perceive that which appears in a straight line,\nand consequently we come to know the position of the object\nto be seen, we proceed in this manner also for the finding of\nthe position of the virtual, apparent form, since the associ-\nated image is seen straightforward, according to the one and\nthe other conformation, which is to say, of the conformation\nof the object placed in front [of the position of sight] and of\nthat which really appears, and conserves this meta [destination\npoint] with that which from both [conformations] appear, as if\nall [the points] were seen according to an opposite position in\nrespect to the side of its own apparent position. Therefore, a\nstraight quantity appears straight. At preestablished distances,\nthen, when a true image will be found on a straight line and\nthe object will be arranged at right angles to the mirrors, it is\nnecessary that that which appears of one side is found at the\nsame time in conformity to both [the views] on a single straight\nline. And if a same segment will appear erect to the surface of a\nmirror and its apparition will be found on a straight line, again\nit will be seen erect upon the same surface, so that there is no\ndistinction between this one and the entire extension, as if the\nobjects to be observed were arranged in real places, naturally\nthose which are arranged according to that which regards the\nmirrors in conformity to the things that are seen and to their\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n139",
  "21": "140\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nforms, after having maintained, for each of the two positions,\nthe meta [destination point] of that which appears in the object\nto be observed correctly according to the proximity.20\nIn order to better understand the text, we should once again\nobserve the two eyes, the two cubes, and their image traced\nupon the mirror (Fig. 90), which we will call the \"associated\nobject\" (res congregata).\nThe scientific theory of tracing upon the mirrors assists us\nin two ways:\n1. We can see the original cube as if it were placed straightfor-\nward, though opposite, in front of the observer.\n2. We can proceed in \"the finding of the position of the virtual,\napparent form\" (cognitione loci forme non vere apparentis\n[where non vere has been translated as \"virtual\"]).\nThis concerns two cardinal arguments, which we will now\nanalyze.\nLet us begin by specifying that the original point of view\nO sees straightforward the image associated with the virtual\nobject. In this operation of straightforward positioning, the\nassociated image conserves this meta (destination point) (hanc\nmetam in the Latin), which will be necessary to indicate on the\nmirror by means of \"a sign\" (nutus), to which the image will\nremain anchored in its double correspondence to two objects:\nthe real one and the virtual one.\nThrough the orthogonal visual ray, which goes from the\npupil to the mirror and which corresponds to our principal\nray, pass all of the planes of the reflection: in our case, the four\nplanes 00'Ta-a, 00'Tb-b, 00'Tc-c, 00'Td-d, which are per-\npendicular to the mirror and contain both the original visual\nrays and the refracted segments. However, it is toward the meta\n(destination point), which is the point O', that all of the images\ntend and flow as into a \"pivot\" or into a \"vanishing point,\"\nas well as the portions of the images, of the straight objective\nlines orthogonal to the mirror, placed both on this side and on\nthe other side of it, since they have the virtual extension on the\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "22": "PTOLEMY\n0-Tb\n2\"\n3\"\n91\nThe great law of reflection: The order of the sequences. Note: For the order of the\nsequences and their symmetry, see Chapter 1, Figure 10.\nopposite side. Upon these images of straight lines (Fig. 91) are\nalso found all of the associated images of the objective points\nand of the respective virtual opposite ones. By placing us in\nfront of the traced form, Ptolemy thus places us in front of\nthis meta (destination point), which corresponds exactly - I\nrepeat to the principal vanishing point, to say it in modern\nterms, of all the orthogonal lines to the picture plane.\nThis vanishing point also constitutes the \"pivot\" to which\nare linked the two images: the reflected one (or specular) and\nthe straightforward one (or perspective) of the virtual cube.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n141",
  "23": "142\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\n8. THE POSITION OF THE VIRTUAL APPARENT FORM\nLet us continue to focus our attention on the meaning of the\n\"associated\" image, in which coincide the reflected image and\nthe straightforward image of the virtual object. One may draw\nthree principal fundamentals from this paragraph:\n1. The images of straight lines, or portions of the same lines,\nerected upon the flat mirrors, are seen according to straight\nlines without bending (videntur secundum rectitudinem sine\nproclivitate): this important factor implies that these images\nare not curved or arched (Fig. 91).\n2. The images of straight lines, or portions of the same lines,\nerected upon flat mirrors, \"appear positioned on the same\nside toward which the objects move\" (apparent translate\nad eandem partem ad quam res moventur); that is why, for\nexample, if one has the sequence 1, 2, 3, 4, 5, et cetera,\nwhich begins to part from the mirror, this sequence will\nhave to part in this same exact order also from the opposite\nside beyond the mirror.\n3. Through the order of the rectilinear sequence, one can find\nthe position of the apparent \"not true\" object, that is to\nsay, the \"virtual\" object (ita procedimus et in cognitione loci\nforme non vere apparentis).\nLet us explain by means of examples what this implies. If we\nhave a drawing, represented by simple lines and simple points,\none can immediately draw its reverse, or vice versa, if we have\nits reverse, one can immediately draw its obverse with the cor-\nrespondence now described: this is the simple law of symme-\ntry. Applying this concept, for example, the real points Tc, A,\nB, et cetera, on one side, will be set on the opposite side always\nin the order Tc, A\", B\", starting from the mirror (Fig. 92) - a\nphenomenon that generates the turning over of the sequence\nand therefore the reversal of the square, with the inversion of\nthe respective arrows.\nFrom the simple reduction of the spatial summary onto a\nplane (Fig. 93), it is possible to further verify the facility with\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "24": "92\nB'\nA'\nPTOLEMY\nTd\nThe direct and the reverse seen in space.\nwhich one can obtain one or the other of the two squares once\nthe first one is fixed.\nTherefore, it is easy, if not immediate, to find the position\nof the virtual, apparent form or, vice versa, to return to the\nobjective one.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\nB\"\n143",
  "25": "PERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nB\"\nTd\nTc\nd\n93\nThe direct and the reverse seen on a plane.\n144\nB\n9. FURTHER DETAILS\nIn paragraph 17, it is reiterated that there exists only one\npoint of view for each vision, only one principal ray, and\nonly one meta (destination point) with respect to the plane of\nthe mirror upon which one has taken care to trace the image.\nFurthermore, as the head, or the beginning of the viewpoint,\nhas a terminus and a single position, in the same way the con-\nstitution of the images must occur according to a single and\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "26": "PTOLEMY\nsame point that has a determined position, which must natu-\nrally be upon the perpendicular line from the eye to the mirror.\nThe origin of the viewpoint, which moves in any way upon\nthis perpendicular line, or which shifts away from it, generates\nmany discrepancies in the vision.\nTo show the forms, or rather the images of the things that\nappear straightforward: this is the true intent of what Ptolemy\nsets forth in paragraph 65.22 The Latin says expressly ut pate-\nant forme omnium rerum que videntur aut recte aut aliter. These\nmatters, Ptolemy specifies, would be such to require a book\napart, but he will operate by limiting himself to only the most\nrelevant points. Thus, the purpose of the theory of flat mirrors\nconsists, for Ptolemy and also for us, in constructing a straight-\nforward image of that virtual one, under the conditions that\nwe will now illustrate.\nAt paragraph 66,23 the premise is made that when one speaks\nof the viewpoint, one must understand the vertex of the pyr-\namid of rays, by means of which one sees, and that when one\nspeaks of the image of a line perpendicular to the plane of the\nmirror, one must understand the line that is the common inter-\nsection of the plane of the mirror and of the plane orthogonal\nto it, containing the visual ray and the refracted ray.\nIn paragraph 67,24 it is reiterated that the appearances of\nthings are to be considered in relation to the distance, to the\nquantity, and to the position as well as in making reference to\nonly one vision at a time.\n10. CORRESPONDENCES\nParagraph 6825 describes the straight line ABG, which locates\nthe surface of a flat mirror, the viewpoint D, and the object E\n(Fig. 94). Let the visual ray that exits from the viewpoint D\nbend, in going toward E, at equal angles in respect to the mir-\nror, and let DBE be the ray (which fractures at B on the mirror).\nIt is affirmed that no other ray, among those which proceed\nfrom point D, fractures toward E at equal angles. Therefore,\nthe singularity of the ray DBE is affirmed. In paragraphs 69 and\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n145",
  "27": "94\n146\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nK\nB\nZ\nT\nE\nH\nThe singularity of a ray. Note: Original figure, from manuscript.\n70, the hypothesis is taken into consideration that there could\nbe, absurdly, a second ray DZE,26 which fractures at Z on the\nmirror - something that cannot be because the ray DZ does not\nfracture along the line ZE at equal angles. The ray DZ27 must\nhave, in fact, as an extension, the line ZH, which is clearly dis-\ntinct from ZE. In paragraph 71,28 it is demonstrated that if from\nthe objective point E the perpendicular line ET is extended\nand the lines ET and DB are lengthened, these will connect to\neach other at point K. Therefore, Ptolemy concludes at para-\ngraph 72,29 that the image of point E, which the viewpoint D\nsees, corresponds to that of point K.\nIn paragraphs 7330 and 74,31 it is demonstrated that the\ndistance of the objective point E from the mirror and the\ndistance, always from the mirror, of the virtual point H are\nequal (Fig. 95). In paragraph 75, it is demonstrated that\nthe entire line DBH is equal to the lines DB and BE taken\ntogether.\nIn paragraph 76,\" the conclusion is made that the images\nof the real objects appear far away, just like the images of the\nvirtual objects that are seen straightforward. These latter ones\n(the images), in fact, appear farther away the more the virtual\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "28": "95\nD\nPTOLEMY\nH\nZ\nG\nE\nThe equality of distances. Note: Original figure, from manuscript.\nobjects are distant from the viewpoint; this occurs in confor-\nmity with the augmenting of the length of the rays.\n11. LINES IN A FRONTAL POSITION\nIn paragraph 77,34 the appearance of lines parallel to the plane\nof the mirror is taken into consideration, lines that offer the\npossibility of seeing images similar to those which are real. In\nparagraph 78,35 it is specified that the \"frontal position,\" my\ntranslation of the Latin words rectam ... positionem, is the posi-\ntion where the principal visual ray (or its projection in plan)\nfalls onto the center of a segment forming with it two right\nangles.\nAt paragraph 79,36 Ptolemy takes into consideration the\nline (or rather the segment) EZ that constitutes the object to\nbe observed (Figs. 96, 97). The image of point E corresponds\nto that of point K, and the image of point Z corresponds to\nthat of point L. At paragraph 80, it is demonstrated that\nEAK is equal to ZGL, that KL is equal to EZ, and that the\nangles around K and L are right angles. At paragraph 81,38 it\nis deduced that EZ corresponds to KL and that KL is opposite\nand similar to EZ.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n147",
  "29": "96\n97\n148\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nK\nH\nBT\nDA\nE\nZ\nThe appearance of lines parallel to the plane of the mirror 1. Note: Original figure,\nfrom manuscript.\nK\nA\nB\nMeta' O'\nH\nL\nG\nMirror\nE\nZ\nThe appearance of lines parallel to the plane of the mirror 2. Note: Original figure,\nseen in space.\nAt paragraph 82,39 the conclusion is made that the reflected\nimage of a real object coincides with that which is the straight-\nforward one of the virtual object.\n12. THE LOCALIZATION OF THE IMAGES\nAt paragraph 91,40 the problem of the localization of the image\nis posed. At paragraph 92,\" the line ABG singles out the sur-\nface of a mirror plane, D the viewpoint, and EZ the object to be\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "30": "H\nPTOLEMY\nD\nB G.\nT\nL\n98\nE\nZ K\nThe localization of the images 1. Note: Original figure, from manuscript.\nseen (Fig. 98). Let us lead, starting from the viewpoint D, the\ntwo fractured rays DAE and DBZ, at equal angles, to the points\nE and Z. Let us extend DA and DB in straight lines, until they\nconnect with the two perpendicular lines that are conducted\nfrom the points E and Z to the points H and T. Let us draw the\nline HT. Point E will be seen in point H, and point Z in point T.\nAt paragraph 93,42 the line EZ is extended to K (for example)\nand the fractured ray DGK is conducted at equal angles. Then\nthe line DG is extended until it meets at L the line KL, which is\nperpendicular to the line AG. We have moved from T to L, and\nthis movement has taken place on the equivalent side where\nthe real object Z has been moved to K. At paragraph 94,43 it is\nobserved that if the image BG of ZK is above the viewpoint, TL\nwill also appear in the upper part in respect to the eye (Fig. 99).\nThe visual ray, in fact, sees farther above that which is higher\nup and farther below that which is lower down. At paragraph\n95, by turning one's gaze from D toward ZK (Fig. 98), one sees\nthat K is to the right of Z, but by turning one's gaze toward\nTL, one notices that G, which is the image of L, the virtual of\nK, is found on the right of B: therefore, a point that is on the\nright appears on the left and vice versa. Paragraph 9645 notes\nthat this is a deception that the mind overcomes through the\nknowledge of the principles that we have studied.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n149",
  "31": "99\n150\nPERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nT\nB\nD\nK\nZ\nH\nE\nThe localization of the images 2. Note: Original figure rotated.\n13. THE REFLECTED IMAGE OF THE REAL\nOBJECT AND THE STRAIGHTFORWARD IMAGE\nOF THE VIRTUAL OBJECT COINCIDE\nAccording to paragraph 97, in the flat mirrors the reflected\nimages \"do not differ from those of the objects placed frontally\nwhich are seen straightforward\" (non differri a subiectis rebus\nque recte videntur), because the manner of being of the first\nimages is similar to that of the latter images.\nIt is clearly shown that the situs adversus, the \"opposite\nposition,\" is the position where the virtual objects are arranged\ninverted (Figs. 100, 101)\n14. THE UPPER REGISTERS PAINTED WITH\nARCHITECTURAL ELEMENTS\nThat Ptolemy addressed himself in particular to painters is\nclearly understood in book II, where he speaks of veils and col-\nors, of light and shadow, of walls to be painted and painters.\nAt paragraph 140 of book II, he discusses, in particular, the\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "32": "PTOLEMY\n100 Situs adversus and image of a point. Note: The image of a point is obtained through\nthe construction of a diagonal. Source: Original drawing from Piero della Francesca,\nDe Prospectiva Pingendi, Edizione critica, ed. G. Nicco Fasola (Florence: Sansoni,\n1942).\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n151",
  "33": "PERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\n101 Situs adversus and image of a polygon. Source: Original drawing from Piero della\nFrancesca, De Prospectiva Pingendi, Edizione critica, ed. G. Nicco Fasola (Florence:\nSansoni, 1942).\ninterior walls of houses. Walls are painted in the upper registers\nwith architectural elements of the house and doors, the parts\nabove wider than the parts below (the Latin reads superiores\npartes videntur ampliores), although there is not, in reality, nar-\nrowing or expansion of any kind in those upper parts.\n152\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "34": "PTOLEMY\nHuman beings, Ptolemy informs us, became accustomed\nto painting these transformations in conformity with a well-\ndefined and stable position of the observer: a phrase that in\nLatin reads Hoc enim consueverunt homines facere, ut positio sit\nbene disposita et firma.\" This position is the fixed and immuta-\nble viewpoint that every perspective must have, the point that\nPtolemy taught how to establish and to specify by means of the\ntheory of the principal ray and of the meta.\nHere, as a consequence, is to be found the theoretical jus-\ntification, in accordance with the mathematical and geometric\npoint of view, for the architectural wall paintings executed at\nRome and Pompeii, before A.D. 79. Such paintings would have\nbeen found in any other city of the Roman Empire around the\nthird or fourth decade of the second century of our era.\n15. THE THREE PROJECTIONS OF THE\nSPHERE PRESENT IN PTOLEMY\nThrough the theory of mirrors, Ptolemy reduced the three-\ndimensional reality of objects to a plane, but beyond this he\nalso treated the projection onto a plane of the celestial vault\nand the terrestrial sphere. In fact, he constructed celestial and\nterrestrial maps based on very precise geometrical principles.\nThe sphere, which is impossible to develop on a plane, is also\nparticularly difficult to represent. Ptolemy found the images\nthrough exact projections, using a center and a projection\nplane those very elements which we have studied in the the-\nory of mirrors.\nFirst of all, he fixed the essential elements of reference\nfor the terrestrial sphere the axis, the poles, the equator,\nthe parallels, and the meridians. And, consequently, for the\ncelestial sphere, which is considered an immense enlarge-\nment of the terrestrial sphere, he established the celestial\nmeridians, the celestial equator, the ecliptic, the equinoc-\ntial colure, and the astronomical horizon all elements that\nserve to establish both geographical and astronomical point\ncoordinates.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n153",
  "35": "PERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nMeridian Section of the Terrestrial Sphere\nParallel\nof Thule\nEquator\nPicture plane\nin elevation\nEllipse Projecton of the\nParallel through Thule\nParallel of Syene.\nCenter of\nProjection\nParallel through Syene\nThe Oikoumene from\nthe Equator to Thule\nHorizon Line\nEllipse = Projection\nof the Equatorial Circle\n102 Ptolemy's geography 1: The projection of the terrestrial sphere from a point in space\ntaken from the parallel of Syene.\n154\nWhat followed was the projection of the sphere from a cen-\nter upon a flat plane with its points, which can thus be easily\nlocated.\nIf the point of view or the center of the projected rays is cho-\nsen as the center of the sphere, one will have a centrographic\nor gnomonic projection; if outside of the center, it will be a\nscenographic or perspectival projection.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "36": "PTOLEMY\nEllipse Projection of the Parallel through Thule\nPicture plane\nMeridian\nSection of the\nTerrestrial\nSphere\nThe Parallel through Syene\nCenter of\nprojection\nEllipse = Proiection of the Equatorial Circle\n103 Ptolemy's geography 2: The projection of the terrestrial sphere from a point in space\ntaken from the parallel through Syene.\nIn Geographia, 48 Ptolemy examines the representation of the\nterrestrial sphere, in order to produce a map of the earth. He\nprojects the sphere onto a vertical plane, passing through the\ncenter of the earth, from a point in space taken from the paral-\nlel plane of Syene (Figs. 102, 103). The area he delimits covers\nthe oikoumene of the ancients, the world as then known. In\nproducing such a boundary, Ptolemy designed the elliptical\nprojections of the equatorial circle below and of the parallel\ncircle above, the latter passing through Thule. This is a classi-\ncal scenographic or perspectival projection.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n155",
  "37": "PERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\nEcliptic\nMeridian Section of the\nCelestial Sphere\nEquinoctial Plane\nPicture Plane\nEquinoctial Circle\nVanishing Line\nof the Ecliptic\nCircle Projection\nof the Ecliptic\na) Parallel to the\nEquinoctial Plane\nb) Parallel to the\nEquinoctial Plane\nAustral Pole\nCenter of Projection\nb) Circle Projection\nof the Parallel to the\nEquinoctial Plane\na) Circle Projection\n\"of the Parallel to the\nEquinoctial Plane\nProjection of the Celestial\nSphere on a Plane\n104 Ptolemy's planisphere.\nThe second projection corresponds to the \"planisphere,\"49\nin which Ptolemy projects the celestial sphere upon the equa-\ntorial plane from the South Pole. In this representation, the\ncircles of the celestial sphere, the equinoctial, and the paral-\nlels to the equator are represented by circles (Fig. 104). With\nthis projection, Ptolemy teaches how to transport onto a plane\nthe position of the stars in order to easily locate them in the\n156\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press",
  "38": "10\nP\n10\nPTOLEMY\n15°.\n12\n15\n11\n10 o'clock on Summer Solstice\n10\nEquinoctial Line\n10 o'clock on Winter Solstice\n105 Ptolemy's analemma 1: Horizontal astronomical clock with equal hours; calculation\nof the tenth hour (latitude of Rome). AB = gnomon; NAFC = sun ray at the equinox;\nEAI = astronomical horizon; PQ = world axis.\nsky for orientation in navigating. This is also a scenographic or\nperspectival projection, but because the center of projection\nis placed upon the surface of the sphere, it has been given the\nname of a stereographic projection.\nThe third representation consists in transporting onto a plane\nthe paths that the sun takes upon the celestial sphere. 50 This\ntime the center of projection is horizontal and passes through\nthe base of the gnomon. The shadows that the sun generates\nby projecting the vertex of the gnomon onto the horizontal\nplane are, at our latitudes, hyperboles (Figs. 105, 106). This too\nis a scenographic or perspectival projection, but because the\ncenter of projection is the vertex of the gnomon, it has been\ngiven the name centrographic or gnomonic projection.\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press\n157",
  "39": "PERSPECTIVE IN VISUAL CULTURE OF CLASSICAL ANTIQUITY\n12\n11\n10,\n9\n8\n10 9 8\n7\n12\n5\n12\n11\n10\nHourly lines\n7\nEquinoctial line\n10\nBranches of the hyperbola\n106 Ptolemy's analemma 2: Horizontal astronomical clock with equal hours; construc-\ntion of hourly lines (latitude of Rome).\n158\nhttps://doi.org/10.1017/CBO9781139198905.007 Published online by Cambridge University Press"
}