{
  "1": [
    {
      "label": "section_header",
      "text": "IV.2 THREE-DIMENSIONAL ASTRONOMY",
      "bbox": {
        "l": 188.0,
        "b": 794.0,
        "r": 564.0,
        "t": 908.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 347.0,
        "b": 881.0,
        "r": 404.0,
        "t": 908.0
      }
    },
    {
      "label": "section_header",
      "text": "Celestial globes and armillary spheres",
      "bbox": {
        "l": 173.0,
        "b": 744.0,
        "r": 580.0,
        "t": 771.0
      }
    },
    {
      "label": "text",
      "text": "Taha Yasin Arslan",
      "bbox": {
        "l": 307.0,
        "b": 696.0,
        "r": 446.0,
        "t": 713.0
      }
    },
    {
      "label": "text",
      "text": "Astronomical instruments are physical manifestations of knowledge about the heavens to which various disciplines contributed. They provide information on the development of three of the four fundamental mathematical sciences — number theory, geometry, and astronomy, and their branches. They are also evidence of scholarly influences and transmission, mastery of craftsmanship, artistic and religious preferences, and the social acknowledgment of astronomy and astrology as well as the patronage and institutionalization of knowledge. This chapter deals with two of these instruments: celestial globes and armillary spheres. Celestial globes carry evidence of arts and crafismanship in their time and region through the depictions of the constellations, the wording of the makers signature, the names of stars, constellations, lunar mansions, and the nature of the scales included. Their popularity, as well as records of dedications, reveals non-scholarly interests and the patronage of different elite circles for globe making, while records of dates and places may provide information on the transition of knowledge between regions and centuries. In contrast, only a few examples of armillary spheres survive, preventing us from making a broad assessment of the instrument's role in society. However, extant manuals on its construction and use shed some light on the devel- ‘opment of the instrument.!",
      "bbox": {
        "l": 101.0,
        "b": 358.0,
        "r": 653.0,
        "t": 643.0
      }
    },
    {
      "label": "section_header",
      "text": "IV.2.1 Celestial globes",
      "bbox": {
        "l": 293.0,
        "b": 312.0,
        "r": 459.0,
        "t": 330.0
      }
    },
    {
      "label": "text",
      "text": "‘The celestial globe is an instrument that imitates the daily motion of the sky and is used for observations, calculations, or demonstrations. It is usually made of metal and occasionally of wood and papier-maché. More than 200 globes are extant and almost all have a hollow metal body (for a comprehensive description and a list of surviving celestial globes, see Savage-Smith 1990-1991). Their sizes vary between Sem and 35cm in diameter. This is one of the largest lasses of surviving astronomical instruments made in the Islamicate world. During the construc tion process, the first problem that had to be dealt with was how to produce a sphere. Unfortu- nately, no known text discusses this. A careful investigation of the extant instruments, however, gives us credible information on two types of metal spheres used as globes. First are two-piece globes, which consist of two identical hemispheres cast, joined by seams, and smoothed. Second are one-piece globes that were made by the lost-wax method, which involved casting a complete sphere and smoothing its surface, although this usually required plugs on the body to cover the",
      "bbox": {
        "l": 101.0,
        "b": 87.0,
        "r": 652.0,
        "t": 301.0
      }
    },
    {
      "label": "key_value",
      "text": "DOI: 10.4324/9781315170718-43",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 270.0,
        "t": 65.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 270.0,
        "t": 64.0
      }
    },
    {
      "label": "page_footer",
      "text": "474",
      "bbox": {
        "l": 630.0,
        "b": 53.0,
        "r": 650.0,
        "t": 64.0
      }
    }
  ],
  "2": [
    {
      "label": "section_header",
      "text": "‘Three-dimensional astronomy",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "hole required in the casting process (Sava ship, construction markings, plugs, or traces of seams may hardly be visible. Smith 1985, 83-6). Depending on the crafisman-",
      "bbox": {
        "l": 88.0,
        "b": 917.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "‘Almost all surviving globes from the Islamicate world share major similarities. A standard globe has the celestial equator and ecliptic drawn. The equator carries a scale of 360°, while the ecliptic has twelve scales of 30°. Both begin at the vernal equinox and are divided into intervals, of 5°, 6°, or 10°, where the divisions are labeled with Arabic alphanumeric notation (abjad) and subdivided into inte rls of 1° or 2°. The twelve scales of the ecliptic are inscribed with the corresponding names of the signs of the zodiac. The poles of the equator and the ecliptic are usually marked with circles and occasionally labeled. The globe is divided into twelve sec- tions by six great circles drawn at intervals of 30° between the ecliptic poles. One of these is a sokstitial colure, which is a great circle through the celestial poles, the poles of the ecliptic, and the summer and winter solstices. None of the standard globes carries circles of ever-visible or invisible stars. Depending on the type of globe, may not be inscribed. When they are, the stars are usually shown in different sizes and shapes, tars and the constellation figures may or based on their brightness (Figure IV.2.1).",
      "bbox": {
        "l": 88.0,
        "b": 683.0,
        "r": 638.0,
        "t": 914.0
      }
    },
    {
      "label": "text",
      "text": "‘A standard globe has two rings, one for the meridian and another for the horizon. The globe from the c is mounted in the meridian ring ring at the north-south axis, maki Because of this arrangement, manuscripts in the Islamicate world refé estial poles and the ring is fixed within the horizon g it the prime meridian. The horizon ring sits on a stand. to the instrument as the sphere with a stand (al-kura dhat al-kurs). Both rings carry either a scale of 360°, two scales of 180°, or four scales of 90° and are divided into intervals of 5°, 6°, or 10°, which are subdivided into intervals of 1° or 2°. Although standard globes do not have an attached ring or a gnomon",
      "bbox": {
        "l": 88.0,
        "b": 557.0,
        "r": 639.0,
        "t": 681.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 138.0,
        "b": 142.0,
        "r": 588.0,
        "t": 515.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 1V-2.1 Model of a standard globe",
      "bbox": {
        "l": 89.0,
        "b": 112.0,
        "r": 303.0,
        "t": 125.0
      }
    },
    {
      "label": "key_value",
      "text": "Source: © Taha Yasin Arslan, Istanbul",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 280.0,
        "t": 101.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 88.0,
        "r": 280.0,
        "t": 101.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 88.0,
        "r": 280.0,
        "t": 101.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 90.0,
        "r": 122.0,
        "t": 100.0
      }
    },
    {
      "label": "page_footer",
      "text": "475",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "Taha Arslan",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "for measuring the altitude of the Sun and the stars, the manuals on the use of globes propose using a suitable object as gnomon and a detached quadrant with a 90° scale to find the altitude of celestial objects. Standard globes are divided into three groups for the number of stars they represent. Globes of the first group have around a thousand stars usually distributed among the images of the 48 classical constellations. Globes of the second group display only selected stars, usually those found on astrolabes. The third group contains specimens that carry only the great circles but no stars (Savage-Smith 1985, 61-2)",
      "bbox": {
        "l": 101.0,
        "b": 827.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "In addition to those standard types, the works of Ptolemy (¢. 100-180) and Bateini (4 317/929-930) introduced two other designs to the Islamicate world. In the eighth book of the Almagest, Ptolemy describes a globe with a rotatable ecliptic ring (Ptolemy 1998[CB],? 4047) ‘The purpose of this modification is to allow for the deviation caused by the precession of the equinoxes over the years (approximately 1° in 72.2 years in modern value). Al-Battini introduced a globe called an egg (bayda), which was a common term for globes, with five rings (al-Battini 1977[CB], 210-13 [fols 142s~44b)). The celestial equator and the ecliptic are drawn on the globe as usual. Additionally, there are two meridian rings, one is fixed and the other rotates, a horizon ring, a zenith ring, and the outer ring, which carries a movable and removable gnomon. Unlike the other examples, al-Battin’s egg does not sit on a stand but is suspended. The second rotatable meridian ring serves for marking the star positions and making calculations accurately. ‘The movable gnomon is used to mark the solar longitude and the altitude of the sun along with many other applications. Unfortunately, no example of these two ingenious devices has survived.",
      "bbox": {
        "l": 101.0,
        "b": 593.0,
        "r": 652.0,
        "t": 824.0
      }
    },
    {
      "label": "section_header",
      "text": "1V.2.1.1 Instructions for globe making",
      "bbox": {
        "l": 242.0,
        "b": 548.0,
        "r": 511.0,
        "t": 564.0
      }
    },
    {
      "label": "text",
      "text": "Instructions of how to draw on globes are very limited in extant astronomical writings. This is particularly surprising given the large number of surviving objects. ‘Abd al-Rahman al-Sifi’s (291-376/903-986) Book of the Constellations (Kitab suwar al-kawakib al-thabita) seems to be the only treatise that was used extensively all over the Islamicate world. Construction manuals for astrolabes and sundials, however, are much more common. They usually give precise values in ratios as pointers for engravings such as almucantars, azimuths, and seasonal hours on astrolabes and parabolas and hyperbolas of shadow lengths of various signs of the zodiac on sundials. On the other hand, globes require their users to consider only two parameters: (1) the obliquity of the ecliptic and (2) the precession of the equinoxes. While the value of the obliquity was calculated and given differently by various astronomers, the globe makers seem to have used approximate values such as 23.5° or 24°. Considering the small size of the instrument one should not expect a precision of more than half or a quarter of a degree. The value of the precession is more impor- tant since the makers usually used older catalogues for star positions (ie., al-Sifis Book of the Constellations) and needed to consider the positional changes of stars during the period between the preparation of the star catalogue and the construction of the globe.",
      "bbox": {
        "l": 101.0,
        "b": 269.0,
        "r": 652.0,
        "t": 536.0
      }
    },
    {
      "label": "text",
      "text": "‘The scales, circles, and inscriptions all depend on the size of the instrument as well as the maker’ initiative. The production process includes marking opposite points as poles, drawing great circles for the ecliptic and celestial equators and the three great circles through the poles of the ecliptic, as well as constructing scales with various intervals on some of these circles, and inscribing their values. Unlike the ones on an astrolabe, these circles do not require a table of radii jadwal ansaf al-agiar) but simple angular calculations since no type of projection is required on globes. For those tasks, the globe makers usually employed various tools, such as a quadrant with a scale of 90°; compasses; and engraving tools.",
      "bbox": {
        "l": 102.0,
        "b": 125.0,
        "r": 652.0,
        "t": 266.0
      }
    },
    {
      "label": "text",
      "text": "‘There are two important works with detailed descriptions on how to draw on globes. The first ‘one was introduced by al-Battint in the 7th chapter of his Book of Astronomical Tables (Kitab al-Z),",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 652.0,
        "t": 122.0
      }
    },
    {
      "label": "page_footer",
      "text": "476",
      "bbox": {
        "l": 366.0,
        "b": 51.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "4": [
    {
      "label": "section_header",
      "text": "‘Three-dimensional astronomy",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "where he proposed the egg (al-Battini 1977, 210-13 [fols 142a—44b]). According to al-Battini, the maker needs to determine two points that are exactly opposite of each other on the globe, which will act as the celestial poles. However, he doesn’t mention how this is done. Al-Batt3nts summary of the different steps for construction reflects the scholar’ effort for providing globe makers (craftsmen as well as scholars) with the necessary skills. Using the poles, the globe maker is told to draw a great circle as the celestial equator and then to mark four equidistant points on it. The steady leg of a pair of compasses has to be fixed at one of these points, and the drawing leg is used to draw another great circle that passes through two points on the equator and the poles, making it the solstitial colure. In order to determine the positions of the ecliptic poles and to draw the ecliptic, the globe maker has to inscribe a quarter of the equator with a scale of (902. Learning from al-Battant’s text that the obliquity of the ecliptic is 23° 35’, the globe maker, using the scale, can now open the legs of the compasses as wide as the value of the obliquity. ‘Then he fixes the steady leg at one of the celestial poles and rotates the drawing leg until it intersects with the solstitial colure. Wherever the tip of the leg touches on the colure he marks as an ecliptic pole. The same procedure is carried out for the second pole. Once the poles are marked, he can draw the ecliptic.",
      "bbox": {
        "l": 89.0,
        "b": 665.0,
        "r": 639.0,
        "t": 951.0
      }
    },
    {
      "label": "text",
      "text": "Determining and marking the stars’ positions is only possible after the ecliptic circle is divided into twelve scales of 30°. First, the globe maker needs to obtain the values for a star’s longitude and latitude in ecliptic coordinates from either catalogues or observations. Using the scale of 90° that was previously prepared for finding the ecliptic poles, he then opens the compasses as wide as the value of the latitude of the star. Keeping the width fixed, the globe maker has now to place the steady leg on the corresponding degree of the zodiacal sign as its longitude. He is instructed to use the drawing leg to draw a small, concave arc for an approximate position. Depending on the direction of the star, he draws the arc either on the north or the south of the ecliptic but always eastward. To make the position more precise, he has to open the compasses exactly 90° and to place the steady leg on a point that is 90° west of the longitude of the star on the ecliptic circle. Now he can draw a second arc by using the drawing leg. The intersection of the two arcs gives the position of the star. All designations are approximate since the scales have only 1° intervals.",
      "bbox": {
        "l": 89.0,
        "b": 449.0,
        "r": 638.0,
        "t": 662.0
      }
    },
    {
      "label": "text",
      "text": "‘The second example of instructions for how to make a globe is found in Abii ‘AN al-Hasan al-Marrikush’s (2nd half of the 7th/13th century) From A to Z: A Compendium of Timekeeping (Jami al-mabadt wal-ghayat ft ‘lm al-migai). In the fifth chapter of the second book, he gives details on how to construct celestial globes and armillary spheres (MS Oxford, Bodleian Library, Marsh 154, fols 2b-5a). In the section on the globe, he first describes finding the diameter of a globe and proposes to make a quadrant with a scale of 90° and the same radius as the globe. He then introduces a method for precision drawing. According to this, one picks any point on the globe as the center, then places the steady leg of the compass on this center and draws a small circle with four equidistant points marked on it. After this, the quadrant, that was introduced while finding the diameter of the globe, is required. The quadrant is placed on the globe so that its rim touches any one of the four equidistant points while one of its ends remains fixed at the original center. Starting from the center, an arc is drawn along the rim of the quadrant. The other end of the arc marks one of the poles. Then the quadrant is rotated until its rim touches the opposite one of the equidistant points. A secondary arc is drawn to mark the second pole. After this, al-Marrakushi proposes that one should use a lathe to engrave the celestial equator. To do that, the globe should be held axially in the lathe so that it can be rotated about its poles. Then, using a point equidistant from each pole as the reference, one can engrave a great circle that also passes through the center and the two remaining points of the small circle.",
      "bbox": {
        "l": 89.0,
        "b": 125.0,
        "r": 639.0,
        "t": 446.0
      }
    },
    {
      "label": "text",
      "text": "‘Al-Marrakushi’s introduction of the quadrant, which carries a scale of 90°, makes marking the star positions rather easy in comparison to al-Battini’s method. One simply fixes one end",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 122.0
      }
    },
    {
      "label": "page_footer",
      "text": "477",
      "bbox": {
        "l": 353.0,
        "b": 51.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "Taha Arslan",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "of the quadrant to the north or south ecliptic pole and rotates it to the corresponding degree of the ecliptic for the longitude. Then one measures the latitude of the star and marks its posi tion. Although none of the extant Jobes resembles fully the types introduced by al-Battini or al-Marrakushi, determining whether the producers of the extant globes had indeed used any of their methods for drawing the circles and marki g the star positions requires further research.",
      "bbox": {
        "l": 101.0,
        "b": 863.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Abd al-Rahman al-Safi was pethaps the scholar whose work had the the construction of globes. In his famous work, Book of the Star Constell constellations and marks 1025 stars from Prolemy’s star catalo reatest impact on ions, he illustrates 48 ie. He ako offers the ecliptic coordinates (longitude and latitude) and the brightness of the stars in tables and gives detailed descriptions of the positions of the stars relative to their constellations. Each constellation is depicted as it is seen in the sky and on the globe. Al- 's catalogue relies heavily on Ptolemy's values, but he adds 12° 42’ to the longitude of each star to eliminate the difference caused by the precession of the equinoxes and occasionally changes some of the values to the ones he obtained through his own observations (Dekker 2012, 29-47). Al-Sufi’s cataloy and, more importantly, his illustrations were helpful for preparing star catalogues and constructing globes. It was used until the 13th/19th century",
      "bbox": {
        "l": 101.0,
        "b": 665.0,
        "r": 652.0,
        "t": 860.0
      }
    },
    {
      "label": "section_header",
      "text": "IV.2.1.2 Uses of celestial globes",
      "bbox": {
        "l": 266.0,
        "b": 620.0,
        "r": 486.0,
        "t": 637.0
      }
    },
    {
      "label": "text",
      "text": "Once the globe is constructed, one can use it in any latitude. To use it in a specific locality, the meridian ring is rotated until the angular difference between the celestial pole and horizon agre with the local latitude. This is rather easy since the meridian ring is attached to the globe at the celestial poles and carries a scale. Depending on the globe's type, the number of applications that can be performed with it differs. Moreover, the celestial globes, with the exception of those using an additional gnomon and a detached quadrant, are not destined for observations but for calcula tions and demonstrations. Only a few examples of these additional tools survive (Figure IV.2.2)",
      "bbox": {
        "l": 101.0,
        "b": 486.0,
        "r": 652.0,
        "t": 608.0
      }
    },
    {
      "label": "text",
      "text": "Therefore, we do not know whether many of the extant globes were indeed used for obser- vations. Before one uses the globe, one needs to obtain values such as the degree of the zodiacal",
      "bbox": {
        "l": 102.0,
        "b": 449.0,
        "r": 651.0,
        "t": 482.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 149.0,
        "b": 172.0,
        "r": 603.0,
        "t": 436.0
      }
    },
    {
      "label": "caption",
      "text": "12.2 Muhammad ibn Mu ayyad al-Din al Urdis (7th/13th century) celestial wooden stand, made from brass, with gold and silver inlay; Mathes Salon, Dresden, inv. no. E ILL 687/128) on",
      "bbox": {
        "l": 102.0,
        "b": 113.0,
        "r": 652.0,
        "t": 155.0
      }
    },
    {
      "label": "text",
      "text": "Source: © Mathematisch-Physikalischer Salon, Staatliche Kunstsammlungen, Dresden",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 542.0,
        "t": 101.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 542.0,
        "t": 101.0
      }
    },
    {
      "label": "page_footer",
      "text": "478",
      "bbox": {
        "l": 366.0,
        "b": 53.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "6": [
    {
      "label": "section_header",
      "text": "‘Three-dimensional astronomy",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "sign for the intended day, the instantaneous altitudes of the sun, the moon and the stars and the ascendant. These values can be found in astronomical tables or through observations made with the globe or different instruments. When such parameters are known, a globe can be used for numerous calculations. Some are",
      "bbox": {
        "l": 89.0,
        "b": 884.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the longest and shortest days and nights in a given latitude.",
      "bbox": {
        "l": 89.0,
        "b": 845.0,
        "r": 502.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the maximum and minimum meridian altitude of the sun in a given latitude.",
      "bbox": {
        "l": 89.0,
        "b": 828.0,
        "r": 607.0,
        "t": 843.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the difference between the lengths of the different days in a given latitude.",
      "bbox": {
        "l": 89.0,
        "b": 809.0,
        "r": 591.0,
        "t": 825.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the daytime arc of any star marked on the globe.",
      "bbox": {
        "l": 89.0,
        "b": 791.0,
        "r": 442.0,
        "t": 806.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the azimuth of any star when it is rising or setting,",
      "bbox": {
        "l": 89.0,
        "b": 773.0,
        "r": 454.0,
        "t": 788.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the declination of any star on the globe",
      "bbox": {
        "l": 89.0,
        "b": 755.0,
        "r": 392.0,
        "t": 770.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the distance between two stars on the globe.",
      "bbox": {
        "l": 89.0,
        "b": 737.0,
        "r": 419.0,
        "t": 753.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the time of rising and setting of any star on the globe.",
      "bbox": {
        "l": 89.0,
        "b": 720.0,
        "r": 473.0,
        "t": 735.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding ever-visible and ever-invisible stars for a given latitude.",
      "bbox": {
        "l": 89.0,
        "b": 701.0,
        "r": 479.0,
        "t": 717.0
      }
    },
    {
      "label": "list_item",
      "text": "+ finding the azimuth of the direction of Mecca (gibla).",
      "bbox": {
        "l": 89.0,
        "b": 683.0,
        "r": 423.0,
        "t": 699.0
      }
    },
    {
      "label": "text",
      "text": "‘As a consequence of its wide array of use, several manuals on this topic were written, copied, and used for centuries. Of those, two were particularly influential: Qusta ibn Liga’s (d. « 300/912-913) Treatise on the Use of the Sphere with a Stand (Risdlat al-‘Amal bi-l-kura dhat al-kursi) and al-Safis Commentary on the Use of the Globe (Fi Shard al-‘Amal bi-I-kura). These two works, compiled in the 3rd/9th and 4th/10th centuries, respectively, are the most comprehensive trea- tises on the subject. Qusti’s work, on present evidence the more popular one of the two, consists of an introduction and 65 chapters. First, it gives information on the celestial sphere followed by a brief description of a globe with those stars that can be found on astrolabes (chapters 1-5) It continues with the instructions on many different applications both for observations and calculations (chapters 6-65). Al-Sifi’ treatise is even more comprehensive. It deals with the problems of the use of globes in 157 chapters. Habash al-Hisib (d. after 255/869), al-Marrakushi, and Amin al-Din al-Abhari (4. 733/1332-3) are among the few other scholars who wrote on the use of the celestial globe.",
      "bbox": {
        "l": 88.0,
        "b": 431.0,
        "r": 638.0,
        "t": 662.0
      }
    },
    {
      "label": "section_header",
      "text": "1V.2.1.3 A profile of the globe-making tradition",
      "bbox": {
        "l": 197.0,
        "b": 386.0,
        "r": 527.0,
        "t": 403.0
      }
    },
    {
      "label": "text",
      "text": "For the surviving globes, knowing their makers, dates of construction, and places of origin allows us to create a profile for the globe-making tradition. For instance, most of the extant globes are of either Persian or Mughal Indian origin. Only a handful of globes are dated from the 3rd/9th to the 10th/16th centuries. The number of dated globes rises exponentially in the 11th/14th century and the provenances shifted from the Middle East to Mughal India. The dates and signatures on the instruments provide proof of the continuous activity of families and individual specialists as instrument-making artisans. In comparison to other instruments such as astrolabes, quadrants, and sundial, relatively more non-scholarly artisans seem to be involved in the construction of globes. There were two noteworthy cities for instrument makers: Har- fin (today in Turkey) and Lahore (today in Pakistan). Although little of their production has survived, the historical record indicates that Harrin was a major center for the construction of astronomical instruments between the 3rd/9th and the 5th/Iith centuries. ‘Abd al-Rahman al-Sifi states, for instance, that he has seen many globes made in Harrin and that he disapproved of a globe made by Ali ibn Is from Harrin (MS Paris, BnF, Arabe 5036, fols 4b, 108b). Unfor- tunately, in the case of Harrin, we lack details such as the list of makers, the sale records, and the number of workshops. We are better informed about a family who ran a workshop for",
      "bbox": {
        "l": 88.0,
        "b": 89.0,
        "r": 638.0,
        "t": 374.0
      }
    },
    {
      "label": "page_footer",
      "text": "479",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "7": [
    {
      "label": "section_header",
      "text": "Taha Arslan",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "instruments in Mughal Lahore during the 11th/17th century o xr four generations: Shaykh Allahdid Asturlabi Humaydni Lahiri, his son Mulla ‘isi, the latter’s two sons Qaim Muhammad and Muhammad Mugim, Qi'im’s son Diyi’ al-Din Muhammad and Mugim’s sons Hamid and Jamal al-Din (Sarma 2019). Of the astrolabes and globes they produced, 134 and 33, respectively, are en decades between 1032/1623 and 1102/1691, using the lost-wax method exclusively and successfully. They produced very accurate globes of every type. Although they were not the only instrument makers in Mughal India, this Lahore family constituted the frame of the Mughal globe-making tradition (Figure 1V.2.3). ant. They made these 33 globes in the se",
      "bbox": {
        "l": 101.0,
        "b": 809.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 149.0,
        "b": 187.0,
        "r": 603.0,
        "t": 790.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 12.3 Cast and engraved celestial globe on a stand from the workshop in Lahore, Mughal India, made in 1036/1626-7. Height: 23 cm, Width: 17.5 em. Inscriptions: (1) The work of the Yim Muhammad ibn 13 ibn All Tiwenty-second year of the reign of Jahingir. Museum no. M.828PART/1-1928, least of the servants ( id Asgurlabs Humiytin’ Labi. (2)",
      "bbox": {
        "l": 101.0,
        "b": 112.0,
        "r": 651.0,
        "t": 170.0
      }
    },
    {
      "label": "text",
      "text": "Soure: © Victoria and Albert Museum, London",
      "bbox": {
        "l": 103.0,
        "b": 89.0,
        "r": 352.0,
        "t": 101.0
      }
    },
    {
      "label": "page_footer",
      "text": "480",
      "bbox": {
        "l": 365.0,
        "b": 53.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "‘Three-dimensional astronomy",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Celestial globe production in the Islamicate world continued for over a millennium. While the values for positioning the stars mostly remained true to the ones given by al-Sifi, the style of wording and the images of the constellations varied from region to region during this period. Globe makers from Iran and Mughal India excelled at the lost-wax method around the 10th/16th century. Afterward, it became the preferred method for globe construction. Almost none of the extant globes has its original rings (the meridian ring and the horizon ring), but some have replacements. Noncontemporary replacements, in particular, indicate that these globes were in use for centuries.",
      "bbox": {
        "l": 88.0,
        "b": 808.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "1V.2.2. Armillary spheres",
      "bbox": {
        "l": 272.0,
        "b": 764.0,
        "r": 454.0,
        "t": 781.0
      }
    },
    {
      "label": "text",
      "text": "Like celestial globes, armillary spheres imitate the daily motion of the sky. But, unlike globes, they do not have a solid spherical body to indicate the stars and the constellations. The circles that are astronomically significant, such as the meridian and the ecliptic, are represented by nested rings. They can be used both for demonstrations and observations. However, it seems that they were exclusively employed for observations in the Islamicate world. This is rather different from Europe where armillary spheres were often employed in demonstrations and teachings.",
      "bbox": {
        "l": 88.0,
        "b": 647.0,
        "r": 638.0,
        "t": 753.0
      }
    },
    {
      "label": "text",
      "text": "Armillary spheres are made of wood or metal and constructed as large as possible in order to reach high accuracy in observations. Depending on the material and the craftsmanship, instru- ments were known to have been made in sizes between 1 and 6 meters in diameter. There were, however, certain limitations to size since parts can be deformed by expansion or bending, Unfortunately, only very few late examples survive from the 12th/18th and the 13th/19th cen- turies (Sarma 2019, 3261-80)",
      "bbox": {
        "l": 88.0,
        "b": 539.0,
        "r": 638.0,
        "t": 644.0
      }
    },
    {
      "label": "section_header",
      "text": "1V.2.2.1 The construction of an armillary sphere",
      "bbox": {
        "l": 194.0,
        "b": 494.0,
        "r": 532.0,
        "t": 511.0
      }
    },
    {
      "label": "text",
      "text": "‘The armillary sphere is a Greek invention and is known in Arabic as dhat al-balag (the [instru ment] with rings). The earliest record in the Islamicate world is ascribed to the 2nd/8th-century astrologer Muhammad ibn Ibrahim al-Faziri because of his lost work Book on the Use of the Astro- abe Known as the Armillary Sphere (Kitab al-‘Amal bi-L-asturlab wa-huuwa dhat al-balag; Yon al-Na- dim 1871-1872[CB], 2: 273). Although al-Fazari categorized the armillary sphere as a type of astrolabe, this was not followed by others, and it was usually treated as a different instrument. ‘The armillary sphere became popular very early in the history of astronomy in the Islamicate world through the translations of Ptolemy's Almagest in the 2nd/8th and 3rd/9th centuries. In the fifth book of the Almagest, Ptolemy introduces an armillary sphere with six rings, as follows (Ptolemy 1998, 217-18)",
      "bbox": {
        "l": 88.0,
        "b": 305.0,
        "r": 639.0,
        "t": 482.0
      }
    },
    {
      "label": "text",
      "text": "‘Two rings of the same size, representing the ecliptic and the solstitial colure, are joined perpendicularly. Then the ecliptic poles are located on the colure and two pegs, one for the inner surface and the other for the outer surface, are attached at each pole. Two rotatable rings are fixed at these pegs. The outer one is the large longitude ring, and the inner one is the small longitude ring. The small longitude ring houses another ring with two sighting vanes. This ‘observation’ ring is fitted so that it can only rotate parallel to and simultaneously with the small longitude ring. After measuring the angular difference between the ecliptic and celestial poles, positions of the latter are marked on the large longitude ring. One peg is attached to its outer surface at each pole. The outermost ring, which represents the meridian, is fixed at these pegs. The meridian ring is then fixed inside the horizontal plane as we have seen in globe making. The entire arrangement is carried by columns fitted under the horizon plane (Figure 1V.2.4)",
      "bbox": {
        "l": 88.0,
        "b": 89.0,
        "r": 638.0,
        "t": 302.0
      }
    },
    {
      "label": "page_footer",
      "text": "481",
      "bbox": {
        "l": 354.0,
        "b": 52.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "9": [
    {
      "label": "section_header",
      "text": "Taha Arslan",
      "bbox": {
        "l": 344.0,
        "b": 983.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 983.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 108.0,
        "b": 569.0,
        "r": 644.0,
        "t": 951.0
      }
    },
    {
      "label": "caption",
      "text": "1V2.4 Ptolemy's model of the armillary sphere",
      "bbox": {
        "l": 102.0,
        "b": 541.0,
        "r": 388.0,
        "t": 554.0
      }
    },
    {
      "label": "text",
      "text": "© Taha Yasin Arslan, Istanbul",
      "bbox": {
        "l": 102.0,
        "b": 518.0,
        "r": 293.0,
        "t": 530.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 519.0,
        "r": 293.0,
        "t": 530.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 520.0,
        "r": 136.0,
        "t": 529.0
      }
    },
    {
      "label": "text",
      "text": "The types of this instrument used for demonstration and for observation are distinctively different. An armillary sphere for demonstration contains a small globe, representing the Earth at the center, and does not require sighting vanes or an observation ring. The armillary sphere for making observations does not have Jlobe at its center. It was rather more popular in the Islamicate world and arguably had more practical value. It could be used to find the latitudes and longitudes of the sun, the moon, the five planets and the stars, their meridian altitude, the time, and the angular differences between two or more celestial objects, all according to the ecliptic coordinate system.",
      "bbox": {
        "l": 101.0,
        "b": 321.0,
        "r": 652.0,
        "t": 462.0
      }
    },
    {
      "label": "text",
      "text": "Prolemy’s description of an armillary sphere for making observations was used for centuries with some changes to the number and the function of the rings. For instance, the instrument maker and scholar Mu’ayyad al-Din al-'Urdi (d. 664/126) switched the observation ring with an alidade (a sighting unit) by converting the small longitude ring into a hollowed disk so that the {al-Din ibn Ma'rif (d. 993/1585). '84-987/15 alidade could be fixed at its center. The Ottoman scholar Ta who headed the short-lived Istanbul Observatory between 9 1580, constructed an armillary sphere with six rings but removed the observation ring while adding another for the celestial equator (MS Istanbul, Topkapr Library, Hazine 452). The new ring is of the same size as the meridian ring and was connected to it perpendicularly. In this model, the sighting vanes are on the celestial equator ring (Figure IV.2.5)",
      "bbox": {
        "l": 101.0,
        "b": 141.0,
        "r": 652.0,
        "t": 318.0
      }
    },
    {
      "label": "text",
      "text": "The construction of an armillary sphere does not necessitate sophisticated astronomical knowledge. Other than determining or obtaining the value of the obliquity of the ecliptic, one needs to execute only simple geometrical calculations to determine the sizes of the rings. There",
      "bbox": {
        "l": 101.0,
        "b": 87.0,
        "r": 652.0,
        "t": 138.0
      }
    },
    {
      "label": "page_footer",
      "text": "482",
      "bbox": {
        "l": 365.0,
        "b": 53.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "‘Three-dimensional astronomy",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 178.0,
        "b": 408.0,
        "r": 548.0,
        "t": 951.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 11.2.5 A miniature of Tagi al-Din ibn Mavis armillary sphere. MS Istanbul, Istanbul University, Rare Works Library, F 1404, fol. 56b.",
      "bbox": {
        "l": 89.0,
        "b": 363.0,
        "r": 638.0,
        "t": 391.0
      }
    },
    {
      "label": "text",
      "text": "‘Source: © Istanbul University, Rare Works Library, Istanbul",
      "bbox": {
        "l": 89.0,
        "b": 338.0,
        "r": 394.0,
        "t": 352.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 338.0,
        "r": 394.0,
        "t": 352.0
      }
    },
    {
      "label": "text",
      "text": "is no astronomical significance in the proportions of the rings, the choice is based on aesthetics. However, constructing a flawless instrument, especially in large sizes as it was often done in the Islamicate world, is extremely hard. Metal rings may expand and contract due to temperature changes and both wood and metal rings may bend over time due to their own weight. Unskillfal crafismanship can also prevent free rotation of the rings. These become major problems since gathering systematic observations requires many years of application. However, making a large instrument creates advantages in terms of precision in the observations. Hence, instrument makers in the Islamicate world tried to perfect their designs with modifications of Ptolemy's model and constructed instruments as large as possible. In comparison to portable instruments like globes and astrolabes, these armillary spheres were rather heavy and quite expensive. That is why they were employed almost exclusively in observatories. Moreover, political struggles, wars, and the financial costs of maintenance shortened the lifespans of the observatories in the",
      "bbox": {
        "l": 88.0,
        "b": 88.0,
        "r": 638.0,
        "t": 300.0
      }
    },
    {
      "label": "page_footer",
      "text": "483",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "Taha Arslan",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Islamicate world. For instance, the Samargand observatory may have been active no longer than 30 years and the Istanbul observatory survived only four. These relatively short working lives did not help the survival of large instruments,",
      "bbox": {
        "l": 102.0,
        "b": 899.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "1V.2.2.2 The use of the armillary sphere",
      "bbox": {
        "l": 237.0,
        "b": 854.0,
        "r": 515.0,
        "t": 871.0
      }
    },
    {
      "label": "text",
      "text": "‘The earliest known armillary spheres used in the Islamicate world are the two instruments made for the observatories in Baghdad and Damascus, respectively, between 213-14/828-829 and 216-217/831-832. Both were made by Khalid ibn ‘Abd al-Malik al-Marwarridhi (3rd/9th century), an instrument maker of the Abbasid Caliph al-Ma'miin (r. 198-218/813-833; Sayili 1960 [1988][CB], 57). No farther information about these instruments seems to have survived. Several centuries later, two firsthand records were written on armillary spheres used in the two most important observatories in the Islamicate world: Maragha and Samargand. Al“Urdi, ‘Maragha's instrument maker, compiled The Epistle on How (to Make) Observations (al-Risala ft kay- _fiyyat al-arad). In it, he deals with several instruments, some of which were his own inventions. He also wrote a comprehensive section on the construction of a wooden armillary sphere with five rings and a diameter of approximately 160cm (MS Istanbul, Siileymaniye Library, Nurnos- ‘maniye 2971, fols 766-82a). Al“Undi gives measurements for the diameter, width, and thickness of each ring and detailed instructions on how to attach the rings, as well as how to preserve the instrument's condition. He shows why Ptolemy's ‘observation’ ring is inconvenient and argues that an alidade is a better option for observations. In another text, Giyith al-Din al-Jamshid al-Kashi (d. 832/1429), who was the first director of the observatory in Samarqand, mentions an armillary sphere with seven rings that were employed in the observations (Kennedy 1961, 100) It should be noted that both texts are derivations from Ptolemy's descriptions in the Almagest.",
      "bbox": {
        "l": 101.0,
        "b": 521.0,
        "r": 652.0,
        "t": 842.0
      }
    },
    {
      "label": "section_header",
      "text": "IV.2.3 Conclusion",
      "bbox": {
        "l": 306.0,
        "b": 479.0,
        "r": 444.0,
        "t": 493.0
      }
    },
    {
      "label": "text",
      "text": "Celestial globes and armillary spheres are miniaturized versions of the celestial sphere asit is under- stood in classical astronomy and, depending on construction, could be used for demonstrations and observations. They are helpful educational tools when used for demonstrations, because they offer a direct representation of the sky, unlike projection-based instruments such as astrolabes and quadrants. They are universal in nature; they can be used anywhere in the world. Due to chal- lenges with their construction, globes were relatively small and portable, whereas armillary spheres for stationary use were built as large as posible for accuracy. Both instruments provide ample evidence for scholarly activities, astronomical interests in the corresponding communities, and the transmission of astronomical knowledge through time. The many unique surviving instruments and the manuals on their construction and use deserve thorough investigation. Most of the dated and authored globes were produced for the courtly elites such as Ayyubids, Safivids, or Mughals. Armiillary spheres, on the other hand, were occasionally depicted and illustrated in manuscripts like the Shahinshahnama by Sayyid Loqman dedicated to Murad III (see Figure IV.2.5). Moreover, the social aspects of the existence and use of these instruments within the Islamicate world have been ignored for too long and are in need of comprehensive study.",
      "bbox": {
        "l": 101.0,
        "b": 197.0,
        "r": 652.0,
        "t": 464.0
      }
    },
    {
      "label": "section_header",
      "text": "Notes",
      "bbox": {
        "l": 355.0,
        "b": 155.0,
        "r": 396.0,
        "t": 169.0
      }
    },
    {
      "label": "footnote",
      "text": "1 For more on their purpose see Charette (2006, 123-38); and formore on the patronage, see Brentjes (2008, 403-36).",
      "bbox": {
        "l": 102.0,
        "b": 115.0,
        "r": 652.0,
        "t": 142.0
      }
    },
    {
      "label": "footnote",
      "text": "Consolidated bibliography.",
      "bbox": {
        "l": 101.0,
        "b": 99.0,
        "r": 254.0,
        "t": 112.0
      }
    },
    {
      "label": "page_footer",
      "text": "484",
      "bbox": {
        "l": 365.0,
        "b": 53.0,
        "r": 387.0,
        "t": 64.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "‘Three-dimensional astronomy",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "list_item",
      "text": "For more on Marrikushi’s work, see Charette (2003),",
      "bbox": {
        "l": 89.0,
        "b": 937.0,
        "r": 381.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "For examples of its use, see Evans (1998, 85-87).",
      "bbox": {
        "l": 88.0,
        "b": 922.0,
        "r": 356.0,
        "t": 935.0
      }
    },
    {
      "label": "list_item",
      "text": "For more details, see Sams (2015, 68-72),",
      "bbox": {
        "l": 89.0,
        "b": 907.0,
        "r": 326.0,
        "t": 920.0
      }
    },
    {
      "label": "section_header",
      "text": "Bibliography",
      "bbox": {
        "l": 317.0,
        "b": 861.0,
        "r": 409.0,
        "t": 878.0
      }
    },
    {
      "label": "section_header",
      "text": "Manuscripts",
      "bbox": {
        "l": 320.0,
        "b": 825.0,
        "r": 406.0,
        "t": 841.0
      }
    },
    {
      "label": "text",
      "text": "MS Istanbul, Siileymaniye Library, Hamidiye 1453, fols 103b—123a,",
      "bbox": {
        "l": 89.0,
        "b": 802.0,
        "r": 440.0,
        "t": 815.0
      }
    },
    {
      "label": "text",
      "text": "MS Istanbul, Siileymaniye Library, Nuruosmaniye 2971, fols 746-102",
      "bbox": {
        "l": 89.0,
        "b": 787.0,
        "r": 460.0,
        "t": 800.0
      }
    },
    {
      "label": "text",
      "text": "MS Istanbul, Topkap: Library, Hazine 452,",
      "bbox": {
        "l": 89.0,
        "b": 772.0,
        "r": 311.0,
        "t": 785.0
      }
    },
    {
      "label": "text",
      "text": "MS Oxford, Bodleian Library, Marsh 154.",
      "bbox": {
        "l": 89.0,
        "b": 757.0,
        "r": 310.0,
        "t": 770.0
      }
    },
    {
      "label": "text",
      "text": "MS Paris, BaF, Arabe 5036.",
      "bbox": {
        "l": 88.0,
        "b": 743.0,
        "r": 234.0,
        "t": 755.0
      }
    },
    {
      "label": "section_header",
      "text": "Research literature",
      "bbox": {
        "l": 298.0,
        "b": 699.0,
        "r": 428.0,
        "t": 713.0
      }
    },
    {
      "label": "text",
      "text": "Brentjes, S. 2008, “Courtly Patronage of the Ancient Sciences in Post-Classcal Islamic Societies.” ‘Al-Qanpara 29.2: 403-36.",
      "bbox": {
        "l": 88.0,
        "b": 659.0,
        "r": 638.0,
        "t": 686.0
      }
    },
    {
      "label": "text",
      "text": "Brengjes, . 2015. “Sanctioning Knowledge,” Al-Qungara 35.1: 277-309",
      "bbox": {
        "l": 89.0,
        "b": 643.0,
        "r": 459.0,
        "t": 656.0
      }
    },
    {
      "label": "text",
      "text": "Dekker, E. 1999. Globes at Greenwich: A Catalogue ofthe Globes and Armillary Spheres inthe National Maritime ‘Muscum, Greenwich. New York: Oxford University Pres.",
      "bbox": {
        "l": 88.0,
        "b": 613.0,
        "r": 638.0,
        "t": 641.0
      }
    },
    {
      "label": "text",
      "text": "Dekker, E. 2012. Illustrating the Phacnomena. Oxford: Oxford University Pres, http://doi.org/10.1093/aep 0f3030/97801199609697.003.0004",
      "bbox": {
        "l": 88.0,
        "b": 584.0,
        "r": 638.0,
        "t": 611.0
      }
    },
    {
      "label": "text",
      "text": "Dekker, E. and Kunitesch, P2008. “An Early klamie Tradition in Globe Making.” ZGAIWV 18: 155-211 Evans, J. 1998. The History and Practice of Ancient Astronomy. Oxford: Oxford University Press.",
      "bbox": {
        "l": 88.0,
        "b": 554.0,
        "r": 638.0,
        "t": 581.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 568.0,
        "r": 637.0,
        "t": 581.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 552.0,
        "r": 573.0,
        "t": 565.0
      }
    },
    {
      "label": "text",
      "text": "Gillispie, C. C. ed. 1981. Dictionary of Sdentific Biography. New York: Chasles Scribner’ Sons.",
      "bbox": {
        "l": 89.0,
        "b": 538.0,
        "r": 572.0,
        "t": 551.0
      }
    },
    {
      "label": "text",
      "text": "Kennedy, E. S. 1961. “ALKishis Treatise on Astronomical Observational Instruments,” Journal of Near Eastems Studies 20.2: 98-108,",
      "bbox": {
        "l": 88.0,
        "b": 508.0,
        "r": 638.0,
        "t": 536.0
      }
    },
    {
      "label": "text",
      "text": "Kunitasch, P. 1959. Arahische Semmamen In Europa. Wiesbaden: Otto Harrasowitz.",
      "bbox": {
        "l": 89.0,
        "b": 493.0,
        "r": 520.0,
        "t": 506.0
      }
    },
    {
      "label": "text",
      "text": "Samsé, J. 2015. “Qusta ibn Lagi and Alfonso X on he celestial globe,” Sulhayl 5: 63-79.",
      "bbox": {
        "l": 88.0,
        "b": 478.0,
        "r": 544.0,
        "t": 491.0
      }
    },
    {
      "label": "text",
      "text": "Sarma, S. R. 2019. A Desaiptive Catalogue of Indian Astronomical Instruments.",
      "bbox": {
        "l": 88.0,
        "b": 462.0,
        "r": 479.0,
        "t": 475.0
      }
    },
    {
      "label": "text",
      "text": "Edmonton: University of Alberta, Canada. btps//stsarma.in/catalogue php",
      "bbox": {
        "l": 89.0,
        "b": 445.0,
        "r": 485.0,
        "t": 458.0
      }
    },
    {
      "label": "text",
      "text": "Savage-Smith, E. 1985, Ilamicate Celestial Globes: Their History, Construction, and Use, with a",
      "bbox": {
        "l": 88.0,
        "b": 429.0,
        "r": 561.0,
        "t": 442.0
      }
    },
    {
      "label": "text",
      "text": "Cheper on Lonography by Andrea P A. Bello. Washington, DC: Smithsonian Institution Pres.",
      "bbox": {
        "l": 89.0,
        "b": 412.0,
        "r": 573.0,
        "t": 425.0
      }
    },
    {
      "label": "text",
      "text": "Savage-Smith, E. 1990-1991. “The Chasifiation of Islamic Celestial Globes",
      "bbox": {
        "l": 89.0,
        "b": 396.0,
        "r": 488.0,
        "t": 409.0
      }
    },
    {
      "label": "text",
      "text": "inthe Light of Recent Evidence.” Der Globusfeund 38-9: 23-9",
      "bbox": {
        "l": 89.0,
        "b": 380.0,
        "r": 418.0,
        "t": 393.0
      }
    },
    {
      "label": "text",
      "text": "Savage-Smith, E. 1992. “Celestial Mapping.”in GTISAS [CB], 12-70.",
      "bbox": {
        "l": 88.0,
        "b": 364.0,
        "r": 458.0,
        "t": 377.0
      }
    },
    {
      "label": "text",
      "text": "Savage-Smith, E1997. “Islamic Celestial Globes and Related Instruments” in Maddison, FE and Sav age-Smith, E., eds. Scion, Tools and Magic, Part One: Body and Spirit, Mapping the Universe (Khalili Collection XI). London and Oxford: Nour Foundation, Azimuth Editions, Oxford University Pres, 168-84,",
      "bbox": {
        "l": 89.0,
        "b": 306.0,
        "r": 638.0,
        "t": 362.0
      }
    },
    {
      "label": "text",
      "text": "Worrel, W. H. 1944.\" usta ibn Luga on the Use of the Celestial Globe.” lis 35.4: 285-93,",
      "bbox": {
        "l": 89.0,
        "b": 289.0,
        "r": 567.0,
        "t": 302.0
      }
    },
    {
      "label": "page_footer",
      "text": "485",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 740,
      "h": 1046
    },
    "2": {
      "w": 740,
      "h": 1046
    },
    "3": {
      "w": 740,
      "h": 1046
    },
    "4": {
      "w": 740,
      "h": 1046
    },
    "5": {
      "w": 740,
      "h": 1046
    },
    "6": {
      "w": 740,
      "h": 1046
    },
    "7": {
      "w": 740,
      "h": 1046
    },
    "8": {
      "w": 740,
      "h": 1046
    },
    "9": {
      "w": 740,
      "h": 1046
    },
    "10": {
      "w": 740,
      "h": 1046
    },
    "11": {
      "w": 740,
      "h": 1046
    },
    "12": {
      "w": 740,
      "h": 1046
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}