{
  "1": [
    {
      "label": "section_header",
      "text": "IV.2\nTHREE-DIMENSIONAL\nASTRONOMY\nCelestial globes and armillary spheres\nTaha Yasin Arslan\nAstronomical instruments are physical manifestations of knowledge about the heavens to\nwhich various disciplines contributed. They provide information on the development of three\nof the four fundamental mathematical sciences - number theory, geometry, and astronomy,\nand their branches. They are also evidence of scholarly influences and transmission, mastery of\ncraftsmanship, artistic and religious preferences, and the social acknowledgment of astronomy\nand astrology as well as the patronage and institutionalization of knowledge. This chapter\ndeals with two of these instruments: celestial globes and armillary spheres. Celestial globes\ncarry evidence of arts and craftsmanship in their time and region through the depictions of\nthe constellations, the wording of the maker's signature, the names of stars, constellations,\nlunar mansions, and the nature of the scales included. Their popularity, as well as records\nof dedications, reveals non-scholarly interests and the patronage of different elite circles for\nglobe making, while records of dates and places may provide information on the transition\nof knowledge between regions and centuries. In contrast, only a few examples of armillary\nspheres survive, preventing us from making a broad assessment of the instrument's role in\nsociety. However, extant manuals on its construction and use shed some light on the devel-\nopment of the instrument.\nIV.2.1 Celestial globes\nThe celestial globe is an instrument that imitates the daily motion of the sky and is used for\nobservations, calculations, or demonstrations. It is usually made of metal and occasionally of\nwood and papier-mâché. More than 200 globes are extant and almost all have a hollow metal\nbody (for a comprehensive description and a list of surviving celestial globes, see Savage-Smith\n1990-1991). Their sizes vary between 5cm and 35cm in diameter. This is one of the largest\nclasses of surviving astronomical instruments made in the Islamicate world. During the construc-\ntion process, the first problem that had to be dealt with was how to produce a sphere. Unfortu-\nnately, no known text discusses this. A careful investigation of the extant instruments, however,\ngives us credible information on two types of metal spheres used as globes. First are two-piece\nglobes, which consist of two identical hemispheres cast, joined by seams, and smoothed. Second\nare one-piece globes that were made by the lost-wax method, which involved casting a complete\nsphere and smoothing its surface, although this usually required plugs on the body to cover the\nDOI: 10.4324/9781315170718-43\n474",
      "bbox": {
        "l": 188.0,
        "b": 794.0,
        "r": 564.0,
        "t": 908.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 347.0,
        "b": 881.0,
        "r": 404.0,
        "t": 908.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 173.0,
        "b": 744.0,
        "r": 580.0,
        "t": 771.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 307.0,
        "b": 696.0,
        "r": 446.0,
        "t": 713.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 358.0,
        "r": 653.0,
        "t": 643.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 293.0,
        "b": 312.0,
        "r": 459.0,
        "t": 330.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 87.0,
        "r": 652.0,
        "t": 301.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 270.0,
        "t": 65.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 270.0,
        "t": 64.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 630.0,
        "b": 53.0,
        "r": 650.0,
        "t": 64.0
      }
    }
  ],
  "2": [
    {
      "label": "section_header",
      "text": "Three-dimensional astronomy\nhole required in the casting process (Savage-Smith 1985, 83-6). Depending on the craftsman-\nship, construction markings, plugs, or traces of seams may hardly be visible.\nAlmost all surviving globes from the Islamicate world share major similarities. A standard\nglobe has the celestial equator and ecliptic drawn. The equator carries a scale of 360°, while the\necliptic has twelve scales of 30°. Both begin at the vernal equinox and are divided into intervals\nof 5º, 6º, or 10°, where the divisions are labeled with Arabic alphanumeric notation (abjad)\nand subdivided into intervals of 1° or 2°. The twelve scales of the ecliptic are inscribed with\nthe corresponding names of the signs of the zodiac. The poles of the equator and the ecliptic\nare usually marked with circles and occasionally labeled. The globe is divided into twelve sec-\ntions by six great circles drawn at intervals of 30° between the ecliptic poles. One of these is a\nsolstitial colure, which is a great circle through the celestial poles, the poles of the ecliptic, and\nthe summer and winter solstices. None of the standard globes carries circles of ever-visible or\never-invisible stars. Depending on the type of globe, stars and the constellation figures may or\nmay not be inscribed. When they are, the stars are usually shown in different sizes and shapes\nbased on their brightness (Figure IV.2.1).\nA standard globe has two rings, one for the meridian and another for the horizon. The globe\nis mounted in the meridian ring from the celestial poles and the ring is fixed within the horizon\nring at the north-south axis, making it the prime meridian. The horizon ring sits on a stand.\nBecause of this arrangement, manuscripts in the Islamicate world refer to the instrument as the\nsphere with a stand (al-kura dhat al-kursi). Both rings carry either a scale of 360°, two scales of\n180°, or four scales of 90° and are divided into intervals of 5°, 6°, or 10°, which are subdivided\ninto intervals of 1° or 2°. Although standard globes do not have an attached ring or a gnomon\nالحمل\nالثور\nΣ\nFigure IV.2.1 Model of a standard globe\nSource: Taha Yasin Arslan, Istanbul\n475\nالحوت",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 917.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 683.0,
        "r": 638.0,
        "t": 914.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 557.0,
        "r": 639.0,
        "t": 681.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 138.0,
        "b": 142.0,
        "r": 588.0,
        "t": 515.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 112.0,
        "r": 303.0,
        "t": 125.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 280.0,
        "t": 101.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 88.0,
        "r": 280.0,
        "t": 101.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 88.0,
        "r": 280.0,
        "t": 101.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 90.0,
        "r": 122.0,
        "t": 100.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "Taha Arslan\nfor measuring the altitude of the Sun and the stars, the manuals on the use of globes propose\nusing a suitable object as gnomon and a detached quadrant with a 90° scale to find the altitude\nof celestial objects. Standard globes are divided into three groups for the number of stars they\nrepresent. Globes of the first group have around a thousand stars usually distributed among the\nimages of the 48 classical constellations. Globes of the second group display only selected stars,\nusually those found on astrolabes. The third group contains specimens that carry only the great\ncircles but no stars (Savage-Smith 1985, 61-2).\nIn addition to those standard types, the works of Ptolemy (c. 100-180) and Battānī (d.\n317/929–930) introduced two other designs to the Islamicate world. In the eighth book of the\nAlmagest, Ptolemy describes a globe with a rotatable ecliptic ring (Ptolemy 1998[CB],2² 404-7).\nThe purpose of this modification is to allow for the deviation caused by the precession of the\nequinoxes over the years (approximately 1° in 72.2 years in modern value). Al-Battani introduced\na globe called an egg (bayda), which was a common term for globes, with five rings (al-Battāni\n1977[CB], 210-13 [fols 142a-44b]). The celestial equator and the ecliptic are drawn on the\nglobe as usual. Additionally, there are two meridian rings, one is fixed and the other rotates, a\nhorizon ring, a zenith ring, and the outer ring, which carries a movable and removable gnomon.\nUnlike the other examples, al-Battani's egg does not sit on a stand but is suspended. The second\nrotatable meridian ring serves for marking the star positions and making calculations accurately.\nThe movable gnomon is used to mark the solar longitude and the altitude of the sun along with\nmany other applications. Unfortunately, no example of these two ingenious devices has survived.\nIV.2.1.1 Instructions for globe making\nInstructions of how to draw on globes are very limited in extant astronomical writings. This\nis particularly surprising given the large number of surviving objects. 'Abd al-Rahman al-Şūfi's\n(291-376/903-986) Book of the Constellations (Kitab suwar al-kawakib al-thabita) seems to be the\nonly treatise that was used extensively all over the Islamicate world. Construction manuals for\nastrolabes and sundials, however, are much more common. They usually give precise values in\nratios as pointers for engravings such as almucantars, azimuths, and seasonal hours on astrolabes\nand parabolas and hyperbolas of shadow lengths of various signs of the zodiac on sundials. On the\nother hand, globes require their users to consider only two parameters: (1) the obliquity of the\necliptic and (2) the precession of the equinoxes. While the value of the obliquity was calculated\nand given differently by various astronomers, the globe makers seem to have used approximate\nvalues such as 23.5° or 24°. Considering the small size of the instrument one should not expect a\nprecision of more than half or a quarter of a degree. The value of the precession is more impor-\ntant since the makers usually used older catalogues for star positions (i.e., al-Şüfi's Book of the\nConstellations) and needed to consider the positional changes of stars during the period between\nthe preparation of the star catalogue and the construction of the globe.\nThe scales, circles, and inscriptions all depend on the size of the instrument as well as the\nmaker's initiative. The production process includes marking opposite points as poles, drawing\ngreat circles for the ecliptic and celestial equators and the three great circles through the poles\nof the ecliptic, as well as constructing scales with various intervals on some of these circles, and\ninscribing their values. Unlike the ones on an astrolabe, these circles do not require a table of\nradii (jadwal ansaf al-aqtar) but simple angular calculations since no type of projection is required\non globes. For those tasks, the globe makers usually employed various tools, such as a quadrant\nwith a scale of 90°; compasses; and engraving tools.\nThere are two important works with detailed descriptions on how to draw on globes. The first\none was introduced by al-Battani in the 7th chapter of his Book of Astronomical Tables (Kitab al-Zij),\n476",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 827.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 593.0,
        "r": 652.0,
        "t": 824.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 242.0,
        "b": 548.0,
        "r": 511.0,
        "t": 564.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 269.0,
        "r": 652.0,
        "t": 536.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 125.0,
        "r": 652.0,
        "t": 266.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 652.0,
        "t": 122.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 366.0,
        "b": 51.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "4": [
    {
      "label": "section_header",
      "text": "Three-dimensional astronomy\nwhere he proposed the egg (al-Battāni 1977, 210-13 [fols 142a-44b]). According to al-Battānī,\nthe maker needs to determine two points that are exactly opposite of each other on the globe,\nwhich will act as the celestial poles. However, he doesn't mention how this is done. Al-Battani's\nsummary of the different steps for construction reflects the scholar's effort for providing globe\nmakers (craftsmen as well as scholars) with the necessary skills. Using the poles, the globe maker\nis told to draw a great circle as the celestial equator and then to mark four equidistant points on\nit. The steady leg of a pair of compasses has to be fixed at one of these points, and the drawing\nleg is used to draw another great circle that passes through two points on the equator and the\npoles, making it the solstitial colure. In order to determine the positions of the ecliptic poles\nand to draw the ecliptic, the globe maker has to inscribe a quarter of the equator with a scale of\n90°. Learning from al-Battani's text that the obliquity of the ecliptic is 23° 35', the globe maker,\nusing the scale, can now open the legs of the compasses as wide as the value of the obliquity.\nThen he fixes the steady leg at one of the celestial poles and rotates the drawing leg until it\nintersects with the solstitial colure. Wherever the tip of the leg touches on the colure he marks\nas an ecliptic pole. The same procedure is carried out for the second pole. Once the poles are\nmarked, he can draw the ecliptic.\nDetermining and marking the stars' positions is only possible after the ecliptic circle is divided\ninto twelve scales of 30°. First, the globe maker needs to obtain the values for a star's longitude\nand latitude in ecliptic coordinates from either catalogues or observations. Using the scale of 90°\nthat was previously prepared for finding the ecliptic poles, he then opens the compasses as wide\nas the value of the latitude of the star. Keeping the width fixed, the globe maker has now to place\nthe steady leg on the corresponding degree of the zodiacal sign as its longitude. He is instructed to\nuse the drawing leg to draw a small, concave arc for an approximate position. Depending on the\ndirection of the star, he draws the arc either on the north or the south of the ecliptic but always\neastward. To make the position more precise, he has to open the compasses exactly 90° and to\nplace the steady leg on a point that is 90° west of the longitude of the star on the ecliptic circle.\nNow he can draw a second arc by using the drawing leg. The intersection of the two arcs gives\nthe position of the star. All designations are approximate since the scales have only 1° intervals.\nThe second example of instructions for how to make a globe is found in Abu 'Ali al-Hasan\nal-Marrākushi's (2nd half of the 7th/13th century) From A to Z: A Compendium of Timekeeping\n(Jāmī al-mabadi wa-l-ghayat fi film al-mīgāt). In the fifth chapter of the second book, he gives\ndetails on how to construct celestial globes and armillary spheres (MS Oxford, Bodleian Library,\nMarsh 154, fols 2b-5a). In the section on the globe, he first describes finding the diameter of a\nglobe and proposes to make a quadrant with a scale of 90° and the same radius as the globe. He\nthen introduces a method for precision drawing. According to this, one picks any point on the\nglobe as the center, then places the steady leg of the compass on this center and draws a small\ncircle with four equidistant points marked on it. After this, the quadrant, that was introduced\nwhile finding the diameter of the globe, is required. The quadrant is placed on the globe so that\nits rim touches any one of the four equidistant points while one of its ends remains fixed at the\noriginal center. Starting from the center, an arc is drawn along the rim of the quadrant. The\nother end of the arc marks one of the poles. Then the quadrant is rotated until its rim touches\nthe opposite one of the equidistant points. A secondary arc is drawn to mark the second pole.\nAfter this, al-Marrākushi proposes that one should use a lathe to engrave the celestial equator.\nTo do that, the globe should be held axially in the lathe so that it can be rotated about its poles.\nThen, using a point equidistant from each pole as the reference, one can engrave a great circle\nthat also passes through the center and the two remaining points of the small circle.\nAl-Marrākushi's introduction of the quadrant, which carries a scale of 90°, makes marking\nthe star positions rather easy in comparison to al-Battani's method. One simply fixes one end\n477",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 665.0,
        "r": 639.0,
        "t": 951.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 449.0,
        "r": 638.0,
        "t": 662.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 125.0,
        "r": 639.0,
        "t": 446.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 122.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 51.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "Taha Arslan\nof the quadrant to the north or south ecliptic pole and rotates it to the corresponding degree\nof the ecliptic for the longitude. Then one measures the latitude of the star and marks its posi-\ntion. Although none of the extant globes resembles fully the types introduced by al-Battani or\nal-Marrākushi, determining whether the producers of the extant globes had indeed used any of\ntheir methods for drawing the circles and marking the star positions requires further research.\n'Abd al-Rahman al-Şüfi was perhaps the scholar whose work had the greatest impact on\nthe construction of globes. In his famous work, Book of the Star Constellations, he illustrates 48\nconstellations and marks 1025 stars from Ptolemy's star catalogue. He also offers the ecliptic\ncoordinates (longitude and latitude) and the brightness of the stars in tables and gives detailed\ndescriptions of the positions of the stars relative to their constellations. Each constellation is\ndepicted as it is seen in the sky and on the globe. Al-Sufi's catalogue relies heavily on Ptolemy's\nvalues, but he adds 12° 42' to the longitude of each star to eliminate the difference caused by the\nprecession of the equinoxes and occasionally changes some of the values to the ones he obtained\nthrough his own observations (Dekker 2012, 29-47). Al-Şüfi's catalogue and, more importantly,\nhis illustrations were helpful for preparing star catalogues and constructing globes. It was used\nuntil the 13th/19th century.\nIV.2.1.2 Uses of celestial globes\nOnce the globe is constructed, one can use it in any latitude. To use it in a specific locality, the\nmeridian ring is rotated until the angular difference between the celestial pole and horizon agrees\nwith the local latitude. This is rather easy since the meridian ring is attached to the globe at the\ncelestial poles and carries a scale. Depending on the globe's type, the number of applications that\ncan be performed with it differs. Moreover, the celestial globes, with the exception of those using\nan additional gnomon and a detached quadrant, are not destined for observations but for calcula-\ntions and demonstrations. Only a few examples of these additional tools survive (Figure IV.2.2).\nTherefore, we do not know whether many of the extant globes were indeed used for obser-\nvations. Before one uses the globe, one needs to obtain values such as the degree of the zodiacal\nGreat Circles that divides\nthe ecliptic into 12 intervals\nMeridian Ring\nCelestial Equator\nEcliptic\nHorizon Ring\nSouth\nCelestial Pole\nStar\nNorth Ecliptic Pole\nNorth Celestial Pole\nStar\nEquinoctial Colure\nNames of the Signs\nof the Zodiac\nScales divided into\n5-degree intervals\nFigure IV.2.2 Muḥammad ibn Muayyad al-Din al-'Urdi's (7th/13th century) celestial globe (c. 687/1288) on\na wooden stand, made from brass, with gold and silver inlay; Mathematisch-Physikalischer\nSalon, Dresden, inv. no. E II 1.\nSource: Mathematisch-Physikalischer Salon, Staatliche Kunstsammlungen, Dresden\n478",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 863.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 665.0,
        "r": 652.0,
        "t": 860.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 266.0,
        "b": 620.0,
        "r": 486.0,
        "t": 637.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 486.0,
        "r": 652.0,
        "t": 608.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 449.0,
        "r": 651.0,
        "t": 482.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 149.0,
        "b": 172.0,
        "r": 603.0,
        "t": 436.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 113.0,
        "r": 652.0,
        "t": 155.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 542.0,
        "t": 101.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 542.0,
        "t": 101.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 366.0,
        "b": 53.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "6": [
    {
      "label": "section_header",
      "text": "Three-dimensional astronomy\nsign for the intended day, the instantaneous altitudes of the sun, the moon and the stars and the\nascendant. These values can be found in astronomical tables or through observations made with\nthe globe or different instruments. When such parameters are known, a globe can be used for\nnumerous calculations. Some are\nfinding the longest and shortest days and nights in a given latitude.\nfinding the maximum and minimum meridian altitude of the sun in a given latitude.\nfinding the difference between the lengths of the different days in a given latitude.\nfinding the daytime arc of any star marked on the globe.\nfinding the azimuth of any star when it is rising or setting.\nfinding the declination of any star on the globe.\nfinding the distance between two stars on the globe.\nfinding the time of rising and setting of any star on the globe.\nfinding ever-visible and ever-invisible stars for a given latitude.\nfinding the azimuth of the direction of Mecca (qibla).\nAs a consequence of its wide array of use, several manuals on this topic were written, copied,\nand used for centuries. Of those, two were particularly influential: Qusta ibn Luqa's (d. c.\n300/912-913) Treatise on the Use of the Sphere with a Stand (Risalat al-'Amal bi-l-kura dhat al-kursi)\nand al-Sufi's Commentary on the Use of the Globe (Fi Sharb al-'Amal bi-l-kura). These two works,\ncompiled in the 3rd/9th and 4th/10th centuries, respectively, are the most comprehensive trea-\ntises on the subject. Qusta's work, on present evidence the more popular one of the two, consists\nof an introduction and 65 chapters. First, it gives information on the celestial sphere followed\nby a brief description of a globe with those stars that can be found on astrolabes (chapters 1-5).\nIt continues with the instructions on many different applications both for observations and\ncalculations (chapters 6-65). Al-Sufi's treatise is even more comprehensive. It deals with the\nproblems of the use of globes in 157 chapters. Habash al-Hasib (d. after 255/869), al-Marrākushi,\nand Amin al-Din al-Abhari (d. 733/1332-3) are among the few other scholars who wrote on\nthe use of the celestial globe.\nIV.2.1.3 A profile of the globe-making tradition\nFor the surviving globes, knowing their makers, dates of construction, and places of origin\nallows us to create a profile for the globe-making tradition. For instance, most of the extant\nglobes are of either Persian or Mughal Indian origin. Only a handful of globes are dated from\nthe 3rd/9th to the 10th/16th centuries. The number of dated globes rises exponentially in the\n11th/14th century and the provenances shifted from the Middle East to Mughal India. The\ndates and signatures on the instruments provide proof of the continuous activity of families and\nindividual specialists as instrument-making artisans. In comparison to other instruments such\nas astrolabes, quadrants, and sundials, relatively more non-scholarly artisans seem to be involved\nin the construction of globes. There were two noteworthy cities for instrument makers: Har-\nran (today in Turkey) and Lahore (today in Pakistan). Although little of their production has\nsurvived, the historical record indicates that Harran was a major center for the construction of\nastronomical instruments between the 3rd/9th and the 5th/11th centuries. 'Abd al-Rahman\nal-Şüfi states, for instance, that he has seen many globes made in Harran and that he disapproved\nof a globe made by Ali ibn Isa from Harran (MS Paris, BnF, Arabe 5036, fols 4b, 108b). Unfor-\ntunately, in the case of Harran, we lack details such as the list of makers, the sale records, and\nthe number of workshops. We are better informed about a family who ran a workshop for\n479",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 884.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 845.0,
        "r": 502.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 828.0,
        "r": 607.0,
        "t": 843.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 809.0,
        "r": 591.0,
        "t": 825.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 791.0,
        "r": 442.0,
        "t": 806.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 773.0,
        "r": 454.0,
        "t": 788.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 755.0,
        "r": 392.0,
        "t": 770.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 737.0,
        "r": 419.0,
        "t": 753.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 720.0,
        "r": 473.0,
        "t": 735.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 701.0,
        "r": 479.0,
        "t": 717.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 683.0,
        "r": 423.0,
        "t": 699.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 431.0,
        "r": 638.0,
        "t": 662.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 197.0,
        "b": 386.0,
        "r": 527.0,
        "t": 403.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 89.0,
        "r": 638.0,
        "t": 374.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "7": [
    {
      "label": "section_header",
      "text": "Taha Arslan\ninstruments in Mughal Lahore during the 11th/17th century over four generations: Shaykh\nAllāhdad Asturlābi Humayuni Lähūrī, his son Mulla 'Īsā, the latter's two sons Qa'im Muḥammad\nand Muḥammad Muqim, Qa'im's son Diya' al-Din Muḥammad and Muqim's sons Hamid and Jamal\nal-Din (Sarma 2019). Of the astrolabes and globes they produced, 134 and 33, respectively, are\nextant. They made these 33 globes in the seven decades between 1032/1623 and 1102/1691,\nusing the lost-wax method exclusively and successfully. They produced very accurate globes of\nevery type. Although they were not the only instrument makers in Mughal India, this Lahore\nfamily constituted the frame of the Mughal globe-making tradition (Figure IV.2.3).\nFigure IV.2.3 Cast and engraved celestial globe on a stand from the workshop in Lahore, Mughal India,\nmade in 1036/1626-7. Height: 23 cm, Width: 17.5 cm. Inscriptions: (1) The work of the\nleast of the servants Qaim Muḥammad ibn Isä ibn Allahdad Asturläbi Humayuni Lahūrī. (2)\nTwenty-second year of the reign of Jahangir. Museum no. M.828PART/1-1928.\nSource: Ⓒ Victoria and Albert Museum, London\n480",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 809.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 149.0,
        "b": 187.0,
        "r": 603.0,
        "t": 790.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 112.0,
        "r": 651.0,
        "t": 170.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 103.0,
        "b": 89.0,
        "r": 352.0,
        "t": 101.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 365.0,
        "b": 53.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Three-dimensional astronomy\nCelestial globe production in the Islamicate world continued for over a millennium. While\nthe values for positioning the stars mostly remained true to the ones given by al-Şüfi, the\nstyle of wording and the images of the constellations varied from region to region during this\nperiod. Globe makers from Iran and Mughal India excelled at the lost-wax method around\nthe 10th/16th century. Afterward, it became the preferred method for globe construction.\nAlmost none of the extant globes has its original rings (the meridian ring and the horizon ring),\nbut some have replacements. Noncontemporary replacements, in particular, indicate that these\nglobes were in use for centuries.\nIV.2.2 Armillary spheres\nLike celestial globes, armillary spheres imitate the daily motion of the sky. But, unlike globes,\nthey do not have a solid spherical body to indicate the stars and the constellations. The circles\nthat are astronomically significant, such as the meridian and the ecliptic, are represented by\nnested rings. They can be used both for demonstrations and observations. However, it seems that\nthey were exclusively employed for observations in the Islamicate world. This is rather different\nfrom Europe where armillary spheres were often employed in demonstrations and teachings.\nArmillary spheres are made of wood or metal and constructed as large as possible in order to\nreach high accuracy in observations. Depending on the material and the craftsmanship, instru-\nments were known to have been made in sizes between 1 and 6 meters in diameter. There\nwere, however, certain limitations to size since parts can be deformed by expansion or bending.\nUnfortunately, only very few late examples survive from the 12th/18th and the 13th/19th cen-\nturies (Sarma 2019, 3261-80).\nIV.2.2.1 The construction of an armillary sphere\nThe armillary sphere is a Greek invention and is known in Arabic as dhat al-balaq (the [instru-\nment] with rings). The earliest record in the Islamicate world is ascribed to the 2nd/8th-century\nastrologer Muḥammad ibn Ibrahim al-Fazārī because of his lost work Book on the Use of the Astro-\nlabe Known as the Armillary Sphere (Kitab al-'Amal bi-l-asturlab wa-huwa dhat al-balaq; Ibn al-Na-\ndim 1871-1872[CB], 2: 273). Although al-Fazari categorized the armillary sphere as a type of\nastrolabe, this was not followed by others, and it was usually treated as a different instrument.\nThe armillary sphere became popular very early in the history of astronomy in the Islamicate\nworld through the translations of Ptolemy's Almagest in the 2nd/8th and 3rd/9th centuries. In\nthe fifth book of the Almagest, Ptolemy introduces an armillary sphere with six rings, as follows\n(Ptolemy 1998, 217-18):\nTwo rings of the same size, representing the ecliptic and the solstitial colure, are joined\nperpendicularly. Then the ecliptic poles are located on the colure and two pegs, one for the\ninner surface and the other for the outer surface, are attached at each pole. Two rotatable\nrings are fixed at these pegs. The outer one is the large longitude ring, and the inner one\nis the small longitude ring. The small longitude ring houses another ring with two sighting\nvanes. This 'observation' ring is fitted so that it can only rotate parallel to and simultaneously\nwith the small longitude ring. After measuring the angular difference between the ecliptic\nand celestial poles, positions of the latter are marked on the large longitude ring. One peg is\nattached to its outer surface at each pole. The outermost ring, which represents the meridian,\nis fixed at these pegs. The meridian ring is then fixed inside the horizontal plane as we have\nseen in globe making. The entire arrangement is carried by columns fitted under the horizon\nplane (Figure IV.2.4).\n481",
      "bbox": {
        "l": 88.0,
        "b": 808.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 272.0,
        "b": 764.0,
        "r": 454.0,
        "t": 781.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 647.0,
        "r": 638.0,
        "t": 753.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 539.0,
        "r": 638.0,
        "t": 644.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 194.0,
        "b": 494.0,
        "r": 532.0,
        "t": 511.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 305.0,
        "r": 639.0,
        "t": 482.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 89.0,
        "r": 638.0,
        "t": 302.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 354.0,
        "b": 52.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "9": [
    {
      "label": "section_header",
      "text": "3040\nTaha Arslan\n20 15 10\n80 90 90 80/70\nFigure IV.2.4 Ptolemy's model of the armillary sphere\nSource: Taha Yasin Arslan, Istanbul\nmeridian ring\nlarge longitude ring\nsmall longitude ring\nhorizon ring\nsighting ring\necliptic ring\nsolstitial colure\nThe types of this instrument used for demonstration and for observation are distinctively\ndifferent. An armillary sphere for demonstration contains a small globe, representing the Earth\nat the center, and does not require sighting vanes or an observation ring. The armillary sphere\nfor making observations does not have a globe at its center. It was rather more popular in the\nIslamicate world and arguably had more practical value. It could be used to find the latitudes\nand longitudes of the sun, the moon, the five planets and the stars, their meridian altitude, the\ntime, and the angular differences between two or more celestial objects, all according to the\necliptic coordinate system.\nPtolemy's description of an armillary sphere for making observations was used for centuries\nwith some changes to the number and the function of the rings. For instance, the instrument\nmaker and scholar Mu'ayyad al-Din al-'Urdi (d. 664/1266) switched the observation ring with an\nalidade (a sighting unit) by converting the small longitude ring into a hollowed disk so that the\nalidade could be fixed at its center. The Ottoman scholar Taqi al-Din ibn Ma'ruf (d. 993/1585),\nwho headed the short-lived Istanbul Observatory between 984-987/1577-1580, constructed an\narmillary sphere with six rings but removed the observation ring while adding another for the\ncelestial equator (MS Istanbul, Topkapı Library, Hazine 452). The new ring is of the same size\nas the meridian ring and was connected to it perpendicularly. In this model, the sighting vanes\nare on the celestial equator ring (Figure IV.2.5).\nThe construction of an armillary sphere does not necessitate sophisticated astronomical\nknowledge. Other than determining or obtaining the value of the obliquity of the ecliptic, one\nneeds to execute only simple geometrical calculations to determine the sizes of the rings. There\n482",
      "bbox": {
        "l": 344.0,
        "b": 983.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 983.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 108.0,
        "b": 569.0,
        "r": 644.0,
        "t": 951.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 541.0,
        "r": 388.0,
        "t": 554.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 518.0,
        "r": 293.0,
        "t": 530.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 519.0,
        "r": 293.0,
        "t": 530.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 520.0,
        "r": 136.0,
        "t": 529.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 321.0,
        "r": 652.0,
        "t": 462.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 141.0,
        "r": 652.0,
        "t": 318.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 87.0,
        "r": 652.0,
        "t": 138.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 365.0,
        "b": 53.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "Three-dimensional astronomy\nG\nFigure IV.2.5 A miniature of Taqi al-Din ibn Ma'ruf's armillary sphere. MS Istanbul, Istanbul University,\nRare Works Library, F 1404, fol. 56b.\nSource: Istanbul University, Rare Works Library, Istanbul\nis no astronomical significance in the proportions of the rings, the choice is based on aesthetics.\nHowever, constructing a flawless instrument, especially in large sizes as it was often done in the\nIslamicate world, is extremely hard. Metal rings may expand and contract due to temperature\nchanges and both wood and metal rings may bend over time due to their own weight. Unskillful\ncraftsmanship can also prevent free rotation of the rings. These become major problems since\ngathering systematic observations requires many years of application. However, making a large\ninstrument creates advantages in terms of precision in the observations. Hence, instrument\nmakers in the Islamicate world tried to perfect their designs with modifications of Ptolemy's\nmodel and constructed instruments as large as possible. In comparison to portable instruments\nlike globes and astrolabes, these armillary spheres were rather heavy and quite expensive. That\nis why they were employed almost exclusively in observatories. Moreover, political struggles,\nwars, and the financial costs of maintenance shortened the lifespans of the observatories in the\n483",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 178.0,
        "b": 408.0,
        "r": 548.0,
        "t": 951.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 363.0,
        "r": 638.0,
        "t": 391.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 338.0,
        "r": 394.0,
        "t": 352.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 338.0,
        "r": 394.0,
        "t": 352.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 88.0,
        "r": 638.0,
        "t": 300.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "Taha Arslan\nIslamicate world. For instance, the Samarqand observatory may have been active no longer than\n30 years and the Istanbul observatory survived only four. These relatively short working lives did\nnot help the survival of large instruments.\nIV.2.2.2 The use of the armillary sphere\nThe earliest known armillary spheres used in the Islamicate world are the two instruments made\nfor the observatories in Baghdad and Damascus, respectively, between 213-14/828-829 and\n216-217/831-832. Both were made by Khalid ibn 'Abd al-Malik al-Marwarrūdhi (3rd/9th\ncentury), an instrument maker of the Abbasid Caliph al-Ma'mun (r. 198-218/813-833; Sayili\n1960 [1988][CB], 57). No further information about these instruments seems to have survived.\nSeveral centuries later, two firsthand records were written on armillary spheres used in the\ntwo most important observatories in the Islamicate world: Maragha and Samarqand. Al-'Urḍi,\nMaragha's instrument maker, compiled The Epistle on How (to Make) Observations (al-Risala fi kay-\nfiyyat al-arṣād). In it, he deals with several instruments, some of which were his own inventions.\nHe also wrote a comprehensive section on the construction of a wooden armillary sphere with\nfive rings and a diameter of approximately 160cm (MS Istanbul, Süleymaniye Library, Nuruos-\nmaniye 2971, fols 76b-82a). Al-'Urdi gives measurements for the diameter, width, and thickness\nof each ring and detailed instructions on how to attach the rings, as well as how to preserve the\ninstrument's condition. He shows why Ptolemy's 'observation' ring is inconvenient and argues\nthat an alidade is a better option for observations. In another text, Giyath al-Din al-Jamshid\nal-Kashi (d. 832/1429), who was the first director of the observatory in Samarqand, mentions an\narmillary sphere with seven rings that were employed in the observations (Kennedy 1961, 100).\nIt should be noted that both texts are derivations from Ptolemy's descriptions in the Almagest.\nIV.2.3 Conclusion\nCelestial globes and armillary spheres are miniaturized versions of the celestial sphere as it is under-\nstood in classical astronomy and, depending on construction, could be used for demonstrations\nand observations. They are helpful educational tools when used for demonstrations, because they\noffer a direct representation of the sky, unlike projection-based instruments such as astrolabes and\nquadrants. They are universal in nature; they can be used anywhere in the world. Due to chal-\nlenges with their construction, globes were relatively small and portable, whereas armillary spheres\nfor stationary use were built as large as possible for accuracy. Both instruments provide ample\nevidence for scholarly activities, astronomical interests in the corresponding communities, and the\ntransmission of astronomical knowledge through time. The many unique surviving instruments\nand the manuals on their construction and use deserve thorough investigation. Most of the dated\nand authored globes were produced for the courtly elites such as Ayyubids, Safavids, or Mughals.\nArmillary spheres, on the other hand, were occasionally depicted and illustrated in manuscripts like\nthe Shahinshahnama by Sayyid Loqman dedicated to Murad III (see Figure IV.2.5). Moreover, the\nsocial aspects of the existence and use of these instruments within the Islamicate world have been\nignored for too long and are in need of comprehensive study.\nNotes\n1 For more on their purpose see Charette (2006, 123-38); and formore on the patronage, see Brentjes\n(2008, 403-36).\n2 Consolidated bibliography.\n484",
      "bbox": {
        "l": 344.0,
        "b": 982.0,
        "r": 408.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 899.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 237.0,
        "b": 854.0,
        "r": 515.0,
        "t": 871.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 521.0,
        "r": 652.0,
        "t": 842.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 306.0,
        "b": 479.0,
        "r": 444.0,
        "t": 493.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 197.0,
        "r": 652.0,
        "t": 464.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 355.0,
        "b": 155.0,
        "r": 396.0,
        "t": 169.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 115.0,
        "r": 652.0,
        "t": 142.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 99.0,
        "r": 254.0,
        "t": 112.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 365.0,
        "b": 53.0,
        "r": 387.0,
        "t": 64.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 284.0,
        "b": 979.0,
        "r": 443.0,
        "t": 994.0
      }
    },
    {
      "label": "list_item",
      "text": "Three-dimensional astronomy\n3 For more on Marrākushi's work, see Charette (2003).\n4 For examples of its use, see Evans (1998, 85-87).\n5 For more details, see Samsó (2015, 68-72).\nBibliography\nManuscripts\nMS Istanbul, Süleymaniye Library, Hamidiye 1453, fols 103b-123a.\nMS Istanbul, Süleymaniye Library, Nuruosmaniye 2971, fols 74b-102a.\nMS Istanbul, Topkapı Library, Hazine 452.\nMS Oxford, Bodleian Library, Marsh 154.\nMS Paris, BnF, Arabe 5036.\nResearch literature\nBrentjes, S. 2008. \"Courtly Patronage of the Ancient Sciences in Post-Classical Islamic Societies,\"\nAl-Qantara 29.2: 403-36.\nBrentjes, S. 2015. \"Sanctioning Knowledge,\" Al-Qantara 35.1: 277-309.\nDekker, E. 1999. Globes at Greenwich: A Catalogue of the Globes and Armillary Spheres in the National Maritime\nMuseum, Greenwich. New York: Oxford University Press.\nDekker, E. 2012. Illustrating the Phaenomena. Oxford: Oxford University Press. http://doi.org/10.1093/acp\nrof:oso/9780199609697.003.0004\nDekker, E. and Kunitzsch, P. 2008. \"An Early Islamic Tradition in Globe Making,\" ZGAIW 18: 155-211.\nEvans, J. 1998. The History and Practice of Ancient Astronomy. Oxford: Oxford University Press.\nGillispie, C. C. ed. 1981. Dictionary of Scientific Biography. New York: Charles Scribner's Sons.\nKennedy, E. S. 1961. \"Al-Kashi's Treatise on Astronomical Observational Instruments,\" Journal of Near\nEastern Studies 20.2: 98-108.\nKunitzsch, P. 1959. Arabische Sternnamen In Europa. Wiesbaden: Otto Harrassowitz.\nSamsó, J. 2015. \"Qusta ibn Luqa and Alfonso X on the celestial globe,\" Suhay! 5: 63-79.\nSarma, S. R. 2019. A Descriptive Catalogue of Indian Astronomical Instruments.\nEdmonton: University of Alberta, Canada. https://srsarma.in/catalogue.php\nSavage-Smith, E. 1985. Islamicate Celestial Globes: Their History, Construction, and Use, with a\nChapter on Iconography by Andrea P. A. Belloli. Washington, DC: Smithsonian Institution Press.\nSavage-Smith, E. 1990-1991. \"The Classification of Islamic Celestial Globes\nin the Light of Recent Evidence,\" Der Globusfreund 38-9: 23-9.\nSavage-Smith, E. 1992. \"Celestial Mapping,\" in GTISAS [CB], 12-70.\nSavage-Smith, E. 1997. \"Islamic Celestial Globes and Related Instruments,\" in Maddison, F. and Sav-\nage-Smith, E., eds. Science, Tools and Magic, Part One: Body and Spirit, Mapping the Universe (Khalili\nCollection XII). London and Oxford: Nour Foundation, Azimuth Editions, Oxford University Press,\n168-84.\nWorrel, W. H. 1944. \"Qusta ibn Luqa on the Use of the Celestial Globe,\" Isis 35.4: 285–93.\n485",
      "bbox": {
        "l": 89.0,
        "b": 937.0,
        "r": 381.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 922.0,
        "r": 356.0,
        "t": 935.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 907.0,
        "r": 326.0,
        "t": 920.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 317.0,
        "b": 861.0,
        "r": 409.0,
        "t": 878.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 320.0,
        "b": 825.0,
        "r": 406.0,
        "t": 841.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 802.0,
        "r": 440.0,
        "t": 815.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 787.0,
        "r": 460.0,
        "t": 800.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 772.0,
        "r": 311.0,
        "t": 785.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 757.0,
        "r": 310.0,
        "t": 770.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 743.0,
        "r": 234.0,
        "t": 755.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 298.0,
        "b": 699.0,
        "r": 428.0,
        "t": 713.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 659.0,
        "r": 638.0,
        "t": 686.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 643.0,
        "r": 459.0,
        "t": 656.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 613.0,
        "r": 638.0,
        "t": 641.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 584.0,
        "r": 638.0,
        "t": 611.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 554.0,
        "r": 638.0,
        "t": 581.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 568.0,
        "r": 637.0,
        "t": 581.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 552.0,
        "r": 573.0,
        "t": 565.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 538.0,
        "r": 572.0,
        "t": 551.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 508.0,
        "r": 638.0,
        "t": 536.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 493.0,
        "r": 520.0,
        "t": 506.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 478.0,
        "r": 544.0,
        "t": 491.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 462.0,
        "r": 479.0,
        "t": 475.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 445.0,
        "r": 485.0,
        "t": 458.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 429.0,
        "r": 561.0,
        "t": 442.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 412.0,
        "r": 573.0,
        "t": 425.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 396.0,
        "r": 488.0,
        "t": 409.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 380.0,
        "r": 418.0,
        "t": 393.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 364.0,
        "r": 458.0,
        "t": 377.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 306.0,
        "r": 638.0,
        "t": 362.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 289.0,
        "r": 567.0,
        "t": 302.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 740,
      "h": 1046
    },
    "2": {
      "w": 740,
      "h": 1046
    },
    "3": {
      "w": 740,
      "h": 1046
    },
    "4": {
      "w": 740,
      "h": 1046
    },
    "5": {
      "w": 740,
      "h": 1046
    },
    "6": {
      "w": 740,
      "h": 1046
    },
    "7": {
      "w": 740,
      "h": 1046
    },
    "8": {
      "w": 740,
      "h": 1046
    },
    "9": {
      "w": 740,
      "h": 1046
    },
    "10": {
      "w": 740,
      "h": 1046
    },
    "11": {
      "w": 740,
      "h": 1046
    },
    "12": {
      "w": 740,
      "h": 1046
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}