{
  "1": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 1\t\r\nTITLE: World map of al-Istakhri\r\nDATE: 1193\r\nAUTHOR: Abu Ishaq Ibrahim ibn Muhammad al-Farisi al Istakhri\r\nDESCRIPTION: Al-Istakhri is virtually unknown apart from this one work. He does\r\nnot appear in any of the standard Arab biographies, and all we know about him\r\npersonally was his meeting with the more renown Ibn Hawqal (#213), which is related in\r\nthe latter’s own book. Even his work Kitab al-masalik wa-al- mamalik [KMM, Book of\r\nRoutes and Realms (or Kingdoms)] can be dated only from internal evidence, to the\r\nmiddle of the 10th century A.D./CE It soon became popular, however, for there are\r\nmany early editions, abridgments, and translations into Persian, often differing\r\nconsiderably from each other.\r\n In the Balkhi-Istakhri-Ibn Hawqal set of writings, there are four distinct recessions\r\nof what is basically one set of maps. This monograph follows J.H. Kramers’ example\r\nwho refers to the four types as: Istakhri I, Istakhri II, Ibn Hawqal I, and Ibn Hawqal III. The\r\nmanuscripts of Ibn Hawqal III, though all undated, are much later than the other texts,\r\nprobably from the late 13th or early 14th century A.D. The regional maps are nevertheless\r\ncopies of the earlier versions. The world map of Ibn Hawqal III, however, is so different\r\nfrom the other world maps that it warrants special consideration. Kramers finds that the\r\ntexts presumed to be by al-Istakhri can be divided into two groups, and he regards one\r\nas earlier in origin. In this earlier group (Istakhri I), the maps are more geometric than the\r\nlater ones (Istakhri II), while the text that goes with the later maps appears more\r\ncomplete and refined. On the other hand, it is the earlier texts that mention the name al￾Istakhri, so that the cartographic historian Konrad Miller attributes the anonymous\r\n(Istakhri II) texts to al-Balkhi (#214.2), presuming wrongly that they are earlier than the\r\nothers.\r\n The main difference between the work of Ibn Hawqal and that of al-Istakhri is in\r\nthe former’s discussion of the western (formerly Byzantine) part of Islam. He treats\r\nSpain, North Africa and Sicily as three separate sections. Syria and Egypt are dealt with\r\nin more detail, and it is interesting that when later authors like Yaqut quote Ibn Hawqal\r\nthey are almost always referring to these western regions.\r\n Al-Istakhri’s work was a commentary on the maps, and he states that “our plan is to\r\ndescribe, and to delineate on maps, the various seas, ... affixing the name of each, so that it may be\r\nknown in the maps,” thus showing the importance he placed on the maps. The\r\ncartography, therefore, was the essential element in the work.\r\n The maps accompanying the geographical texts from what has been termed the\r\n“Balkhi School” of geography seem at first sight to be an unnecessary supplement to the\r\ntexts, the text being so complete in itself. This is often so with illustrative material in\r\nclassical Arab texts, certainly with maps in some later geographical works. This set in\r\nmost cases comprises twenty-one maps, although some manuscripts lack a map. The\r\nconsistency with which the same set of maps appears in so many manuscripts and with\r\nseveral different authors led scholars such as Konrad Miller to call the set the “Islamic\r\nAtlas,” and it has subsequently been called this by several other scholars. Historian\r\nKaren Pinto, however, chooses to disregard the misnomer “Balkhi School” and has\r\nopted to for the acronym KMMS mapping tradition. The “S” in the acronym stands for\r\nsurat [picture in Arabic], that is, those KMM geographical manuscripts that are\r\naccompanied by map images. This set, sometimes referred to as the Ottoman Cluster,\r\nconsists of a world map, maps of the three seas: the Mediterranean, the Persian Sea\r\n[Indian Ocean] and the Caspian Sea, and maps of seventeen “provinces” of the Islamic",
  "2": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 2\t\r\nempire. The word “provinces” is placed in quotation marks because in some cases\r\nprovinces are linked together in one map (Azerbaijan, Armenia, etc., plus Spain and the\r\nMaghreb) and because the Persian Desert is hardly a province. The word the texts use for\r\n“province” is iqlim, from the Greek word that reaches Arabic through the translation of\r\nPtolemy. The word was used first to translate the Persian kishvar, which was a specific\r\ngeographical region, and hence comes the present usage. A complete list of these maps\r\nin the order usually found in a manuscript is as follows:\r\n \r\n(1) world map;\r\n(2) Arabia;\r\n(3) Indian Ocean;\r\n(4) al-Maghrib [North Africa];\r\n(5) Egypt;\r\n(6) Syria;\r\n(7) Mediterranean Sea;\r\n(8) al-Jazirah [Upper Mesopotamia];\r\n(9) Iraq (Lower Mesopotamia);\r\n(10) Khuzistan;\r\n(11) Fars;\r\n(12) Kirman;\r\n(13) Sind;\r\n(14) Armenia, Arran (Alvan), and Azerbaijan;\r\n(15) Jibal (central Persian mountains);\r\n(16) Daylam and its neighbors (Rayy, Tabaristan);\r\n(17) Caspian Sea;\r\n(18) Persian Desert;\r\n(19) Sijistan;\r\n(20) Khurasan; and\r\n(21) Transoxiana.\r\n \r\nThe thirteen maps that represent the Persian-speaking provinces of the Islamic empire\r\nare fairly consistent in form throughout all the manuscripts. Their form was stereotyped\r\nby the time of the first al-Istakhri recession, and Ibn Hawqal seems to have found no\r\nneed to change these maps. Even Azerbaijan and al-Jazirah, of which Ibn Hawqal\r\nproduced good versions approved by al-Istakhri, do not seem to have changed much\r\nthrough Islamic cartography recessions. It is therefore appropriate to describe these\r\nmaps of the Iranian area and then use them as a standard for the rest of the set.\r\n The maps of each of these regions consist of an area that is roughly rectangular\r\nand usually, although not always, surrounded by a line representing its boundary with\r\nthe surrounding areas. There is no projection to form the base of the map. The maps\r\ncannot be joined together as a multi-sheet map like the sectional maps of al-Idrisi (#219).\r\nEven if they are reduced to the same scale, this cannot be done as it can for the sectional\r\nmaps of the European edition of Ptolemy. The maps are thus individual entities and are\r\nseen as such by the draftsman.\r\n This set of maps also does not cover the whole world as do the sectional maps of\r\nal-Idrisi that follow in the 12th century and the texts of the earlier geographers like Ibn al￾Faqih or Ibn Khurradadhbih. These latter include considerable detail on China and\r\nIndia and give some account of Africa and Europe. The Balkhi/KMMS maps specifically",
  "3": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 3\t\r\ncover only the Islamic empire as it appeared in the 10th century. Even Spain has no\r\nseparate map and is omitted in the text, though it was a Muslim province at the time. It\r\nwas, of course, never part of the Abbasid Empire. Inside the Dar al-Islam each province\r\nis then given its own map and a description that forms an individual chapter dealing\r\nsystematically with towns, rivers, mountains and inhabitants, followed by itineraries\r\nthroughout the province. S. Maqbul Ahmad has a theory that this Islamicization of the\r\nmaps and geography was a deliberate policy developing independent of the work of the\r\nearlier al-Ma’mun type of geographer, which, based mainly on Ptolemy, covered the\r\nwhole of the known world.\r\n Besides this policy of portraying only the areas of the Abbasid caliphate at its\r\ngreatest extent, it is further obvious that there is a bias toward things Iranian: so much so\r\nthat Kramers has suggested there may have been old Iranian maps that are the basis of\r\nthese Balkhi/KMMS maps. There is no evidence for the existence of the former, but the\r\nmaps may ultimately be based on early lists of postal routes surviving from Sassanid\r\ntimes. These lists may perhaps also be seen as the origin of the lists of Islamic postal\r\nroutes found in the works of the al-Masalik waal-mamalik type. The Iranian bias also\r\nappears in the contents of the set of maps. The Iranian area is divided systematically into\r\nareas for mapping, whereas the areas the Arabs conquered from the Byzantines were\r\ntreated in a much less systematic way. This may, however, reflect the administrative\r\nsituation in the two empires that preceded the Islamic empire at the time when the Arab\r\nconquest took place. Al-Balkhi and al-Istakhri were both patronized by the Samanid\r\nrulers of Persia, and the emphasis is very much on the Iranian area.\r\n According to Karen Pinto due to their divine nature, the seas figure in the\r\nmedieval Islamic maps as perfect and smooth shapes without irregular coastlines. Each\r\ncan be argued to have symbolic emanations of their own. The Mediterranean equals a\r\nsandal-imprint, possibly that of the Prophet Muhammad, at the close-up regional scale.\r\nAt the level of the world it morphs from the form of a footprint into a teardrop. On the\r\nopposite end is the Indian Ocean in a hook-shaped form that resembles that of an eye\r\ntooth at the regional level and a hook-ended arm at the world level. These two make up\r\nthe arms that stretch out into (or, depending on your perspective, out of) the Encircling\r\nOcean. In the middle of the Asian land mass the Caspian and Aral Seas glimmer like a\r\npair of blue or sometimes green eyes, depending on the color code for the seas that\r\nvaries from map to map. Collectively they create a refracted set of splintered arms and\r\neyes surrounded by the quixotic Encircling Ocean of good and evil that connects\r\ncosmographically to the nine spheres beyond, which end in the ultimate overarching\r\nrealm of God that encircles all.\r\n Again according to Pinto this interpretation of the seas in the KMMS maps\r\nrepresents a stylized vision of the world that, on the basis of the longevity of the KMMS\r\nmapping tradition, held sway for at least eight centuries. From the depiction of the seas\r\nin KMMS world maps we can assert that they can be read as an amorphous fluid mass of\r\nthe divine amidst traces of the diabolic. This analysis of the seas in the Islamic\r\ncartographic imagination reaffirms that cosmogony establishes a timeless space that\r\ntranscends history and geography.",
  "4": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 4\t\r\n \r\nal-Istakhri’s world map, Arabic, 977/1570 A.D./CE, oriented with South at the top\r\nMS Ouseley 37, fol. 3b-4a(1297[696 H])\r\nThe 'Mountain of the Moon', thought to be the source of the River Nile, has been painted over the\r\ncenter of the scale. Europeis depicted as a landmass to the lower right, with a very large\r\nIberian peninsula. No islands are shown in the Mediterranean, perhaps because other maps in the\r\ntreatise are devoted solely to the Mediterranean and to the islands of Sicily and Cyprus. At the\r\nleft-hand rnargin of the map, a brown landmass has an inscription reading: 'Island of the Jewel,\r\nand its mountains encircle it like a basket'-this island, usually interpreted as Indonesia or\r\nFormosa, was considered the easternmost limit of the inhabitable world. The map also depicts, in\r\nthe lower left corner, the legendary wall constructed by Alexander the Great to imprison Gog and\r\nMagog. At the Caspian Sea, represented by a dark circle in the lower left quadrant, a number of\r\ntributaries converge, one of which Rows from Gog and Magog's mountain enclave. Unlike\r\nEuropean map-makers, the Islamic cartographers always showed the Caspian as an inland sea.\r\nThe author's interest in travel and trade is evident in the several routes or itineraries that he\r\nplaced somewhat arbitrarily on top of the map. In Spain, for example, the long straight line of red\r\ndots is an itinerary beginning near Toledo and proceeding through Lisbon to Cordoba and on to",
  "5": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 5\t\r\nAlmeria on the southern coast. Itineraries are given from Kufa (south of Karbala in Iraq) to\r\nDamascus and, in the other direction, from Kufa to Mecca. The Tunisian coast has been\r\nexaggerated in length in order to accommodate another itinerary.\r\n \r\n The world maps (al-Istakhri I/II and Hawqal III) and the map of the Indian Ocean,\r\nwhich is enlarged from it and always referred to as the Persian Sea, are a different\r\nproposition. These two maps are built up by what might be called “academic\r\nconjecture”—an armchair attempt to see all the provinces set down relative to each\r\nother. The whole has to fit into a stereotyped idea of what the whole world should look\r\nlike. According to Arab geographical theory based entirely on Ptolemy, this would be a\r\nsphere. Since the far side of a world sphere (an upside-down world) was practically\r\ninconceivable, only a hemisphere was thought to be inhabitable. This could easily be\r\n“projected” onto a flat area and represented by a circle. That Ptolemy represented the\r\ninhabitable world as occupying 180 degrees of the earth supported this idea. Thus al￾Istakhri represented the world as a circle surrounded by the Encompassing Sea, with the\r\ntwo main seas reaching in from the east and the west toward the center, where they\r\nwould join except for a small, narrow land barrier—the barzakh of the Qur’an.\r\n In his text, al-Istakhri gives a simple description of the world to explain his map.\r\n“The earth is divided into two by the two seas, so that we have a north or cold half and a south or\r\nhot half. People in these two halves get blacker as you go south and whiter as you go north etc.”",
  "6": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 6\t\r\nThe main kingdoms are listed together with the kingdoms that adjoin them. This is the\r\nonly place where non-Islamic areas are given any mention. Measurements are\r\nattempted; thus the width from the Encircling Ocean in northwestern Africa to the ocean\r\nin China was 400 days’ journey. However, the distance north to south was not\r\nmeasurable. There were 210 days’ journey through inhabitable lands, but the extreme\r\nnorth was uninhabited because of intense cold and the extreme south because of intense\r\nheat. The seas were described briefly, and the fact that the Khazar [Caspian] Sea and the\r\nKhwarazm [Aral] Sea were landlocked is mentioned, as well as the sea connection\r\nbetween the Encircling Ocean and Istanbul—that is, the Baltic joins up to the Bosporus.\r\n The map of the Persian Sea is an enlarged version of a portion of the world map,\r\nalthough there are enough differences in the shape of the ocean in the two maps to\r\nnecessitate some explanation. Three large islands, Kharak, Awal [Bahrain] and Laft\r\n[Qishm Island], are set symmetrically in what is the Arabian Sea, with the Tigris to the\r\nleft and the Indus to the right. India and China coalesce into one narrow peninsula,\r\nmatching Arabia on the other side. The attempt is probably to match the Mediterranean\r\non the other side of the world. Hence India also has a large mountain (Adam’s Peak) to\r\nmatch the Jabal al-Qilal near the Strait of Gibraltar. This is the Indian Ocean map in the\r\nfirst recession (Istakhri I).\r\n The second recession (Istakhri II) is not so symmetrical, and the mountain and\r\nthree islands become much smaller (as they also do in the Mediterranean). In the world\r\nmap, the islands disappear altogether in the second recession but are there, very large, in\r\nthe first. There is no “mountain” in either recession of the world map. The surprising\r\ndifference is that the western tip of the Indian Ocean, which represents the Red Sea (Sea\r\nof Qulzum), points to the west in the ocean map, but in the world map it turns back on\r\nitself to almost touch the southeastern corner of the Mediterranean Sea.\r\n Al-Istakhri and Ibn Hawqal show no interest in projections or mathematical\r\nastronomy. Neither do they mention longitude and latitude in any form, or any sort of\r\nmap construction. They both give distances between places on their routes (marhalah = a\r\nday’s journey), and they add these up roughly to give the dimensions of the inhabited\r\nworld. These distances are not recognizable on the map, however. It therefore does not\r\nseem that the authors envisaged any kind of formal scale at all in constructing these\r\nmaps.\r\n Scattered throughout collections of medieval and early modern Arabic, Persian,\r\nand Turkish manuscripts are thousands of cartographic images of the world and various\r\nregions. The sheer number of these extant maps tells us that from the 13th century\r\nonward, when copies of these map manuscripts began to proliferate, the world was a\r\nmuch-depicted place. It loomed large in the medieval Muslim imagination. It was\r\npondered, discussed, and copied with minor and major variations again and again, and\r\nall with what seems to be a peculiar idiosyncrasy to modern eyes. The cartographers did\r\nnot strive for mimesis (imitation of the real world). They did not show irregular\r\ncoastlines even though some of the geographers whose work includes these maps\r\nopenly acknowledge that the landmasses and their coastlines are uneven. They present\r\ninstead a deliberately schematic layout of the world and the regions under Islamic\r\ncontrol.\r\n \r\n These images employ a language of stylized forms that make them hard to\r\nrecognize as maps. Scholars of Islamic science and geography often ignore and belittle\r\nthese maps on the grounds that they are not mimetically accurate representations of the",
  "7": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 7\t\r\nworld. What these scholars miss, according to Pinto, is that these schematic, geometric,\r\nand often symmetrical images of the world are iconographic representations, carte￾ideographs of how medieval Muslim cartographic artists and their patrons perceived\r\ntheir world and chose to represent and disseminate this perception.\r\n Each map consists of a set of geometric configurations. Though some are more\r\ngeometric than others, most lines are straight or arced, rivers are wide parallel lines, and\r\nlakes are often perfect circles. Towns are sometimes squares, circles, or four-pointed\r\nstars or, if they are stopping places on a straight route, resemble small tents or perhaps\r\ndoors to caravansaries. Thus much of the drafting is ruled with either a straight or a\r\ncurved edge. The only exceptions are mountains, which are drawn as a collection of\r\npeaks or perhaps piles of rocks, though even here the base, which probably represents\r\nthe position of the range on the map, is a straight line or a regular curve.\r\n \r\n al-Istakhri world map,\t589/1193, diameter 37.5 cm, oriented with South at the top, a classic\r\nKMMS world map titled Surat al-Ard [Picture of the World]\r\nCourtesy of Leiden University Libraries. Cod. Or. 3101, fols. 4- 5\r\n \r\nThe Leiden al-Istakhri manuscript affords us an opportunity to examine the ways in\r\nwhich 12th century Arabo-Norman illustrators molded the al-Istakhri maps to fit with\r\ntheir perspective of the world through a Sicilian lens. One of the most noticeable\r\nelements is the way in which the island of Sicily is given a prominent berth in the maps\r\nof the world, the Mediterranean, and the Maghreb (North Africa and Andalus). Three red\r\nislands stand out prominently in each sea: Sicily, Crete, and Cyprus, in the Medi￾terranean and Bahrain, Qeshm, and Sri Lanka in the Persian Gulf/Indian Ocean. It",
  "8": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 8\t\r\nshows the old world of Africa, Asia, and Europe with south on top spread-eagled on the\r\noceans in the shape of a bird.\r\n \r\n The basic purpose of the maps (especially those of the Persian-speaking areas) seems to\r\nbe to incorporate the caravan routes across the province, with all the stages marked. This\r\nis most noticeable on the map of the Khurasan Desert, where the boundary of the desert\r\nis given with the bordering villages and oases marked around it. Straight lines then join\r\nthose places on opposite sides where traffic flows, and the name of the route is written\r\non the line so drawn.\r\n All the manuscripts in what is called the Ottoman Cluster [al-Istakhri’s Kitab al￾Masalik wa-al-Mamalik - Book of Roads and Kingdoms, henceforth KMMS] are written on\r\nthin, highly polished paper in tight, late, naskhi script with few diacritical marks. They\r\nare strikingly similar in other respects too. Five of the six average the same number of\r\nlines per page, namely 25. Rubricated words are identical. The manuscripts are the same\r\nsize, approximately 32 x 22 cm. The world maps have a consistent diameter of\r\napproximately 19 to 20 cm, while the map of the Persian Gulf is approximately 24 x 17\r\ncm. Gouache pigments tend to be the same: dull blue washes for the seas, reddish -\r\nbrowns for the mountains, and pale pinks or oxidized copper greens for the deserts,\r\nwith red ink as the preferred color for the outlines of the land masses and the territorial\r\ndemarcations. All the maps in the Ottoman Cluster take up a single folio. TSMK A. 3349\r\nand BL Oriental [Or.] 5305, the last manuscript in the series, represent departures from\r\nthe strict color code. The maps in these two manuscripts are unpainted; instead they are\r\noutlined in either red or gold.\r\n As Karen Pinto points out it is through the distinctive delineations in the maps\r\nthat one can most easily identify the KMMS Ottoman Cluster as part of a single group.",
  "9": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 9\t\r\nOverall, on the regional maps, the Arabian peninsula has an unusual over-elongated\r\nshape. The Red Sea on the Persian Gulf maps has a distinctive sharp-toothed shape,\r\nwhile its shape on the Mediterranean maps also stands out for its pronounced oblong\r\nappearance.\r\n Pinto also points out that every medieval Islamic cartograph of the world\r\ncontains a curious anomaly. Consistently located on the eastern flank of Africa is a\r\ndouble-territorial ethnonym for an obscure East African tribe: the Buja (marked on\r\nbelow with a red circle). Mention of them in medieval Middle Eastern historiography is\r\nrare and, at best, superficial, yet no Islamic mappamundi from the 11th to the 19th century\r\nleaves them out. Not only are the Buja privileged with a permanent berth on the Islamic\r\nworld map, they are also the only place on the map signified with a double territorial\r\nmarking.\r\n \r\n Reconstruction by M. Vivien Saint-Martin, 1847",
  "10": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 10\t\r\n al-Istakhri II world map, Arabic, 934 A.D., oriented with South at the top and\r\nthe words “al-Buja” marked prominently astride the upper reaches of the Nile between al￾Habasha [Abyssinia] and the Bilad al-Nuba [Land/Territory of Nubia]; and “Mafaza al-Buja”\r\n[deserts of the Buja] as a strip of land between the Red Sea and the Nile.\r\n \r\n \r\n \r\n \r\n\t\r\n\t",
  "11": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 11\t\r\n\t Map of the world from the earliest of the KMMS Ottoman Cluster, 878/1473, Sulemaniye Camii\r\nKutuphanesi, Istanbul, A.S. 2971a, fol. 3a.\r\nSouth is at the top. Diameter 19.5 cm. For place-names, see below.\r\n(Reproduced with permission from Sülemaniye Kütüphanesi, Istanbul)\r\n \r\nThe key is: blue for seas; paper white for land masses; red for border lines and the name\r\nof the Encircling Ocean; and black for area/region/kingdom names and directions.\r\n The classical KMMS map of the world is made up of a double-edged circle in a\r\nsquare or rectangular frame. Placed within this circle is the image of a pre- Columbian\r\nworld, punctuated by seas and rivers. At the top of the map a large crescent shape\r\nsweeps in to shelter a double-headed, bulging form in the lower left-hand corner with a\r\ntiny triangle marooned in the lower right-hand sector of the image. These are white or\r\npaper-colored. Two outspread blue arms emerge from a blue encircling band and",
  "12": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 12\t\r\nadditional blue shapes punctuate the white mass, including two small twin keyhole\r\nshapes towards the bottom of the map.\r\nWithin this aesthetically packaged ideograph are all the features standard to the classical\r\nmedieval Islamic vision of the world. The Encircling Ocean (Bahr al-Muhit) that rings\r\nthe world along with four other seas, seven rivers and the three major land masses of\r\nAfrica, Asia and Europe (listed here in order of their size on the map). The key to\r\ncomprehending the medieval Muslim conception of the world is to assimilate the basic\r\nshapes of the landmasses and the seas, and, crucially, the map’s southerly inversion.\r\n The crescent-shaped land mass is the continent of Africa. Once we make this\r\nassociation we recognize that the double-headed, bulging form in the lower left-hand\r\ncorner corresponds to the continent of Asia. The bulge connecting Africa to Asia is the\r\nArabian Peninsula, and the tiny triangle marooned in the lower right-hand sector of the\r\nimage is none other than Europe. Behind lie the seas outlining the landmasses and, in\r\ndoing so, make them possible.\r\n Encasing this entire image is the broad band of the Encircling Ocean, encom￾passing the Pacific and Atlantic Oceans. In a single flourishing sweep, it reinforces the\r\nidea that our world is an island marooned in a vast sea struggling to keep the waters at\r\nbay, it is the ring that encircles, contains and connects the traces of liquid divinity\r\nimparted by God’s throne to the earthly seas. It is the most liminal of seas, representing\r\nthe boundary of man and his land and ships and the realm of God on the other end, nine\r\nheavenly circles away.\r\n \r\n ",
  "13": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 13\t\r\n Translations of KMMS world map based upon Ottoman Cluster map on p. 8.\r\n \r\n The world map is characterized by distinctive shapes, especially for the seas and\r\nrivers. In the northwestern quadrant (lower right) of each world map, is an elongated,\r\ntear-shaped Mediterranean Sea, with two outstretched arms representing the Nile (at\r\nright angles to the Mediterranean) and the Bosphorus (at 45 degrees). The two arms\r\ntogether give the Mediterranean a bulging cruciform appearance. At the other, left or\r\neastern, end of the map, the combined Persian Gulf-Indian Ocean sweeps in as if\r\nthreatening to hook onto the Mediterranean, a distinctive characteristic of this group of\r\nmaps.\r\n As on world maps in other KMMS manuscripts, the interior of the three\r\ncontinents on the Ottoman Cluster world map, which are always outlined in red ink, are\r\nleft uncolored. Consequently it is the blueness of the surrounding water that directs\r\nattention to the land, whose stark whiteness on the folios also serves to heighten the\r\nvisual conflict between the threatening Persian Gulf and the placid Mediterranean.",
  "14": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 14\t\r\nAfrica, which always sweeps across the top of KMMS world maps, has a pronounced\r\npointed dagger or crescent-like shape. Below, as if sheltered by Africa, is a double￾humped Asia. In the lower right corner of the image, between the Mediterranean Sea\r\nand the Encircling Ocean, is a triangular European land mass. The stark, unadorned\r\nstylistic simplicity of the maps and the dramatic shapes of the lands and seas are among\r\nthe most visually striking features of the world maps in this group.\r\n A final but crucial aspect identified by Karen Pinto that individualizes all the\r\nmaps in the Ottoman Cluster manuscripts is their unsophisticated execution and\r\nlackluster painting technique. The outlining is uneven, with smudges and overlapping\r\nlines. The paintwork, too, is patchy and unevenly applied, while the colors tend to be\r\nwatered-down and pale. The color palate is limited: on the world maps it is restricted to\r\nthe blue of the sea, the white of the paper, and the red of the outlines and rubrication.\r\nOn the regional maps the blue and white monotony is broken only by an occasional red￾brown mountain or a pale pink or oxidized copper-green desert.\r\n The earliest manuscript of the Ottoman Cluster, A.S. 2971a, shown above, is not a\r\ntracing from TSMK A. 2830, but a free-hand copy, which was subsequently faithfully\r\ntraced in the other manuscripts of the Ottoman Cluster. Everything is slightly different.\r\nHence, the distinctive angle of the Mediterranean in the Ottoman Cluster maps as against\r\nthose of TSMK A. 2830, the “mother map” (see illustration below). The Indus River\r\n(marked Mehran on the world map) is sometimes squiggly as in the mother map - and\r\nsometimes straight. This can be explained on the basis of later Ottoman KMMS Cluster\r\nmanuscripts being traced from an earlier exemplar in the cluster rather than directly\r\ncopied from the mother manuscript; lines and shapes tend to be straightened out or\r\nfurther exaggerated in the process of transmission. The two inland seas, the Caspian and\r\nthe Aral, retain their keyhole appearance with minor variations. The Tigris and\r\nEuphrates rivers are both smaller, although they retain their TSMK A. 2830 structure.\r\nThe Euphrates noticeably does not meet up with either major sea but hangs almost as a\r\nfrontier between them, reduced to a pronounced crescent shape. In both the mother\r\nworld map and the world maps of the Cluster, the Euphrates acts as the boundary\r\nseparating the Arabian peninsula from the rest of the world.\r\n Taken as a whole, however, the world maps in TSMK A. 2830 and in the Ottoman\r\nCluster manuscripts are almost identical. Territorial boundaries on the Cluster maps are\r\nmarked with the same shapes as those employed by TSMK A. 2830, with the occasional\r\nshrinking and expanding in places. The space on the Ottoman Cluster world map\r\nMaghrib, Egypt and the Saharo-Sahelian sector lying to their south and to the Iranian\r\nterritories in the east are visibly reduced, whereas the area accorded to Abyssinia has\r\nbeen increased. The bulbous head of the Arabian peninsula has become smaller,\r\nsignificantly reducing assigned to the Arab tribes as well assigned to Iraq. The areas\r\nalong the edges of the map have expanded so that the waste around the northern and\r\nsouthern extremities (appropriately termed Barari meaning open-country/steepe/\r\ndesert) have ballooned.\r\n Part of the cause of this ballooning is to be found in the simple fact that the maps\r\nof the Ottoman Cluster are on a larger size of paper, 19 cm compared with 13.2 cm in\r\nTSMK A. 2830, which has, in turn, increased the size of the map. The enlargement,\r\nhowever, is uneven. For instance, the territory marked Bilad al-Rum [Byzantium] has\r\nbeen allocated disproportionately more space in the world maps of the Ottoman Cluster\r\nthan it had in the mother map. Stretching across all of Anatolia and Syria, and",
  "15": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 15\t\r\nincorporating almost the whole of the Levant, it can be read as synonymous with a\r\ndesire to expand the, of the Ottoman Empire.\r\n The Slavic tribal belt on the western flank of the Black Sea, composed of (in order\r\nof occurrence) Sarir, the Khazar, the Burtas and the Rus, has also expanded and now\r\npresses into territory assigned to Bilad al-Rum. The area accorded to the Bulgars,\r\ndesignated Bulghar al-Dakhil, namely the Inner Bulghar, has been reduced in keeping with\r\nthe fact that by this point Ottoman Sultan Mehmet II had incorporated most of Bulgaria\r\ninto the Ottoman Empire. The swathe of land assigned to the Slavs (al-Saqaliba) along the\r\nnorthern end of the Bosphorus crossing over from Asia to Europe has been significantly\r\nelongated in A.S. 2971a. This too is a telling change, because by 1474 Mehmet had\r\noverrun most of the lower Danube region and had designs on all of it, up to and beyond\r\nBuda.\r\n Of particular interest is the way in which the space accorded to the al-Ard al￾Kabira min al-Rum [the Land of Greater Byzantium] on the European flank has grown to\r\ntake over almost the entire European triangle. The semi-circular areas assigned to the\r\nIfranja [the Franks] and Andalus [Muslim Spain] has shrunk considerably. This change,\r\nmore than any of the others, bears the mark of Mehmet’s territorial ambitions in Europe.\r\nBeing heir to the Byzantines meant controlling most of Europe and Asia Minor. This is\r\nprecisely what the boundaries of Rum can be read as representing on the world maps of\r\nthe Ottoman Cluster.\r\n Noticeable too are the sizes of the landmasses in the Ottoman Cluster versions of\r\nthe world map. Africa is bigger, longer, more pointed and unmistakably sword-like in\r\nshape. Asia too is bigger, with significant expansion along its extremities. As a result\r\nIndia, Tibet, China, and especially the northern wastelands, Barari aI-Shaman, have been\r\ngiven more space. Europe is visibly larger. However, the hint of European contact with\r\nthe westernmost tip of North Africa present in the TSMK A. 2830 world map has been\r\nremoved in the Ottoman rendition.\r\n The world map of the Ottoman Cluster was adroitly re-proportioned to impress\r\nupon the viewer the greatness and expanse of the Bilad aI-Rum and al-Ard al-Kabira min\r\nal-Rum - and the Ottoman Empire as successor to Byzantium - in comparison with all\r\nother territories of the world. The message is reinforced by the space accorded to the\r\nlands designated al-Saqaliba and Bulghar al-Dakhil, creating the impression of Ottoman\r\ncontrol almost to the territorially voluminous northern steppes (Barari al-Shamal) and the\r\nlands of the Turks’ eponymous ancestors who, in the 11th and 12th centuries, as we know\r\nfrom the history of Turkic migrations from Inner Asia, made their way westward to\r\nAnatolia. What matters, according to the world map of the Ottoman Cluster, is that the\r\nOttoman Empire dominates the image of the world as the new Byzantium with its\r\nnominative implication of a neo-Roman Empire.",
  "16": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 16\t\r\n The world map illustrated above is also based upon al-Istakhri. The world,\r\ncentering on the Persian Gulf, an Ottoman province, c. 1820 and measures 26 x 29 cm.\r\nDrawn on paper with water color, ink, gouache and gold highlighting. The world map is\r\nin manuscript with inscriptions in Arabic showing a map of the world centered on the\r\nJezirah and is based on al-Istakhri’s world map (977/1570 A.D). Oriented with South at\r\nthe top, just as in the T-O maps of contemporary Latin Europe, but instead of the Earthly\r\nParadise the Arab scholars knew enough to place in the furthest East both China and\r\nTibet. The map shows Egypt and the river Nile in the right and further on “Country of\r\nthe Black People”. Note how the tip of Africa points eastwards, a mistake that the\r\nChinese geographers were the first to correct. In the lower right corner Europe, i.e.\r\n“Country of the Romans and Franks”. The map shows the Indus in the lower left, with\r\nthe Indian Peninsula, Tibet and Chinese Empire and The Red Sea colored in red. The\r\nouter circles represent the seas. The manuscript is a cosmology, not meant to be accurate\r\ngeographically, but only to present the reader with a systematic overview of the existing\r\nknowledge about the world at the time.\r\n According to Arab geographical theory based entirely on Ptolemy, this would be\r\na sphere. Since the far side of a world sphere (an upside-down world) was practically\r\ninconceivable, only a hemisphere was thought to be inhabitable. This could easily be\r\n“projected” onto a flat area and represented by a circle.",
  "17": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 17\t\r\nThat Ptolemy represented the inhabitable world as occupying 180 degrees of the\r\nearth supported this idea. Thus al-Istakhri represented the world as a circle surrounded\r\nby the Encompassing Sea, with the two main seas reaching in from the east and the west\r\ntoward the center, where they would join except for a small, narrow land barrier—the\r\nbarzakh of the Qur’an .\r\n In his text, al-Istakhri gives a simple description of the world to explain his map.\r\n“The earth is divided into two by the two seas, so that we have a north or cold half and a\r\nsouth or hot half. People in these two halves get blacker as you go south and whiter as\r\nyou go north etc.” The main kingdoms are listed together with the kingdoms that adjoin\r\nthem. This is the only place where non-Islamic areas are given any mention.\r\nMeasurements are attempted; thus the width from the Encircling Ocean in northwestern\r\nAfrica to the ocean in China was 400 days’ journey. However, the distance north to\r\nsouth was not measurable. There were 210 days’ journey through inhabitable lands, but\r\nthe extreme north was uninhabited because of intense cold and the extreme south\r\nbecause of intense heat. The seas were described briefly, and the fact that the Khazar\r\n[Caspian] Sea and the Khwarazm [Aral] Sea were landlocked is mentioned, as well as the\r\nsea connection between the Encircling Ocean and Istanbul—that is, the Baltic joins up to\r\nthe Bosporus.\r\n ",
  "18": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 18\t\r\n \r\nal-Istakhri’s manuscript copy of Kitab al-masalik wa-al-mamalik MS copy dated 1325, Iran\r\nBastan Museum, Tehran. Ref. MS.3515, ff. 3a-2b.\r\n \r\n This world map is from al-Istakhri’s manuscript copy of Kitab al-masalik wa-al￾mamalik [Book of Routes and Realms], which is kept in Iran Bastan Museum in Tehran.\r\nThis is a Persian translation of the book, dating from 1325.\r\n The map follows all the traditions of the basic Islamic world maps by giving\r\nprominence to the Mediterranean Sea, the Indian/Arabian Sea and the Persian Gulf. The\r\nGulf as well as the Mediterranean has each been shown with three islands. The Black Sea\r\nseems to be the waterway connecting the Mediterranean with the surrounding ocean,\r\nbut the Caspian and the Aral Seas are shown as circular inland lakes, with wide rivers\r\nflowing in.\r\n In the territory of Africa countries specified include Misr [Egypt], Maghrib, Land\r\nof the Blacks, Sehhe, Habashe [Ethiopia] and Zangbar [Zanzibar]. The Nile is the vertical\r\nblue strip descending from Habashe to the Mediterranean, where it arrives between Misr\r\nand Maghrib. In Asia, which occupies the bulk of the map, there are many countries and\r\nprovinces shown from Sham [Syria] in the west to Chin [China] in the east and Khuzestan",
  "19": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 19\t\r\nin the south, to the land of Gog and Magog in the north. Most of the legends, however, are\r\nthose of the various provinces of Persia. In Western Europe the map shows few\r\ncountries, namely Vilayet Rum [Byzantium], Saqaliba [Land of the Slavs], Vilayet Farang\r\n[France], Andalus and further east and near the center, Rus. The Mediterranean is shown\r\nwith three large islands, westernmost of which is Cyprus, the others being Eqrites [Crete]\r\nand Saqalia [Sicily].\r\n The name of Armenia should be on the map, since it appears in the text as well as\r\nin the regional map entitled Surat Arminiya, Arran va Adharbeijan of the same manuscript.\r\nHowever, part of the map, which should have borne this name, is in the fold of the\r\npaper and has been damaged and the writing partially obliterated. The name of Arran\r\nhas also been rendered indiscernible by this damage. These should have been inscribed\r\nin the area between the Caspian, shown as comma-shaped, and the Back sea, which is\r\nthe slanted blue band connecting the Mediterranean, located below center-right, to the\r\nocean below. Only the names of Khazar and Adharbeijan, which are above the damaged\r\narea (south), are partially legible.\r\n \r\nLOCATIONS: Biblioteca Universitaria di Bologna, Cod. 3521, fol. 2r.\r\n Bibliothek der Rijksuniversiteit, MS. Or. 3101, pp. 4-5, Leiden.\r\n 1325 MS copy Iran Bastan Museum, Tehran. Ref. MS.3515, ff. 3a-2b.\r\n \r\nREFERENCES:\r\nBrentjes, S., “Cartography in Islamic Societies”, 36pp.\r\n*Edson, Evelyn, E. Savage-Smith, Medieval Views of the Cosmos, 2004/2011.\r\n*Harley, J. B., The History of Cartography, Volume Two, pp. 112-115, 121-22, 127, Figures\r\n5.3, 5.15, Plate 7.\r\n*Galichian, R., Countries South of the Caucasus in Medieval Maps: Armenia, Georgia and Azerbaijan,\r\npp. 90-101.\r\n*Harwood, J., To the ends of the Earth, 100 Maps that changed the world, p. 44.\r\nKramers, J. H., “La question Balkhi-Istakhri-Ibn Hawkal et l’Atlas de l’Islam”, Acta\r\nOrientalia 10 (1932): 9-30.\r\n*Park, H., Mapping the Chinese and Islamic Worlds, pp. 58-74.\r\n*Pinto, K., “The Maps are the Message: Mehmet II’s Patronage of an ‘Ottoman Cluster’”, pp.155-\r\n179, Imago Mundi, Volume 63:2, p. 201.\r\nPinto, K., “Capturing Imagination: The Buja and Medieval Islamic Mappa Mundi”, Views from the\r\nEdge: Essays in Honor of Richard W. Bulliet, pp. 154-183.\r\n*Pinto, K., Medieval Islamic Maps, pp. 11, 56, 60, 154, 168, 197-98, 201.\r\n*Pinto, Karen, “Interpretation, Intention, and Impact, Andalusi Arab and Norman Sicilian\r\nExamples of Islamo-Christian Cartographic Translation”, Knowledge in Translation, 2018, Chap. 2.\r\n*Pinto, Karen, “In God’s Eyes: The Sacrality of the Seas in the Islamic Cartographic Vision”,\r\nEspacio Tiempo y Forma 5.\r\n*Tibbetts, G. R., “The Balkhi School of Geographers”, History of Cartography, Vol. II, Book I,\r\nCartography in the Traditional Islamic and South Asian Societies, pp. 108-36.\r\n*illustrated\r\n ",
  "20": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 20\t\r\n \r\nFrom al-lstakari’s Kitab al-masalik wa-al-mamalik, dated 1836, British Library, London\r\n Ref. Add. MS Or. 23542, al-Jayhani, f. 59a. 20 x 320cm, diameter approximately 18.5 cm.\r\n \r\n This is a world map drawn in line with the Islamic traditions, taken from al￾lstakari’s original manuscript entitled Kitab al-masalik wa-al-mamalik [Book of Routes and\r\nRealms], a geographical treatise on the whole of the inhabited world. The map has South\r\nat the top and as per the Balkhi School of mapmakers, includes the Mediterranean and\r\nIndian Seas, with other standard features of the Islamic world maps. This is from a\r\nPersian translation of al-Istakhri’s manuscript copy dated 1836.\r\n This manuscript contains 18 other maps of various provinces of the Islamic world,\r\nincluding those of Iraq, Mesopotamia, Egypt, North Africa, the Persian Gulf, Kerman,\r\nKhorasan, Fars, Sahastan [Sistan], Khawrazm [Oxiana], Khazar [Caspian], as well as the\r\neastern region of the Caspian, entitled Arran, Azerbaijan and Arminiya.\r\n The large sea shown on the left is a combination of the Persian Gulf, Arabian Sea,\r\nIndian Ocean and Pacific Ocean shown with four circular islands. The sea on the right is\r\nthe Mediterranean, with the downward curving Aegean Sea leading to the Black Sea,",
  "21": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 21\t\r\ndepicted as the bulge at the end of the curved line (though could conceivably be the\r\nCaspian Sea, which is not shown separately). The Mediterranean is bereft of any islands\r\nhere, and the blue circle at bottom left is the Aral Sea. The large lip-like features on top\r\nof the map are the Mountains of the Moon, thought as being the source of the Nile, while\r\nthe five parallel lines are the five sources, thereafter combining to form the Nile, flowing\r\nnorth into the Mediterranean.\r\n The map shows Arminiya [Armenia] located southwest of the Caspian (or Back\r\nSea), next to Azerbaijan. Countries around the Caucasian Mountains are Arminiya,\r\nAzerbaijan, Khazar, Vilayet Rum and Saqaliba. This map tends towards the more\r\ndecorative rather than true representation of Islamic geography, a truer sample of which\r\ncan be seen in the other illustrations herein.\r\n \r\n \r\nTimurid KMMS world map from al-Istakhri’s Kitab al-masalik wa-al-mamalik [Book of Routes\r\nand Realms], 827/1424, 24 cm diameter, Topkapi Saray Museum, Bagdat 334, fol. 2b, Istanbul\r\nA 10th century version with an unusual orientation to the West",
  "22": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 22\t\r\n Map of the world from the Kitab al-masalik wa-al-mamalik, BL., Or 5305, fol. 3a. Gouache on\r\npaper, 19.2 cm diameter, South at the top. Painted with gold outlines on egg-white polished\r\nEuropean paper. ca 1520. British Library",
  "23": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 23\t\r\n\t Map of the world from the Kitab al-masalik wa-al-mamalik, TSMK A. 2830, fol. 4a. Gouache on\r\npaper, 13.2 cm diameter, 15th century, South at the top. Lavish lapis lazuli and gold pigments.\r\n Topkapi Sarayi Müzesi Kütüphanesi\r\n\t\r\n\t\r\n\t",
  "24": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 24\t\r\n \r\n Map of the world from the Kitab al-masalik wa-al-mamalik, A.S. 2613, fol. 3a. Gouache on\r\npaper, 19.6 cm diameter, South at the top. Lavish lapis lazuli and gold pigments. Sülemaniye\r\nKütüphanesi, Istanbul\r\n \r\n\t\r\n\t\r\n\t\r\n\t\r\n\t",
  "25": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 25\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\nAn Arabic wheel-map, that of Abu Ishaq al-Farisi al-Istakhri and Abu al-Qasim Muhammad idn\r\nHawqal (950-970). Re-oriented with North at the top, it clearly shows the strong tendency to\r\ngeometrical stylization characteristic of the second period of Arab cartography. In the originals\r\n(shown above), South was normally at the top. Note also the curved, eastward extension of the\r\nsouthern part of Africa, a mistake that the Chinese were the first to correct\r\n(from Needham after Reinaud)\r\n\t\r\n\t\r\n\t",
  "26": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 26\t\r\n\t al-Istahri world map, Kitab al-masalik, 1193, oriented with South at the top\r\nLeiden Universiteisbibliotheek, Ms. Or, 3101\r\n\t\r\n\t\r\n\t",
  "27": "",
  "28": "World Map of al-Istakhri\n\n#211\n\n28\n",
  "29": "World Map of al-Istakhri\n\n#211\n\n",
  "30": "World Map of al-Istakhri\n\n#211\n\n30\n",
  "31": "World Map of al-Istakhri\n\n#211\n\n31\n\n",
  "32": "World Map of al-Istakhri\n\n#211\n\n",
  "33": "World Map of al-Istakhri\n\n33\n",
  "34": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 34\t\r\n\t After al-Istakhri. The world, centering on the Persian Gulf. Ottoman province, c. 1820. 26x29\r\ncm. World map in manuscript.\r\nDrawn on paper with water color, ink, gouache and gold highlighting.\r\n \r\nWorld map in manuscript with inscriptions in Arabic showing a map of the world\r\ncentered on the Jezirah. This map is based on al-Istakhri's world map (977/1570\r\nA.D/CE). Oriented with South at the top, just as in the T-O maps of contemporary Latin\r\nEurope (#205), but instead of the Earthly Paradise the Arab scholars knew enough to\r\nplace in the furthest East both China and Tibet.\r\nThe map shows Egypt and the river Nile in the right and further on \"Country of\r\nthe Black People\". Note how the tip of Africa points eastwards, a mistake which the\r\nChinese geographers were the first to correct. In the lower right corner Europe, i.e.\r\n\"Country of the Romans and Franks\".. \" The map shows the Indus in the lower left, with\r\nthe Indian Peninsula, Tibet and the Chinese Empire with the Red Sea colored in red. The\r\nouter circles represent the seas.\r\nThe manuscript is a cosmology, not meant to be accurate geographically, but\r\nonly to present the reader with a systematic overview of the existing knowledge about\r\nthe world at the time.\r\nAccording to Arab geographical theory based entirely on Ptolemy, this would be\r\na sphere. Since the far side of a world sphere (an upside-down world) was practically",
  "35": "World Map of al-Istakhri\r\n#211\r\n\t\r\n\t 35\t\r\ninconceivable, only a hemisphere was thought to be inhabitable. This could easily be\r\n“projected” onto a flat area and represented by a circle.\r\nThat Ptolemy represented the inhabitable world as occupying 180 degrees of the\r\nearth supported this idea. Thus al- Istakhri represented the world as a circle surrounded\r\nby the Encompassing Sea, with the two main seas reaching in from the east and the west\r\ntoward the center, where they would join except for a small, narrow land barrier—the\r\nbarzakh of the Qur’an .\r\nIn his text, al-Istakhri gives a simple description of the world to explain his map.\r\n“The earth is divided into two by the two seas, so that we have a north or cold half and a south or\r\nhot half. People in these two halves get blacker as you go south and whiter as you go north etc.”\r\nThe main kingdoms are listed together with the kingdoms that adjoin them. This is the\r\nonly place where non-Islamic areas are given any mention. Measurements are\r\nattempted; thus the width from the Encircling Ocean in northwestern Africa to the ocean\r\nin China was 400 days’ journey. However, the distance north to south was not\r\nmeasurable. There were 210 days’ journey through inhabitable lands, but the extreme\r\nnorth was uninhabited because of intense cold and the extreme south because of intense\r\nheat. The seas were described briefly, and the fact that the Khazar [Caspian] Sea and the\r\nKhwarazm [Aral] Sea were landlocked is mentioned, as well as the sea connection\r\nbetween the Encircling Ocean and Istanbul—that is, the Baltic joins up to the Bosporus.\r\n \r\n \r\n "
}