{
  "1": "Provided for non-commercial research and educational use only.\nNot for reproduction, distribution or commercial use.\nThis article was originally published in International Encyclopedia of Human Geography, published by Elsevier,\nand the attached copy is provided by Elsevier for the author's benefit and for the benefit of the author's institution,\nfor non-commercial research and educational use including without limitation use in instruction at your institution,\nsending it to specific colleagues who you know, and providing a copy to your institution's administrator.\nINTERNATIONAL\nENCYCLOPEDIA OF\nHUMAN\nGEOGRAPHY\nAll other uses, reproduction and distribution, including without limitation commercial reprints, selling or licensing\ncopies or access, or posting on open internet sites, your personal or institution's website or repository, are\nprohibited. For exceptions, permission may be sought for such use through Elsevier's permissions site at:\nhttp://www.elsevier.com/locate/permissionusematerial\nBrentjes S. 2009. Cartography in Islamic Societies. In Kitchin R, Thrift N (eds) International Encyclopedia of\nHuman Geography, Volume 1, pp. 414-427. Oxford: Elsevier\nISBN: 978-0-08-044911-1\nCopyright 2009 Elsevier Ltd.",
  "2": "Author's personal copy\nCartography in Islamic Societies\nS. Brentjes, Universidad de Sevilla, Sevilla, Spain\n© 2009 Elsevier Ltd. All rights reserved.\nGlossary\nAl-Bahr al-Muhit The Encompassing Sea.\nBarzakh A small, narrow land barrier that separates\nthe two main oceans of the maps, that is, the Indian\nOcean and the Mediterranean Sea. The main Quranic\nmeaning of barzakh is, however, not geographical, but\neschatological. It denotes the life of the soul after the\ndeath of the body until the Day of Judgment.\nDar al-funun House of the Disciplines/Sciences/Arts,\nnew school of higher education for the Qajar army and\nadministration, founded in 1851; taught European\nmilitary methods, theories, technologies, sciences\nincluding geography and cartography and languages.\nHadith A body of religious teachings about what the\nProphet and his companions had said and done.\nHudud Boundaries, the word has also other meanings\nsuch as definitions.\n'Ilm al-hay'a Mathematical cosmography.\nIsolarii Books about islands, produced in Italy.\nMi'raj Ascent to the heavens.\nMount Qaf Often drawn on world maps around the\nEncompassing Sea; this is derived from an interpretation\nof Sura 1.1 according to which God created a mountain\nchain at the edge of the earth out of a single green\nemerald. This chain is called Mt. Qaf.\nQibla Indicates direction toward Mecca, hence prayer\ndirection, also direction regulating other social activities\nsuch as the way in which a dead body is laid to rest.\nSīlā Island\nKorea.\nthat is, Hajji Khalifa's (d. 1067 h/1657) Cibānnāmā (version\nII). These printed maps adopted and adapted certain\ncartographic conventions, methods, and fields of interest\nthat dominated cartography in early modern Catholic and\nProtestant societies in Europe. This was, however, neither\nthe first nor the last encounter between the various\ncartographic traditions and practices as pursued in various\nsocieties around the Mediterranean basin. The length and\ndepth of the history of these cross-cultural encounters\nrenders the notion of a history of cartography in well-\ndefined geographical and cultural spaces that formed\nseparate entities difficult to sustain.\nCartographic products independent of manuscripts or\nprinted books appeared primarily in cultural fields out-\nside the sphere of education and knowledge production.\nNavigation, war, water administration, architecture,\nlandscape design, religious ritual, and gift giving were\nsuch domains where self-contained cartographic prod-\nucts are known to have existed in several Islamic societies\nor are preserved in libraries, museums, and collections\nacross the world. Military maps gained increasing im-\nportance during the nineteenth century. In the twentieth\ncentury, private and state institutions for cartography and\nsurveying were founded in Iran, Turkey, and Arab\ncountries. They produced a broad variety of thematic\nmaps, among them street maps, historical maps, me-\nteorological maps, geological maps, and maps for tourism.\nThese new cartographic products were supported by new\nmethods and techniques of surveying, displaying, re-\nsearching, measuring, and representing.\nIn Islamic societies, cartographic activities were part of Cultures of Mapmaking\ncourtly patronage and diplomatic exchange, educational\nliteracy and scientific study, religious rituals and remin-\niscence, entertainment and the arts, and to some extent of\nwar, seafaring, and administration.\nMany of the extant cartographic products are parts of\nmanuscripts. Words, narratives, numbers, tables, and geo-\nmetrical figures organize, structure, delineate, and inter-\npret them. Books with maps form several topical categories\nas well as genres. They include cosmography, astronomy,\nhistory, and geography on the one hand and pilgrimage\nbooks, encyclopedias, dictionaries, and miscellanies on the\nother. The most important types of cartographic products\nare world maps, regional maps of the Islamic world, and\nmaps and diagrams of the prayer directions, the qibla. The\nfirst printed maps appeared in the early eighteenth cen-\ntury in Istanbul, first as single-sheet maps, but quickly\nfollowed as parts of a book on the Old and the New World,\nMapmaking in Islamic societies took its themes, methods,\ntechniques, and formats from several societies that either\nexisted before the emergence of Islamic societies or\nparallel to them. The regions where these societies\nflourished were Greece, Egypt, Iran, India, China, Spain,\nItaly, the Netherlands, and France. With the shifts and\nchanges in Europe since the sixteenth century, further\nEuropean societies became relevant to cartographic ac-\ntivities in various Islamic societies, among them Russia,\nGerman countries, and Great Britain.\nThe two earliest appropriations of cartographic products\nand practices from other cultures, which shaped mapmak-\ning in Islamic societies for more than 500 years, occurred\nduring the eighth and ninth centuries in Abbasid Baghdad\nand other regions of the empire. One of the two cross-\ncultural encounters is represented through the translations\n414",
  "3": "Author's personal copy\nof Ptolemy's Geography into Arabic during the ninth century\nand their subsequent appropriation and adaptation to the\ninterests of scholars. These translations were made in the\ncircle of the Abbasid courtier and son of the Arab governor\nof Kufa, the philosopher Abū Yusuf Ya'qub b. Isḥāq al-Kindī\n(d. c. 260 h/874), and the Sabean moneylender, mathem-\natician, astronomer, philosopher, and theologian Thabit\nb. Qurra (d. 288 h/901). The other encounter had its basis in\na series of maps of possibly Sasanian origin that were re-\nproduced in Arabic, although it is unclear when this took\nplace. These maps were adapted during the ninth and tenth\ncenturies to the new political and religious powers and\nstructures in Iran, the Arabian Peninsula, and Northern\nAfrica. Step by step the original set of maps was enriched by\nmaps of new regions of the Islamic world and accompanied\nby descriptions of the mapped territories and their cultures.\nThe two encounters led to different views on how to\norganize and represent the world and its parts. Maps in\nthe tradition of Ptolemy's Geography worked with pro-\njections, latitudes and longitudes, grids, occasionally\nscales, and the theory of astronomically defined climates,\nmostly seven in number. They often contain short ref-\nerences to uninhabitable parts of the earth due to ex-\ncessive cold or heat derived from Aristotelian physics and\nmeteorology. The geographical space represented in such\nmaps was first and foremost the entire world. It was\nmapped as a sphere or as a semisphere. Over time, such\nworld maps focused more and more on the Islamic world.\nBut certain regions of the world outside of Islamic so-\ncieties continued to be reported about such as China, Sri\nLanka, Byzantium, or the land of the Slaves. In addition\nto the world maps, maps of oceans, seas, rivers, and is-\nlands are extant from this cartographic encounter. These\nlocal maps show clear non-Ptolemaic features. They may\nbe the result of the mapmakers' efforts to translate textual\nand oral geographic information into images. The people\ninvolved in this cartographic tradition were primarily\nscholars of the mathematical sciences which comprised in\nIslamic societies in continuation of earlier Greek models\nnumber theory, geometry, theory of proportions, and\nastronomy. The most important representatives of this\ntradition in Islamic societies were the lost maps produced\nin the early ninth century for the Abbasid caliph al-\nMa'mun (r. 198-218 h/813-33), the maps extant in\nMuḥammad b. Mūsā al-Khwārazmi's (fl. late second-early\nthird century h/late eighth-early ninth century) Şurat al-\nard (image/form of the earth), the maps extant in copies\nof the new Arabic translation of Ptolemy's Geography\nmade by Georgios Amirutzes (d. 1475) and his son for the\nOttoman Sultan Mehmet Fatih (r. 849 h/1444 and 855-86\nh/1451-81), and the maps found in the geographical\nchapter of texts on ilm al-bay'a (mathematical cos-\nmography) such as Nizam al-Din al-Nīsābūrī's (d. 730 h/\n1329) Tawdiḥ or Sharb al-Tadbkira (explanation of or\ncommentary on the 'Memoir') (Figure 1).\nCartography in Islamic Societies 415\nMaps derived from possible Sasanian models worked\nwith geometrical figures such as circles, semicircles,\ncrescents, triangles, rectangles, ovals, and straight lines to\nrepresent regional units, directions, and distances. Their\nfocal points are the postal and pilgrimage routes within\nthe Abbasid Empire and other Islamic states, for instance,\nin al-Andalus and the main parts that formed the Abbasid\ncaliphate. The views on what these parts were and which\nrank each part assumed in relationship to the others\ndepended largely on the outlook the mapmaker and\ncommentator subscribed to a preference for Iranian\ncultural values, a preference for Islamic values, or a\npreference for his own environment and travel experi-\nences. The set of maps created within this tradition in-\ncluded as a rule a world map and in most cases 21\nregional maps. Most of the world maps in the extant\nmanuscripts show the world as a full circle; but there are\nalso manuscripts from as early as the tenth century and as\nlate as probably the seventeenth or eighteenth century\nthat show the world as a bird. The distribution of the\nregions over the body of the bird varies. China or Arabia\ncan be found as the head. India, the land of the Khazars in\nthe Northern Caucasus Mountains, Asia, or Africa fill the\nwings. The tail is taken up by Northern Africa or Europe.\nThe world maps show cosmological concepts such as al-\nBabr al-Mubit (the Encompassing Sea) also known from\nmuch earlier cultures and religious concepts specific\nto the Qur'an and other sources of Muslim belief such\nas the barzakh, a small, narrow land barrier that separates\nthe two main oceans of the maps, that is, the Indian\nOcean and the Mediterranean Sea. The main Quranic\nmeaning of barzakh is, however, not geographical, but\neschatological. It denotes the life of the soul after the\ndeath of the body until the Day of Judgment. The\nprovinces and regions in these world maps are mostly\nregistered in form of rectangular tables or stripes of\nboxes. They also include countries outside the Islamic\nworld such as India or China. A few cities such as Mecca\nor Alexandria, rivers and occasionally their sources, is-\nlands and tribes are also noted. The regional maps focus\nentirely on the Islamic world. They map Iran, Central\nAsia, parts of the Caucasus Mountains, the Arabian\nPeninsula, Iraq, the Fertile Crescent, Northern Africa,\nand three seas (the Persian Sea that is the Indian Ocean;\nthe Mediterranean Sea; the Caspian Sea). The sequence\nof the mapped regions and their relative delineation\ndiffers from my naming them in the sense that most\nextant manuscript maps show the following order and\ncontent: Arabia; Persian Sea; al-Maghrib (Northwest\nAfrica); Egypt; Syria; Mediterranean Sea; al-Jazira\n(Northern Iraq and Southeast Turkey); Iraq (Central and\nSouth Iraq); Khuzistan; Fars; Kirman (parts of Iran); Sind\n(part of Pakistan); Armenia, Arran, Azerbaijan (part of\nCaucasus Mountains, Azerbaijan, and Iran); Jibal; Day-\nlam, Rayy, Tabaristan (parts of Iran), Caspian Sea;",
  "4": "Author's personal copy\n416 Cartography in Islamic Societies\n地\nFigure 1 Ptolemy, Geographike Hyphegesis, Arabian Peninsula, Arabic translation by Georgios Amyrutzes, MS Istanbul,\nSüleymaniye Kütüphanesi, Aya Sofya 2610, pp 198-199. Courtesy of Süleymaniye Kütüphanesi.\nPersian Desert; Sijistan; Khurasan (parts of Iran, Turk-\nmenistan, Pakistan, Afghanistan); and Mã wara' al-nahr\n(part of Uzbekistan) (Figure 2).\nThe people creating maps and writing texts in this\ncartographic tradition were mostly members of the Ab-\nbasid administration for which they worked as officers of\nthe postal routes or of the finances, philosophers, and\nscholars of religious disciplines, or wealthy, independent\ntravelers and merchants. After its first famous prac-\ntitioner, the geographer, mathematician, astronomer,\nphysician, philosopher, and student of al-Kindi, Abū\nZayd Ahmad b. Sahl al-Balkhi (d. 322 h/934), this\ntradition is called the Balkhi school of geography. Other\nmajor representatives of this school were Abū Ishaq\nIbrahim b. Muḥammad al-Istakhri (fourth century\nh/tenth century), Abū l-Qasim Muḥammad b. Hawqal (d.\nc. 367 h/977), and Abū 'Abdallah Muḥammad b. Aḥmad\nal-Muqaddasi (d. c. 390/1000). The earliest maps sur-\nviving from this body of works belong to a manuscript of\nIbn Hawqal from 479 h/1086 extant in the Topkapı\nSarayı Müzesi Kütüphanesi in Istanbul.\nThe most pervasive feature of maps in Arabic, Persian,\nand Ottoman Turkish after the centuries of translation,\nadoption, and adaptation is, however, their combination\nof more than one cultural tradition of cartography. World\nmaps attached to geographical, cosmographical, or his-\ntorical texts combine between the eleventh- and the\nsixteenth-century elements of the Ptolemaic tradition\nwith the components of the Balkhi school to which their\nmakers added further elements taken from the Qur'ān\nand contemporary developments in politics, commerce,\nwar, or demography. Mount Qaf, another Quranic\nconcept, appears for instance as a mountainous ring\nenclosing the Encompassing Sea in maps joined to geo-\ngraphic manuscripts such as Abū 'Abdallah Muḥammad\nb. al-Sharif al-Idrisi's (495- c. 560 h/1100- c. 1165)\nNuzhat al-mushtaq fi 'khtiraq al-afaq (The Pleasant Journey of\nThose Who Desire to Travel through Faraway Lands), to texts\nseen as popularizing scientific ideas such as Zakariya' al-\nQazwini's (d. 682 h/1283) Kitab ajaib al-makblūgāt fi\ngbara'ib al-mawjūdāt (Book of Marvels of Things Created and\nMiraculous Aspects of Things Existing), and to texts of a",
  "5": "417\nلاد الشام\nAuthor's personal copy\nCartography in Islamic Societies\nالشمال\nصورة الجزيرة\nلاد الجزيرة\nلاجان\nافانه\nالتاليه\nG\nراق\nالحديثة\nالجنوب\n39\nFigure 2 Şürat al-Jazira (Image of the land between the Tigris and the Euphrates), MS Istanbul, Topkapı Sarayı Müzesi Kütüphanesi\nAhmet III.1285, f 39a (dated 1285). Courtesy of Topkapı Sarayı Müzesi.\nmore religious character such as the Kharīdat al-'aja'ib\nwa-faridat al-gbara ib (The Unbored Pearl of Wonders and\nPrecious Gem of Marvels) attributed to Siraj al-Din Abū\nHafs 'Umar b. al-Wardī (d. 861 h/1457). The maps to The\nBook of Curiosities, a twelfth-century manuscript on as-\ntronomy, geography, commerce, and wondrous things\ncopying a work of the eleventh century, include already\nthe famous circular map ascribed to al-Idrīsī. It also has a\nrectangular world map and maps of the Indian Ocean, the\nMediterranean Sea, Cyprus, Sicily, maps of great rivers\nsuch as the Nile, the Euphrates, and the Tigris, maps of\nthe former Fatimid capital al-Mahdīya and the Egyptian\ntown of Tinnis, and maps of lakes. The author, in all\nlikelihood a Fatimid custom officer, combined conceptual\nand technical elements of the Ptolemaic tradition such as\nclimate zones, geographical coordinates, a scale, and the\nconfiguration of the Old World with symbolic features\nfrom al-Khwārazmi's maps such as the depiction of\nthe Mountains of the Moon as sources of the Nile\nand conceptual and representational elements of the\nBalkhi school such as the representation of rivers by\nstraight lines or lakes by circles to which he added\ninformation from travelers, texts, and perhaps adminis-\ntrative documents. He chose some unique and not yet\nwell-understood forms of representation for the Medi-\nterranean Sea and the Indian Ocean (an oval) and for\nCyprus (a rectangle divided into smaller units of rect-\nangles and text) (Figure 3).",
  "6": "418\nAuthor's personal copy\nCartography in Islamic Societies\nFigure 3 Book of Curiosities, Rectangular World Map, MS Oxford, Bodleian Library, Ar.c.90, ff 23b-24a. Courtesy of Bodleian Library.\nAl-Sharif al-Idrīsī and his geographical and carto-\ngraphic work represent another kind of cross-cultural\nencounter since he lived in more than one of the\nMediterranean cultures. He was born in Ceuta, received\nhis education in al-Andalus, and traveled widely in the\nIslamic world. Then he worked for two Norman kings,\nRoger II (r. 1097-1154) and William I (r. 1154-66) at their\ncourt in Palermo. At the end of his life, he returned to the\nIslamic world, possibly to Ceuta. Conceptually, he fol-\nlowed Ptolemaic cartographic theory and methods. He\nproduced two sets of new maps. One was a circular world\nmap engraved on a silver plate, which is lost. The other is\na set of 70 regional maps drawn on paper. They are extant\nin various manuscripts across the world. Al-Idrīsī planned\nto combine them into one large rectangular map of the\nknown world stretching from 180° in the east in the Sīlā\nIsland (Korea) to the prime meridian in the west running\nthrough the Fortunate Isles. Presenting Roger not only as\na successful conqueror and master of politics, he de-\nscribed him as the head of the cartographic project who\ndecided on what geographical and cartographic truth was.\nOne method applied for sorting out conflicting infor-\nmation was to trace with iron instruments on a drawing\nboard all data on longitudes, latitudes, and distances. Al-\nIdrīsī wrote two, perhaps even three geographical texts,\nall of them lavishly illustrated with regional maps por-\ntraying the entire world in a combination of Ptolemaic\nconcepts with ideas and symbols taken from the Balkhī\nschool. He also had access to non-Arabic oral and per-\nhaps written sources and provided fresh information\nabout the physical and cultural geography of European\nlands, not available previously in Arabic.\nAlmost all of Ottoman mapmaking is best described as\na highly flexible merging of cartographic and artistic\nlanguages from all major cultural traditions the Ottoman\nEmpire drew upon, cooperated and traded with, and\nfought against. While these mergers are often seen as a\nreflex of Ottoman cultural and scholarly inferiority, the\ncultural dynamics and force that brought forth such\nmergers cannot be overrated. If nothing else, the people\ninvolved in producing such eclectic maps were capable of\nreading and understanding different geographical con-\ncepts, philological descriptions, and iconographic repre-\nsentations. A fair amount of concrete cross-cultural work\nwas needed in order to interpret foreign maps and make\ntheir copies and translations into Ottoman Turkish ac-\nceptable for the local consumer. As is well known and can\nbe demonstrated for a number of the preserved Ottoman\nmaps designed from the sixteenth to the eighteenth\ncenturies, even the copyists participated in this process of\ncross-cultural adaptation.\nFour major cultures of mapmaking arose in the Ot-\ntoman realm. Two of these cultures, the making of por-\ntolan charts and the creation of maritime handbooks with\nmaps of Mediterranean islands, coasts, and fortresses,\nwere closely interconnected. They combined several\nprevious mapmaking traditions from different Medi-\nterranean cultures, mainly Arabic, Catalan, and Italian\nportolan charts, regional maps, and isolarii. They were\napparently primarily designed by members of the Otto-\nman navy. Scribes and painters from imperial as well as\ncommercial workshops participated in executing the fine\ncopies. Specialized mapmaking workshops existed in the\nmiddle of the seventeenth century in Istanbul. Almost all\nextant specimens were made for acquiring courtly pat-\nronage or to be given away as gifts. In particular the maps\nillustrating the various copies of Pīrī Re'is' (c. 875-961 h/\n1470-1554) two versions of the Kitab-i Bahriye (Maritime\nHandbook) are wonderful products of art. Some of them\nshow the inclusion of Renaissance painting techniques,",
  "7": "Author's personal copy\nCartography in Islamic Societies 419\nwhile others are splendid experiments in colors and\nsymbolic interpretations of physical objects (Figure 4).\nThe two other main Ottoman mapmaking cultures were\nsituated directly in the courtly sphere. One of them consists\nof town views and itineraries in official histories mapping\nOttoman military campaigns, adversaries, and imperial\narchitecture. Their execution was the task of the painters of\nthe imperial painting workshops. As a result, many are\nsuperb exemplars of Ottoman fine arts. (Figure 5).\nThe other mapmaking culture began to appear during\nthe sixteenth century when Arabic and Persian models of\nworld maps became to be replaced gradually by models\nfrom Italy and then from the United Provinces, France,\nand German countries. Partial or full translations of\nbooks on the New World, a Latin edition of Ptolemy's\nGeography, Abraham Ortelius' Theatrum Orbis Terrarum,\nGerard Mercator's and Henricus Hondius' Atlas Minor,\nWillem J. and Joan Blaeu's Atlas Maior, and other geo-\ngraphical and cartographic works produced in different\nCatholic and Protestant countries of Europe were\nundertaken by Ottoman scholars, often in collaboration\nwith members of the religious minorities living in the\nOttoman Empire or with converts from Catholic or\nProtestant Europe. The maps of these books had a pro-\nfound impact on Ottoman mapmaking. The changes,\nhowever, did not constitute a unilateral Westernization,\nنه اسیکی ادوی\nشكال\nFigure 4 Piri Reis, Kitāb-i Bahriye (Maritime Handbook), The Island of Rhodes, MS Istanbul, İstanbul Üniversitesi, T6605, f 100a.\nCourtesy of İstanbul Üniversitesi.",
  "8": "420\nAuthor's personal copy\nCartography in Islamic Societies\nFigure 5 Szigetvár, Ahmed Feridun, Nüzhet Esrar el-Ahbar der Sefer-i Sigetvar (Present of the Secrets of Information on the Journey to\nSzigetvár), MS Istanbul, Topkapı Sarayı Müzesi Kütüphanesi H. 1339, ff 32b-33a (copied in 1568-69). Courtesy of Topkapı Sarayı Müzesi.\nFigure 6 Willem and loan Blaeu, Atlas Maior, Translation ascribed to Abu Bakr al-Dimashqi, Asia, MS Istanbul, Süleymaniye\nKütüphanesi, Nuruosmaniye 2995, before f 104a. Courtesy Süleymaniye Kütüphanesi.\nto use an anachronistic term. Translators, scholars,\ncopyists, calligraphers, painters, and trainees, and tea-\nchers of the Ottoman army transformed the translated\nmaps in a variety of ways into maps accessible to Otto-\nman spectators and situated them firmly within Ottoman\nvisual, geographic, and literary cultures (Figure 6).\nCartographic Genres and Practices\nIn addition to the world and regional maps, portolan\ncharts, and handbooks for sailing directions discussed in\nthe previous section, a number of other cartographic\nformats were developed in Islamic societies. Early in\nthe ninth century, or perhaps even in the eighth century,\nthe question of how to determine from any given place\nthe direction toward Mecca was raised. David A.\nKing claims that there were two cartographic worlds\nin Islamic societies with respect to the qibla. Mathemat-\nicians, astronomers, and mathematical geographers\ninhabited one of these two worlds. They developed\ntrigonometric, projective, arithmetic, and other exact\nor approximate methods for solving the problem\n(Figure 7).",
  "9": "Author's personal copy\nCartography in Islamic Societies 421\nLegal scholars, students of the religious traditions,\ndescriptive geographers, folk astronomers, and cos-\nmographers who focused on miracles, wonders, and\nnarrated histories populated the other. They relied on\nḥadīth, a body of religious teachings about what the\nProphet and his companions had said and done, on\nastronomical and meteorological alignments ascribed to\nthe Ka'ba since pre-Islamic times, and on practices of\ntravelers.\nAmong the various methods used for mapmaking,\ngrids, coordinate frames, and scales played roles that are\nnot always easily discernible. Some mapmakers applied\nthem as mathematical tools, while others apparently saw\nin them primarily symbolic statements about the possi-\nbility of mapping the world mathematically. Grids were\nused in rectangular and circular maps. Rectangular grids\nwere applied in world maps such as the one made for al-\nMa'mun and by Suhrab (fl. first-half fourth century h/\ntenth century), for regional maps and world maps illus-\ntrating historical works or encyclopedias such as the\nMasalik al-absar fi mamalik al-amsar (Ways of Perception\nConcerning the Most Populous [Civilized] Provinces) compiled\nby the Mamluk judge and administrator Ibn Faḍlallah al-\n'Umari (691-749 h/1301-49). Suhrāb described his\nr\n90\n12\nسواس\n00\nلكه ك\nاسکندریہ\nت المقدس\nکر دبان\nاصفهان\nشاکاره\nکرمان\n4\nنفعان\nعرض\nسونات\nاصفهان\nA\n42\nسه عه ت له سه\nFigure 7 Qibla Map, MS Paris, BnF Perse 169, f 42a. Courtesy Bibliothèque nationale de France.",
  "10": "Author's personal copy\n422 Cartography in Islamic Societies\nmethod as starting with a rectangle, followed by dividing\nthe edges into degrees and marking the equator. Then he\ndrew the horizontal lines that separate the climates. For\npositioning the localities he stretched two threads over\nthe rectangle, one horizontally, the other vertically. Lost\nworld maps made before 1500 may have worked with\ncurvilinear grids as does the only extant exemplar of such\na type attached to a manuscript of al-'Umari's work. The\nmeaning of this grid has been interpreted differently by\nFuat Sezgin who believes the grid to be a stereographic\nprojection and the map to represent the map made for al-\nMa'mun and by David A. King who points to the several\nerrors in the grid and al-'Umari's explanation and refers\nto historical evidence contradicting the identification of\nthis map with that made for al-Ma'mūn.\nCoordinate frames and scales appear early on maps\nmade in Islamic societies. Several maps, however, are\ninscribed merely with one set of the coordinates, mostly\nlongitudes, and the placement of the equator on which\nthey are noted varies. Scales too show contradictory in-\nformation. Such features are often taken to illustrate a\nlack of mathematical knowledge on the side of the\nmapmakers. The quality and care invested in some spe-\ncimens of this kind and the people involved in the pro-\nduction of the manuscripts where they are found make\nsuch a reading unlikely. An example is the world map\nattached to one of the anthologies produced for the\nTimurid prince Iskandar Sultan (r. 812-17 h/1409-14).\nSimple circular as well as quadratic schemes were\nused for organizing geographical knowledge for religious\nand divinatory purposes. Such diagrams could evolve\ninto small-scale maps since they linked either the Ka'ba\nor major religious monuments in Mecca with the indi-\nvidual sectors of the circle and the regions or towns in-\nscribed in them. They often group a multitude of\nlocalities behind one specifically chosen town whose qibla\nserves as a marker or representative for all the other\ndirections. The effect of such an arrangement was di-\ndactic and mnemonic in the same time. The earliest\nknown scheme of this kind is found in a manuscript copy\nof Ibn Khurradadhbih's (third century h/ninth century)\nKitāb al-masālik wa'l-mamalik (Book of the Routes and Prov-\ninces). It consists of four sectors of the world, each one of\nthem being connected with a part of the Ka'ba - Maghrib,\nEgypt, Syria, al-Jazira; Iraq, Armenia, Kashmir; Mansūra,\nTibet, China; Yemen. Over time, the schemes became\nmore elaborate and could comprise as many as seventy\ntwo divisions. In addition to the schemes, maps and in-\nstruments for finding the qibla were created. The most\nsophisticated, Mecca-centered map was engraved on\nthree astrolabes made by Safavid instrument makers in\nthe late seventeenth century.\nClimatic zone charts are a further type of diagram-\nmatic schemes that were widely used in geographical,\ncosmographical, astronomical, and historical treatises and\ndictionaries for illustrating the theoretical division of the\nearth as taught by natural philosophy and astronomy. Its\nwidespread appearance across the disciplines and literary\ngenres is but one indicator of the depth at which the\nintellectual outlook in Islamic societies was permeated by\nscientific elements of ancient Greek origin. A very simple\nexemplar of these kinds of diagrams is found in Sharaf al-\nDīn al-Mas'udi's (545-after 613 h/1150-after 1216) Jaban\nDanish (Knowledge of the World), a book on astronomy, as-\ntrology, and geography written in (549 h/1154-55).\nThree unnamed circles enclose eight parallel, equidistant\nlines identified at the right as demarcating the seven\nclimates. Geographical features such as oceans, islands,\nand countries are sparsely marked by words alone. Nu-\nmerous Arabic, Persian, and Ottoman circular and\nsemicircular world maps also show such a scheme of\nclimatic zones. The division into climates became the\nmost important format of structuring the physical world\nin maps as well as texts. It was applied to maps of the\nPtolemaic tradition, maps working within the tradition of\nthe Balkhi schools, and maps derived from early modern\nEuropean maps. Examples are the semicircular world\nmap in 'Ayn al-Zaman's Hasan b. 'Ali Qattan Marwazi's\n(465-548 h/1072-1153) Gayban Shenakht (Constructing the\nWorld) and the circular maps for Iskandar Sultan, the Book\nof Curiosities and Mehmet b. 'Alī Sipāhī-zādeh's (d. 997/\n1589) Turkish translation of his Awdab al-masalik fi ma'rifat\nal-buldan wa'l-mamālik (Explanation of the Routes about the\nKnowledge of Places and Provinces).\nFunctions and Purposes\nMaps, charts, plans, diagrams, and tables served a variety\nof functions and purposes in Islamic societies although\nthe bulk seems to have spent their life in manuscripts,\nthat is, in the spheres of educated readers. The earliest\nusage of maps seems to have happened when the armies\nof the newly converted Arab tribes invaded regions of\nIran and Central Asia. The governor of the eastern parts\nof the Umayyad Empire, al-Hajjaj b. Yusuf (d. 95h/714),\nis said to have ordered a map of Daylam, a mountainous\nregion south of the Caspian Sea, before attacking it in\nc. 83 h/702. Five years later, when planning to lay siege at\nBukhara, he ordered a plan of the city. Plans or sketches\nare also reported for planning in 141 h/758 the new\ncapital Baghdad of the Abbasid caliphate and possibly for\nwaterworks in the swamps near Basra made for the sec-\nond Abbasid caliph al-Mansur (r. 136-58 h/754-75). The\nnext time that sources report of maps, sketches, or plans\nfor military purposes occurs in the Ottoman Empire.\nLaying siege to cities and fortresses such as Constan-\ntinople, Szigetvār, Vienna, Baghdad, or the fortresses of\nthe Order of St. John at Rhodes and Malta included the\ndrawing of sketches and plans, while the actual warfare",
  "11": "Author's personal copy\nmade use of compasses for tunneling the walls. It is only\nafter the treaty of Karlowitz in 1699, that maps became an\nimportant tool for the Ottoman army for settling\nboundary disputes and negotiations over lost territories.\nTax collection and market regulation, on the other\nhand, were subjects that apparently rarely worked with\nmaps, and the manuals written about these themes were\nseldom illustrated with more than the simplest diagrams.\nThis is, according to Ahmet T. Karamustafa, even true for\nthe Islamic society with the broadest use for maps and\nthe widest array of types of maps - the Ottoman Empire.\nDifferent bodies of the Ottoman state used maps and\nplans that visualized waterways and channels, archi-\ntecture, and navigation in the Mediterranean and the\nBlack Sea.\nA central function of maps in Islamic societies was to\nindicate religious beliefs, support the believer in carrying\nout her or his religious duties, and help her or him re-\nmember the visits to the Holy shrines. A further religious\ntheme illuminated by maps relates to the Prophet's mi'raj\n(ascent to the heavens). Maps functioned as instruments,\ntools, and pictorial narratives. They were turned into\nsouvenirs and certificates (Figure 8).\nMaps also served as objects of art and diplomacy.\nFatimid world and regional maps were produced on costly\nsilks embroidered with gold and colored silk threads.\nConsequently, they were stored with other valuables in the\nprincely treasury rooms. The anonymous author of the\nKitāb al-Hadaya wal-Tubaf (Book of Gifts and Rarities) when\ndescribing the treasures stored by the Fatimid rulers ex-\nclaimed that among them several hundreds, close to a\nthousand silk drapes were found that represented king-\ndoms with their kings. He marveled at the precious ma-\nterial used for this display of royal splendor and possession\nand emphasized that these drapes showed a portrait of\nevery king, his name, the span of his reign, and an account\nof his life. At least four more courts are known where maps\nwere either painted on silk or engraved on silver plates -\nthe court of the Khwarazmshah Sultan 'Ala' al-Din\nMuḥammad (r. 596-617 h/1199-1220) in Khiva, the court\nof the Ilkhanid ruler Ghāzān Mahmud (r. 694-703 h/\n1295-1304) in Tabriz, the Norman court of Roger II (d.\n1154) in Palermo, and the Ottoman court in Istanbul (857-\n1341 h/1453-1922). Except for Ottoman maps on silk,\nnone of these maps are extant.\nIn various contexts, maps were treated like miniature\npaintings. Outstanding examples are the world map for\nIskandar Sultan mentioned above, maps in a manuscript\nof the Beyan-i Menazil-i Sefer-i Irakeyn-i Sultan Süleyman\nHan (Explanation of the Stops in Sultan Süleyman Khan's\nTravel to the Two Iraqs) (944 h/1537-38) by Matrakçī\nNasūḥ (d. 971 h/1564) commemorating Sultan Süley-\nman's (r. 926-74 h/1520-66) successful military cam-\npaign of 941 h/1534-35 against his Safavid neighbor\nShāh Tahmāsb (r. 930-84 r/1524-76), and maps in\nCartography in Islamic Societies 423\neighteenth-century manuscripts of Hajji Khalifa's\nCibānnümā (version II).\nA fourth function of maps was their capacity to\nmemorize historical events and portray princely power\nand splendor. The most splendid examples of maps as\nconstructs of historical memory are found in books de-\nscribing and eternalizing the feats of the Ottoman sultans.\nMany of the views of cities and ports found in Ottoman\nhistories since the early sixteenth century celebrate ei-\nther their conquest by an Ottoman sultan or an attack by\na fleet in Ottoman service. According to J. M. Rogers they\nwere also meant to visualize \"the pomp and circumstance\nof the Ottoman court\". The composition of the views\nusually includes a representation of an abstract landscape\n- some mountains, some flowers, some herbs, occasion-\nally also trees and animals. This theme of the landscape,\nits elements, and its colors is borrowed from miniature\npainting. The major difference between the maps and the\nminiatures is the complete lack of human beings in al-\nmost all maps of this genre.\nA different, but equally splendid construction of im-\nperial allegory can be found in miniatures produced for\nthe Mughal rulers Jahangir (r. 1014-37 h/1605-1628) and\nShah Jahan (r. 1037-1068 h/1628-1658). Both rulers were\nkeen to express their imperial claims by relying sym-\nbolically on the image of a globe with or without de-\npictions of lands and seas. A series of images painted by\nMuslim and Hindu court painters between 1614 and\n1658 stress the legitimacy of the ruler as a dutiful son,\njust defender of the interests of his subjects, and pious\nfollower of the saints. Jahangir also used the globe for\ndepicting his relationship to his most powerful Muslim\nneighbor outside of India, the Safavid Shāh 'Abbas I\n(r. 986-1038 h/1587-1628). The portrait, called Jahangir's\nDream, shows Jahangir as the superior and benign ruler\nwho is connected by friendship with his smaller neighbor.\nBoth stand on a world map that reflects knowledge of\nWestern cartographic developments. Two animals rest at\nthe feet of the two rulers, a lion and a lamb. The juxta-\nposition of lion and lamb symbolized the peaceful\ncoexistence of natural enemies, of irreconcilable contra-\ndictions, hence the highest good a just ruler could\nachieve. The symbolic globe also figures in other por-\ntraits of Jahangir, which describe his successful squelch-\ning of Khurram's rebellion, the later Shah Jahan, and his\ndesire to destroy his political and military rival Malik\n'Ambar, minister to the rulers of Ahmadnagar from 1596\nto 1626. The minister valiantly opposed Mughal imperial\nambitions in the Deccan and pursued a policy of steady\nrecovery of territory conquered by Shah Akbar late in the\nsixteenth century. It was only 'Ambar's death in 1626 that\nopened the Deccan to Mughal invasion. The miniature of\nJahangir shooting at a beheaded and speared Malik\n'Ambar while standing on a complex cosmological alle-\ngory composed of a terrestrial globe seated both on an",
  "12": "424\nAuthor's personal copy\nCartography in Islamic Societies\nمام شيخ المحو المحترم كبته الله\nنیا سعادت امین و شهر را\nبا مبنای رمانی تریفه\nFigure 8 View of Mecca and its pilgrimage stations, MS Jena, University Library Prov. q. 215, f 6b. Courtesy of the University Library\nof the University of Jena.\nelephant and a huge whale surrounded by a wealth of\nother symbolic elements expresses the magnitude of\nemotions roused in Jahangir by the obstacle the Deccani\nminister of Ethiopian origin posed to fulfilling his im-\nperial dream.\nMost Islamic maps before the eighteenth century ig-\nnore political space in favor of cultural space. Elements\nthat may signal political entities such as boundaries,\nemblems, names of dynasties, flags, or monuments rarely\noccur at all on Islamic maps before 1700. Maps of the\nso-called Balkhi school indicate boundaries (budūd)\nexplicitly, but they are not boundaries separating differ-\nent states or kingdoms, but boundaries dividing the Is-\nlamic world into administrative subunits. In contrast to\ngeographical writings, which even stressed the linkage\nbetween geography and history, maps produced in Is-\nlamic societies before the sixteenth century did not ex-\npress this disciplinary neighborhood.\nA similar reluctance to deal with the political com-\nposition of the world can be seen in maps illustrating the\nmanuscripts of Hajji Khalifa and Abu Bakr al-Dimashqi\n(d. 1102 h/1691). In the autograph of the translation of",
  "13": "Author's personal copy\nCartography in Islamic Societies 425\nthe Atlas Minor, Hajj Khalifa and his French partner\nMehmet Ikhlāsī followed closely the views about the\npolitical division of Europe and Asia as propagated by the\nDutch cartographers Gerard Mercator and Henricus\nHondius. In the autograph of Hajji Khalifa's own geo-\ngraphical work for which he had engaged in the project of\ntranslation, the Cibānnümā (version II), the Ottoman\nEmpire is not mapped at all and the Safavid Empire has\ndisintegrated into a series of maps reflecting views of\nIranian provinces held in pre-Safavid geographical lit-\nerature. The fine copy of Abu Bakr al-Dimashqi's trans-\nlation of the Atlas Major does not contain any map of the\nOttoman or the Safavid Empires. Later paraphrases of\nthe work map the two Muslim neighbor-states as found\nin Western atlases, that is, the Ottoman Empire is clipped\nto Anatolia and the Safavid Empire has borders that fit\nmore the situation of the early nineteenth than that of the\nlate seventeenth or early eighteenth centuries when these\nmaps were painted in Istanbul. Possibly the first Ottoman\nmap that names Anatolia and even parts of Iran Memleket-\ne devlet-e 'aliye (Kingdom of the Supreme Dynasty), but con-\ntinues to disregard the matter of precise boundaries of\nthe empire in contrast to other states in Europe, is a silk\nmap painted in Istanbul in 1182 h/1768. This map too\nfollows without further reflection the structuring of the\npolitical space as seen in Catholic and Protestant Europe.\nA rupture with this disrespect for the political status and\nextension of the Ottoman state in Ottoman mapmaking\noccurred only in the nineteenth century, when the\nmodernized Ottoman army and its Western advisors took\na fresh interest due to military and economic reasons in\nmapping the Ottoman territories.\nMaps of nineteenth-century Qajar Iran likewise do\nnot show any explicit interest in mapping the political\nspace of the country. Their authors mostly focused on\nmapping particular provinces and their physical and\ncultural properties. Qajar maps show clearly that by now\nmapmaking in Iran followed the map culture of Europe.\nIn the first-half of the nineteenth century, British and\nRussian officers toured the country for mapping several\nof its provinces, mountains, and shores, partly on order of\nthe Qajar court. In the second-half of the nineteenth\ncentury, Iranian mapmakers who were trained in modern\nmathematical and cartographic methods and concepts at\nthe Dar al-funun in Tehran started to work. The Dār al-\nfunun was a new type of school for higher education\nfounded in 1851 by Mirzā Taqi Khān Amir-i Nizām\n(1186\nassassinated in 1231 h sh/1807 - assassinated in\n1852), a diplomat and highly disputed prime minister of\nthe Qajar ruler Nasir al-Din Shah (r. 1227-75 h sh/1848-\n96). The new school was part of efforts to reform the\nQajar army. European teachers taught new military\nmethods, theories, technologies, sciences including\ngeography and cartography, and languages. The major\ncartographic works undertaken by Austrian professors\nand Iranian students and later professors of the Dar al-\nfunun were explorations, triangulations, descriptions, and\ndrawings of boundaries between Iran, the Ottoman Em-\npire, Central Asia, Afghanistan, and Northwest India\n(today Pakistan) and various kinds of mapping enterprises\nabout Tehran and the settlements in its immediate en-\nvironment. A number of the engineers involved in these\ndifferent projects studied for some time in France or\nEngland and worked for different departments of the\ngovernment and the army. In addition to mapmaking,\nthey wrote books about geography and mathematics\n(Figure 9).\nCartography and Surveying in Iran in the\nTwentieth Century\nIn the twentieth century, cartography developed in Iran\nin three sectors private cartographic and surveying\ncompanies, the army, and governmental civil institutions.\nThe first private cartographic company, Sahab Geo-\ngraphic & Drafting Company, was founded in 1315 h sh/\n1936 by 'Abdolghasem Saḥāb (1265-1335 h sh/1886-\n1956) and led for most of the century by his son 'Abbas\nSahāb (1300-79 h sh/1921-2000), who was trained as an\nengineer. It began with publishing maps of Iranian history\nand physical geography. After 1945, it also produced road\nmaps, maps for tourism, globes, maps of Iran's neighbors,\natlases, posters, and school books. Ebädolähe Bakhtiarī\n(1306-62 h sh/1927-83), the husband of a sister of 'Abbas\nSaḥāb, founded in 1351 h sh/1972 the second private\ncartographic publishing house in Iran, Gitashenasi\nGeographical and Cartographic Institute. Being today\nthe more active of the two, it has a similar range of\nproducts, including political, physical, historical, and\ntopographical maps of Iran, its provinces and cities, road\nand street maps, maps for tourism and outdoor activities,\nmaps of Asian countries, globes, books, and postcards.\nSince some time, the company produces its maps with\ncomputer technologies.\nIn the field of geophysics and surveying, two men\nshaped the face of modern practices and products in Iran -\nMahmud Hisābī (1282-71 h sh/1903-92) and Taqi Riyāḥī\n(d. after 1989). Hisābī, a student of Albert Einstein, was\neducated as a civil engineer in Beirut and Paris and did his\nPhD in physics at the Sorbonne. Starting in 1928, he\nsurveyed Iranian coastal roads and was a founder or co-\nfounder of a number of institutions important for Iranian\ncartography, among them the country's first weather sta-\ntion (1931), Tehran University (1934), the Institute of\nStandards of Iran (1954), and the Geophysical Institute of\nTehran University (1961). Hisābī worked for Mossadegh's\ngovernment as the first general manager of the Iranian\nNational Oil Company. Riyāḥī was a civil engineer who\nhad studied at the École Polytechnique in Paris. In 1952, he",
  "14": "426\nAuthor's personal copy\nCartography in Islamic Societies\nFigure 9 Naqsh-i Färis (Map of Persia), MS Berlin, Preussischer Kulturbesitz, Staatsbibliothek, Kartensammlung D9515; Courtesy of\nPreussischer Kulturbesitz, Staatsbibliothek.\nbecame Mossadegh's chief of staff. After the CIA coup in\n1953, Riyāḥī was sentenced to 2 years of prison. In 1979,\nhe worked for the head of the interim government after\nthe fall of the Shah, Mahdi Bazargān (d. 1995), but left the\ncountry soon after to live until his death in France. In\n1956, Riyāḥī founded with a partner the first private sur-\nveying company of Iran, Cherkate-e Nesbi Nagbsbeb Bardari.\nThe company began with land surveying in the year of its\nfoundation, but quickly expanded into other fields, among\nthem photogrammetry (1959) and terrestrial photogram-\nmetry. It cooperated closely with the French company La\nFoncière registered in the French protectorate of Morocco.\nAbout 20 French engineers and technicians came to Iran\nproviding expertise and bringing with them needed in-\nstruments for surveying and mapmaking. The company\nsent c. 25 of its employees for education to France, among\nthem Nasr Ghazālī, today's head of the company, who had\nto leave Tehran University due to political difficulties\nunder the Shah; five or six to the Netherlands; and three to\nSwitzerland. Renamed in 1967 as Rassad Surveying\nCompany, it moved into hydrography, microgeodesy,\northophoto mapping, digital mapping, GIS design and\nimplementation, tunnel drilling control, and industrial\ncontrol surveying. Twice, it mapped half of Iran, the first\ntime using photogrammetric methods, the second working\nwith satellite material. Its main clients are oil and road\ncompanies, the municipalities of Tehran, Yazd, and Kish,\nand various ministries.\nIn 1921, the army founded its first group for cartog-\nraphy. The first tasks the engineers of this department\ncarried out consisted in translating, correcting, and\ncompleting Russian and English maps of Iran and ad-\njacent countries. Fourteen years later, the first books on\nIranian geography illustrated with military maps were\nproduced for educational purposes. Subsequently, the\ncartographic organization of the army began creating its\nown military maps. As in the nineteenth and early\ntwentieth century, a major focus of military mapmaking\nwas the exploration of the borderlands. As the National\nGeographic Organization, it is now the most powerful\ncartographic body in Iran and possesses the most ad-\nvanced technology, for instance, for area photography.\nIn 1953, Iran founded its first governmental institution\nfor civil cartography, the National Cartographic Center\n(NCC). It started in 1948 as an engineering department\nof the Plan and Budget Organization. Working with\nforeign consultants and army officers, it carried out sur-\nveying work and planned the structure for the new\ngovernmental institution for mapping Iran. It focused its\nactivities on three major domains. The first domain em-\nbraces the creation of terrestrial maps of various prov-\ninces, regions, and cities of Iran and works for producing\na comprehensive map of the entire Iranian territory.\nNCC brought foreign engineers and technicians, mainly\nfrom France and the Netherlands, for surveying the\ncountry and trained students of mathematics and physics\nin cartographic methods and techniques. The second\ndomain covers the charting of Iranian coastal and mari-\ntime areas, in particular in the Persian Gulf. The third\nmajor domain lies in creating the intellectual infra-\nstructure for cartography in Iran. NCC created a re-\nsearch journal, organized conferences, published\ntextbooks and the series National Atlas of Iran, and\nsponsored the translation of foreign publications. It has\ntwo special responsibilities - the supervision of all gov-\nernment contracts and area photography.",
  "15": "Author's personal copy\nFrom 1941 onward, state bodies such as the Mining\nAdministration, the Ministry of Agriculture, or the\nMinistry of the Roads ordered engineers to map the\nentities under their responsibility. Other governmental\norganizations, in particular institutes of Tehran Uni-\nversity, the Geological Survey of Iran, and the Me-\nteorological Survey of Iran, founded mostly in the\nsecond-half of the twentieth century, produce specialized\nthematic maps on geology, geomorphology, geophysics,\ngeochemistry, meteorology and soil or land use.\nSee also: Art and Cartography; Mapping, Non-Western;\nMaps and the State; Medieval Geography; Middle East\nand North Africa; Orientalism.\nFurther Reading\nAhmad, S. M. (1992). Cartography of al-Sharif al-Idrisi. In Harley, J. B. &\nWoodward, D. (eds.) History of Cartography, vol. 2, Bk. 1:\nCartography in the Traditional Islamic and South Asian Societies,\npp 156-174. Chicago, IL: University Press of Chicago.\n'Ayn al-Zamān's Hasan b. 'Ali Qattan Marwazi, Gayhan Shenakht.\nQom: Vaḥed-e enteshārāt-e kitābkhāne-ye bozorg-e Ayatollah al-\n'uzma Mar'ashi Najafi.\nBrentjes, S. (2004). Mapmaking in Ottoman Istanbul between 1650 and\n1750: A domain of painters, calligraphers, or cartographers?\nIn Imber, C., Kiyotaki, K. & Murphey, R. (eds.) Frontiers of Ottoman\nStudies, vol. 2, pp 125-156. London: I. B. Tauris.\nBrentjes, S. (2007). Nasr Ghazali, Rassadiran, Interview, Tehran, March,\n25, 2007.\nEdson, E. and Savage-Smith, E. (2004). Medieval Views of the\nCosmos: Picturing the Universe in the Christian and Islamic Middle\nAges. Oxford: The Bodleian Library, Oxford University.\nGhada al-Hijjawi al-Qaddumi, (1996). Book of Gifts and Rarities.\nHarvard Middle Eastern Monographies XXIX, Harvard UP, Boston.\nGoodrich, T. D. (1990). The Ottoman Turks and the New World: A Study\nof Tarih-i Hind-i Garbi and Sixteenth-Century Ottoman Americana.\nWiesbaden: Harrassowitz Verlag.\nHagen, G. (2003). Ein Osmanischer Geograph bei der Arbeit.\nEntstehung und Gedankenwelt von Katib Čelebis Gihannūmā.\nBerlin: Klaus Schwarz Verlag.\nKaramustafa, A. T. (1992). Military, administrative, and scholarly maps\nand plans. In Harley, J. B. & Woodward, D. (eds.) History of\nCartography, vol. 2, Bk. 1: Cartography in the Traditional Islamic and\nSouth Asian Societies, pp 209-227. Chicago, IL: University Press of\nChicago.\nCartography in Islamic Societies 427\nKing, D. A. (1999). World-Maps for Finding the Direction and Distance\nto Mecca. Innovation and Tradition in Islamic Science. Leiden: Köln:\nBrill.\nKing, D. A. and Lorch, R. (1992). Qibla charts, Qibla maps, and related\ninstruments. In Harley, J. B. & Woodward, D. (eds.) History of\nCartography, vol. 2, Bk. 1: Cartography in the Traditional Islamic and\nSouth Asian Societies, pp 189-205. Chicago, IL: University Press of\nChicago.\nMS Istanbul, Süleymaniye Library, Mihrişah Sultan 304.\nOrientalische Buchkunst in Gotha (1997). Ausstellung zum 350jährigen\nJubiläum der Forschungs- und Landesbibliothek Gotha. Spiegelsaal\n11. September 1997 bis 14. Dezember 1997. Forschungs- und\nLandesbibliothek Gotha, 1997.\nRogers, J. M. (1992). Itineraries and town views in Ottoman\nHistories. In Harley, J. B. & Woodward, D. (eds.) History of\nCartography, vol. 2, Bk. 1: Cartography in the Traditional Islamic\nand South Asian Societies, pp 228-255. Chicago, IL: University\nPress of Chicago.\nSezgin, F. (1987). Contribution of the Arabic-Islamic Geographers to the\nFormation of the World Map. Frankfurt am Main: Institut für\nGeschichte der Arabisch-Islamischen Wissenschaften.\nSharaf al-Din Muḥammad b. Mas'ud Mas'ūdī, (2003). Jahan\nDanish (edited and introduced by Zanjāni, D.-A.). Tehran: Mirās-e\nMaktub.\nSoucek, S. (1992). Islamic charting in the Mediterranean. In Harley, J. B.\n& Woodward, D. (eds.) History of Cartography, vol. 2, Bk. 1:\nCartography in the Traditional Islamic and South Asian Societies,\npp 265-284. Chicago, IL: University Press of Chicago.\nThe National Atlas of Iran. Maps. vol. 18, The Islamic Republic of Iran,\nManagement and Planning Organization, National Cartographic\nCenter, Tehran, 1371 sh.\nTibbets, G. R. (1992). Later cartographic developments. In Harley, J. B.\n& Woodward, D. (eds.) History of Cartography, vol. 2, Bk. 1:\nCartography in the Traditional Islamic and South Asian Societies,\npp 137-155. Chicago, IL: University Press of Chicago.\nTibbets, G. R. (1992). The Balkhi school of geographers. In Harley, J. B.\n& Woodward, D. (eds.) History of Cartography, vol. 2, Bk. 1:\nCartography in the Traditional Islamic and South Asian Societies,\npp 108-136. Chicago, IL: University Press of Chicago.\nTibbets, G. R. (1992). The beginnings of a cartographic tradition.\nIn Harley, J. B. & Woodward, D. (eds.) History of Cartography,\nvol. 2, Bk. 1: Cartography in the Traditional Islamic and\nSouth Asian Societies, pp 90-107. Chicago, IL: University\nPress of Chicago.\nRelevant Websites\nhttp://cosmos.bodley.ox.ac.uk\nMedieval Views of the Cosmos, The Book of Curiosities.\nhttp://www.ncc.org.ir\nNational Cartographic Center."
}