{
  "key": "ANLFTXVL",
  "title": "The Journey of Maps and Images on the Silk Road",
  "refs": [
    {
      "id": "1",
      "raw": "Di Cosmo, N. and D. Bao, Manchu-Mongol Relations on the Eve of the Qing Conquest. A Documentary History. ISBN 90 04 11777 6",
      "authors": [
        "Di Cosmo, N.",
        "Bao, D."
      ],
      "year": null,
      "title": "Manchu-Mongol Relations on the Eve of the Qing Conquest. A Documentary History",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "2",
      "raw": "Williams, B.G., The Crimean Tatars. The Diaspora Experience and the Forging of a Nation. 2001. ISBN 90 04 12122 6",
      "authors": [
        "Williams, B.G."
      ],
      "year": "2001",
      "title": "The Crimean Tatars. The Diaspora Experience and the Forging of a Nation",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "3",
      "raw": "Levi, S.C., The Indian Diaspora in Central Asia and its Trade (1550-1900). 2002. ISBN 90 04 12320 2",
      "authors": [
        "Levi, S.C."
      ],
      "year": "2002",
      "title": "The Indian Diaspora in Central Asia and its Trade (1550-1900)",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "4",
      "raw": "Allworth, E.A., Evading Reality. The Devices of # Abdalrauf Fitrat, Modern Central Asian Reformist; Poetry and Prose of # Abdul Qadir Bedil. Transl. from Persian by William L. Hanaway. 2002. ISBN 90 04 12516 7",
      "authors": [
        "Allworth, E.A."
      ],
      "year": "2002",
      "title": "Evading Reality. The Devices of Abdalrauf Fitrat, Modern Central Asian Reformist; Poetry and Prose of Abdul Qadir Bedil",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "5",
      "raw": "Gross, J. and A. Urunbaev, The Letters of Khw § ja 'Ubayd All § h A È r § r and his Associates. 2002. ISBN 90 04 12603 1",
      "authors": [
        "Gross, J.",
        "Urunbaev, A."
      ],
      "year": "2002",
      "title": "The Letters of Khwaja 'Ubayd Allah Akhrar and his Associates",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "6",
      "raw": "Atwood, C.P., Young Mongols and Vigilantes in Inner Mongolia's Interregnum Decades, 1911-1931. 2002. ISBN 90 04 12607 4",
      "authors": [
        "Atwood, C.P."
      ],
      "year": "2002",
      "title": "Young Mongols and Vigilantes in Inner Mongolia's Interregnum Decades, 1911-1931",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "7",
      "raw": "Rachewiltz, I. de (tr.), The Secret History of the Mongols. A Mongolian Epic Chronicle of the Thirteenth Century. 2003. ISBN 90 04 13159 0 (Set), ISBN 90 04 13596 0 (Vol. 1), ISBN 90 04 13597 9 (Vol. 2)",
      "authors": [
        "Rachewiltz, I. de"
      ],
      "year": "2003",
      "title": "The Secret History of the Mongols. A Mongolian Epic Chronicle of the Thirteenth Century",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "8",
      "raw": "Elverskog, J., The ' Jewel Translucent S å tra '. Altan Khan and the Mongols in the Sixteenth Century. 2003. ISBN 90 04 13261 9",
      "authors": [
        "Elverskog, J."
      ],
      "year": "2003",
      "title": "The Jewel Translucent Sutra. Altan Khan and the Mongols in the Sixteenth Century",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "9",
      "raw": "Mu È ammad-Shar Ê f-i ' adr-i Z 8 iy § , The Personal History of a Bukharan Intellectual. The Diary of Mu È ammad-Shar Ê f-i ' adr-i Z 8 iy § . 2004. ISBN 90 04 13161 2",
      "authors": [
        "Muhammad-Sharif-i 'Adr-i Ziya"
      ],
      "year": "2004",
      "title": "The Personal History of a Bukharan Intellectual. The Diary of Muhammad-Sharif-i 'Adr-i Ziya",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "10",
      "raw": "Dale, S.F., The Garden of the Eight Paradises. B § bur and the Culture of Empire in Central Asia, Afghanistan and India (1483-1530). 2004. ISBN 90 04 13707 6",
      "authors": [
        "Dale, S.F."
      ],
      "year": "2004",
      "title": "The Garden of the Eight Paradises. Babur and the Culture of Empire in Central Asia, Afghanistan and India (1483-1530)",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "11",
      "raw": "Amitai, R. and M. Biran (eds.), Mongols, Turks, and Others. Eurasian Nomads and the Sedentary World. 2005. ISBN 90 04 14096 4",
      "authors": [
        "Amitai, R.",
        "Biran, M."
      ],
      "year": "2005",
      "title": "Mongols, Turks, and Others. Eurasian Nomads and the Sedentary World",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "12",
      "raw": "Frank, A.J. and M.A. Usmanov, An Islamic Biographical Dictionary of the Eastern Kazakh Steppe: 1770-1912. 2005. ISBN 90 04 14127 8",
      "authors": [
        "Frank, A.J.",
        "Usmanov, M.A."
      ],
      "year": "2005",
      "title": "An Islamic Biographical Dictionary of the Eastern Kazakh Steppe: 1770-1912",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "13",
      "raw": "Drompp, M.R., Tang China and the Collapse of the Uighur Empire. A Documentary History. 2005. ISBN 90 04 14129 4",
      "authors": [
        "Drompp, M.R."
      ],
      "year": "2005",
      "title": "Tang China and the Collapse of the Uighur Empire. A Documentary History",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "14",
      "raw": "Russell-Smith, L., Uygur Patronage in Dunhuang. Regional Art Centres on the Northern Silk Road in the Tenth and Eleventh Centuries. 2005. ISBN 90 04 14241 X",
      "authors": [
        "Russell-Smith, L."
      ],
      "year": "2005",
      "title": "Uygur Patronage in Dunhuang. Regional Art Centres on the Northern Silk Road in the Tenth and Eleventh Centuries",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "15",
      "raw": "Tighe, J.R., Constructing Suiyuan. The Politics of Northwestern Territory and Development in Early Twentieth-Century China. 2005. ISBN 90 04 14466 8",
      "authors": [
        "Tighe, J.R."
      ],
      "year": "2005",
      "title": "Constructing Suiyuan. The Politics of Northwestern Territory and Development in Early Twentieth-Century China",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "16",
      "raw": "Newby, L.J., The Empire and the Khanate. A Political History of Qing Relations with Khoqand c. 1760-1860. 2005. ISBN 90 04 14550 8",
      "authors": [
        "Newby, L.J."
      ],
      "year": "2005",
      "title": "The Empire and the Khanate. A Political History of Qing Relations with Khoqand c. 1760-1860",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "17",
      "raw": "Kakar, M.H., A Political and Diplomatic History of Afghanistan, 1863-1901. 2006. ISBN 978 90 04 15185 7",
      "authors": [
        "Kakar, M.H."
      ],
      "year": "2006",
      "title": "A Political and Diplomatic History of Afghanistan, 1863-1901",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "18",
      "raw": "Srinivasan, D.M. (ed.), On the Cusp of an Era. Art in the Pre-Ku ß§Ö a World. 2006. ISBN 978 90 04 15451 3",
      "authors": [
        "Srinivasan, D.M."
      ],
      "year": "2006",
      "title": "On the Cusp of an Era. Art in the Pre-Kusana World",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "19",
      "raw": "Subtelny, M.E., Timurids in Transition. Turko-Persian Politics and Acculturation in Medieval Iran. 2007. ISBN 978 90 04 16031 6",
      "authors": [
        "Subtelny, M.E."
      ],
      "year": "2007",
      "title": "Timurids in Transition. Turko-Persian Politics and Acculturation in Medieval Iran",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "20",
      "raw": "Baumann, B., Divine Knowledge. Buddhist Mathematics According to Antoine Mostaert's Manual of Mongolian Astrology and Divination. 2008. ISBN 978 90 04 15575 6",
      "authors": [
        "Baumann, B."
      ],
      "year": "2008",
      "title": "Divine Knowledge. Buddhist Mathematics According to Antoine Mostaert's Manual of Mongolian Astrology and Divination",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    },
    {
      "id": "21",
      "raw": "Forêt, P. and A. Kaplony (eds.), The Journey of Maps and Images on the Silk Road. 2008. ISBN 978 90 04 17165 7",
      "authors": [
        "Forêt, P.",
        "Kaplony, A."
      ],
      "year": "2008",
      "title": "The Journey of Maps and Images on the Silk Road",
      "venue": "Brill's Inner Asian Library",
      "pages": null
    }
  ],
  "citations": [
    {
      "page": 23,
      "marker": "Komaroff and Carboni 2002",
      "context": "Bronze mirror with dragon and phoenix. Xuanhua, Hebei, China, tomb M10, pre-1093. Komaroff and Carboni 2002: fig. 100."
    },
    {
      "page": 23,
      "marker": "Excavation Report Xuanhua 2001",
      "context": "Bronze mirror with dragon and phoenix. Xuanhua, Hebei, China, tomb M10, pre-1093. Excavation Report Xuanhua 2001, vol. 1: 49."
    },
    {
      "page": 23,
      "marker": "Komaroff and Carboni 2002",
      "context": "Rustam's and Zavara's bier. Boston, Museum of Fine Art, no. 22.393, Great Mongol Shahnama, 1330s. Komaroff and Carboni 2002: fig. 124."
    },
    {
      "page": 23,
      "marker": "Xyngopoulos 1966",
      "context": "Funeral and burial of King Philip. Venice, Hellenic Institute, no. 5, fol. 30, Romance of Alexander, mid-fourteenth century. Xyngopoulos 1966: pl. II."
    },
    {
      "page": 23,
      "marker": "Komaroff and Carboni 2002",
      "context": "Alexander enthroned. Paris, Musée du Louvre, no. 7096, Great Mongol Shahnama, 1330s, single page. Komaroff and Carboni 2002: fig. 51."
    },
    {
      "page": 28,
      "marker": "Nicolas Zufferey's Chapter 1",
      "context": "excavated from the tomb of a prince at Mawangdui, Hunan province (see Nicolas Zufferey's Chapter 1). They show a small section"
    },
    {
      "page": 28,
      "marker": "Natasha Heller's Chapter 2",
      "context": "purposes, too. Natasha Heller's Chapter 2 focuses on the map of an important Buddhist pilgrimage center"
    },
    {
      "page": 28,
      "marker": "Ennin",
      "context": "Mount Wutai in modern Shanxi province. When the Japanese pilgrim Ennin (794-864) visited there in 840"
    },
    {
      "page": 28,
      "marker": "Dorothy Wong's Chapter 3",
      "context": "miracles of Mañjusri, the bodhisattva believed to preside over the mountain site. Dorothy Wong's Chapter 3 discusses Buddhist maps"
    },
    {
      "page": 29,
      "marker": "Chapter 4",
      "context": "Yuji tu (Map of the Tracks of Yu) dates to the twelfth century (see Chapter 4). As Bloom notes, the grid"
    },
    {
      "page": 29,
      "marker": "Ptolemy (second century ce)",
      "context": "role in Islamic cartography. Islamic geographers followed the lead of Ptolemy (second century ce) and made charts"
    },
    {
      "page": 29,
      "marker": "Andreas Kaplony's Chapter 7",
      "context": "accompanying text. Andreas Kaplony's Chapter 7 analyzes al-Kashghari's grammar of Turkic languages"
    },
    {
      "page": 29,
      "marker": "Paul Kunitzsch in Chapter 9",
      "context": "copying of star charts, Paul Kunitzsch explains in Chapter 9. Whereas one fourteenth-century map showed"
    },
    {
      "page": 29,
      "marker": "Peter Apian",
      "context": "dots in meaningless groups. Only when the German astronomer Peter Apian located the original text"
    },
    {
      "page": 29,
      "marker": "Yossef Rapoport's Chapter 8",
      "context": "twelfth or thirteenth century), the subject of Yossef Rapoport's Chapter 8. The maps in this manuscript"
    },
    {
      "page": 30,
      "marker": "Bloom",
      "context": "graticule scale with 'little idea of what it meant or how it was to be used,' as Bloom puts it in Chapter 4"
    },
    {
      "page": 30,
      "marker": "Johannes Thomann in Chapter 5",
      "context": "squares, argues Johannes Thomann in Chapter 5. People in the Islamic World saw square Chinese horoscopes"
    },
    {
      "page": 30,
      "marker": "Dickran Kouymjian",
      "context": "Armenian lectionary, they included a very Chinese-looking dragon and phoenix. In Chapter 6, Dickran Kouymjian suggests"
    },
    {
      "page": 31,
      "marker": "Sonja Brentjes",
      "context": "which this volume has emerged can forget Sonja Brentjes's images of horses' tails from the Catalan Atlas"
    },
    {
      "page": 31,
      "marker": "Chapter 10",
      "context": "top; the first hairs appear some distance from the horse's rear. In Chapter 10, Brentjes uses the clues"
    },
    {
      "page": 33,
      "marker": "Edward Schafer's The Golden Peaches of Samarkand",
      "context": "since the 1963 publication of Edward Schafer's The Golden Peaches of Samarkand. Scholars have published monographs"
    },
    {
      "page": 34,
      "marker": "1",
      "context": "until the fifteenth century, the Mongol Road that superseded the Buddhist Road was maintained by Mongol states for their couriers and troops, as well as for the artists, scholars, and merchants they summoned to their separate courts."
    },
    {
      "page": 34,
      "marker": "1",
      "context": "We would have liked to include a chapter on the Sogdian Road because it provides another example of a Silk Road network. The East Iranian merchants who maintained it had colonies and settlements from the Korean border to Byzantium and Europe. For more information on the Sogdian Road, see Etienne de la Vaissière, Sogdian Traders: A History, Handbook of Oriental Studies"
    },
    {
      "page": 41,
      "marker": "1",
      "context": "The aim of this contribution is to discuss aspects of the transmission to China of visual knowledge through the Silk Road during the Han dynasty (206 bce -220 ce)."
    },
    {
      "page": 42,
      "marker": "2",
      "context": "Designs on these ancient stones displayed the artistic style of early Christian times found in Iraq and Middle East area while bearing the characteristics of China's Eastern Han times."
    },
    {
      "page": 42,
      "marker": "3",
      "context": "A number of religious media abroad reacted to this finding, but the Han-dynasty 'Christian' designs vanished before scholars could examine them."
    },
    {
      "page": 43,
      "marker": "4",
      "context": "of China today, where 50 millions inhabitants used to live."
    },
    {
      "page": 43,
      "marker": "5",
      "context": "From that city several routes crossed the Pamirs to reach either the Fergana or the Indus valley."
    },
    {
      "page": 44,
      "marker": "6",
      "context": "the Hanshu (Book of the [Former or Western] Han Dynasty, compiled by Ban Gu, 32-92 ce) and the Hou Hanshu (Book of the Later [or Eastern] Han Dynasty, composed by Fan Ye, 398-446)."
    },
    {
      "page": 44,
      "marker": "7",
      "context": "they are based on scanty evidence because Western Han historians relied mostly on the accounts of one man, the famous traveler Zhang Qian"
    },
    {
      "page": 44,
      "marker": "8",
      "context": "the indication that Arsacid Parthia (Anxi) was 11,600 li (4,823 km, or 2,990 miles) from Chang'an, the Western Han capital"
    },
    {
      "page": 44,
      "marker": "9",
      "context": "or that the country of Shache (also pronounced Shaju, Yarkand in modern times) in southwestern Xinjiang had a population of 16,373 inhabitants?"
    },
    {
      "page": 45,
      "marker": "10",
      "context": "Despite many collaborative efforts that have involved experts in geography, linguistics, history, archaeology, botany, and even biology, fundamental problems of identification remain"
    },
    {
      "page": 45,
      "marker": "11",
      "context": "Words such as Xihai (the 'Western Sea') and Wuyishanli (the Chinese rendering for 'Alexandria') may refer to different places in different texts"
    },
    {
      "page": 45,
      "marker": "12",
      "context": "For instance, historians still do not agree on the location of the Wusun tribal state (did it occupy the Ili valley southeast of Lake Balkhash?)"
    },
    {
      "page": 45,
      "marker": "13",
      "context": "The first translations into Chinese of Buddhist scriptures (largely from the Hênayâna traditions) were from Prakrit sources, the vernacular language of northwestern India two thousand years ago"
    },
    {
      "page": 46,
      "marker": "14",
      "context": "The name Seidenstrasse ('Silk Road') was only coined in 1877 by the German geographer Ferdinand von Richthofen, so modern expressions such as sichou zhi lu or silu cannot be found in Han-dynasty texts."
    },
    {
      "page": 46,
      "marker": "15",
      "context": "The Western Regions were also considered to be the abode of Taoist immortals and deities such as the Queen Mother of the West (Xiwangmu)."
    },
    {
      "page": 46,
      "marker": "16",
      "context": "Several fictional places described in the Shanhaijing match sites referred to in realistic accounts; for instance, the Kunlun range, which Zhang Qian visited"
    },
    {
      "page": 47,
      "marker": "17",
      "context": "Although Han-dynasty scholars were sometimes aware of such contradictions,"
    },
    {
      "page": 47,
      "marker": "18",
      "context": "The barbarians are the feet of the empire.' Such prejudice is still common"
    },
    {
      "page": 47,
      "marker": "19",
      "context": "in terms of economic life the difference between a Chinese and a barbarian"
    },
    {
      "page": 47,
      "marker": "20",
      "context": "the Hanshu stated that 'most peoples in the Western Regions were sedentary'"
    },
    {
      "page": 48,
      "marker": "21",
      "context": "the aggressive behavior of the Xiongnu during the Han period was a reaction"
    },
    {
      "page": 48,
      "marker": "22",
      "context": "Small-scale maps were not unknown to the Han, as has been discovered during"
    },
    {
      "page": 48,
      "marker": "23",
      "context": "Chinese expeditions in the West surveyed part of the territories explored"
    },
    {
      "page": 49,
      "marker": "24",
      "context": "Buddhist themes and forms by Han China during the first and second centuries"
    },
    {
      "page": 49,
      "marker": "25",
      "context": "Buddhist and popular religious figures are mixed with secular figures."
    },
    {
      "page": 49,
      "marker": "26",
      "context": "Rhie nevertheless follows 'the opinion of some Chinese scholars' as she assumes"
    },
    {
      "page": 50,
      "marker": "27",
      "context": "which has generally been attributed to the fourth or fifth century but which"
    },
    {
      "page": 50,
      "marker": "28",
      "context": "'reminds us of the Parthian examples of Tang-i-Sarvak' or 'Kaniska Buddha coins.'"
    },
    {
      "page": 50,
      "marker": "29",
      "context": "the Han Chinese of the first century ce began to accept this format to portray"
    },
    {
      "page": 54,
      "marker": "30",
      "context": "centuries of the Han dynasty. 30 Opposing a 'Chinese' Queen Mother of the West to 'foreign' Buddhism"
    },
    {
      "page": 54,
      "marker": "31",
      "context": "separated from Taoism or Taoist beliefs until later. 31 As a result, instead of speaking"
    },
    {
      "page": 54,
      "marker": "32",
      "context": "very 'Chinese' during the Han dynasty. 32 Another topic is the production of 'Buddhist'"
    },
    {
      "page": 55,
      "marker": "33",
      "context": "of the Buddha . 33 Influential scholars such as Lao Kan are confident"
    },
    {
      "page": 55,
      "marker": "34",
      "context": "Tengxian image represents that story. 34 The problem is not with the representation"
    },
    {
      "page": 55,
      "marker": "35",
      "context": "which did live in southern China during the Han period, 35 but with"
    },
    {
      "page": 55,
      "marker": "36",
      "context": "style.' 36 We again meet difficulties when we assess the extent"
    },
    {
      "page": 56,
      "marker": "37",
      "context": "four cardinal directions. 37 Elaborating on this idea, the Chinese thought historian"
    },
    {
      "page": 57,
      "marker": "38",
      "context": "towering structure, represents a specific kind of architecture that was 38 hitherto unknown"
    },
    {
      "page": 61,
      "marker": "1",
      "context": "Maps are multivalent, layering different kinds of information and different registers of meaning within their frames."
    },
    {
      "page": 61,
      "marker": "1",
      "context": "J. B. Harley's seminal work has drawn attention to how maps represent not just physical space but ideas about that space."
    },
    {
      "page": 61,
      "marker": "2",
      "context": "landscape paintings 'attempt to convey the sensuous aspects of the environing place-world.'"
    },
    {
      "page": 62,
      "marker": "2",
      "context": "Casey 2002: xiv."
    },
    {
      "page": 62,
      "marker": "3",
      "context": "Mount Wutai seems to fall close to Casey's definition of chorography as 'the qualitative mapping of regions', as distinct from cartography"
    },
    {
      "page": 62,
      "marker": "3",
      "context": "Casey 2002: xvii. Casey has redefined the term. Historically, chorography referred to the mapping of a region"
    },
    {
      "page": 63,
      "marker": "4",
      "context": "two months in the period when the map was commissioned. 4 these possibilities, so that the map may indeed substitute"
    },
    {
      "page": 63,
      "marker": "5",
      "context": "We now believe that the cave was excavated between 947-951. 5 At this time, the Dunhuang region was"
    },
    {
      "page": 64,
      "marker": "6",
      "context": "Under the Cao family, twenty-six new caves were excavated at the Mogao site , and many more restored. 6"
    },
    {
      "page": 64,
      "marker": "7",
      "context": "The Caos left a lasting imprint on Dunhuang, and their rule marks the last florescence at the Mogao Caves . 7"
    },
    {
      "page": 64,
      "marker": "8",
      "context": "made, and wrote an account of his visit; the map is the prototype of all later maps of the mountain. 8"
    },
    {
      "page": 65,
      "marker": "9",
      "context": "in Taiyuan ֜ ଺ in Shanxi province . 9 The Japanese pilgrim Ennin"
    },
    {
      "page": 65,
      "marker": "10",
      "context": "and in 824 the Tibetans also requested a map, attesting to the geographic reach of the cult. 10 There"
    },
    {
      "page": 66,
      "marker": "11",
      "context": "divided. 11 The first of these is the temporal world , that of pilgrims"
    },
    {
      "page": 66,
      "marker": "12",
      "context": "for viewers to read the map as a truthful representation of the landscape . 12 Although lining up"
    },
    {
      "page": 66,
      "marker": "13",
      "context": "the mountains . 13 Moreover, the linear representation of the terraces"
    },
    {
      "page": 66,
      "marker": "14",
      "context": "traveling across the unrolling scroll .' 14 Marchand argues that although the landscape"
    },
    {
      "page": 67,
      "marker": "15",
      "context": "The religious layer of meaning has been considered in detail by the art historian Dorothy Wong."
    },
    {
      "page": 67,
      "marker": "16",
      "context": "Mount Wutai had become firmly associated with Mañjuśrī, although the details of this process are not entirely clear."
    },
    {
      "page": 68,
      "marker": "17",
      "context": "pilgrims remark upon supernatural sights, they also make note of which temples they visit and their splendor, as Hibino Takeo points out."
    },
    {
      "page": 68,
      "marker": "18",
      "context": "Mañjuśrī was a bodhisattva with particular meaning for rulers of this time period."
    },
    {
      "page": 68,
      "marker": "19",
      "context": "diagonal lines draw the eye upward to the middle peak and the Mañjuśrī hall directly below it."
    },
    {
      "page": 69,
      "marker": "20",
      "context": "the visual starting point of the map is one of these two corners."
    },
    {
      "page": 69,
      "marker": "21",
      "context": "the record in the Guang qingliang zhuan of the donations sent in 947 by the ruler of Hunan-that is, the Five Dynasties state of Chu."
    },
    {
      "page": 69,
      "marker": "22",
      "context": "a cartouche identifies a group as emissaries from Korea."
    },
    {
      "page": 72,
      "marker": "23",
      "context": "The social aspect of pilgrimage has likewise been the topic of much scholarly attention, which has often focused on these social elements."
    },
    {
      "page": 72,
      "marker": "24",
      "context": "the vast majority of the figures shown are in groups of two or more. In many cases the figures are presented in tandem."
    },
    {
      "page": 73,
      "marker": "25",
      "context": "This illustration may indicate that a vision of this goddess was a particular aim of female pilgrims."
    },
    {
      "page": 74,
      "marker": "26",
      "context": "prior monk was not happy to see guests.' With just a few words, Ennin conveys his feelings"
    },
    {
      "page": 76,
      "marker": "27",
      "context": "discovered among the manuscripts at Dunhuang. Buddhapali was a monk from the Western Regions"
    },
    {
      "page": 76,
      "marker": "28",
      "context": "where Buddhapali was said to remain ever after. The story's importance for the artist of the map"
    },
    {
      "page": 77,
      "marker": "29",
      "context": "Ennin recounts the same story, but he has it taking place at a different monastery, with a lay"
    },
    {
      "page": 79,
      "marker": "30",
      "context": "possible vessel for the bodhisattva. On the one hand, this attests to the intense spiritual potency"
    },
    {
      "page": 80,
      "marker": "31",
      "context": "This passage from Ennin suggests how depictions of social interaction should be understood in the context of the map of Mount Wutai."
    },
    {
      "page": 83,
      "marker": "1",
      "context": "as W. Randolph Kloetzli notes, 'it must not be understood primarily as the physical universe, but rather as structured reality at every level'"
    },
    {
      "page": 83,
      "marker": "2",
      "context": "Martin Kemp remarks, 'Naturalistic painting and science both present models of the world. Both kinds of model rely upon discovery and invention'"
    },
    {
      "page": 84,
      "marker": "3",
      "context": "here I outline a rudimentary classification that distinguishes the single-world system of pre-Mahāyāna Buddhist cosmology from the multiple-world system"
    },
    {
      "page": 84,
      "marker": "4",
      "context": "These different Buddhist cosmologies are integral to the diverse theories of Buddhist soteriology set forth in various texts, and they coexist"
    },
    {
      "page": 84,
      "marker": "5",
      "context": "Before the introduction of Buddhism, the Chinese possessed their own theories about the universe, albeit less systematic and fantastic than Indian speculations."
    },
    {
      "page": 85,
      "marker": "6",
      "context": "their contents were based on canonical texts that originated in India. 6 This chapter includes discussion"
    },
    {
      "page": 86,
      "marker": "7",
      "context": "at the center. 7 The waters of the various seas fill the regions"
    },
    {
      "page": 87,
      "marker": "8",
      "context": "cyclical nature of cosmic time. 8 Images of the wheel of life did not"
    },
    {
      "page": 87,
      "marker": "9",
      "context": "mainstream Chinese Buddhist art but feature prominently in Tibetan art, which also abounds in various types of cosmographic depictions. 9 For example,"
    },
    {
      "page": 87,
      "marker": "10",
      "context": "which dates to the tenth century. 10 Deborah Klimburg-Salter interprets that 'While"
    },
    {
      "page": 87,
      "marker": "8",
      "context": "See Zin 1999, vol. 2: 26-27. 9 See Schwartzberg 1992b: 625-629, fig. 15.18"
    },
    {
      "page": 87,
      "marker": "9",
      "context": "Schwartzberg 1992b: 625-629, fig. 15.18. The wheel of life, based on the Abhidharmako"
    },
    {
      "page": 87,
      "marker": "10",
      "context": "Brauen 1997: 22-23, 51-79. 10 Klimburg-Salter et al. 1997: 80-82."
    },
    {
      "page": 88,
      "marker": "11",
      "context": "the mandala [the interior of the monastery].' 11 The mural at Tabo Monastery seems"
    },
    {
      "page": 88,
      "marker": "12",
      "content": "times in the Tantric context and was also depicted in the later periods. 12 It was probably"
    },
    {
      "page": 88,
      "marker": "13",
      "context": "cartographic perspective, is that the visual representation of the multi-dimensional universe in a two-dimensional image [i.e., a conventional map surface] sees it extended along a vertical rather than a horizontal plane.' 13 This vertical format"
    },
    {
      "page": 88,
      "marker": "14",
      "context": "which illustrates this cosmology diagrammatically (fig. 3.1a-c). 14 The illustrator uses a bird's-eye view and a level"
    },
    {
      "page": 88,
      "marker": "15",
      "context": "where Theravāda Buddhism predominates. 15 The early images of the single-world cosmology found in China"
    },
    {
      "page": 89,
      "marker": "16",
      "context": "other three quadrants of the ceiling murals show a similar mix of Chinese and foreign motifs, although the identification of some figures remains in dispute."
    },
    {
      "page": 92,
      "marker": "17",
      "context": "Mount Meru is also featured on the robe of a specific type of buddha identified as either Vairocana or the Cosmological Buddha. In these examples, Mount Meru serves as a backdrop"
    },
    {
      "page": 92,
      "marker": "18",
      "context": "Mount Meru is also featured on the robe of a specific type of buddha identified as either Vairocana or the Cosmological Buddha."
    },
    {
      "page": 92,
      "marker": "19",
      "context": "The idea of mapping the universe onto a person's body is rooted in the ancient Indian concept of the primordial or cosmic man (puruṣa) eulogized in Vedic literature, and in the depiction of Viṣṇu in Hindu art."
    },
    {
      "page": 92,
      "marker": "20",
      "context": "Among extant examples of Khotanese mural paintings there is an example of Vairocana, whose body is adorned with images of Mount Meru (or symbolically the Mount Meru throne) and other cosmic emblems."
    },
    {
      "page": 92,
      "marker": "21",
      "context": "This celebrated event is depicted in early Buddhist art, such as on a pillar of the north gateway of Sāñcī Stūpa I, dating to the first century bce."
    },
    {
      "page": 93,
      "marker": "22",
      "context": "The absence of an image of the Buddha has been ascribed to the 'aniconic phase' of early Buddhist art. Alternately, some art historians argue that such a depiction does not portray the Buddha's presence but commemorates the sacred site."
    },
    {
      "page": 93,
      "marker": "23",
      "context": "This cult spread, in the early centuries of the Common Era, from India through Central Asia to China as well as Korea and Japan."
    },
    {
      "page": 93,
      "marker": "24",
      "context": "Que gates denote palatial or funerary compounds in Han architecture, and this adjustment to employ a local architecture symbol is another example of the acclimatization of foreign images."
    },
    {
      "page": 96,
      "marker": "25",
      "context": "one of the earliest depictions of a pure land, offering a rare glimpse into the beginnings of the new genre of pure land imagery that developed in China"
    },
    {
      "page": 96,
      "marker": "25",
      "context": "See Wong 2004: 151-179."
    },
    {
      "page": 100,
      "marker": "26",
      "context": "the sacred map of Mount Wutai presided over by Mañjuśrī in Cave 61, although in this case a sculptural icon"
    },
    {
      "page": 100,
      "marker": "27",
      "context": "Panofsky 1991; Cassirer 1953-96."
    },
    {
      "page": 101,
      "marker": "28",
      "context": "spiritual meaning is attached to a concrete, material sign and intrinsically given to this sign."
    },
    {
      "page": 101,
      "marker": "29",
      "context": "the extension of the orthogonals does not merge as a single point but converges and meets in pairs"
    },
    {
      "page": 101,
      "marker": "30",
      "context": "In the Renaissance, the invention of the single vanishing point perspective derived from the scientific"
    },
    {
      "page": 101,
      "marker": "31",
      "context": "This distinctive Chinese pure land perspective was so compelling that it became the predominant mode"
    },
    {
      "page": 101,
      "marker": "32",
      "context": "In turn, these pure land paintings were transmitted to Korea and Japan, where some of the"
    },
    {
      "page": 102,
      "marker": "33",
      "context": "such depictions of the Water Moon Guanyin, Mañjuśrī, and Samantabhadra in the Yulin and East Thousand Buddhas"
    },
    {
      "page": 102,
      "marker": "34",
      "context": "Flower Ornament Scripture (Avataṃsaka Sūtra, or Huayan jing in Chinese), one of the most developed Mahāyāna texts."
    },
    {
      "page": 102,
      "marker": "33",
      "context": "Examples include the murals of the Water Moon Guanyin in Yulin Cave 2, and Mañjuśrī and Samantabhadra"
    },
    {
      "page": 105,
      "marker": "35",
      "context": "The flower ornament world is a world purified (and thus ornamented) by Vairocana."
    },
    {
      "page": 105,
      "marker": "36",
      "context": "countless as the sands of the Ganges."
    },
    {
      "page": 105,
      "marker": "37",
      "context": "Although the buddha statue itself was destroyed and recast in the seventeenth century, the lotus pedestal"
    },
    {
      "page": 105,
      "marker": "38",
      "context": "There are some thirty examples of murals and silk paintings at Dunhuang of the so-called Huayan bian"
    },
    {
      "page": 106,
      "marker": "39",
      "context": "magical appearances in seven mythical locations where he expounded the Huayan teachings in nine gatherings"
    },
    {
      "page": 107,
      "marker": "40",
      "context": "identical in composition to a number of wall murals at Dunhuang, such as that of Cave 61"
    },
    {
      "page": 107,
      "marker": "41",
      "context": "became very popular in China and Japan after the tenth century"
    },
    {
      "page": 108,
      "marker": "42",
      "context": "A second silk Huayan painting, of about the same date as the last silk Huayan bian, illustrates the Dasabhumika"
    },
    {
      "page": 115,
      "marker": "1",
      "context": "Paper, a suspension of cellulose fibers collected on a screen and dried into a mat, was invented in China a few centuries before Christ."
    },
    {
      "page": 116,
      "marker": "2",
      "context": "The earliest known printed text is an early eighth-century miniature charm scroll, also printed on paper, that was discovered in a pagoda in Kyongju, Korea, in 1966."
    },
    {
      "page": 117,
      "marker": "3",
      "context": "accessibility to much larger audiences than ever before."
    },
    {
      "page": 117,
      "marker": "4",
      "context": "buildings on the spot and used the parts of the building"
    },
    {
      "page": 117,
      "marker": "5",
      "context": "fragments of the molded plaster muqarnas elements from the vault were actually found there."
    },
    {
      "page": 117,
      "marker": "6",
      "context": "practicing in sixteenth-century Bukhara."
    },
    {
      "page": 118,
      "marker": "7",
      "context": "while others may well date to the seventeenth century or later."
    },
    {
      "page": 118,
      "marker": "8",
      "context": "they were rediscovered in the twentieth century."
    },
    {
      "page": 119,
      "marker": "9",
      "context": "but also in drawing (ãarrÈÊ)."
    },
    {
      "page": 119,
      "marker": "10",
      "context": "in which an entire surface is covered with an unbroken revetment of ceramic pieces"
    },
    {
      "page": 119,
      "marker": "11",
      "context": "the resulting plaque is affixed to the wall."
    },
    {
      "page": 120,
      "marker": "12",
      "context": "not by connecting the intersections of a grid and filling in the squares."
    },
    {
      "page": 120,
      "marker": "13",
      "context": "for the first time."
    },
    {
      "page": 121,
      "marker": "14",
      "context": "discovered several decades ago above the ceiling of the Great Mosque in Sanaa, Yemen."
    },
    {
      "page": 121,
      "marker": "15",
      "context": "have long recognized the relationship between the representation of geographical space and of architectural space."
    },
    {
      "page": 121,
      "marker": "16",
      "context": "prepared for him in the early ninth century by Suhrāb (or Ibn Serapion), in which the points were plotted"
    },
    {
      "page": 122,
      "marker": "17",
      "context": "course, been known to the Greeks."
    },
    {
      "page": 122,
      "marker": "18",
      "context": "graticule scale laid across the northern portion of the continent of Africa, but the cartographer"
    },
    {
      "page": 122,
      "marker": "19",
      "context": "Ancient scientific and technical literature was constrained by the fact that complex visual data"
    },
    {
      "page": 122,
      "marker": "20",
      "context": "In effect, he was the first to digitize images."
    },
    {
      "page": 123,
      "marker": "21",
      "context": "that square. In his map of the Iranian-Turkestan region, longitude and latitude lines form"
    },
    {
      "page": 123,
      "marker": "22",
      "context": "thirteenth century but then dismisses the similarity, although he is unable to determine its origins"
    },
    {
      "page": 123,
      "marker": "23",
      "context": "single cultural sphere."
    },
    {
      "page": 124,
      "marker": "25",
      "context": "arbitrarily on a given area of interest."
    },
    {
      "page": 124,
      "marker": "26",
      "context": "for mapping."
    },
    {
      "page": 124,
      "marker": "27",
      "context": "in which a square plot is divided into nine smaller plots with a well in the center."
    },
    {
      "page": 124,
      "marker": "28",
      "context": "because Chinese wooden buildings of this and earlier periods were planned on grid surfaces."
    },
    {
      "page": 124,
      "marker": "29",
      "context": "capital at Chang'an preserved on a stele dated 1080."
    },
    {
      "page": 124,
      "marker": "30",
      "context": "the grid became the primal flat surface for visualizing space."
    },
    {
      "page": 125,
      "marker": "31",
      "context": "contact during the Ilkhanid and Timurid periods with China along the Paper Road."
    },
    {
      "page": 126,
      "marker": "32",
      "context": "All important dimensions in plan and elevation were based on this entity and were commensurable with it."
    },
    {
      "page": 126,
      "marker": "33",
      "context": "how many bricks would be needed to build a particular structure or how much tile would be needed to decorate its walls."
    },
    {
      "page": 126,
      "marker": "1",
      "context": "The oldest known individual horoscopes come from ancient Mesopotamia."
    },
    {
      "page": 129,
      "marker": "1",
      "context": "The oldest known individual horoscopes come from ancient Mesopotamia."
    },
    {
      "page": 129,
      "marker": "2",
      "context": "Horoscopes found in other regions of the ancient world are similar."
    },
    {
      "page": 129,
      "marker": "3",
      "context": "In Egypt, several Demotic"
    },
    {
      "page": 129,
      "marker": "4",
      "context": "an old Coptic"
    },
    {
      "page": 130,
      "marker": "5",
      "context": "copes, mostly on papyrus, have been discovered."
    },
    {
      "page": 130,
      "marker": "6",
      "context": "only one papyrus from Oxyrhynchos (15-22 ce ; fig. 5.1)"
    },
    {
      "page": 130,
      "marker": "7",
      "context": "eight graffiti from Dura Europos (176 ce and 219 ce ; figs. 5.2; 5.3; 5.4)"
    },
    {
      "page": 130,
      "marker": "8",
      "context": "one graffito from Abydos (353 ce ; fig. 5.5)"
    },
    {
      "page": 130,
      "marker": "9",
      "context": "and an engraving on a wooden object from Palestine"
    },
    {
      "page": 130,
      "marker": "10",
      "context": "Ancient art often represents the zodiac as a circle or a ring, often bearing the images of the zodiacal signs. This standard iconographical pattern needed no explicit inscriptions or symbols."
    },
    {
      "page": 130,
      "marker": "11",
      "context": "The word ζωδιακός was originally an adjective, and the full expression often used is κύκλος ζωδιακός"
    },
    {
      "page": 130,
      "marker": "12",
      "context": "Literary transmission has preserved many ancient Greek horoscopes."
    },
    {
      "page": 130,
      "marker": "13",
      "context": "The largest collection is Vettius Valens's Anthologiai (second century ce ), with 123 examples."
    },
    {
      "page": 130,
      "marker": "14",
      "context": "According to David Pingree's critical edition, no horoscope diagrams were found in the extant codices (eleventh to seventeenth century)"
    },
    {
      "page": 130,
      "marker": "15",
      "context": "The Apotelesmatika of Hephaistion (ca. 415 ce ) contained several horoscope examples in its main part"
    },
    {
      "page": 130,
      "marker": "16",
      "context": "but only one diagram appears, in a codex of the thirteenth century."
    },
    {
      "page": 141,
      "marker": "36",
      "context": "no horoscope examples in the text, we cannot expect to find diagrams in the other early codex of the Mudkhal."
    },
    {
      "page": 141,
      "marker": "37",
      "context": "Abū Ma'shar's Kitāb al-qirānāt (dated 352 H/963 CE) and Ibn ad-Dāyā's commentary on Ptolemy's"
    },
    {
      "page": 141,
      "marker": "38",
      "content": "Ibn ad-Dāyā's commentary on Ptolemy's Karpos (dated 371 H/981 CE) have not yet been edited."
    },
    {
      "page": 141,
      "marker": "39",
      "context": "thirteen century (fig. 5.10)."
    },
    {
      "page": 141,
      "marker": "40",
      "context": "Kitāb al-Kāmil by Mūsā Ibn Nawbakht (twelfth century), 48 horoscopes are represented in three different types"
    },
    {
      "page": 141,
      "marker": "41",
      "context": "fifteenth-century manuscript in Milan includes eleven square diagrams with rhomboid divisions, except one marginal"
    },
    {
      "page": 141,
      "marker": "42",
      "context": "in Abū Ma'shar's astrological history (see the two manuscripts as described in the edition by Keiji Yamamoto and Charles Burnett)."
    },
    {
      "page": 142,
      "marker": "43",
      "context": "people."
    },
    {
      "page": 142,
      "marker": "44",
      "context": "τµήµατα."
    },
    {
      "page": 143,
      "marker": "45",
      "context": "heavens and not simple diagram sketches."
    },
    {
      "page": 143,
      "marker": "46",
      "context": "published."
    },
    {
      "page": 143,
      "marker": "47",
      "context": "primary interest."
    },
    {
      "page": 143,
      "marker": "48",
      "context": "ancient China."
    },
    {
      "page": 144,
      "marker": "49",
      "context": "Ming dynasty."
    },
    {
      "page": 144,
      "marker": "50",
      "context": "bce."
    },
    {
      "page": 144,
      "marker": "51",
      "context": "hemerology."
    },
    {
      "page": 144,
      "marker": "52",
      "context": "tenth century."
    },
    {
      "page": 144,
      "marker": "53",
      "context": "texts."
    },
    {
      "page": 144,
      "marker": "54",
      "context": "Transoxania."
    },
    {
      "page": 144,
      "marker": "55",
      "context": "975,"
    },
    {
      "page": 144,
      "marker": "56",
      "context": "Dunhuang."
    },
    {
      "page": 144,
      "marker": "57",
      "context": "heaven."
    },
    {
      "page": 144,
      "marker": "58",
      "context": "sun."
    },
    {
      "page": 144,
      "marker": "59",
      "context": "5.11)."
    },
    {
      "page": 144,
      "marker": "60",
      "context": "disposed."
    },
    {
      "page": 144,
      "marker": "61",
      "context": "physiognomy"
    },
    {
      "page": 144,
      "marker": "62",
      "context": "topomancy."
    },
    {
      "page": 145,
      "marker": "63",
      "context": "diagram."
    },
    {
      "page": 145,
      "marker": "64",
      "context": "well."
    },
    {
      "page": 145,
      "marker": "65",
      "context": "page."
    },
    {
      "page": 146,
      "marker": "66",
      "context": "Turfan."
    },
    {
      "page": 146,
      "marker": "67",
      "context": "Aral region."
    },
    {
      "page": 151,
      "marker": "1",
      "text": "This chapter is devoted to a close analysis of this cultural contact with East Asia by examining in depth a number of oriental motifs only casually described in earlier literature.",
      "context": "A part of the research and the illustrative material was realized thanks to successive grants from the Bertha and John Garabedian Charitable Foundation of Fresno, California."
    },
    {
      "page": 151,
      "marker": "2",
      "text": "At a conference in 1977, I gave a paper entitled 'Far Eastern Influences in Armenian Miniature Painting in the Mongol Period.'",
      "context": "This paper was part of a panel on 'Patronage and Symbolism in Medieval Armenian Art,' sponsored by the Society for Armenian Studies during the Eleventh Annual Meeting of the Middle East Studies Association in New York."
    },
    {
      "page": 151,
      "marker": "3",
      "text": "As an addendum, I suggested that East Asian works of art may have been partly responsible for a pronounced stylistic change in Cilician painting of the late thirteenth century.",
      "context": "In the mimeographed version of 1977, 7-9; in the published, Kouymjian 1986: 461-468."
    },
    {
      "page": 156,
      "marker": "22",
      "context": "is not really a phoenix but has been assimilated to the animal of Greek mythology since early times."
    },
    {
      "page": 156,
      "marker": "23",
      "context": "positioned nearly identically to phoenixes described as 'soaring' on Jin-dynasty silks, as in one from the Cleveland Museum"
    },
    {
      "page": 156,
      "marker": "24",
      "context": "represented warmth, summer, the sun, and was said to appear to glorify a successful ruler and a peaceful reign."
    },
    {
      "page": 156,
      "marker": "25",
      "context": "in a portrait of Archbishop John, a Gospel commissioned by the clergyman in 1289."
    },
    {
      "page": 156,
      "marker": "26",
      "context": "close to surviving dragons on Chinese silks of the Jin and Yuan dynasties"
    },
    {
      "page": 157,
      "marker": "27",
      "context": "built and decorated in the 1270s under the orders of Abakha Khan."
    },
    {
      "page": 157,
      "marker": "28",
      "context": "later in the fourteenth century and afterward were these motifs Iranized in works such as the Great Mongol Shahname of the 1330s."
    },
    {
      "page": 158,
      "marker": "29",
      "context": "specialists in the field have pointed out that they know of no occurrence of the theme in Yuan art or earlier."
    },
    {
      "page": 158,
      "marker": "30",
      "context": "The tomb is among a group of tombs of the same time, in Xuanhua, Hebei province."
    },
    {
      "page": 160,
      "marker": "31",
      "context": "Ifmy suggestion presented elsewhere 31 has merit—namely, that the lion-Christ Emmanuel headpiece"
    },
    {
      "page": 160,
      "marker": "32",
      "context": "the models for these paintings came either through the exchange of gifts, 32 mentioned regularly in the sources"
    },
    {
      "page": 160,
      "marker": "33",
      "context": "or through the extensive trade with China and Central Asia conducted through Cilician ports primarily by Italians. 33"
    },
    {
      "page": 160,
      "marker": "34",
      "context": "I have argued elsewhere that the impact of Chinese art on Armenia during the Mongol period extended beyond the faithful reproduction ofdistinctive animal motifs to a new treatment of space in painting. 34"
    },
    {
      "page": 160,
      "marker": "31",
      "context": "Kouymjian 2006: 321."
    },
    {
      "page": 160,
      "marker": "32",
      "context": "On the exchange of gifts and visits between the Armenian royalty and Mongol rulers, see Kouymjian 1986: 453-456."
    },
    {
      "page": 160,
      "marker": "33",
      "context": "For a discussion of commerce between the kingdom of Cilician Armenia and East Asia, see Kouymjian 1986: 449-453."
    },
    {
      "page": 160,
      "marker": "34",
      "context": "Kouymjian 1986: 461-468 and figs. 19-22."
    },
    {
      "page": 161,
      "marker": "35",
      "context": "it was only at the end of the thirteenth and the first years ofthe fourteenth century that there was a major revival of interest in it. 35"
    },
    {
      "page": 161,
      "marker": "36",
      "context": "The oldest illustrated Armenian Alexander, a magnificent manuscript now in the Mekhitarist Monastery in Venice, 36 suggests"
    },
    {
      "page": 161,
      "marker": "37",
      "context": "the most important of which are Vardan, Kirakos, Grigor of Akner, and Smbat Sparapet 37 —speak at length"
    },
    {
      "page": 161,
      "marker": "35",
      "context": "For an English translation of the Armenian version of the Alexander Romance with a discussion of the text, see Wolohojian 1969."
    },
    {
      "page": 161,
      "marker": "36",
      "context": "See now the facsimile edition and commentary, Traina 2003."
    },
    {
      "page": 161,
      "marker": "37",
      "context": "Details on texts and translations of these historians can be found in Thomson 1995."
    },
    {
      "page": 162,
      "marker": "38",
      "context": "was copied and painted slightly later in the mid-fourteenth century, from an earlier but lost Byzantine model of the late thirteenth century. 38"
    },
    {
      "page": 162,
      "marker": "39",
      "context": "The engagement of the cavalry of opposing armies is rendered with a similar rhythm ofarmed soldiers and horses in all three manuscripts. 39"
    },
    {
      "page": 162,
      "marker": "38",
      "context": "Xyngopoulos 1966. More recently, a facsimile edition has been published in Greek by Trahoulias 1997"
    },
    {
      "page": 162,
      "marker": "39",
      "context": "Armenian example, the V424, fols. 89v-90; Great Mongol Shāhnāma, Iskandar Killing the Fur of Hind, the Keir Collection, Komaroff and Carboni 2002: fig. 36"
    },
    {
      "page": 163,
      "marker": "40",
      "content": "The seated position of the emperor, common in early Byzantine art, gives way, more often than not, to formal portraits"
    },
    {
      "page": 163,
      "marker": "41",
      "context": "and Ilkhanid examples, and more rigidly seated, with knees together, in the Byzantine manuscript. 40"
    },
    {
      "page": 163,
      "marker": "40",
      "context": "In the Hellenic Institute Byzantine manuscript, though the seated ruler (scores of examples) looks stiffer than in the Armenian or Persian examples"
    },
    {
      "page": 163,
      "marker": "41",
      "context": "Contemporary examples include, for the Armenian, the figures of Prince Levon and his wife Keran"
    },
    {
      "page": 169,
      "marker": "1",
      "context": "oldest non-Chinese representation of the Silk Road, see Herrmann 1922."
    },
    {
      "page": 169,
      "marker": "2",
      "context": "manuscript of the 'Compendium of the Languages of the Turks' by al-Kāshgharī, is kept in Istanbul. It has been carefully translated by Dankoff and Kelly 1982-85"
    },
    {
      "page": 169,
      "marker": "3",
      "context": "Comparing al-Kāshgharī's map with those by Arabic geographers will assist us in understanding his visual language."
    },
    {
      "page": 169,
      "marker": "4",
      "context": "adapted it to his own needs as can be seen in the eastward rather than southward orientation of his map. Miller 1926-31"
    },
    {
      "page": 170,
      "marker": "5",
      "context": "Japan (Djābarqā) in the east. Herrmann 1935: 23; Sezgin 2000-07"
    },
    {
      "page": 171,
      "marker": "6",
      "context": "Arabic maps are a constant challenge to today's readers."
    },
    {
      "page": 171,
      "marker": "7",
      "context": "The absence of scales in Arabic-Islamic maps wrongly suggests that cartographers"
    },
    {
      "page": 171,
      "marker": "8",
      "context": "were not even interested in precise calculations."
    },
    {
      "page": 171,
      "marker": "9",
      "context": "degrees and minutes), color and orientation."
    },
    {
      "page": 172,
      "marker": "10",
      "context": "and many regional maps."
    },
    {
      "page": 172,
      "marker": "11",
      "context": "on the map' (fî l-ßûra)."
    },
    {
      "page": 172,
      "marker": "12",
      "context": "on a rotating net."
    },
    {
      "page": 172,
      "marker": "13",
      "context": "and small diagrammatic maps."
    },
    {
      "page": 172,
      "marker": "14",
      "context": "they are referred to in the books they are part of."
    },
    {
      "page": 172,
      "marker": "15",
      "context": "The geographers stress that their works"
    },
    {
      "page": 173,
      "marker": "16",
      "context": "predecessors, and they constantly describe their maps and refer to them."
    },
    {
      "page": 173,
      "marker": "17",
      "context": "and they constantly describe their maps and refer to them."
    },
    {
      "page": 173,
      "marker": "18",
      "context": "and grey for mountains."
    },
    {
      "page": 173,
      "marker": "19",
      "context": "finished in 956)."
    },
    {
      "page": 173,
      "marker": "20",
      "context": "Book on the Image of the Earth."
    },
    {
      "page": 173,
      "marker": "21",
      "context": "or birds."
    },
    {
      "page": 173,
      "marker": "22",
      "context": "of coastal lines."
    },
    {
      "page": 173,
      "marker": "23",
      "context": "of shapes."
    },
    {
      "page": 174,
      "marker": "24",
      "context": "and learn,"
    },
    {
      "page": 174,
      "marker": "25",
      "context": "relative locations,"
    },
    {
      "page": 174,
      "marker": "26",
      "context": "and seas with coastal lines."
    },
    {
      "page": 175,
      "marker": "27",
      "context": "writes: 'We explained that on the image ( ßå ra ) to make it clearer.' 27"
    },
    {
      "page": 175,
      "marker": "28",
      "context": "image ( ßå rat ).' 28 Geographers considered their maps an integral"
    },
    {
      "page": 175,
      "marker": "29",
      "context": "Compendium of the Languages of the Turks ( D Ê w § n lugh § t al-Turk ). 29"
    },
    {
      "page": 175,
      "marker": "30",
      "context": "al-Muqtad Ê (1075-1094), 30 to whom the book is dedicated"
    },
    {
      "page": 176,
      "marker": "31",
      "context": "and so on (3,17-6,5). 31 Each linguistic feature is carefully"
    },
    {
      "page": 176,
      "marker": "32",
      "context": "yellow dots-may represent where these Turkish tribes lived, 32 with the"
    },
    {
      "page": 176,
      "marker": "33",
      "context": "Qarakh § nid dynasty at its center. 33 The background information"
    },
    {
      "page": 176,
      "marker": "34",
      "context": "represent roads 34 cannot be supported because al-K § shghar Ê"
    },
    {
      "page": 176,
      "marker": "35",
      "context": "northern China). 35 He knows Turkish proper, the"
    },
    {
      "page": 176,
      "marker": "36",
      "context": "Qirqiz (3, 3-7; 69,4-8). 36 But is there a way"
    },
    {
      "page": 177,
      "marker": "37",
      "context": "this or that tribe . 37 He emphasizes that the reader"
    },
    {
      "page": 177,
      "marker": "38",
      "context": "introduced in the map. 38 With the Istanbul manuscript, we"
    },
    {
      "page": 179,
      "marker": "39",
      "context": "The copyist changed the general layout of the map drastically when he added 39 a survey of the wider Islamic World."
    },
    {
      "page": 179,
      "marker": "40",
      "context": "and the hot deserts [of the Sahara]. 40 Farther north, a column stretches from northwest Iran"
    },
    {
      "page": 179,
      "marker": "41",
      "context": "belongs to Greater China ('Ên, 228,6-9). 41 He adds that the Oghuz erroneously call"
    },
    {
      "page": 180,
      "marker": "42",
      "context": "and non-Islamic countries, where only some 42 few names need to be quoted (19,17-20,3)."
    },
    {
      "page": 180,
      "marker": "43",
      "context": "sound indecent in Turkish (168,10-169,1). 43 The only Islamic features of the map are"
    },
    {
      "page": 180,
      "marker": "44",
      "context": "are Adam's descent to Earth in Sri Lanka; 44 the Land of Gog and Magog"
    },
    {
      "page": 180,
      "marker": "45",
      "context": "the Land of Gog and Magog with Alexander the Great's Wall 45 and the City"
    },
    {
      "page": 180,
      "marker": "46",
      "context": "Alexander the Great's Wall 45 and the City of the Women; 46 and Dja ̄barqa ̄,"
    },
    {
      "page": 180,
      "marker": "47",
      "context": "which may allude to Alexander the Great. Mecca and Medina are unmentioned 47 and seem not to exist."
    },
    {
      "page": 180,
      "marker": "48",
      "context": "Mecca and Medina are unmentioned and seem not to exist. 48 Language also divides"
    },
    {
      "page": 180,
      "marker": "49",
      "context": "basis of his work. 49 As we have just seen, compared to the original"
    },
    {
      "page": 180,
      "marker": "50",
      "context": "Greater China ('Ên) and Byzantium (Råm), the two poles of the Turkish world. 50 Of"
    },
    {
      "page": 180,
      "marker": "42",
      "context": "When he discusses lake names, al-Kashgharî emphasizes that Islamic and non-Islamic countries need to be treated"
    },
    {
      "page": 180,
      "marker": "43",
      "context": "On al-Kashgharî's viewpoint on the struggle between Muslims and non-Muslims (mainly Buddhists), see Brockelmann"
    },
    {
      "page": 180,
      "marker": "44",
      "context": "Adam's descent to Earth in Sri Lanka, see Herrmann 1935: 22."
    },
    {
      "page": 180,
      "marker": "45",
      "context": "The Alexander Romance is also mentioned in al-Kashgharî's text (24,10-12; 57,16-58,9;"
    },
    {
      "page": 180,
      "marker": "46",
      "context": "On locating the Land of Gog and Magog with its wall in the southeast"
    },
    {
      "page": 180,
      "marker": "47",
      "context": "wall that reflects the Indian Mount Meru. 46 Dankoff 1973: 240 n. 24. 47"
    },
    {
      "page": 180,
      "marker": "48",
      "context": "place encircled by a wall that reflects the Indian Mount Meru. 47 Wensinckh"
    },
    {
      "page": 180,
      "marker": "49",
      "context": "Dankoff 1973: 240 n. 24. 47 Wensinckh 1918: 31f., 36. 48 Devereux"
    },
    {
      "page": 180,
      "marker": "50",
      "content": "Wensinckh 1918: 31f., 36. 48 Devereux 1959: 138. 49 Dankoff and Kelly"
    },
    {
      "page": 181,
      "marker": "51",
      "context": "could easily match the remaining three dots east of Barsghân. At the center"
    },
    {
      "page": 181,
      "marker": "52",
      "context": "say the Indus the Syr Darya (Sayâân). 52 Conclusion Arabic-Islamic geographers used"
    },
    {
      "page": 187,
      "marker": "1",
      "context": "history of medieval cartography. This newly discovered manuscript contains a remarkable series of early maps"
    },
    {
      "page": 188,
      "marker": "2",
      "context": "On the circular world map attributed to al-Idrîsî, and for a list of preserved copies, see Ahmad 1992."
    },
    {
      "page": 188,
      "marker": "3",
      "context": "See Rapoport and Savage-Smith 2008, and the discussions of this map by Jonathan Bloom and Andreas Kaplony in this volume."
    },
    {
      "page": 190,
      "marker": "4",
      "context": "The map of the Nile in the Book of Curiosities is quite similar to the map of the Nile made by al-Khwârizmî. See al-Khwârizmî 1926: pl. III."
    },
    {
      "page": 190,
      "marker": "5",
      "context": "Around the lake is the domain of the Peçeneg Turks. These people have an annual celebration in which they circumambulate this lake. Bodl. Ms. Arab. c. 90, fol. 40b."
    },
    {
      "page": 190,
      "marker": "6",
      "context": "Tamîm also states that water enters this lake from the direction of Tibet through 150 streams, large and small. Minorsky 1947-48: 280."
    },
    {
      "page": 190,
      "marker": "7",
      "context": "The Tigil nomadic tribesmen who live on the shores of the Issîq Kul are also described by the anonymous author of the Hudûd al-'âlam writing in 982. Hudûd 1970: 98-99."
    },
    {
      "page": 190,
      "marker": "7",
      "context": "Minorsky suggests that the chapter was taken from the work of al-Djayhhânî. For further references to Lake Issîq Kul in Arabic geographical literature, see Barthold and Spuler 1978."
    },
    {
      "page": 191,
      "marker": "8",
      "context": "This single river originates in the mountains of Tibet, shown as a red landmass at the top of the map."
    },
    {
      "page": 191,
      "marker": "9",
      "context": "The labels at the center of the page refer to Hindu cities along the banks of the Ganges, such as Benares, Prayâg, and, most prominently, Qanawdj."
    },
    {
      "page": 191,
      "marker": "9",
      "context": "Today Qanawdj lies in the Farrukhhâbâd district of present-day Uttar Pradesh. Tripathi 1959: 3; Dames and Burton-Page 1978."
    },
    {
      "page": 192,
      "marker": "10",
      "context": "army consists of twenty-five hundred elephants."
    },
    {
      "page": 192,
      "marker": "11",
      "context": "The middle of India is the country round Qanawdj, which they call Madhyadeša, i.e., the middle of the realm."
    },
    {
      "page": 192,
      "marker": "12",
      "context": "al-Bîrûnî portrays the geography of India as a list of routes connecting the city with the different parts of India."
    },
    {
      "page": 192,
      "marker": "13",
      "context": "In pre-Islamic Buddhist sources, there is frequent reference to the important trade route that proceeded from the Indus delta."
    },
    {
      "page": 192,
      "marker": "14",
      "context": "Early Islamic geographers attest to the continuous use of this desert route through Mathura, notwithstanding the Muslim conquest of Sind."
    },
    {
      "page": 192,
      "marker": "15",
      "context": "The author of the Hudûd al-'âlam mentions that the merchandise of India is brought to Arûr and other small towns."
    },
    {
      "page": 192,
      "marker": "16",
      "context": "By the eleventh century, however, Multân had become the western terminus point of the desert route coming from the Gangetic valley."
    },
    {
      "page": 193,
      "marker": "17",
      "context": "which is probably Dhavalpur or Dûpâlpâr, modern Dholpur, on the Bîâh tributary of the Indus."
    },
    {
      "page": 193,
      "marker": "18",
      "context": "The fifth label, which reads Bânâshwar, is probably the city of Thaneswar or Thânesar, famed for its Hindu shrine."
    },
    {
      "page": 193,
      "marker": "19",
      "context": "which is possibly a gross corruption of Mathûra, noted by other medieval sources as the chief entrepot."
    },
    {
      "page": 193,
      "marker": "20",
      "context": "The second section of the itinerary is entitled 'The Road to China from [Qanawdj]'"
    },
    {
      "page": 193,
      "marker": "21",
      "context": "Evidence, mainly from non-Muslim sources, suggests that the ancient overland passage from India to China through Assam and Myanmar emerged."
    },
    {
      "page": 194,
      "marker": "22",
      "context": "From there various routes led to Myanmar and Yunnan, in southwestern China."
    },
    {
      "page": 194,
      "marker": "23",
      "context": "It was established in the mid-seventh century and acquired a short-lived importance from the mid-ninth to the mid-tenth century."
    },
    {
      "page": 194,
      "marker": "24",
      "context": "al-Bîrûnî describes a third eastern route from Qanawdj toward Assam, and then relates an account of a traveler."
    },
    {
      "page": 194,
      "marker": "25",
      "context": "The author of the Hudûd al-'âlam also describes a river crossing at the Sino-Tibetan border, a sign of some knowledge."
    },
    {
      "page": 194,
      "marker": "26",
      "context": "through the cities of Prayâg (Allâhâbâd), Benares, and Pâtaliputra (written as BTZ)"
    },
    {
      "page": 195,
      "marker": "27",
      "context": "Sacked by Maèmûd of Ghazna in 1018, it was no longer the capital of the kingdom by al-Bîrûnî's day."
    },
    {
      "page": 196,
      "marker": "28",
      "context": "demonstrates this distinction visually. 28 Early Arab-Islamic geographers were likewise"
    },
    {
      "page": 196,
      "marker": "29",
      "context": "Early Arab-Islamic geographers were likewise aware of the distinction between the Indus and the Ganges. 29 At the same time,"
    },
    {
      "page": 196,
      "marker": "30",
      "context": "Al-Mas'udi is sufficiently familiar with Indian geography to mock al-Djahiz for suggesting a connection between the Indus and the Nile. 30 But elsewhere"
    },
    {
      "page": 196,
      "marker": "31",
      "context": "Indus (Mihran), like the Nile, flows from south to north. 31 The author of the Hudud al-'alam,"
    },
    {
      "page": 196,
      "marker": "32",
      "context": "city. 32 Aloe-wood was brought all the way from Kamariopa (Assam) to the temple"
    },
    {
      "page": 196,
      "marker": "33",
      "context": "god at Multan, where the merchants then bought it from the priests of the deity. 33 Since Multan attracted"
    },
    {
      "page": 197,
      "marker": "34",
      "context": "deformed, but it seems that, for a traveler coming from the direction of India, one of the first two cities may be Khanfa (Guangzhou), 34 the port of Canton."
    },
    {
      "page": 198,
      "marker": "35",
      "context": "away from China by ship. 35 Though several scholars have identified this land with a synonymous locality"
    },
    {
      "page": 198,
      "marker": "36",
      "context": "with a synonymous locality in western India, Hubert Daunicht suggests that Armma'il could be a mistake for BaruManil, 36 the bay"
    },
    {
      "page": 198,
      "marker": "37",
      "context": "attested in medieval Arabic sources. 37 The labels indicated on the Indian coasts at the top"
    },
    {
      "page": 199,
      "marker": "38",
      "context": "Southeast Asia and China. But all other medieval Islamic geographers, including the two world maps found in the Book of Curiosities itself, allow for a narrow opening at the eastern edge of the Indian Ocean. 38 Moreover,"
    },
    {
      "page": 200,
      "marker": "39",
      "context": "scant information about the Silk Road in the Arabic geographical literature. 39 The lack of any direct reference"
    },
    {
      "page": 200,
      "marker": "40",
      "context": "Étienne de la Vaissière's conclusions about the sharp decline in the importance of the Silk Road during the ninth and tenth centuries. 40 These centuries saw trade shifting"
    },
    {
      "page": 200,
      "marker": "41",
      "context": "importance of the maritime route for Muslim merchants has been overestimated. 41 Sen 2003: 176-182 notes that, between the late tenth"
    },
    {
      "page": 207,
      "marker": "1",
      "context": "Sky maps in the classical tradition often represent the convex and outer surface of the celestial globe"
    },
    {
      "page": 207,
      "marker": "2",
      "context": "the possibility of mapping the celestial sphere on a plane surface is well attested in theory"
    },
    {
      "page": 207,
      "marker": "3",
      "context": "The oldest Arabic map of the celestial vault is the fresco in the cupola of the caldarium of the Omayyad desert castle"
    },
    {
      "page": 207,
      "marker": "4",
      "context": "It thus appears that specimens of Greek celestial globes survived into the early Islamic period"
    },
    {
      "page": 208,
      "marker": "5",
      "context": "About 130 Arabic-Islamic celestial globes survive today"
    },
    {
      "page": 208,
      "marker": "6",
      "context": "The number of stars has varied from 17 stars in the tenth century to nearly 70 stars"
    },
    {
      "page": 209,
      "marker": "7",
      "context": "Jean-Baptiste Tavernier would have brought them to Persia during his fourth trip to the Near East"
    },
    {
      "page": 209,
      "marker": "8",
      "context": "Arab cartographers knew the details of Ptolemy's constellations through Greek celestial globes and translations"
    },
    {
      "page": 209,
      "marker": "9",
      "context": "With rare exceptions, he did not illustrate the old Arabic asterisms"
    },
    {
      "page": 209,
      "marker": "10",
      "context": "Manuscripts of what I have called the ''åf Ê Latinus Corpus' accurately rendered these dots"
    },
    {
      "page": 209,
      "marker": "11",
      "context": "Al'åf Ê 's book itself was not translated into Latin in the Middle Ages"
    },
    {
      "page": 210,
      "marker": "12",
      "context": "Apian was thus able to include several old Arabic asterisms, completely drawn as full figures"
    },
    {
      "page": 210,
      "marker": "13",
      "context": "The illustrations discussed here are further analyzed by ¥ iva Vesel and other scholars"
    },
    {
      "page": 215,
      "marker": "1",
      "context": "Angelino Dulcert, Portolan Chart, BnF, Res 08 Ge B 696; Catalan Atlas, BnF, Esp. 30."
    },
    {
      "page": 215,
      "marker": "2",
      "context": "Campbell 1987: 381; Sezgin 2000, vol. 1: 310-315, 332-337. See also Sezgin's discussion of other researchers' positions, Sezgin 2000, vol. 1: 285-300."
    },
    {
      "page": 215,
      "marker": "3",
      "context": "Drecoll 2000: 42-43."
    },
    {
      "page": 216,
      "marker": "4",
      "context": "maps also come from Arabic or Persian ancestors."
    },
    {
      "page": 216,
      "marker": "5",
      "context": "represented on Vesconte's and Paolino's maps, with its islands and surrounding ring of mountains."
    },
    {
      "page": 216,
      "marker": "6",
      "context": "Catalan and Catalan-style maps of the fourteenth and fifteenth centuries."
    },
    {
      "page": 216,
      "marker": "7",
      "context": "Byzantine maps of the late thirteenth and fourteenth centuries display it."
    },
    {
      "page": 216,
      "marker": "8",
      "context": "influence of Arabic maps on Byzantine mapmaking."
    },
    {
      "page": 216,
      "marker": "9",
      "context": "The text of Ptolemy's Geography, however, indicates the existence of this gulf, too."
    },
    {
      "page": 216,
      "marker": "10",
      "context": "Western mapmakers did not know how to place correctly because they lacked necessary geographical knowledge."
    },
    {
      "page": 217,
      "marker": "11",
      "context": "positioning and with regard to the rivers flowing into the lake."
    },
    {
      "page": 219,
      "marker": "12",
      "context": "He places these springs on exactly the same degree of northern latitude."
    },
    {
      "page": 219,
      "marker": "13",
      "context": "The small difference in latitude is repeated in Dulcert's map and several of the later Catalan-style world maps."
    },
    {
      "page": 219,
      "marker": "12",
      "context": "Ptolemaeus 1990: 40, 122. Ptolemaeus 1990: 40."
    },
    {
      "page": 220,
      "marker": "14",
      "context": "A look in the Greek text of the Geography shows that Ptolemy indeed described Eulaios as a river."
    },
    {
      "page": 220,
      "marker": "15",
      "context": "In other Arabic and Persian maps, this bifurcating system is identified as a border separating Khuzistan."
    },
    {
      "page": 220,
      "marker": "14",
      "context": "Ptolemaeus 1990: 90."
    },
    {
      "page": 220,
      "marker": "15",
      "context": "Miller 1986: 42-47."
    },
    {
      "page": 223,
      "marker": "16",
      "context": "Gulf. It is identified today with the river Kerkha, a branch of the Kårån, a tributary to the Shaãã al-'Arab."
    },
    {
      "page": 223,
      "marker": "16",
      "context": "http://www.reference-guides.com/isbe/U/ULAI/. Potts 1999: 27-44."
    },
    {
      "page": 224,
      "marker": "17",
      "context": "enteenth-century Safavid and Moghul miniatures (color fig. 10.4)."
    },
    {
      "page": 224,
      "marker": "18",
      "context": "Occasionally, they are found on thirteenth- and fourteenth-century Ilkhanid miniatures and ceramics, and even on pre-Ilkhanid book illustrations from northern Iraq, Anatolia, or Iran."
    },
    {
      "page": 224,
      "marker": "19",
      "context": "In pre-Ilkhanid times, the motif of a spotted horse appears more often on objects such as bowls, plates, and bottles."
    },
    {
      "page": 224,
      "marker": "20",
      "context": "Spotted horses as an iconographic motif reached the Iberian Peninsula as early as the tenth century. From Islamic objects of art the motif moved into illustrations of Castilian literature."
    },
    {
      "page": 224,
      "marker": "21",
      "context": "Other examples of spotted horses are present in Chinese paintings copying a so-called Central Asian style."
    },
    {
      "page": 224,
      "marker": "22",
      "context": "The Khotanese horse is linked to Seljuq and Ilkhanid piebald horses through its knotted tail, a feature missing in the Catalan Atlas."
    },
    {
      "page": 224,
      "marker": "23",
      "context": "This kind of tail can be found in numerous portraits of dromedaries on miniatures-for instance, in late-thirteenth-century manuscripts of al-Hariri's Maqamat."
    },
    {
      "page": 225,
      "marker": "24",
      "context": "donkey-)like tails are much rarer but can be found on plates and bowls."
    },
    {
      "page": 225,
      "marker": "25",
      "context": "They can be seen much more often and clearly in Timurid and Safavid miniatures."
    },
    {
      "page": 225,
      "marker": "26",
      "context": "It has been assumed that the motif of spotted and brightly colored horses in the Catalan Atlas came from Andalusian, Fatimid, Abbasid, or Seljuq art objects."
    },
    {
      "page": 225,
      "marker": "27",
      "context": "Pre-Ilkhanid piebald horses do not show small circles or dots but flowerlike images or larger blotches of irregularly curved shape."
    },
    {
      "page": 225,
      "marker": "28",
      "context": "Piebald horses in Ilkhanid manuscripts are often depicted with regular small circles. The color of the horses ranges from black and brown to a bright red."
    },
    {
      "page": 225,
      "marker": "29",
      "context": "Piebald horses in late and post-Ilkhanid manuscripts are adorned with tiny dots and appear mostly in light blue, pink, white, or black."
    },
    {
      "page": 226,
      "marker": "30",
      "context": "Alternative sources of inspiration may have come from Islamic cultures around the Mediterranean Sea. Examples are ceramic dishes, which were occasionally used as decoration on the outer walls of churches in Pisa, Genoa, and other towns in Italy, Sicily, and further Mediterranean islands, as well as glass and metal objects."
    },
    {
      "page": 227,
      "marker": "31",
      "context": "eastern Islamic iconographic forms. This is particularly true for the dress, the throne, the falcon, and the cushion."
    },
    {
      "page": 227,
      "marker": "32",
      "context": "all three rulers and their sitting postures, including the positioning of their arms and hands-all are found in princely images on coins"
    },
    {
      "page": 227,
      "marker": "33",
      "context": "Ilkhanid and Timurid princes, while the cap seems to be more closely connected with Turkmen rulers."
    },
    {
      "page": 227,
      "marker": "34",
      "context": "more often shows rulers with high fur caps, crowned caps, or trident crowns."
    },
    {
      "page": 228,
      "marker": "35",
      "context": "during the reigns of the Aq Qoyunlu and the Qar Qoyunlu."
    },
    {
      "page": 228,
      "marker": "36",
      "context": "Cushions in the form of two rolls appear in late Ilkhanid illustrations of the Sh hn ma."
    },
    {
      "page": 228,
      "marker": "37",
      "context": "well known from Sasanian hunting scenes, but also from portraits of Turkic princes."
    },
    {
      "page": 228,
      "marker": "38",
      "context": "a scepter held by a sitting Sogdian nobleman in a mural painting of Pandjikent."
    },
    {
      "page": 229,
      "marker": "39",
      "context": "Sasanian banquets are two major starting points for the later Islamic representations."
    },
    {
      "page": 229,
      "marker": "40",
      "context": "From there, links run to Buddhist art in Central Asia and tribal art of western Iranian settlers alongside the Don."
    },
    {
      "page": 229,
      "marker": "41",
      "context": "marking the figure of a ruler."
    },
    {
      "page": 229,
      "marker": "42",
      "context": "green used in some miniatures resemble those of the Rey del Tauris and Jani-beg."
    },
    {
      "page": 230,
      "marker": "43",
      "context": "and the baldachin held high over his head by his servants."
    },
    {
      "page": 230,
      "marker": "44",
      "context": "shows a distinct similarity to the preferred crown of the Catalan Atlas."
    },
    {
      "page": 235,
      "marker": "Kaplony",
      "context": "maps made in modern Europe and America (Kaplony). We run the risk of misreading"
    },
    {
      "page": 235,
      "marker": "Heller",
      "context": "pilgrims who viewed it centuries ago (Heller). Yet we are hard pressed to propose"
    },
    {
      "page": 235,
      "marker": "Wong",
      "context": "impact on China (Wong). Likewise, ancient Greek gridded plans must be reconstructed"
    },
    {
      "page": 236,
      "marker": "Bloom",
      "context": "from literary allusions (Bloom). Likewise, we lack the evidence needed to bridge the gap between Greek and Arabic"
    },
    {
      "page": 236,
      "marker": "Thomann",
      "context": "between Greek and Arabic horoscope diagrams from the fourth to tenth centuries (Thomann). The original context of Silk Road"
    },
    {
      "page": 236,
      "marker": "Heller",
      "context": "entirety (Heller). We act as though Arabic illustrative maps were independent single sheets and not included in the books"
    },
    {
      "page": 236,
      "marker": "Kaplony",
      "context": "included in the books they used to be part of (Kaplony). As we make such items more available to the general"
    },
    {
      "page": 236,
      "marker": "Heller",
      "context": "Mount Wutai maps (Heller), in the captions in the margins of Arabic maps, and in the references in the geographical"
    },
    {
      "page": 236,
      "marker": "Kaplony",
      "context": "in the geographical texts they illustrated (Kaplony). The Context of Transmission The pace of diffusion along the Silk Road"
    },
    {
      "page": 236,
      "marker": "Heller",
      "context": "support granted by the local political elite (Heller). Rulers, however, did not control the diffusion of the images whose"
    },
    {
      "page": 236,
      "marker": "Bloom",
      "context": "thirteenth century (Bloom). [Page 237] The situation on the Silk Road changed when the Mongol khans reorganized travel"
    },
    {
      "page": 237,
      "marker": "Kouymjian",
      "context": "dragon and phoenix personified the imperial couple (Kouymjian). The emergence of gridded maps (Bloom) and square horoscopes"
    },
    {
      "page": 237,
      "marker": "Bloom",
      "context": "couples (Kouymjian). The emergence of gridded maps (Bloom) and square horoscopes (Thomann) further exemplifies the sudden"
    },
    {
      "page": 237,
      "marker": "Thomann",
      "context": "gridded maps (Bloom) and square horoscopes (Thomann) further exemplifies the sudden fracture that separated the old visual"
    },
    {
      "page": 237,
      "marker": "Brentjes",
      "context": "context (Brentjes). This recontextualization differed, therefore, from what we have just said about Buddhist cosmology in China and"
    },
    {
      "page": 237,
      "marker": "Bloom",
      "context": "original concepts (Bloom). Concepts did not move from one language to the next without being altered. To discuss the"
    },
    {
      "page": 237,
      "marker": "Bloom",
      "context": "original concepts (Bloom). Adaptation is a richly illustrated theme in our sources. Buddhist models may have inspired the verticality"
    },
    {
      "page": 237,
      "marker": "Zufferey",
      "context": "verticality of Han-dynasty pagodas (Zufferey). Chinese artists customized Indian iconography when they placed bodhisattvas in niches with"
    },
    {
      "page": 238,
      "marker": "Wong",
      "context": "lands with a convergent multiple-point perspective (Wong). The Mongol expansion brought to Armenian artists a similar change, from"
    },
    {
      "page": 238,
      "marker": "Kouymjian",
      "context": "previous flatness to the relief of Chinese landscape scenes (Kouymjian). Chinese cartographers employed gridded plans to evaluate distances"
    },
    {
      "page": 238,
      "marker": "Bloom",
      "content": "guidelines for building construction and cost calculations (Bloom). The square diagrams from Central Asia that determined auspicious days"
    },
    {
      "page": 238,
      "marker": "Thomann",
      "context": "became the Islamic and European horoscopes (Thomann). From such instances, we conclude that the cultures of the Silk Road"
    },
    {
      "page": 238,
      "marker": "Bloom",
      "context": "Road often used the same tools in different ways (Bloom). Often playful, the adoption of new concepts also implied"
    },
    {
      "page": 238,
      "marker": "Rapoport; Bloom",
      "context": "coastlines did not confirm (Rapoport; Bloom). The first square horoscopes in the Muslim world hesitated between a rhomboid"
    },
    {
      "page": 238,
      "marker": "Thomann",
      "context": "the norm. The ancient circle horoscopes that in theory depicted the heavens were introduced much later (Thomann). Transmission through"
    },
    {
      "page": 238,
      "marker": "Kaplony",
      "context": "minimize mistakes-a method similar to text encoding (Kaplony). Aesthetic considerations may also have influenced stylistic conventions (Rapoport). The"
    },
    {
      "page": 238,
      "marker": "Rapoport",
      "context": "stylistic conventions (Rapoport). The point is that the rules followed for image-copying and text-copying were different (Bloom). Text-mediated"
    },
    {
      "page": 238,
      "marker": "Bloom",
      "context": "and text-copying were different (Bloom). Text-mediated transmission provided a secure way to convey information. Translating from image to"
    },
    {
      "page": 239,
      "marker": "Zufferey",
      "context": "tusks on each side (Zufferey). At the beginning of the eighth century, Arabic craftsmen erroneously copied the outer"
    },
    {
      "page": 239,
      "marker": "Kunitzsch",
      "context": "vault of a palace (Kunitzsch). Other mistakes made when turning textual data into a map are found in the Arabic"
    },
    {
      "page": 239,
      "marker": "Rapoport",
      "context": "one (Rapoport). For centuries, mapmakers preferred to transmit spatial information through texts, as Ptolemy (90-168 ce) did. His safe"
    },
    {
      "page": 239,
      "marker": "Kaplony",
      "context": "for maximal accuracy. The description of precise Arabic maps is another case of texts acting as support for map data (Kaplony)."
    },
    {
      "page": 239,
      "marker": "Brentjes",
      "context": "Arabic maps (Brentjes). Catalan portolan charts thus display physical elements of Western Asia that match Arabic textual sources, even"
    },
    {
      "page": 241,
      "marker": "1",
      "context": "Although all of its names and terms have been commented upon, 1 so far, scholars have never used the wealth"
    },
    {
      "page": 242,
      "marker": "2",
      "context": "uniform both in the following list and on color fig. 7.2, 2 and the Arabic article, inconsistently"
    },
    {
      "page": 242,
      "marker": "3",
      "context": "one of its attribuents ( shu # ba minhu ); 3 Dict./Own Entry: r. Ätil, in Ld."
    },
    {
      "page": 246,
      "marker": "4",
      "context": "assumes that the two references to Qif´§q on the map mirror al-K§shghar§'s use of the term"
    },
    {
      "page": 251,
      "marker": "6",
      "context": "For Türkmän, see Peter B. Golden, An Introduction to the History of the Turkic Peoples: Ethnogenesis and State-Formation in Medieval and Early Modern Eurasia and the Middle East, Turcologica vol. 9 (Wiesbaden: Harrassowitz, 1992), 212."
    }
  ],
  "summary": {
    "abstract": "This edited volume examines the transmission and transformation of maps and geographical images across the Silk Road from antiquity through the medieval period. Drawing on contributions from scholars of Islamic studies, Chinese history, Buddhist art, and cartography, the book argues that spatial concepts—including cosmological diagrams, astronomical representations, and geographical depictions—traveled alongside merchants and pilgrims, influencing diverse intellectual and artistic traditions from Arabic astronomy to Armenian manuscripts to Chinese landscape painting. The collection demonstrates that maps and images functioned not as objective representations but as culturally contingent visual and textual artifacts that were adapted, reinterpreted, and integrated into local knowledge systems across Eurasia.",
    "contents": [
      {
        "heading": "Acknowledgments",
        "page": 11
      },
      {
        "heading": "Contributors",
        "page": 13
      },
      {
        "heading": "Transliterations and Conventions",
        "page": 17
      },
      {
        "heading": "Illustrations and Map",
        "page": 19
      },
      {
        "heading": "Foreword",
        "page": 25
      },
      {
        "heading": "Preface: What is a Map?",
        "page": 27
      }
    ]
  }
}