{
  "1": [
    {
      "label": "section_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 68.0,
        "b": 571.0,
        "r": 361.5,
        "t": 603.0
      }
    },
    {
      "label": "text",
      "text": "K. Wolstencroft, A. Brass, I. Horrocks, P. Lord, U. Sattler, D. Turi, and R. Stevens",
      "bbox": {
        "l": 85.0,
        "b": 525.5,
        "r": 343.0,
        "t": 547.5
      }
    },
    {
      "label": "text",
      "text": "School of Computer Science, University of Manchester, UK",
      "bbox": {
        "l": 94.5,
        "b": 505.0,
        "r": 334.0,
        "t": 514.5
      }
    },
    {
      "label": "text",
      "text": "Abstract. We show how state-of-the-art Semantic Web technology can be used in e-Science, in particular, to automate the classification of pro- teins in biology. We show that the resulting classification was of compara- ble quality to that performed by a human expert, and how investigations using the classified data even resulted in the discovery of significant infor- mation that had previously been overlooked, leading to the identification of a possible drug-target.",
      "bbox": {
        "l": 69.0,
        "b": 398.0,
        "r": 359.5,
        "t": 473.5
      }
    },
    {
      "label": "section_header",
      "text": "1 Introduction",
      "bbox": {
        "l": 41.5,
        "b": 365.5,
        "r": 135.5,
        "t": 375.0
      }
    },
    {
      "label": "text",
      "text": "Semantic Web research has seen impressive strides in the development of lan- guages, tools, and other infrastructure. In particular, the OWL ontology lan- guage, the Protégé ontology editor, and OWL reasoning tools such as FaCT-++ and Racer are now in widespread use.",
      "bbox": {
        "l": 41.0,
        "b": 304.5,
        "r": 387.5,
        "t": 350.0
      }
    },
    {
      "label": "text",
      "text": "In this paper, we report on an application of Semantic Web technology in the domain of biology, where an OWL ontology and an OWL classification tool called the Instance Store were used to automate the classification of protein data. We show that the resulting classification was of comparable quality to one performed by a human expert, and how investigations using the classified data even resulted in either the discovery of new information or that which had been overlooked.",
      "bbox": {
        "l": 41.0,
        "b": 222.0,
        "r": 388.0,
        "t": 302.5
      }
    },
    {
      "label": "text",
      "text": "While this example focuses on a particular protein family and a particular set of model organisms, the technique should be applicable to other protein families, and to data from any sequenced genome—in fact we believe that similar techniques should be applicable to a wide range of investigations in biology, and in e-Science more generally. If this proves to be the case, then Semantic Web technology is set to have a major impact on e-Science.",
      "bbox": {
        "l": 41.0,
        "b": 148.5,
        "r": 388.0,
        "t": 218.5
      }
    },
    {
      "label": "text",
      "text": "Background and Motivation. The volume of genomic data is increasing at a seem- ingly exponential rate. In particular, high throughput technology has enabled the generation of large quantities of DNA sequence information. This sequence data, however, needs further analysis before it is useful to most biologists. This pro- cess, called annotation, augments the raw DNA sequence, and its derived protein sequence, with significant quantities of additional information describing its bi- ological context.",
      "bbox": {
        "l": 41.0,
        "b": 53.0,
        "r": 388.0,
        "t": 135.0
      }
    },
    {
      "label": "footnote",
      "text": "Y. Gil et al. (Eds.): ISWC 2005, LNCS 3729, pp. 786-800, 2005.",
      "bbox": {
        "l": 41.5,
        "b": 31.5,
        "r": 265.5,
        "t": 39.0
      }
    },
    {
      "label": "page_footer",
      "text": "© Springer-Verlag Berlin Heidelberg 2005",
      "bbox": {
        "l": 41.5,
        "b": 23.0,
        "r": 188.5,
        "t": 31.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 141.5,
        "b": 616.0,
        "r": 354.0,
        "t": 625.0
      }
    },
    {
      "label": "page_header",
      "text": "787",
      "bbox": {
        "l": 373.5,
        "b": 617.5,
        "r": 387.5,
        "t": 625.0
      }
    },
    {
      "label": "text",
      "text": "One important process during annotation is the classification of proteins into different families. This is an important step in understanding the molecular biology of an organism. Attempts to automate this procedure have, however, not generally matched the gold-standard set by human experts. Human expert classification has been more accurate because their expertise allows them to recognise the properties that are sufficient, for example, to place an individual protein into a specific subfamily class. Automated methods have, in contrast, often failed to achieve the same level of specificity. Our goal, therefore, was to improve the precision of automatic protein classification, and bring it up to the same level as that achieved by human experts.",
      "bbox": {
        "l": 41.0,
        "b": 482.5,
        "r": 388.0,
        "t": 600.0
      }
    },
    {
      "label": "text",
      "text": "Overview of Our Technique. Given a set of proteins, each with a (partial) de- scription of its properties, the objective is to find, for each of these proteins, the most specific protein family classes of which it is an instance. To describe protein family classes, we use an OWL-DL ontology; this enables us to specify necessary and sufficient conditions for a protein to be an instance of a given protein class. The ontology models the biology community’s view of the current knowledge of protein classification. We then take protein data derived using standard bioinfor- matics analysis tools, translate these data into OWL-DL instance descriptions that use terms from the ontology, and use the Instance Store to classify these instances.",
      "bbox": {
        "l": 41.0,
        "b": 353.0,
        "r": 388.0,
        "t": 468.5
      }
    },
    {
      "label": "text",
      "text": "Empirical Evaluation. We have tested our system using data sets from both the human and Aspergillus fumigatus (a pathogenic fungus) genomes. We found that our automatic classification process performed at least as well as a human expert: it allows a fast and repeatable classification process, and the explicit rep- resentation of human expert knowledge means that there is a clear and explicit evidence base for the classification. Moreover, the precise and methodical classi- fication of the data led to the discovery of new information about these proteins, including a protein subclass that seems to be specific to pathogenic fungi, and could thus be an important drug-target for pharmaceutical investigations.",
      "bbox": {
        "l": 41.0,
        "b": 230.5,
        "r": 387.5,
        "t": 337.0
      }
    },
    {
      "label": "section_header",
      "text": "2 Science and Technology",
      "bbox": {
        "l": 41.5,
        "b": 198.5,
        "r": 201.0,
        "t": 210.0
      }
    },
    {
      "label": "text",
      "text": "In this section, we describe the biology problem we have tackled and the Semantic Web technology that we used to achieve an appropriate solution.",
      "bbox": {
        "l": 41.0,
        "b": 163.0,
        "r": 388.0,
        "t": 185.0
      }
    },
    {
      "label": "section_header",
      "text": "2.1 Classifying Proteins",
      "bbox": {
        "l": 41.5,
        "b": 132.5,
        "r": 168.0,
        "t": 143.0
      }
    },
    {
      "label": "text",
      "text": "The process of annotation follows the “central dogma” of molecular biology. In broad outline, this process consists of the following steps: firstly DNA is sequenced; then genes are identified in this DNA; the DNA is then translated into a protein sequence; the proteins are then analysed and annotated with information useful for further biological investigation. As the majority of the functions of a cell are carried out by proteins, it is those proteins in which most",
      "bbox": {
        "l": 41.0,
        "b": 53.0,
        "r": 388.0,
        "t": 123.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "788",
      "bbox": {
        "l": 41.5,
        "b": 616.5,
        "r": 55.5,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "K. Wolstencroft et al.",
      "bbox": {
        "l": 41.5,
        "b": 616.5,
        "r": 162.5,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 74.5,
        "b": 617.0,
        "r": 162.0,
        "t": 625.5
      }
    },
    {
      "label": "text",
      "text": "biologists are interested. Proteins are classified into families that both reflect the functions they carry out in the cell, as well as often giving clear indications as to the biological processes in which they are involved. It is this classification, along with other and diverse kinds of information, which makes up the annotation of a protein and makes the large data sets manageable, enabling biologists to perform more thorough investigations.",
      "bbox": {
        "l": 41.0,
        "b": 530.0,
        "r": 388.0,
        "t": 600.5
      }
    },
    {
      "label": "text",
      "text": "In the last decade, various steps of this process have been automated, and thus their speed has increased enormously. Sequencing of whole genomes! is now routine. Gene discovery is technically challenging, but responds well to the increasing availability of CPU cycles. However, this still leaves a large number of protein sequences—approximately 30000 in the human genome, a quantity that is more or less in other species. This quantity is far more than that with which the individual biologist can cope.",
      "bbox": {
        "l": 41.0,
        "b": 446.5,
        "r": 388.5,
        "t": 528.5
      }
    },
    {
      "label": "text",
      "text": "The automation of the annotation process has, however, lagged behind ad- vances in other parts of this process. To date, automated approaches have proven to be quicker than human expert annotation, but the level of detail is often re- duced [26,6]. As a consequence, many protein sequences are not annotated with the accurate, specific information necessary for bioinformatics analyses. Thus useful resources for further biological discovery remain untapped.",
      "bbox": {
        "l": 41.0,
        "b": 374.5,
        "r": 388.0,
        "t": 444.5
      }
    },
    {
      "label": "text",
      "text": "In this investigation, we have used one protein family, the protein phosphatase family, as a case study to demonstrate a new, ontology-based method for auto- mated annotation. This method was designed to combine the speed of automated annotation with some of the detailed knowledge that experts use in annotation.",
      "bbox": {
        "l": 41.0,
        "b": 321.5,
        "r": 388.0,
        "t": 368.0
      }
    },
    {
      "label": "text",
      "text": "Protein phosphatases are a large and varied protein family. Together with another family, the protein kinases, they are critically involve in controlling the activity of many other proteins, thereby forming an essential part of the feedback control mechanism within the cell.",
      "bbox": {
        "l": 41.0,
        "b": 274.0,
        "r": 388.0,
        "t": 320.5
      }
    },
    {
      "label": "text",
      "text": "Given this pivotal role, it is perhaps unsurprising that many protein phos- phatases have been implicated in various diseases of great medical importance, including diabetes, cancer, and neurodegenerative conditions. Phosphatases are therefore a major subject of medical and pharmaceutical research.",
      "bbox": {
        "l": 41.0,
        "b": 226.5,
        "r": 388.0,
        "t": 272.0
      }
    },
    {
      "label": "text",
      "text": "In general, proteins are relatively modular and comprise of a number of dif ferent protein domains. Using a protein sequence, it is often possible to com- putationally determine the protein domains of which it is composed. For many protein families, including the protein phosphatases, it is possible to classify their members based on the protein domains of which they are composed. To avoid confusion with interpretation domains or the domain of a property, for the remainder of this paper, we use “p-domain” for protein domain.",
      "bbox": {
        "l": 41.0,
        "b": 142.5,
        "r": 388.0,
        "t": 224.5
      }
    },
    {
      "label": "text",
      "text": "The different p-domain composition of proteins suggests the specific function of a protein. , Individual p-domains, however, often have specific and separate functions from the protein as a whole. For example, an enzyme will have a catalytic p-domain that performs the catalysis on the substrate molecule, but it will also contain structural p-domains and binding p-domains that ensure that the substrate can interact with the catalytic p-domain. Therefore, a specific",
      "bbox": {
        "l": 41.5,
        "b": 70.5,
        "r": 388.0,
        "t": 141.0
      }
    },
    {
      "label": "footnote",
      "text": "1 A genome is the entirety of DNA in a cell.",
      "bbox": {
        "l": 43.5,
        "b": 53.0,
        "r": 222.5,
        "t": 64.0
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 141.5,
        "b": 615.5,
        "r": 354.0,
        "t": 625.0
      }
    },
    {
      "label": "page_header",
      "text": "789",
      "bbox": {
        "l": 373.5,
        "b": 617.5,
        "r": 387.5,
        "t": 625.0
      }
    },
    {
      "label": "text",
      "text": "combination of p-domains is required for a protein to function correctly. In some cases, the presence of a certain p-domain is diagnostic for membership in a particular protein family, i.e., some p-domains only occur in a single protein family. If a protein contains one of these diagnostic p-domains, it must belong to that particular family. For example, the protein tyrosine kinase catalytic p- domain is diagnostic for the tyrosine kinases.",
      "bbox": {
        "l": 41.0,
        "b": 530.5,
        "r": 388.0,
        "t": 600.0
      }
    },
    {
      "label": "text",
      "text": "Most protein families are, however, defined by a non-trivial combination of p-domains. For example, as you descend the hierarchical structure, extra p- domains (and therefore more specific functional properties) are observed in the protein class definitions. For example, an R5 phosphatase is a type of classical receptor tyrosine phosphatase. As a tyrosine phosphatase, it contains at least one phosphatase catalytic p-domain and, as a receptor tyrosine phosphatase, it contains a transmembrane region. The R5 type actually contains two catalytic p-domains and a fibronectin p-domain, identifying it as an instance of even more specific subclasses.",
      "bbox": {
        "l": 41.0,
        "b": 422.0,
        "r": 388.0,
        "t": 528.5
      }
    },
    {
      "label": "text",
      "text": "Identifying the p-domain composition of a protein is, therefore, a first step to- wards its classification. There are databases describing functional p-domains, for example, PROSITE [17], SMART [20] and INTERPRo [23], and these databases come with specific tools, such as INTERPROSCAN, which can report the presence of these p-domains in a novel protein sequence. Bioinformaticians are, however, usually required to perform the analysis that places a protein (with its set of p-domains) into a particular protein family. The whole process of classifying proteins from a genome can be accomplished with the following steps:",
      "bbox": {
        "l": 41.0,
        "b": 326.5,
        "r": 388.5,
        "t": 420.5
      }
    },
    {
      "label": "list_item",
      "text": "1. Given a genome, we extract DNA gene sequences, which we then translate into the set of protein sequences. If we are interested in a particular protein family, we can sub-select sequences containing p-domains diagnostic of that family.",
      "bbox": {
        "l": 45.5,
        "b": 270.5,
        "r": 388.0,
        "t": 316.5
      }
    },
    {
      "label": "list_item",
      "text": "2. On each of the extracted proteins, we use INTERPROSCAN to determine its p-domain composition.",
      "bbox": {
        "l": 45.5,
        "b": 246.0,
        "r": 388.0,
        "t": 268.5
      }
    },
    {
      "label": "list_item",
      "text": "3. For each of these compositions, we identify the protein family or subfamily to which it belongs by comparing them to the available biological knowledge.",
      "bbox": {
        "l": 45.5,
        "b": 222.0,
        "r": 388.0,
        "t": 244.5
      }
    },
    {
      "label": "text",
      "text": "The final step currently requires the most human analysis and expert knowl- edge. Manual classification methods are carried out by protein family experts to interpret these data and use their expert knowledge to classify proteins to a fine-grained level. To the best of our knowledge, no automated method has yet been able to replicate this expert level of detail and precision.",
      "bbox": {
        "l": 41.0,
        "b": 154.0,
        "r": 388.0,
        "t": 212.0
      }
    },
    {
      "label": "section_header",
      "text": "2.2 Ontologies and the Instance Store",
      "bbox": {
        "l": 41.5,
        "b": 129.0,
        "r": 238.5,
        "t": 139.0
      }
    },
    {
      "label": "text",
      "text": "Ontologies, with their intuitive taxonomic structure and class based semantics, are widely used in domains like bio- and medical-informatics, where there is a tradition of establishing taxonomies of terms. The recent W3C recommendation of OWL? as the language of choice for web ontologies also underlines the long",
      "bbox": {
        "l": 41.0,
        "b": 72.5,
        "r": 388.0,
        "t": 118.5
      }
    },
    {
      "label": "footnote",
      "text": "? See http: //www.w3.org/2004/OWL/ or [11].",
      "bbox": {
        "l": 43.5,
        "b": 52.5,
        "r": 226.0,
        "t": 64.5
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "K. Wolstencroft et al.",
      "bbox": {
        "l": 74.0,
        "b": 617.5,
        "r": 162.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "790",
      "bbox": {
        "l": 41.5,
        "b": 617.5,
        "r": 55.0,
        "t": 625.0
      }
    },
    {
      "label": "text",
      "text": "term vision that ontologies will play a central role in the Semantic Web. Most importantly, as shown in [4], most of the available OWL ontologies can be cap- tured in OWL-DL—a subset of OWL for which highly optimised Description Logic [2] reasoners can be used to support ontology design and deployment.",
      "bbox": {
        "l": 41.0,
        "b": 554.0,
        "r": 388.0,
        "t": 600.0
      }
    },
    {
      "label": "text",
      "text": "Unfortunately, existing reasoners (and tools), while successful in dealing with the (relatively small and static) class level information in ontologies, fail when presented with the large volumes of instance level data often required by realistic applications, hampering the use of reasoning over ontologies beyond the class level. The system we have used—the instance Store (1S) [14]—addresses this problem using a hybrid database/reasoner architecture: a relational database is used to make instances persistent, while a class level (“TBox” in Description Logic terms) reasoner is used to infer ontological information about the classes to which they belong. Moreover, part of this ontological information is also made persistent in the database. The 1S currently only supports a rather limited form of reasoning about individuals: it takes an ontology (without instances), a set of axioms asserting class-instance relationships, and answers queries asking for all the instances of a class description. The classes in both axioms and queries can be arbitrarily complex OWL-DL descriptions, and a DL reasoner is used to ensure that all instances (explicit and implicit) of the query concept are returned. In the remainder of this paper, we use “class-level ontology” for an ontology in which no instances occur. From a theoretical perspective, this might seem un-interesting; the 1S is, however, able to deal with much larger numbers of individuals than would be possible using a standard DL reasoner. More importantly, this kind of reasoning turns out to be useful in a range of applications, in particular those such as the one presented here where a domain model is used to structure and classify large data sets.*",
      "bbox": {
        "l": 41.0,
        "b": 291.5,
        "r": 389.0,
        "t": 552.5
      }
    },
    {
      "label": "text",
      "text": "There is a long tradition of coupling databases to knowledge representation systems in order to perform reasoning, most notably the work in [5]. However, in the 18, we do not use the standard approach of associating a table (or view) with each class and property. Instead, we have a fixed and relatively simple schema that is independent of the structure of the ontology and of the instance data. The IS is, therefore, agnostic about the provenance of data, and uses a new, dedicated database for each ontology (although the schema is always the same).",
      "bbox": {
        "l": 41.0,
        "b": 207.5,
        "r": 388.0,
        "t": 289.5
      }
    },
    {
      "label": "text",
      "text": "The basic functionality of the 1S system are illustrated in Figure 1. At start- up, the initialise method is called with a relational database, an OWL-DL class reasoner such as Racer [9] or Fact ++ [30], and a class-level OWL-DL ontology. The method creates the schema for the database if needed (i.e., if the IS is new), parses the ontology, and loads it into the reasoner. To populate the 1S, the addAssertion method is called repeatedly. Each assertion states that an instance (identified by a URI) belongs to class (which is an arbitrary OWL-DL description). Once the 1S has been populated with some—possibly millions of —instances, it can be queried using the retrieve method. A query again consists of an arbitrary (possibly complex) OWL-DL class description; the result is the set of all instances belonging to the",
      "bbox": {
        "l": 41.5,
        "b": 88.0,
        "r": 388.5,
        "t": 205.5
      }
    },
    {
      "label": "footnote",
      "text": "S The 1S was initially developed for use in a Web Service registry application, where it was used to classify and retrieve (large numbers of) descriptions of web services.",
      "bbox": {
        "l": 43.5,
        "b": 52.5,
        "r": 387.5,
        "t": 75.0
      }
    }
  ],
  "6": [
    {
      "label": "page_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 142.0,
        "b": 616.0,
        "r": 354.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "791",
      "bbox": {
        "l": 373.5,
        "b": 617.5,
        "r": 387.0,
        "t": 625.0
      }
    },
    {
      "label": "text",
      "text": "initialise (database: Database, reasoner: OWLReasoner, ontology: OWLOntology) addAssertion(instance: URI, class: OWLDescription) retrieve (query: OWLDescription): Set (URI)",
      "bbox": {
        "l": 42.5,
        "b": 570.0,
        "r": 388.0,
        "t": 601.5
      }
    },
    {
      "label": "code",
      "text": "",
      "bbox": {
        "l": 42.5,
        "b": 570.0,
        "r": 388.0,
        "t": 601.5
      }
    },
    {
      "label": "caption",
      "text": "Fig. 1. The 1S API",
      "bbox": {
        "l": 176.5,
        "b": 550.0,
        "r": 253.0,
        "t": 559.0
      }
    },
    {
      "label": "text",
      "text": "query class, and is returned by retrieve as a set of URIs. The 1S uses database queries to return individuals that are “obviously” instances of the query class, and to identify those instances where the DL reasoner is needed in order to determine if they form part of the answer set.",
      "bbox": {
        "l": 41.0,
        "b": 486.5,
        "r": 388.0,
        "t": 532.5
      }
    },
    {
      "label": "section_header",
      "text": "3 Description of the Experiments Undertaken",
      "bbox": {
        "l": 41.5,
        "b": 451.0,
        "r": 312.0,
        "t": 462.5
      }
    },
    {
      "label": "text",
      "text": "The method we present could be applicable in general to many protein families, but to demonstrate the technique and the fine-grained classification possible, we present the analysis of one family, the protein phosphatases, in the human and As- pergillus fumigatus genomes.",
      "bbox": {
        "l": 41.0,
        "b": 388.0,
        "r": 388.0,
        "t": 434.5
      }
    },
    {
      "label": "text",
      "text": "We have combined automated reasoning techniques [9,14] with elements of a service-oriented architecture [27,19] to produce a system to automatically extract",
      "bbox": {
        "l": 41.0,
        "b": 364.0,
        "r": 388.0,
        "t": 386.5
      }
    },
    {
      "label": "picture",
      "text": "hanpatare tarps pees Ga OWL aa NaTNATG Reasoner Ontology iment Protein Phosphatas: InterproScan i Il tT q Instance Prote’ Store Classification Restriction Translate to {ehitp:thawe.o1 Pei smed.owlticontains DomainiP ROOO038>| Abstract OWL [porenraea cs fiseretoli",
      "bbox": {
        "l": 49.5,
        "b": 109.5,
        "r": 374.5,
        "t": 336.5
      }
    },
    {
      "label": "caption",
      "text": "Fig. 2. The Ontology Classification System Architecture",
      "bbox": {
        "l": 101.5,
        "b": 65.0,
        "r": 327.5,
        "t": 74.0
      }
    }
  ],
  "7": [
    {
      "label": "page_header",
      "text": "K. Wolstencroft et al.",
      "bbox": {
        "l": 74.0,
        "b": 617.5,
        "r": 162.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "792",
      "bbox": {
        "l": 41.5,
        "b": 617.5,
        "r": 55.0,
        "t": 624.5
      }
    },
    {
      "label": "text",
      "text": "and classify the set of protein phosphatase from an organism.‘ Figure 2 shows the components in our protein classification experiment. An OWL class-level ontology describes the protein phosphatase family, and this ontology is pre-loaded into the Instance Store. Protein instance data is extracted from the protein set of a genome, and the p-domain composition is determined using INTERPROSCAN. These p-domain compositions are then translated into OWL descriptions and compared to the OWL definitions for protein family classes using the Instance Store which, in turn, uses a DL reasoner (Racer in this case), to classify each such instance. For each protein class from our ontology, it returns those proteins that can be inferred to be an instance of this class.",
      "bbox": {
        "l": 41.0,
        "b": 483.5,
        "r": 388.0,
        "t": 600.0
      }
    },
    {
      "label": "text",
      "text": "In the remainder of this section, we will describe the relevant components of this architecture in more detail, and explain the outcomes of this experiment from a biology perspective. In the next section, we describe the experience gained and lessons learnt from a computer science perspective.",
      "bbox": {
        "l": 41.0,
        "b": 434.0,
        "r": 388.5,
        "t": 480.5
      }
    },
    {
      "label": "section_header",
      "text": "3.1 The Ontology",
      "bbox": {
        "l": 41.5,
        "b": 402.0,
        "r": 135.5,
        "t": 412.5
      }
    },
    {
      "label": "text",
      "text": "In this section, we describe how we capture the expert knowledge for phosphatase classification in an OWL-DL ontology. All the information used for developing our ontology comes from peer-reviewed literature from protein phosphatase experts. The family of human protein phosphatases has been well characterised experimen- tally, and detailed reviews of the classification and family composition are available [1,7,18]. These reviews represent the current community knowledge of the relevant biology. If, in the future, new subfamilies are discovered, the ontology can easily be changed to reflect these changes in knowledge; we will comment on this in Section 4.",
      "bbox": {
        "l": 41.0,
        "b": 296.5,
        "r": 388.0,
        "t": 390.5
      }
    },
    {
      "label": "text",
      "text": "Fortunately for this application, there are precise rules,° based on p-domain composition, for protein family membership, and we can express these rules as class definitions in an OWL-DL ontology. The use of an ontology to capture the under- standing of p-domain composition enables the automation of the final analysis step which had previously required human intervention, thus allowing for full automa- tion of the complete process. In biology, the use of ontologies to capture human knowledge of a particular domain and to answer complex queries is becoming well established [8,28]. Less well established is the use of reasoning systems for data in- terpretation. In this study, we present a method which makes use of ontology rea- soning and illustrates the advantages of such an approach.",
      "bbox": {
        "l": 41.0,
        "b": 177.0,
        "r": 388.0,
        "t": 295.5
      }
    },
    {
      "label": "text",
      "text": "The ontology was developed in OWL-DL using the Protégé editor,® and cur- rently contains 80 classes and 39 properties; it is available at (http: //www.bioinf . man.ac.uk/phosphabase/download). Part of the subsumption hierarchy infer- rred from these descriptions can be seen in the left-hand panel of Figure 3, which shows the OWL ontology in the Protégé editor.",
      "bbox": {
        "l": 41.0,
        "b": 117.0,
        "r": 388.0,
        "t": 176.0
      }
    },
    {
      "label": "footnote",
      "text": "* Due to the relatively small test-set used, the case study reported here could have been carried out using Racer [9] only, i-e., without the 1S. However, larger sets of protein data will necessitate the use of IS or a similar tool.",
      "bbox": {
        "l": 44.0,
        "b": 75.0,
        "r": 387.5,
        "t": 108.0
      }
    },
    {
      "label": "footnote",
      "text": "5 We use “rules” here in a completely informal way.",
      "bbox": {
        "l": 45.0,
        "b": 64.0,
        "r": 248.5,
        "t": 74.5
      }
    },
    {
      "label": "footnote",
      "text": "© We used Protégé 3.0 with OWL plugin 1.3, build 225.1.",
      "bbox": {
        "l": 44.5,
        "b": 53.0,
        "r": 268.5,
        "t": 63.5
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 141.5,
        "b": 616.0,
        "r": 354.0,
        "t": 625.0
      }
    },
    {
      "label": "page_header",
      "text": "793",
      "bbox": {
        "l": 373.5,
        "b": 617.5,
        "r": 387.5,
        "t": 624.5
      }
    },
    {
      "label": "picture",
      "text": "al De EM Beet OWL Warde Cole Wow Hep Tee a CH ¢BS ea +4 BSS OS BBB «> <E[protége Tort © ptt fren ORS rte ice) cao ma Ck 2A = —— <= Cie m ‘©prtarProstaeeTy=7 A] & o Propety | vate | tar | vo ¥ (cet jose sont savecormen Drona Oi GL Si wt [> [Gloatansdomain (wut owiCines) | [DlcortanebomeintPRO00242 (in. o2 > ms (Ace Ont neried Conetione 7D omerons o 8 te = = Feels Gta vow OfestVew",
      "bbox": {
        "l": 41.0,
        "b": 343.0,
        "r": 388.0,
        "t": 603.5
      }
    },
    {
      "label": "caption",
      "text": "Fig. 3. A screenshot of the phosphatase ontology in the OWL ontology editor Protégé",
      "bbox": {
        "l": 43.0,
        "b": 318.5,
        "r": 383.0,
        "t": 328.0
      }
    },
    {
      "label": "text",
      "text": "More precisely, for each class of phosphatase, this ontology containsa (necessary and sufficient) definition. For this family of proteins, this definition is, in most cases, a conjunction of p-domain compositions, i.e., a typical case of a phosphatase class definition looks as follows, where X; are p-domains:",
      "bbox": {
        "l": 41.0,
        "b": 253.0,
        "r": 388.5,
        "t": 299.0
      }
    },
    {
      "label": "text",
      "text": "IfaY protein contains at least n1 p-domains of type X1 and... and at least nin p-domains of type Xm, then this protein also belongs to class Z.",
      "bbox": {
        "l": 46.0,
        "b": 218.5,
        "r": 382.5,
        "t": 240.5
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 46.0,
        "b": 218.5,
        "r": 382.5,
        "t": 240.5
      }
    },
    {
      "label": "text",
      "text": "For example, receptor tyrosine phosphatases contain one or two phosphatase cat- alytic p-domains, and receptor tyrosine R2B phosphatases contain exactly 2 tyro- sine phosphatase catalytic p-domains, one transmembrane p-domain, at least one fibronectin p-domain, and at least one immunoglobulin p-domain. In some cases, X; is a disjunction of p-domains. P-domains come with a rather “flat” structure, ie., only few p-domains are specialisations of others. Clearly, “counting” state- ments such as the one above go beyond the expressive power of OWL since they would require (the OWL equivalent of) qualified cardinality restrictions [10], whereas OWL only provides unqualified cardinality restrictions through its restriction(UminCardinality(n)) andrestriction(UmaxCardinality(n)) constructs. In contrast, this kind of expressive means was provided by DAML+OIL [15], i.e., we could have defined the above mentioned receptor tyrosine phosphatases using the expression",
      "bbox": {
        "l": 41.0,
        "b": 53.0,
        "r": 388.5,
        "t": 206.0
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "K. Wolstencroft et al.",
      "bbox": {
        "l": 74.0,
        "b": 617.5,
        "r": 162.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "794",
      "bbox": {
        "l": 41.5,
        "b": 618.0,
        "r": 55.5,
        "t": 625.0
      }
    },
    {
      "label": "section_header",
      "text": "IntersectionOf (Restriction(contains minCardinality (1) PhCatalDoms) Restriction (contains maxCardinality (2) PhCatalDoms)",
      "bbox": {
        "l": 42.5,
        "b": 580.0,
        "r": 383.0,
        "t": 602.0
      }
    },
    {
      "label": "text",
      "text": "To overcome this problem, we used a well-known work-around.’ For each X; that we would have liked to use in a qualified number restriction, we introduced a subproperty containsX-i of contains, and set the range of containsX.i to the class X;. In addition, we added sub-property assertions so that the hierarchy of newly introduced properties containsX.i reflects the class hierarchy of the classes X; used. Unfortunately, this work-around is not always correct. That is, assume there are two ontologies, one with qualified number restrictions and one that re- sulted from the application of this work-around. Then there are cases where the first one implies a subsumption relationship between two classes, whereas the sec- ond one does not imply this subsumption. Similarly, a class may be unsatisfiable w.r-t. the first one, but satisfiable w.r.t. the second. We used this work-around be- lieving that it was correct and, when we learned that it sometimes is not, were quite surprised—we had “cluttered” our ontology with a large number of new properties without this guaranteeing the desired effect. However, we then checked that, in the special case of our experiment, this work-around is indeed correct, even though we are not going to prove this here. We will comment more on this in Section 4 and 5.",
      "bbox": {
        "l": 41.0,
        "b": 369.0,
        "r": 388.5,
        "t": 569.0
      }
    },
    {
      "label": "text",
      "text": "Having captured the expert knowledge in this way, we are left with the problem of dealing with the potentially very large numbers of protein instances that need to be classified according to the corresponding ontology. This requirement motivated our use of the 1S.",
      "bbox": {
        "l": 41.0,
        "b": 321.0,
        "r": 388.0,
        "t": 365.5
      }
    },
    {
      "label": "section_header",
      "text": "3.2 The Data Sets",
      "bbox": {
        "l": 41.5,
        "b": 298.5,
        "r": 137.0,
        "t": 306.5
      }
    },
    {
      "label": "text",
      "text": "This study focuses on the previously identified and described human phosphatases [1,24], and the less well characterised A fumigatus protein phosphatases. The hu- man phosphatases, having been carefully hand-classified, form a control group for our automated protein phosphatase classification. Previous classification of hu- man phosphatases by biological experts provides a substantial test-set for our ap- proach. If the 1S can classify the characterised proteins (at least) as well as human experts, then this would increase our confidence when using our method on un- known genomes. The A.fumigatus genome falls between these extremes, and thus offers a unique insight into the comparison between the automated method and the manual. The A.fumigatus genome has been sequenced, and annotation is cur- rently underway by a team of human experts [22]. We have considered 118 human phosphatases and 45 from A. fumigatus.",
      "bbox": {
        "l": 41.0,
        "b": 145.5,
        "r": 388.0,
        "t": 287.5
      }
    },
    {
      "label": "text",
      "text": "Pre-Screening. Isolation of the protein phosphatase sequences from the protein set. of the genome was achieved by screening for diagnostic phosphatase motifs, i.e. for specific patterns. These are",
      "bbox": {
        "l": 41.0,
        "b": 101.5,
        "r": 388.0,
        "t": 136.0
      }
    },
    {
      "label": "list_item",
      "text": "1. the protein tyrosine phosphatase active site motif H-C-X(5)-R",
      "bbox": {
        "l": 45.5,
        "b": 83.0,
        "r": 323.5,
        "t": 93.5
      }
    },
    {
      "label": "list_item",
      "text": "2. the protein serine/threonine phosphatase motif [LTVMN]-[KR]-G-N-H-E",
      "bbox": {
        "l": 45.5,
        "b": 71.0,
        "r": 369.0,
        "t": 81.5
      }
    },
    {
      "label": "footnote",
      "text": "7 See, e.g., http: //waw.cs.vu.nl/~guus/public/qcr. html",
      "bbox": {
        "l": 44.0,
        "b": 53.0,
        "r": 281.5,
        "t": 64.5
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 141.5,
        "b": 615.5,
        "r": 354.0,
        "t": 625.0
      }
    },
    {
      "label": "page_header",
      "text": "795",
      "bbox": {
        "l": 373.5,
        "b": 617.5,
        "r": 387.0,
        "t": 624.5
      }
    },
    {
      "label": "section_header",
      "text": "3. the protein phosphatase C signature motif [LIVMFY]-[LIVMFYA]-[GSAC]- [LIVM|-[FYC]-D-G-H-[GAV].",
      "bbox": {
        "l": 45.0,
        "b": 577.5,
        "r": 387.5,
        "t": 600.5
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 45.0,
        "b": 577.5,
        "r": 387.5,
        "t": 600.5
      }
    },
    {
      "label": "text",
      "text": "The EMBOSS program, PATMATDB [25] was used to perform the pre-screening process. Performing an INTERPROSCAN on every protein sequence from the genome would also have isolated the protein phosphatase sequences, but each INTERPROSCAN can take several minutes. PATMATDB can screen the whole genome in the time taken to run one INTERPROSCAN, so we decided to use IN- TERPROSCAN only for the detailed analysis of each sequence identified as being a protein phosphatase.",
      "bbox": {
        "l": 41.0,
        "b": 487.0,
        "r": 390.0,
        "t": 569.0
      }
    },
    {
      "label": "section_header",
      "text": "3.3. Queries Asked and Results",
      "bbox": {
        "l": 41.5,
        "b": 464.0,
        "r": 199.0,
        "t": 474.0
      }
    },
    {
      "label": "text",
      "text": "The purposes of the human and A.fumigatus studies were different. The human study was a proof of concept to demonstrate the effectiveness of the automated method. The A. fumigatus study was more focused towards biological discovery.",
      "bbox": {
        "l": 41.0,
        "b": 423.0,
        "r": 388.0,
        "t": 457.5
      }
    },
    {
      "label": "text",
      "text": "For the human phosphatases, we were interested in comparing the automated classification with the thorough, human expert classification. Therefore, we browsed the class hierarchy of our phosphatase ontology and, for each class, we retrieved those proteins for which the 1S inferred that this class was the most spe- cific one. We were also interested in identifying instances that did not fit any of the ontology class definitions (i.e., whose most specific class was the top class).",
      "bbox": {
        "l": 41.0,
        "b": 351.5,
        "r": 388.0,
        "t": 421.5
      }
    },
    {
      "label": "text",
      "text": "For the A. fumigatus phosphatases, we browsed the class hierarchy in a similar way but, as the phosphatases from this organism were less well characterised, we were particularly interested in the differences between the human and A. fumigatus set, i.e., we were interested in finding classes that had instances of the human pro- teins, but not of the A fumigatus proteins, and vice versa. All these queries could be answered easily and quickly using the 1S.",
      "bbox": {
        "l": 41.0,
        "b": 280.0,
        "r": 388.0,
        "t": 350.0
      }
    },
    {
      "label": "text",
      "text": "The results of this experiment were three-fold. Firstly, we found that the au- tomated classification of the human protein phosphatases performed as well as the manual classification by phosphatase experts. Since the same protein instances were used in the automated and manual studies, we could compare these two clas- sifications, and it tured out that both classifications put almost all phosphatases into the same place in the class hierarchy. This evidence shows proof of concept, and suggests that the automated approach could be used to solve the current annota- tion bottleneck. Secondly, in the few cases where the automatic and the manual classification differed, detailed investigations by a domain expert revealed that the automatic one was actually “more correct”: we discovered two proteins for which no appropriate class was available, i.e. they were classified by the automatic clas- sification as instances of the top phosphatases class.",
      "bbox": {
        "l": 41.0,
        "b": 137.0,
        "r": 388.0,
        "t": 278.5
      }
    },
    {
      "label": "text",
      "text": "This discovery lead to a modification of the ontology, and thus of the expert knowledge on proteins. One of these phosphatases was DUSP10 (Dual specificity phosphatase 10). It was found to contain an extra p-domain, a disintegrin. This particular p-domain is not found in any other protein phosphatase and poses inter- esting questions about possible protein functions to the biologists. Our automated classification method was able to find these mis-classifications because the 1S ap- plied the expert knowledge systematically and consistently.",
      "bbox": {
        "l": 41.0,
        "b": 53.0,
        "r": 388.0,
        "t": 134.5
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "796 K. Wolstencroft et al.",
      "bbox": {
        "l": 41.5,
        "b": 617.5,
        "r": 162.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 74.5,
        "b": 617.5,
        "r": 162.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 41.5,
        "b": 617.5,
        "r": 55.5,
        "t": 625.0
      }
    },
    {
      "label": "text",
      "text": "The automated classification of the A.fumigatus phosphatases revealed large differences from the human phosphatases. Not only were there fewer individual proteins, but whole subfamilies were missing. Some of these differences can be at- tributed to the differences in the two organisms. Many phosphatases in the hu- man classification were tissue-specific variations of tissue-types that do not occur in A. fumigatus. Since A fumigatus is pathogenic to humans, these differences are important avenues of investigation for potential drug targets. The most interesting discovery in the A. fumigatus data set was the identification of a novel type of cal- cineurin phosphatase, i.e., again, a phosphatase that was classified automatically only as an instance of the top class. Calcineurin is well conserved throughout evo- lution and performs the same function in all organisms. However, in A. fumigatus, it contains an extra functional p-domain. Further bioinformatics analyses revealed that this extra p-domain also occurs in other pathogenic fungus species, but in no other organisms, suggesting a specific functional role for this extra p-domain. Pre- vious studies have identified divergences in the mechanism of action of calcineurin in pathogenic fungi as being linked to virulence, so this protein is an interesting drug-target for future study.",
      "bbox": {
        "l": 41.0,
        "b": 398.5,
        "r": 388.0,
        "t": 600.0
      }
    },
    {
      "label": "section_header",
      "text": "4 Lessons Learnt",
      "bbox": {
        "l": 41.5,
        "b": 367.0,
        "r": 147.0,
        "t": 376.5
      }
    },
    {
      "label": "text",
      "text": "As we have seen, we have successfully used Semantic Web technology in a bioinfor- matics application. Besides finding new protein families that are of interest to biolo- gists, we have shown that automated classification can indeed compete with manual classification, and is sometimes even superior. Our approach to automated classifi- cation combines the advantages of speed of the automated methods and accuracy of human expert classification, the latter being due to the fact that we captured the expert knowledge in an OWL ontology. The combination of the two, namely speed and expert knowledge, provides a quick and efficient method for classifying proteins ona genomic scale, and offers a solution to the current annotation bottleneck.",
      "bbox": {
        "l": 41.5,
        "b": 241.0,
        "r": 388.5,
        "t": 347.0
      }
    },
    {
      "label": "text",
      "text": "Our approach was made possible by the development of state-of-the-art Seman- tic Web technology, such as the OWL ontology language, the Protégé OWL ontol- ogy editor, the OWL Instance Store, and the Racer OWL reasoner; this technology did not emerge overnight, but is based on decades of research in logic-based knowl- edge representation and reasoning. Although neither Racer nor the 1S support all of OWL-DL,§ these tools proved more than adequate for our experiment.",
      "bbox": {
        "l": 41.5,
        "b": 170.0,
        "r": 388.0,
        "t": 239.5
      }
    },
    {
      "label": "text",
      "text": "In contrast, a limitation in the expressive power of OWL-DL did cause con- siderable problems: the lack of qualified number restrictions (also called qualified cardinality restrictions). In order to overcome this limitation, we had to employ a work around and verify that this work around, even though not correct in general, was correct for our ontology and instance data. This work around introduced a sig- nificant overhead, and was only possible through a close co-operation between the",
      "bbox": {
        "l": 41.5,
        "b": 97.5,
        "r": 388.0,
        "t": 168.0
      }
    },
    {
      "label": "footnote",
      "text": "® Racer does not support individual names in complex class descriptions (so-called nominals—see [16]), and the current version of 1S does not support role assertions be- tween individuals.",
      "bbox": {
        "l": 44.0,
        "b": 54.5,
        "r": 387.5,
        "t": 86.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 141.5,
        "b": 616.0,
        "r": 354.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "797",
      "bbox": {
        "l": 373.5,
        "b": 618.0,
        "r": 387.5,
        "t": 625.0
      }
    },
    {
      "label": "text",
      "text": "biologists and computer scientists. We, therefor, cannot recommend such an ap- proach in general. Additionally, we observe that, from a theoretical and practical perspective, this work around should not be necessary since (a) reasoners such as Racer and Fact [9,13] support qualified number restrictions, (b) for all Description Logics we are aware of that support (unqualified) number restrictions, the worst- case complexity of reasoning remains the same when they are extended with quali- fied number restrictions (see, e.g., [29]), and (c) the latest version of Protégé-OWL now supports qualified number restrictions. Hence we can, in the future, run simi- lar experiments without having to resort to this work around, provided that we are willing to diverge from the current OWL standard.",
      "bbox": {
        "l": 41.0,
        "b": 482.0,
        "r": 388.0,
        "t": 600.0
      }
    },
    {
      "label": "text",
      "text": "The ability to run such experiments is of considerable importance since there is a wealth of unannotated and partially annotated data in the public domain, to which we plan to apply our approach. New genomes are being sequenced continu- ally, and some existing genomes have not been annotated to any degree of detail. Now that the ontology system architecture is in place, new proteins can be quickly and successfully classified as members of protein phosphatase subfamilies. Devel- opment of other ontologies, would enable the application of this technique to some of the 1,000’s of other protein families.",
      "bbox": {
        "l": 41.0,
        "b": 387.0,
        "r": 388.0,
        "t": 480.5
      }
    },
    {
      "label": "text",
      "text": "This paper demonstrates a proof of concept for the automated classification of proteins using automated reasoning technologies. From a study involving a single protein family and two species, we were able to identify a new protein subclass. As this class of protein appears to be specific to pathogenic fungi, it is potentially useful for further pharmaceutical investigations. Automated reasoning over instance data has therefore enabled us to generate new hypotheses which will require significiant further laboratory experimentation, which, in turn, will potentially improve our understanding of protein phosphorylation.",
      "bbox": {
        "l": 41.0,
        "b": 291.5,
        "r": 388.5,
        "t": 385.0
      }
    },
    {
      "label": "text",
      "text": "Finally, we would like to point out that the ontology definitions are produced from expert protein family knowledge. Therefore, they reflect what is currently known in the research community, and are made explicit in a machine- understandable format, namely OWL-DL. This has several important consequences. Firstly, the construction of such an ontology can help in the develop- ment ofa consensus from within the community [3], and even if the community fails to agree on a single ontology, automated classification could be used to enable “par- allel” alternative annotations. Secondly, if the community knowledge of the protein family changes, the ontology can easily be altered, and the protein instances can be re-classified accordingly. Lastly, if the definitions are based on what is known, proteins that do not fit into any of the defined classes are easily identified, making the discovery of new protein subfamilies possible.",
      "bbox": {
        "l": 41.0,
        "b": 147.5,
        "r": 388.0,
        "t": 289.5
      }
    },
    {
      "label": "section_header",
      "text": "5 Outlook and Future Work",
      "bbox": {
        "l": 41.5,
        "b": 116.5,
        "r": 209.5,
        "t": 125.5
      }
    },
    {
      "label": "text",
      "text": "Our plans for future work are manifold. Basically, we want to do more “automated” biology, but we are thereby pushing the current state-of-art in logic-based knowl- edge representation, automated reasoning, and Semantic Web technology. Within this section, we only discuss three of the related issues.",
      "bbox": {
        "l": 41.0,
        "b": 53.0,
        "r": 387.5,
        "t": 99.0
      }
    }
  ],
  "13": [
    {
      "label": "page_header",
      "text": "K. Wolstencroft et al.",
      "bbox": {
        "l": 74.5,
        "b": 617.5,
        "r": 162.0,
        "t": 625.5
      }
    },
    {
      "label": "page_header",
      "text": "798",
      "bbox": {
        "l": 41.5,
        "b": 617.5,
        "r": 55.5,
        "t": 625.0
      }
    },
    {
      "label": "text",
      "text": "Firstly, we observe that a protein is a sequence of amino acids, and thus se- quences can be seen as strings over a twenty letter alphabet since there are only twenty amino acids. In our current ontology, we do not capture this sequence infor- mation, and thus cannot answer queries related to these sequences. From a biology perspective, however, queries such as “give me all proteins whose amino acid se- quence contains an M followed by some arbitrary sub string, which is then followd by a NEN” would be really valuable. From a computer science perspective, we could easily express (and query over) these strings using a simple form of concrete domains, so-called datatypes [21,12]. However, the datatypes currently available in OWL do not provide predicates that compare a given string with a regular ex- pression, a comparison that would reflect the above example query.",
      "bbox": {
        "l": 41.0,
        "b": 470.0,
        "r": 388.0,
        "t": 600.0
      }
    },
    {
      "label": "text",
      "text": "Secondly, we are currently concerned with a single class of components of an organism, namely the proteins. In the future, we want to use the available tech- nology to automate investigations into their interaction, and also represent and reason about larger structures such as genomes and cells. We could easily model interactions between proteins using a property interact to make statements such as “proteins of class X only interact with proteins of class Y”. However, we would also need to make statements on an instance level such as “this protein instance interacts with that protein instance” , which is possible in OWL-DL, but goes be- yond the capabilities of the current 18. We are currently extending the 1S to handle statements of this kind, and we will see if this extension is able to cope with the large volumes of data that will be needed in biology applications.®",
      "bbox": {
        "l": 41.0,
        "b": 338.5,
        "r": 388.0,
        "t": 468.0
      }
    },
    {
      "label": "text",
      "text": "Thirdly, we will “roll back” the work-around we used to cope with the absence of qualified number restrictions, both in our ontology and in the instance data, instead using the form of qualified number restrictions provided by Protégé, Racer, and the 1S. This will greatly enhance the interpretability of the current ontology and also make its extension to other families of proteins more straight-forward.",
      "bbox": {
        "l": 41.0,
        "b": 279.5,
        "r": 389.0,
        "t": 337.0
      }
    },
    {
      "label": "text",
      "text": "Acknowledgements. This work was funded by an MRC PhD studentship, the myGrid e-science project, University of Manchester with the UK e-science pro- gramme EPSRC grant GR/R67743 and the ComparaGRID project, BBSRC grant BBS/B/17131. Preliminary sequence data was obtained from The Institute for Ge- nomic Research website at http: //www .tigr . org from Dr Jane Mabey-Gilsenan. Sequencing of A. fumigatus was funded by the National Institute of Allergy and In- fectious Disease U01 AI 48830 to David Denning and William Nierman, the Well- come Trust, and Fondo de Investicagiones Sanitarias.",
      "bbox": {
        "l": 41.0,
        "b": 164.0,
        "r": 388.0,
        "t": 258.0
      }
    },
    {
      "label": "section_header",
      "text": "References",
      "bbox": {
        "l": 41.5,
        "b": 132.5,
        "r": 104.5,
        "t": 142.5
      }
    },
    {
      "label": "list_item",
      "text": "1. A. Alonso, J. Sasin, N. Bottini, I. Friedberg, I. Friedberg, A. Osterman, A. Godzik, T. Hunter, J. Dixon, and T. Mustelin. Protein tyrosine phosphatases in the human genome. Cell, 117(6):699-711, 2004.",
      "bbox": {
        "l": 45.5,
        "b": 84.5,
        "r": 387.5,
        "t": 116.0
      }
    },
    {
      "label": "footnote",
      "text": "° Racer can already handle such statements, but can only deal with a relatively small number of individuals.",
      "bbox": {
        "l": 44.0,
        "b": 54.0,
        "r": 387.5,
        "t": 75.0
      }
    }
  ],
  "14": [
    {
      "label": "page_header",
      "text": "A Little Semantic Web Goes a Long Way in Biology",
      "bbox": {
        "l": 141.5,
        "b": 616.0,
        "r": 354.0,
        "t": 625.0
      }
    },
    {
      "label": "page_header",
      "text": "799",
      "bbox": {
        "l": 373.5,
        "b": 618.0,
        "r": 387.0,
        "t": 624.5
      }
    },
    {
      "label": "list_item",
      "text": "2. F. Baader, D. Calvanese, D. McGuinness, D. Nardi, and P. Patel-Schneider, editors. The Description Logic Handbook: Theory, Implementation and Applications. Cam- bridge University Press, 2003.",
      "bbox": {
        "l": 45.5,
        "b": 568.0,
        "r": 387.5,
        "t": 599.5
      }
    },
    {
      "label": "list_item",
      "text": "3. M. Bada, D. Turi, R. McEntire, and R. Stevens. Using Reasoning to Guide Annota- tion with Gene Ontology Terms in GOAT. SIGMOD Record (special issue on data engineering for the life sciences), 2004.",
      "bbox": {
        "l": 45.5,
        "b": 534.5,
        "r": 388.0,
        "t": 566.0
      }
    },
    {
      "label": "list_item",
      "text": "4. S. Bechhofer and R. Volz. Patching syntax in OWL ontologies. In Proc. of the 3rd International Semantic Web Conference (ISWC), 2004.",
      "bbox": {
        "l": 45.5,
        "b": 512.0,
        "r": 388.5,
        "t": 532.0
      }
    },
    {
      "label": "list_item",
      "text": "5. A. Borgida and R. J. Brachman. Loading data into description reasoners. In Proceed- ings of the ACM SIGMOD International Conference on Management of Data, pages 217-226, 1993.",
      "bbox": {
        "l": 46.0,
        "b": 479.5,
        "r": 387.5,
        "t": 509.5
      }
    },
    {
      "label": "list_item",
      "text": "6. K. Carter, A. Oka, G. Tamiya, and M. I. Bellgard. Bioinformatics issues for automat- ing the annotation of genomic sequences. Genome Inform Ser Workshop Genome Inform, 12:204-11, 2001.",
      "bbox": {
        "l": 46.0,
        "b": 445.0,
        "r": 388.0,
        "t": 476.0
      }
    },
    {
      "label": "list_item",
      "text": "7. P. T. Cohen. Novel protein serine/threonine phosphatases: variety is the spice of life. Trends Biochem Sci, 22(7):245-51, July 1997.",
      "bbox": {
        "l": 46.0,
        "b": 422.0,
        "r": 387.0,
        "t": 442.5
      }
    },
    {
      "label": "list_item",
      "text": "8. Gene Ontology Consortium. Gene ontology: Tool for the unification of biology. Na- ture Genetics, 25(1):25-29, 2000.",
      "bbox": {
        "l": 45.5,
        "b": 400.0,
        "r": 387.5,
        "t": 420.0
      }
    },
    {
      "label": "list_item",
      "text": "9. V. Haarslev and R. Méller. RACER system description. In Proceedings of the In- ternational Joint Conference on Automated Reasoning (IJCAR-01), volume 2083 of Lecture Notes in Artificial Intelligence, pages 701-705. Springer-Verlag, 2001.",
      "bbox": {
        "l": 45.5,
        "b": 366.0,
        "r": 388.0,
        "t": 397.5
      }
    },
    {
      "label": "list_item",
      "text": "10. B. Hollunder and F. Baader. Qualifying number restrictions in concept languages. In Proceedings of the Second International Conference on the Principles of Knowledge Representation and Reasoning (KR-91), pages 335-346, 1991.",
      "bbox": {
        "l": 41.5,
        "b": 333.0,
        "r": 388.0,
        "t": 364.0
      }
    },
    {
      "label": "list_item",
      "text": "11. I. Horrocks, P. F. Patel-Schneider, and F. van Harmelen. From SHIQ and RDF to OWL: The making of a web ontology language. Journal of Web Semantics, 1(1), 2003.",
      "bbox": {
        "l": 41.5,
        "b": 301.5,
        "r": 387.5,
        "t": 330.5
      }
    },
    {
      "label": "list_item",
      "text": "12. I. Horrocks and U. Sattler. Ontology reasoning in the SHOQ(D) description logic. In Proceedings of the Seventeenth International Joint Conference on Artificial Intel- ligence, 2001.",
      "bbox": {
        "l": 41.0,
        "b": 266.0,
        "r": 387.5,
        "t": 296.5
      }
    },
    {
      "label": "list_item",
      "text": "13. I. Horrocks. Using an expressive description logic: FaCT or fiction? In Proceedings of the Sicth International Conference on the Principles of Knowledge Representation and Reasoning (KR-98), pages 636-647, 1998.",
      "bbox": {
        "l": 41.5,
        "b": 232.5,
        "r": 388.0,
        "t": 263.5
      }
    },
    {
      "label": "list_item",
      "text": "14. I. Horrocks, L. Li, D. Turi, and S. Bechhofer. The instance store: DL rea- soning with large numbers of individuals. In Proc. of the 2004 Description Logic Workshop (DL 2004), 2004. available at CEUR, www.ceur.org, see also instancestore.man.ac.uk.",
      "bbox": {
        "l": 41.0,
        "b": 189.0,
        "r": 388.0,
        "t": 230.0
      }
    },
    {
      "label": "list_item",
      "text": "15. I. Horrocks, P. Patel-Schneider, and F. van Harmelen. Reviewing the design of DAML+OIL: An ontology language for the semantic web. In Proc. of the 18th Nat. Conf. on Artificial Intelligence (AAAI 2002), pages 792-797. AAAI Press, 2002.",
      "bbox": {
        "l": 41.5,
        "b": 154.0,
        "r": 388.5,
        "t": 185.5
      }
    },
    {
      "label": "list_item",
      "text": "16. I. Horrocks and U. Sattler. A tableaux decision procedure for SHOIQ. In Proc. of the 19th Int. Joint Conf. on Artificial Intelligence (IJCAI 2005), 2005.",
      "bbox": {
        "l": 41.5,
        "b": 131.5,
        "r": 389.0,
        "t": 152.0
      }
    },
    {
      "label": "list_item",
      "text": "Hulo, C. J. Sigrist, V. Le Saux, P. S. Langendijk-Genevaux, L. Bordoli, A. Gat- tiker, E. De Castro, P. Bucher, and A. Bairoch. Recent improvements to the prosite database. Nucleic Acids Res, 32:134~7, 2004.",
      "bbox": {
        "l": 41.0,
        "b": 98.5,
        "r": 387.5,
        "t": 129.5
      }
    },
    {
      "label": "list_item",
      "text": "18. P. J. Kemnelly. Protein phosphatases~a phylogenetic perspective. Chem Rev, 101(8):2291-312, 2001.",
      "bbox": {
        "l": 41.5,
        "b": 75.5,
        "r": 387.5,
        "t": 95.5
      }
    },
    {
      "label": "list_item",
      "text": "19. K. Wolstencroft, P. Lord, L. Tabernero, A. Brass, and R. Stevens. Intelligent classi- fication of proteins using an ontology. Submitted, 2005.",
      "bbox": {
        "l": 41.0,
        "b": 53.0,
        "r": 387.0,
        "t": 73.0
      }
    }
  ],
  "15": [
    {
      "label": "page_header",
      "text": "K. Wolstencroft et al.",
      "bbox": {
        "l": 74.0,
        "b": 617.5,
        "r": 162.0,
        "t": 625.0
      }
    },
    {
      "label": "page_header",
      "text": "800",
      "bbox": {
        "l": 41.0,
        "b": 618.0,
        "r": 55.5,
        "t": 624.5
      }
    },
    {
      "label": "list_item",
      "text": "20. I. Letunic, R. R. Copley, $. Schmidt, F. D. Ciccarelli, T. Doerks, J. Schultz, C. P. Ponting, and P. Bork. Smart 4.0: towards genomic data integration. Nucleic Acids Res, 32:142-4, 2004.",
      "bbox": {
        "l": 41.5,
        "b": 568.5,
        "r": 388.0,
        "t": 599.5
      }
    },
    {
      "label": "list_item",
      "text": "21. C. Lutz. Description logics with concrete domains—a survey. In Advances in Modal Logics Volume 4. World Scientific Publishing Co. Pte. Ltd., 2003.",
      "bbox": {
        "l": 41.5,
        "b": 546.0,
        "r": 388.5,
        "t": 566.5
      }
    },
    {
      "label": "list_item",
      "text": "22. J. E. Mabey, M. J. Anderson, P. F. Giles, C. J. Miller, T. K. Attwood, N. W. Paton, E. Bornberg-Bauer, G. D. Robson, S. G. Oliver, and D. W. Denning. Cadre: the central aspergillus data repository. Nucleic Acids Res, 32:401-5, 2004.",
      "bbox": {
        "l": 41.0,
        "b": 513.5,
        "r": 387.5,
        "t": 544.5
      }
    },
    {
      "label": "list_item",
      "text": "23, N. J. Mulder, R. Apweiler, T. K. Attwood, et al. Interpro, progress and status in 2005. Nucleic Acids Res, 33:201-5, 2005.",
      "bbox": {
        "l": 41.0,
        "b": 491.5,
        "r": 387.5,
        "t": 511.5
      }
    },
    {
      "label": "list_item",
      "text": "24. T. Mustelin, T. Vang, and N. Bottini. Protein tyrosine phosphatases and the immune response. Nat Rev Immunol, 5(1):43-57, January 2005.",
      "bbox": {
        "l": 41.5,
        "b": 469.0,
        "r": 388.0,
        "t": 489.5
      }
    },
    {
      "label": "list_item",
      "text": "25. P. Rice, I. Longden, and A. Bleasby. EMBoss: the European molecular biology open software suite. Trends Genet, 16(6):276-7, June 2000.",
      "bbox": {
        "l": 41.5,
        "b": 447.5,
        "r": 387.5,
        "t": 467.5
      }
    },
    {
      "label": "list_item",
      "text": "26. T. F. Smith and X. Zhang. The challenges of genome sequence annotation or ”the devil is in the details”. Nat Biotechnol, 15(12):1222-3, 1997.",
      "bbox": {
        "l": 41.0,
        "b": 426.0,
        "r": 388.0,
        "t": 446.0
      }
    },
    {
      "label": "list_item",
      "text": "27. R. Stevens, H. Tipney, C. Wroe, T. Oinn, M. Senger, P. Lord, C. Goble, A. Brass, and M. Tassabehji. Exploring Williams Beuren Syndrome Using MyGrid. In Bioinfor- matics, volume 20, pages 303-310, 2004. Intelligent Systems for Molecular Biology (ISMB) 2004.",
      "bbox": {
        "l": 41.0,
        "b": 382.0,
        "r": 388.0,
        "t": 424.5
      }
    },
    {
      "label": "list_item",
      "text": "28. R. Stevens, C. Wroe, P. Lord, and C. Goble. Ontologies in bioinformatics. In $. Staab and R. Studer, editors, Handbook on Ontologies, pages 635-657. Springer, 2003.",
      "bbox": {
        "l": 41.0,
        "b": 360.0,
        "r": 387.5,
        "t": 380.0
      }
    },
    {
      "label": "list_item",
      "text": "29. S. Tobies. Complexity Results and Practical Algorithms for Logics in Knowledge Representation. PhD thesis, RWTH Aachen, 2001. electronically available at http://www. bth. rwth-aachen.de/ediss/ediss.html.",
      "bbox": {
        "l": 41.0,
        "b": 326.5,
        "r": 388.0,
        "t": 358.5
      }
    },
    {
      "label": "list_item",
      "text": "30. D. Tsarkov and I. Horrocks. Efficient reasoning with range and domain constraints. In Proceedings of the 2004 Description Logic Workshop (DL 2004). CEUR, 2004. Avail- able from ceur-ws.org.",
      "bbox": {
        "l": 41.0,
        "b": 294.5,
        "r": 387.5,
        "t": 325.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 430.0,
      "h": 660.0
    },
    "2": {
      "w": 430.0,
      "h": 660.0
    },
    "3": {
      "w": 430.0,
      "h": 660.0
    },
    "4": {
      "w": 430.0,
      "h": 660.0
    },
    "5": {
      "w": 430.0,
      "h": 660.0
    },
    "6": {
      "w": 430.0,
      "h": 660.0
    },
    "7": {
      "w": 430.0,
      "h": 660.0
    },
    "8": {
      "w": 430.0,
      "h": 660.0
    },
    "9": {
      "w": 430.0,
      "h": 660.0
    },
    "10": {
      "w": 430.0,
      "h": 660.0
    },
    "11": {
      "w": 430.0,
      "h": 660.0
    },
    "12": {
      "w": 430.0,
      "h": 660.0
    },
    "13": {
      "w": 430.0,
      "h": 660.0
    },
    "14": {
      "w": 430.0,
      "h": 660.0
    },
    "15": {
      "w": 430.0,
      "h": 660.0
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}