{
  "1": [
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 607.5,
        "r": 83.9,
        "t": 635.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 128.5,
        "b": 620.8,
        "r": 310.9,
        "t": 630.8
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 596.2,
        "r": 81.9,
        "t": 602.9
      }
    },
    {
      "label": "section_header",
      "text": "Cosmology and Cosmic Order in Islamic Astronomy Robert G. Morrison * Bowdoin College rgmorris@bowdoin.edu Abstract This article analyzes how the astronomy of Islamic societies in the thirteenth and fourteenth centuries can be understood as cosmological. By studying the Arabic translations  ofthe  relevant  Greek  terms  and  then  the  definitions  ofthe  medieval  Arabic dictionaries, the article finds that Arabic terms did not communicate order in the way implied by the Greek ho kósmos (/uni1F41 κόσμος; the cosmos). Yet, astronomers of the period sometimes discussed cosmic order in addition to describing the cosmos. This article finds, too, that a new technical term, nafs al-amr (the fact of the matter) became part of later discussions of cosmic order. Keywords cosmology - cosmography - astronomy /uni02BFilm al-kalām -nafs al-amr - Ṣadr al-Sharī/uni02BFa al-Bukhārī - al-Sayyid al-Sharīf al-Jurjānī - Mu'ayyad al-Dīn al-/uni02BFUrḍī Defining Islamic cosmology, the cosmology of Islamic societies, is not simple because cosmology does not have historic equivalents in languages such as Arabic, Persian, or Ottoman Turkish, and does not map onto a single actors' category. Cosmology has been applied to synthesize a wide variety of sub-fields within Islamic studies, ranging, on the one hand, from the synthesis of a number of scientific approaches to the universe, and on the other hand, to the description of the world views of ṣūfī s to the outlooks implicit in certain social structures.$^{1} Survey articles capture this range in various ways. We read in the * Department of Religion, Bowdoin College, 7300 College Station, Brunswick, ME 04011, USA. 1 A non-exhaustive sampling would include: Patricia Crone: 'Excursus II: Ungodly Cosmologies,' in Sabine Schmidtke, ed., The Oxford Handbook of Islamic Theology (Oxford, 2016), 103-129;",
      "bbox": {
        "l": 55.9,
        "b": 552.9,
        "r": 382.8,
        "t": 568.2
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.2,
        "b": 500.3,
        "r": 178.4,
        "t": 537.6
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 89.9,
        "b": 461.6,
        "r": 127.8,
        "t": 470.3
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 340.4,
        "r": 383.5,
        "t": 443.6
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 89.9,
        "b": 298.4,
        "r": 133.1,
        "t": 309.1
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 257.8,
        "r": 382.8,
        "t": 281.8
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 122.6,
        "r": 382.8,
        "t": 227.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 91.3,
        "r": 380.1,
        "t": 100.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 56.6,
        "b": 68.6,
        "r": 383.5,
        "t": 89.3
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 65.9,
        "b": 29.3,
        "r": 301.6,
        "t": 37.3
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 200.4,
        "b": 30.0,
        "r": 301.6,
        "t": 37.3
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 66.6,
        "b": 29.3,
        "r": 189.1,
        "t": 36.6
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 369.5,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "Encyclopedia  of  Religion that 'Cosmology  refers  to  more  consciously  entertained images, doctrines, and scientific views concerning the universe.'$^{2} Some scholars have acknowledged this range of meanings in their work. For instance, in the Encyclopaedia of Islam , Second Edition , Tjitze de Boer clarified in the first part of the article on /uni02BFālam (world), which implicated definitions of the cosmos, that he was not addressing 'the scientific development of the cosmogonic teaching of Aristotle and Ptolemy in Islām' and referred readers elsewhere.$^{3} He  focused,  instead,  on  philosophical, qur'ān ic  and  theological  (i.e.,  in  the sense of /uni02BFilm al-kalām ) speculation about cosmogony. In the second part of the article, Louis Gardet described ṣūfī and illuminationist ( ishrāqī ) cosmologies, again setting aside cosmologies that drew on fields such as natural philosophy and science. Other scholarship has focused on the cosmologies found in science and philosophy texts. Y. Tzvi Langermann, in his 1997 survey article 'Arabic Cosmology,' defined cosmology as 'that enterprise which describes what the universe looks like.'$^{4} Langermann clarified that the focus of his survey was the tradition of /uni02BFilm al-hayʾa , a locus for numerous, fascinating discussions in Islamic societies about astronomy. Scholars besides Langermann have used 'cosmology' as a translation for the general field of /uni02BFilm  al-hayʾa .$^{5}  Other  scholarship has both Yousef, Mohamed Haj, Ibn /uni02BF Arabî:  time  and  cosmology (Oxon, 2008); Heinz Halm, 'The Cosmology of the Pre-Fatimid Ismā/uni02BFīliyya,' in Farhad Daftary, ed., Mediaeval Isma/uni02BFili history and thought, (Cambridge, 1996), 75-83; Frank Griffel, 'Al-Ghazālī's Cosmology in the Veil Section of His Mishkāt al-anwār, ' in Y. Tzvi Langermann, ed., Avicenna and his legacy: a golden age of science and philosophy (Turnhout, 2009), 27-49; R. Kevin Jaques, 'Sajarah Leluhur: Hindu cosmology and the construction of Javanese Muslim genealogical authority,' Journal of Islamic Studies 17 (2006), 129-157; Eva Orthmann, 'Court Culture and Cosmology in the Mughal Empire: Humāyūn and the foundations of the dīn-i ilāhī,' in Albrecht Fuess and Jan-Peter Hartung, eds., Court cultures in the Muslim world: seventh to nineteenth centuries (London-New York, 2011), 202-220. 2 Kees W. Bolle, 'Cosmology: An Overview,' in Lindsay Jones, ed., Encyclopedia of Religion , 14 vols. (Detroit, MI, 2005), 1991-1998. 3 Tjitze de Boer and Louis Gardet, '/uni02BFĀlam,', in Peri Bearman, Thierry Bianquis, Clifford E. Bosworth, Emeri van Donzel and Wolfhart P. Heinrichs, eds., Encyclopaedia of Islam, Second Edition (Leiden, 2010), consulted online 11.04.2018 <http://dx.doi.org/10.1163/1573-3912_islam_ COM_0041>. 4 Y. Tzvi Langermann, 'Arabic Cosmology,' Early Science and Medicine 2 (1997), 185-213, 185. Langermann wrote, 'The 'cosmologists' of whom we shall be speaking shared the common concern of providing an adequate portrayal of the physics of the universe as a whole, but especially of the celestial regions.' 5 See, e.g., George Saliba, 'Early Arabic Critique of Ptolemaic Cosmology: A Ninth-Century Text on the Motion of the Celestial Spheres,' in Journal for History of Astronomy 25 (1994), 115-41; Robert Morrison, 'Islamic Astronomy and Cosmology,' in David Lindberg and Michael Shank, eds., Cambridge History of Science , 8 vols. (Cambridge-New York, 2011), vol. 5, 109-138.",
      "bbox": {
        "l": 55.3,
        "b": 449.0,
        "r": 382.8,
        "t": 604.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 352.4,
        "r": 382.8,
        "t": 444.3
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 66.6,
        "b": 223.8,
        "r": 383.5,
        "t": 331.7
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 201.2,
        "r": 382.8,
        "t": 221.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 157.9,
        "r": 383.5,
        "t": 199.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 113.2,
        "r": 382.8,
        "t": 155.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 69.9,
        "r": 383.5,
        "t": 111.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 623.5,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "distinguished between cosmology and /uni02BFilm al-hayʾa and then blurred that distinction.$^{6}  Recently,  Damien Janos has taken a more synthetic approach and has argued, in the case of Fārābī, that astronomy was a discipline from which one  could  construct  Fārābī's  cosmology,  and  that  no  single  discipline  that Fārābī  pursued  mapped  precisely  onto  the  category  ofcosmology.$^{7}  George Saliba has written that '[t]he best way to translate /uni02BFilm al-hayʾa into English is to think of the term 'cosmography' in the literal sense. This is because hayʾa , in this context, simply meant the attempt to describe the apparent behavior of the cosmos […] celestial spheres interpreted and understood in the same sense as in Aristotelian works upon the subject.'$^{8} Ragep, in his 1982 dissertation, had also described part of Ṭūsī's enterprise in the Tadhkira as cosmography.$^{9} Cosmography is an appealing translation of /uni02BFilm al-hayʾa because it reflects how all writers on /uni02BFilm al-hayʾa were certainly describing the apparent behavior of the cosmos. But since cosmography could also be understood as 'writing the cosmos' and, thus, as a way to study the cosmos, /uni02BFilm al-hayʾa might also be cosmological in ways in addition to the cosmographic. This article will investigate instances when authors on /uni02BFilm al-hayʾa went beyond cosmography, or beyond the  definition  ofcosmology  that  one  might  call  cosmography  -  explaining what the cosmos looked like - and ventured into a different subset of cosmology, a subset that communicated a certain understanding of cosmic order, and exploring the cosmos as an ordered universe, versus others. As all authors on hayʾa presumed that the motions were uniform, I am looking for arguments or contentions that there is an underlying order in the cosmos (cosmology), not simply arguments that a given set of observations can be explained in terms of uniform motions (cosmography). The genre of hayʾa generally excluded 'why' questions, preferring to confine itself to descriptions of the external aspects of the celestial bodies.$^{1}$^{0} Metaphysical statements about 6 The distinction between /uni02BFilm al-hayʾa and cosmology blurs in F. Jamil Ragep, 'Astronomy,' in  Kate  Fleet,  Gudrun  Krämer,  Denis  Matringe, John Nawas and Everett Rowson, eds., Encyclopaedia of Islam, THREE (Leiden, 2009), <http://dx.doi.org/10.1163/1573-3912_ei3_ COM_22652> last accessed 19.05.2019. Ragep wrote that /uni02BFilm al-hayʾa al-basīṭa specified 'a certain genre of theoretical astronomy/cosmology.' Three of the four sub-headings of the article  included  the  word  'cosmology'.  For  another  example  ofthe  blurred  distinction between ilm al-hayʾa and cosmology, see Morrison, 'Islamic Astronomy.' (Leiden- 7 Damien  Janos, Method,  Structure,  and  Development  in  al-Fārābī's  Cosmology Boston, MA, 2012), 11, n1. 8 George Saliba, 'Islamic Astronomy in Context: Attacks on Astrology and the Rise of the Hay'a Tradition,' Bulletin of the Royal Institute for Inter-Faith Studies , 4 (2002), 25-46, 42-43. 9 F. Jamil Ragep: 'Cosmography in the Tadhkira of Naṣīr al-Dīn al-Ṭūsī' (dissertation, Harvard University, 1982). 10 Naṣīr al-Dīn Muḥammad b. Muḥammad al-Ṭūsī, Naṣīr al-Dīn al-Ṭūsī's Memoir on Astron-",
      "bbox": {
        "l": 55.9,
        "b": 325.1,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 244.5,
        "r": 383.5,
        "t": 322.4
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 145.9,
        "r": 383.5,
        "t": 221.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 124.6,
        "r": 382.8,
        "t": 144.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 102.6,
        "r": 382.8,
        "t": 123.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 80.6,
        "r": 382.8,
        "t": 100.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 382.8,
        "t": 77.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.8,
        "t": 38.6
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.8,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "order in the cosmos were borrowed, not discussed. Thus, most of hayʾa turns out to be cosmography, but there are cases in which authors talk about the universe's underlying order, and this article aims to clarify which is which and why. Within the history of /uni02BFilm al-hayʾa , the article focuses on writers associated with the Marāgha Observatory through 1400. Academic discussions of Islamic cosmology in all periods have been complicated by the wide semantic range of the Greek ho kósmos (cosmos), by how the Arabic words /uni02BFālam (world) and niẓām (order) render more than one Greek term respectively, and by how neither Arabic lexicographic dictionaries nor texts translated from the Greek make a necessary connection between /uni02BFālam and niẓām .  Acknowledging the range of possible uses and definitions of Arabic words like /uni02BFālam and English words like 'cosmos' is important background for the debates about cosmic order that follow. Thus, the article begins by examining the semantic range of kósmos in Greek and how that and related words were translated into Arabic. These lexicographic considerations matter because they clarify why thirteenth and fourteenth-century discussions of the cosmos may or may not communicate an inherent order. These different stances on whether the cosmos was inherently ordered are the focus of the first part of the article. Second, the paper will examine the ways in which some writers on /uni02BFilm  al-hayʾa ,  particularly Mu'ayyad al-Dīn al/uni02BFUrḍī (d. 1266), discussed /uni02BFilm al-hayʾa 's models in terms of the cosmos' underlying order. As earlier scholarship has suggested, /uni02BFUrḍī's position could have developed out of a conversation or debate with kalām .$^{1}$^{1}  Third, following /uni02BFUrḍī, the article engages the astronomy of Quṭb al-Dīn al-Shīrāzī (d. 1311), which featured increased confidence about the correctness of astronomy's models but fewer references to an ordered cosmos. Fourth, the paper, as an interlude, will mention Ṣadr al-Sharī/uni02BFa's (d. 1347) position about how the knowledge afforded by /uni02BFilm al-hayʾa was restricted to particulars and did not lead to knowledge of an essential natural order. Ṣadr al-Sharī/uni02BFa's response to Shīrāzī and Naṣīr al-Dīn al-Ṭūsī's theoretical astronomy illustrates how one could be an influential writer on /uni02BFilm al-hayʾa without arguing that there was an underlying natural order detectable through the systematic interrogation of creation. Fifth and finally, the article will cover ways that discussions of an ordered universe, in works on /uni02BFilm al-hayʾa written at the beginning of the thirteenth century, endured even without as strong a dependence on the physics and metaphysics derived from omy: al-Tadhkira fī /uni02BFilm al-hayʾa, ed., trans. and commentary F. Jamil Ragep, 2 vols. (New York-Heidelberg-Berlin, 1993), vol. 1, 33-41, esp. 38-41. 11 Heidrun  Eichner, The  Post-Avicennian  Philosophical  Tradition  and  Islamic  Orthodoxy. Philosophical and Theological Summae in Context ,  (Habilitationsschrift,  Martin-LutherUniversität Halle-Wittenberg, 2009), 285.",
      "bbox": {
        "l": 55.3,
        "b": 381.0,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 135.9,
        "r": 383.5,
        "t": 377.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 101.9,
        "r": 382.8,
        "t": 123.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 56.6,
        "b": 68.6,
        "r": 382.8,
        "t": 100.6
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 39.3
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "Ibn Sīnā. Specifically, the technical term nafs al-amr (the fact of the matter) became relevant to discussions of cosmic order. 1 Introduction: The Greek Semantic Background and the Semantic Range of the Arabic Translations The wide variety of the ways in which the word kósmos , which informs Western understandings of cosmology, was used in ancient Greek and the different semantic ranges of the Arabic translations of the relevant Greek terms complicate the task of specifying how /uni02BFilm al-hayʾa was (or was not) cosmological. The semantic range of the word /uni02BFālam , often used as a translation for kósmos , does not include all of the ways in which kósmos was used in ancient Greek, but adds some others, as is acknowledged in the Encyclopaedia of Islam, Second Edition article '/uni02BF Ālam.' Likewise, there are Arabic texts that address seemingly cosmological  matters,  such  as  the  Arabic  treatise Fī  Mabādi'  al-kull ,  which Charles Genequand translated as On the Cosmos , even though the world kósmos was probably not in the title of Alexander of Aphrodisias' Greek original upon which the Arabic text was based.$^{1}$^{2} Still, Fī Mabādi' al-kull was dedicated to a holistic view of the cosmos, the question of cosmic order, as well as that order's  moral  implications.  Likewise,  Aristotle's De  Caelo had  much  to  say about the cosmos, but was also concerned with more than cosmography, i.e., with more than just the physical models that accounted for and predicted observable  celestial  motions.$^{1}$^{3}  Reviewing  the  semantic  range  ofthe  relevant Greek terms and how they passed into Arabic lends insights into why a writer in English might classify all of these topics as cosmology, and why different writers in Islamic societies wrote about the cosmos in different ways. The semantic range of the Greek kósmos affected the semantic range of the analytic term 'cosmology' in European languages. To survey the ways in which kósmos was  used in classical Greek literature, I consulted Liddell, Scott and 12 See Charles Genequand, Alexander of Aphrodisias on the Cosmos (Leiden-Boston,  MA, 2001). 13 One translator of Aristotle's De Caelo ( On the Heaven s) was Yaḥyā Ibn al-Biṭrīq [within the Kindī circle; see Dimitri Gutas, Greek Thought , Arabic Culture (London-New York, 1998), 145.]  Both  Ibn  Sīnā  and  Ibn  Rushd  produced  versions  ofthe De Caelo ,  but De Caelo 's approach to astronomy, focusing more on physical principles and less on mathematical precision, became less prominent in Islamic societies with the rise of /uni02BFilm al-hayʾa . On Ibn Rushd's epitome and commentaries on the De Caelo , see Gerhard Endress, 'Averroes' De Caelo : Ibn Rushd's Cosmology in His Commentaries on Aristotle's On the Heavens ,' Arabic Sciences and Philosophy 5 (1995), 9-49.",
      "bbox": {
        "l": 55.3,
        "b": 582.9,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 526.9,
        "r": 371.5,
        "t": 550.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 244.5,
        "r": 383.5,
        "t": 511.6
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 204.5,
        "r": 382.8,
        "t": 242.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 157.9,
        "r": 382.8,
        "t": 177.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 68.6,
        "r": 383.5,
        "t": 155.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.8,
        "t": 39.3
      }
    }
  ],
  "6": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "Jones' lexicon.$^{1}$^{4} The first definition given is 'order', with examples of 'each of them sat down at the oarlocks in order,'$^{1}$^{5} and '[t]he constitution of quartans is agreeable to the same order.'$^{1}$^{6} This order could also extend to politics: 'Deioces was first to establish the rule that no one should come into the presence of the king.'$^{1}$^{7} In Aristotle's Politics , kósmos referred to the rulers: 'the overseers are five in number and the order keepers (κόσμοι; kósmoi ) ten.'$^{1}$^{8}  In  a  similar vein, kósmos referred to world order and the universe in the Timaeus : 'In virtue ofthis  reasoning,  when  he  framed  the  universe,  he  fashioned  reason  with soul and soul within body […] this world came to be, by the god's providence, in very truth a living creature with soul and reason.'$^{1}$^{9} There were also usages or discussions of kósmos that did not directly implicate cosmic order. For instance, Greek texts, and their Arabic translations, could use kósmos to mean the  universe  or  the  conglomeration  oforbs.  In  the Planetary  Hypotheses , Ptolemy  wrote: kósmou  dé  gínetai  mía  peristrophḗ (κόσμου  δ/uni1F74  γίνεται  μία περιστροφή).$^{2}$^{0} The Arabic was: wa-l-/uni02BFālam yadūr dawr an  wāḥid an , meaning that the cosmos, in the sense of the conglomeration of orbs, completes a single revolution.$^{2}$^{1} The context of this statement was an attempt to identify the point 14 Henry George Liddell and Robert Scott, A Greek-English Lexicon , revised and augmented by Sir Henry Stuart Jones with the assistance of Roderick McKenzie (Oxford, 1996), s.v. ' kósmos ,' 985. 15 Odyssey , XIII.77. See Homer, The Odyssey , trans. Albert Cook (New York, 1967), 176. 16 Hippocrates,  'The  Book  of  Prognostics,'  in The  Genuine  Works  of  Hippocrates ,  trans. Charles Darwin Adams (New York, 1868), <http://data.perseus.org/citations/urn:cts:greek Lit:tlg0627.tlg003.perseus-eng1:20> last accessed 29.05.2019. 17 Herodotus, The Histories, trans. A.D. Godley (Cambridge, MA, 1920), 99, <www.perseus. tufts.edu/hopper/text?doc=Perseus:abo:tlg,0016,001:7:136> last accessed 29.05.2019. 18 Aristotle, Politics ,  trans. C. David C. Reeve (Indianapolis, IN, 1998), 1272a6. Rémi Brague found that, overall, Aristotle related human life to the cosmos: 'Aristotle's cosmology is such that his ontology determines his anthropology: the world being not that which we are in, but rather the ordered totality of that which is, then man is part of this world. Man is characterized by his capacity to seize that which elevates the best of the ontological model presented by him and to find his excellence in conforming to this model.' [Rémi Brague, Aristote et la question du monde (Paris, 1988), 512. The translation is my own.] 19 Plato, Timaeus, trans. Francis M. Cornford, (New York, 1959), 20 (30b-c). 20 Ptolemy, Claudii Ptolemaei opera quae exstant omnia , ed. Johan L. Heiberg, 3 vols. (Leipzig, 1907), vol. 2: Opera astronomica minora ,  7 4, l. 27. For the Arabic, see Bernard Goldstein, 'The Arabic Version of Ptolemy's Planetary Hypotheses , ' Transactions of the American Philosophical Society , n.s., 57.4 (Philadelphia, PA, 1967), 3-55, at 14, l. 25. 21 Later  in  the  history  ofscience  in  Islamic  societies,  we  find  that  /uni02BFUrḍī's Kitāb  al-Hay'a defined /uni02BFālam as the conglomeration of orbs: 'It ought to be understood from their saying ( qawlihim )  the  world  ( al-/uni02BFālam )  that  it  is  a  reference  to  what  is  encompassed  by  the apparent surface from the uppermost orb in which there is seen no star and which is named, owing to that, al-falak al-aṭlas .' As this paper will show, /uni02BFUrḍī certainly argued for an underlying cosmic order, but his perception of cosmic order did not necessarily follow",
      "bbox": {
        "l": 55.3,
        "b": 379.0,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 333.7,
        "r": 382.8,
        "t": 365.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 321.7,
        "r": 360.2,
        "t": 331.7
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 289.8,
        "r": 382.8,
        "t": 321.1
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 267.8,
        "r": 382.8,
        "t": 288.4
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 189.2,
        "r": 382.8,
        "t": 265.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 59.2,
        "b": 135.9,
        "r": 382.8,
        "t": 177.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 75.9,
        "b": 69.9,
        "r": 383.5,
        "t": 135.2
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "7": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 623.5,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 628.8
      }
    },
    {
      "label": "text",
      "text": "around which the heavens' daily revolution should be measured and not an exploration of the significance of the heavens revolving with a single revolution. Of less significance for this article, kósmos also denoted ornamentation,$^{2}$^{2} and by metaphorical extension, honor and credit as well as the words for six and ten in the Theologoumena Arithmeticae .$^{2}$^{3} The wide semantic range of the Greek word kósmos helps account for the wide range of ways in which cosmology has been defined within Islamic studies. The examples from Aristotle and Plato entailed cosmic order; the example from Ptolemy's Planetary Hypotheses did not. Also important for this article's focus on discussions of cosmic order in /uni02BFilm al-hayʾa texts are cases in which the cosmos is thought to be ordered, but a different word hḗ táxis (/uni1F25 τᾰ ́ ξ/uni1FD0ς) is used for the order of the cosmos itself; consider De Caelo 280a: 'For it is clear that when the elements come together, the resulting order ( táxis ) is not fortuitous, but always the same, especially in the words of the authors of this view, since they attribute each arrangement to one of a pair of opposites. If then the whole sum of a body, being a continuum, is disposed and ordered now in this way and now in that, and the formation of this whole is a world ( kósmos ), then it will not be the world ( kósmos ) which comes into being and perishes, but its dispositions only.' These passages from De Caelo and the Timaeus (in the previous paragraph) relate the cosmos' order to cosmogony. And while the cosmos was necessarily ordered in both passages, the Greek term kósmos did not, on its own, necessarily communicate that order. There were other ways to convey that order, to which Arabic translations of táxis are relevant. The Arabic translations preserved most of the semantic range of the Greek. Kósmos was usually translated into Arabic as /uni02BFālam . For instance, the Greek title of the De Mundo was περ/uni1F76 κόσμου, translated into Arabic as al-Dhahabiyya fī ṣifat  al-/uni02BFālam  wa-annahā  aḥsan  min  bayt  al-dhahab  al-mushāhad  fī  bilād  alHind [lit. The Golden (Epistle) on the Description of the world and that it is from his understanding of the word /uni02BFālam . See Mu'ayyad al-Dīn al-/uni02BFUrḍī, The Astronomical Work of Mu'ayyad al-Dīn al-/uni02BFUrḍī , ed. and intro. George Saliba (Beirut, 1990), 29. 22 For  the  Arabic  translation  of kósmos as ḥaly and zīna ,  see  Artemidoros' Oneirocritica 218,14/400.13 ( zīna ) and 106,17/1076.17 ( ḥaly ). See also the Arabic translation of Aristotle's Rhetoric 15b38: al-tazyīn aw al-tazyīq . Cf. <http://telota.bbaw.de/glossga/glossary.php?id= 134093> last accessed 29.05.2019. 23 Liddell, Scott and Jones' Greek-English Lexicon cites p.37 for six and p.59 for ten from the 1922  Teubner  edition  ofthe Theologoumena Arithmeticae .  I  consulted  Ps.  Iamblichus, Theologoumena Arithmeticae, ed. Victorius de Falco (Leipzig, 1922) and found kósmos for six on 48, l. 18 and for ten on 80, l. 3",
      "bbox": {
        "l": 55.9,
        "b": 488.9,
        "r": 382.8,
        "t": 604.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 286.4,
        "r": 383.5,
        "t": 484.3
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 217.2,
        "r": 383.5,
        "t": 281.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 78.6,
        "b": 157.9,
        "r": 383.5,
        "t": 177.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 112.6,
        "r": 382.8,
        "t": 155.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 382.8,
        "t": 111.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 39.3
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.8,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "finer than the house of gold witnessed in the lands of India].$^{2}$^{4} Another Arabic translation, found in a different MS of the same text, was Risālat Arisṭūṭālīs ilā Iskandar fī l-/uni02BFālam wa-l-makhlūqāt (lit. The Epistle of Aristotle to Alexander on the World and Creatures).$^{2}$^{5} Because this article focuses on the ways in which hayʾa texts sometimes go beyond a holistic description of the universe to discussions of cosmic order, the fact that the usage of kósmos to  mean  'order' could carry over into Arabic is potentially very significant. In Thābit b. Qurra's translation of Nicomachus' Arithmetic , kósmos was rendered as niẓām (order).$^{2}$^{6} In the Arabic Compendium of the ' Timaeus ' ,  the world ( /uni02BFālam , a translation of kósmos ), was created with order: 'he [the demiurge] made the world ( /uni02BFālam ) to be ensouled and created it to last as long as possible.'$^{2}$^{7} The Arabic Compendium of the Timaeus , like the Greek Timaeus , considered an unordered world as a prelude to cosmic order created with the cosmos: 'Then he said: All of this was before the occurrence ( ḥudūth ) of the world ( al-/uni02BFālam ) except that it was not  harmonious  ( ghayr  mu/uni02BFtadala )  without  any  order  or  arrangement  ( lā niẓām la-hā wa-lā tartīb ). When he ornamented and arranged and smoothed out the world, all things became harmonious and ordered.'$^{2}$^{8} In both Ibn Qurra's translation of Nicomachus and the Compendium , the word /uni02BFālam did not connote cosmic order itself; niẓām did. The Compendium reads: 'Because it is not possible to return a thing among things, which is disordered ( ghayr muntaẓama ), to order without an intellect, it is necessary from that that the creator place an intellect in this substance. As it is impossible that the intellect belong 24 David Alan Brafman, The Arabic De Mundo: An Edition with Translation and Commentary (Durham, 1985), 36. 25 Ibid., 44. A corrupted (Ibid. , 51) MS listed the treatise as: Risālat Arisṭūṭālīs ilā al-Iskandar b. Fīlūbis al-Yūnānī ( fī bayt al-dhahab). 26 <http://telota.bbaw.de/glossga/glossary.php?id=177012> last accessed 29.05.2019. See Wilhelm  Kutsch, Tābit  b.  Qurra's  arabische  Übersetzung  der  Arithmetike  Eisagoge  des Nikomachos von Gerasa zum ersten Mal herausgegeben (Beirut, 1959), 55, l. 15. 27 Richard Walzer, ed., Plato Arabus ,  3  vols.  (London: Warburg Institute, 1943-1951), vol. 1: Galeni  Compendium  Timaei  Platonis ,  5.  In  this  sentence,  the  soul  was  the  source  of order. See also Gerd Graßhoff, 'Cosmology,' in Hubert Cancik and Helmuth Schneider, eds., Brill's New Pauly (2016), <http://referenceworks.brillonline.com/entries/brill-s-newpauly/cosmology-e621140> last accessed 11.05.2017. Pythagoras may have been the first to propose a cosmos ordered according to mathematical principles. 'The rise and decay of the world was explained in early natural philosophy ( physikḗ ) by a growth metaphor; the purpose is to discover order ( kósmos ) in nature (φύσις/ phýsis ), determine its essence and explain  its  origin.  The  idea  ofthe  cosmos  as  a  structure  ofthe  whole  linked  by  the elements  directly  associates  its  order  with  the  harmonies  ofwhich  the  Pythagoreans spoke using the verb /uni1F01ρμόττειν  ( harmóttein ,  'compose'),  meaning harmonies borrowed from music and based on numbers.' 28 Walzer, ed., Galeni Compendium, 22.",
      "bbox": {
        "l": 55.3,
        "b": 311.1,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 267.1,
        "r": 382.8,
        "t": 287.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 245.8,
        "r": 383.5,
        "t": 265.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 212.5,
        "r": 382.8,
        "t": 243.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 81.3,
        "r": 383.5,
        "t": 210.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 202.4,
        "t": 77.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "to a thing among the things without a soul, [the creator] ensouled the cosmos and created it as lasting as is possible.'$^{2}$^{9} Just as frequently, though, the Greek texts, followed by the Arabic translations, discussed order apart from cosmogony and apart from the structure of the cosmos. At the beginning of the Planetary Hypotheses , Ptolemy used táxis to mean 'order', writing: hḗ te táxis homoū́ kaí hē diaphorá tōn kinḗseōn (/uni1F25 τε τάξις /uni1F41μο/uni1FE6 κα/uni1F76 /uni1F21 διαφορ/uni1F70 τ/uni1FF6ν κινήσεων), which was  translated  into  Arabic  as niẓām al-ḥarakāt wa-fuṣūlihā wa-l-ikhtilāfāt .$^{3}$^{0} The Greek is translated as: 'Both the arrangement and the difference of the motions at the same time.' The Arabic translations of kósmos reproduced in large part the semantic range of the Greek; there could be order in the cosmos, but that order was not always a foundation of the cosmos. Working with  the  Arabic  translation  rather  than  the  original  Greek,  one cannot always tell whether the Arabic word /uni02BFālam is a translation of kósmos or tó pān (τ/uni1F78 π/uni1FB6ν), which would be more precisely translated as 'the whole'. As for translations of tó pān as /uni02BFālam , we read that 'the reason for the creation of the world ( /uni02BFālam ) is God's, may he be blessed and exalted, generosity,' and that 'it follows [from] this that the universe is only one.'$^{3}$^{1} More cases where /uni02BFālam rendered tó pān are: 'He created the world ( al-/uni02BFālam )  from fire and earth,'$^{3}$^{2} and 'when he mixed the first mixture in which he mixed the soul of the world.'$^{3}$^{3} Likewise, niẓām occurs as a translation not only for the Greek hḗ táxis but also for hē harmoníā (/uni1F21 /uni1F01ρμονία; cf. De Mundo 399a12 ).$^{3}$^{4} The first page of Aristotle's Poetics (1447a22)  uses harmoníā ,  and  it  is  translated  (by  Abū  Bishr  Mattā  b. Yūnus, d. 940) as naẓm .$^{3}$^{5}  The  fact  that the Arabic /uni02BFālam and words from the root nẓm can render Greek words other than kósmos and táxis respectively means that discipline and disciplinary terminology alone are insufficient for conclusions about /uni02BFilm al-hayʾa 's connection to cosmology. 29 Ibid., 5. 30 For the Greek, see Heiberg, ed., Claudii Ptolemaei opera, vol. 2, 70, l. 24 to 72, l. 1. The Greek is  translated as: 'Both the arrangement and the difference of the motions at the same time'. For the Arabic, see Goldstein, 'Arabic Version,' 13, l. 17. 31 Walzer, ed., Galeni Compendium, 5, lines 9 and 16 respectively. Here /uni02BFālam rendered tó pān . At line 14, /uni02BFālam rendered kósmos. 32 Ibid., 6, lines 2-3 33 Ibid., 9, line 9. 34 Brafman, Arabic De Mundo, 269 (for the index). The reading niẓām comes from the Fatih MS (see 108). 35 See GALex online: <http://telota.bbaw.de/glossga/glossary.php?id=131982> last accessed 29.05.2019. Harmoniā appears also in 1448b20 [David Margoliouth: Analecta orientalia ad Poeticam  Aristoteleam (London,  1887),  8]  as ta⁠ʾlīf ,  in  1449b29  (Margoliouth, Analecta orientalia ,  29)  as naghma ,  and  in  1449a28  as harmoniā lektikēs (Margoliouth, Analecta orientalia , 11) and al-ta⁠ʾlīf al-jadalī.",
      "bbox": {
        "l": 55.3,
        "b": 460.3,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 257.1,
        "r": 383.5,
        "t": 457.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 223.8,
        "r": 104.5,
        "t": 232.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 189.8,
        "r": 382.8,
        "t": 221.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 168.5,
        "r": 382.8,
        "t": 189.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 157.2,
        "r": 135.1,
        "t": 165.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 146.6,
        "r": 127.2,
        "t": 155.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 124.6,
        "r": 382.8,
        "t": 144.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 68.6,
        "r": 383.5,
        "t": 123.2
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 39.3
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "Whatever the small distinctions that emerged during the Translation Movement between the semantic ranges of /uni02BFālam and kósmos , as well as the connection  to niẓām ,  Arabic  lexicographic  dictionaries  decoupled  the  world  (or cosmos) from conceptions of order. Lisān al-/uni02BFarab (by Ibn Manẓūr, d. 1312) and al-Qāmūs al-muḥīṭ (of al-Fayrūzabādī; d. 1414) defined /uni02BFālam as 'creation, all of it and it is said: it is what the interior of the orb contains.'$^{3}$^{6} Lisān al-/uni02BFarab went on to discuss whether /uni02BFālam should have a hamza instead of the long alif and how the word connotes things that have been collected. The identification of the world ( /uni02BFālam ) with creation arises, building, in addition, on the translation of kósmos as khalq that motivated the Islamic cosmologies that were covered in  the Encyclopaedia  of  Islam,  Second  Edition article.$^{3}$^{7}  Simply  put,  order was not neccessarily a defining characteristic of /uni02BFālam even though Thābit b. Qurra had translated /uni1F41 κόσμος as niẓām and even though the Arabic Compendium had, like the Greek Timaeus , understood order to be a foundation of the cosmos. One finds that definitions of niẓām and naẓama (i.e.,  ornamentation and arranging) in lexicographic dictionaries such as al-Qāmūs and Lisān al-/uni02BFarab , involve examples of order from nature, but there is no discussion of how nature is necessarily ordered overall. These definitions refer neither to the overall organization of nature nor to anything that could be identified as the cosmos or the political system. From al-Qāmūs al-Muḥīṭ : ' Naẓm is composition: and he brought one thing together with another, and manẓūm is that which is ordered and a group of locusts and three stars  from  Gemini,  with  the  Pleiades  and Aldebaran.$^{3}$^{8}  He  strung  ( naẓama )  the  pearls,  arranging  them  properly  in  a string. He brought them into order ( naẓẓama ):  he  composed them and collected  them  on  a  thread  ( silk ),  so  they  were  ordered  ( intaẓama )  and  wellarranged  ( tanaẓẓama ).  He  pierced  ( intaẓama )  with  his  lance  [means]  he pierced it ( ikhtallah ) […] And [ niẓām is] good conduct, guidance, and morals. And two white streaks ( niẓāmā )  ofthe  fish  and  lizard  and  their  two  white streaks ( inẓāmāhumā ) with a kasra on them both and their two white streaks ( unẓūmatāhumā ) with a ḍamma , meaning two ordered threads from the tail to 36 Ibn Manẓūr, Lisān al-/uni02BFarab al-muḥīṭ , ed. Yūsuf Khayyāṭ, 7 vols. (Beirut, 1988) vol. 4, 871-872. See  also  Majd  al-Dīn  Muḥammad  b.  Ya/uni02BFqūb  al-Fīrūzābādī, al-Qāmūs  al-muḥīṭ (Cairo, 2008), 1137. 37 On the translation of kósmos as khalq , see Ps. Plutarch, Placita , 300a7 in the translation by Qusṭā b. Lūqā (l. 13, l. 23). Cf. <http://telota.bbaw.de/glossga/glossary.php?id=182316> last accessed 29.05.2019. 38 The text (Fīrūzābādī, Qāmūs , 1624) reads: wa-thalātha kawākib min al-jawzāʾ wa/uni02BF (?) wa-lthurayyā wa-l-dabarān . My translation presumes ma/uni02BFa al-thurayyā for wa/uni02BF wa-l-thurayyā .",
      "bbox": {
        "l": 55.9,
        "b": 407.7,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 189.8,
        "r": 382.8,
        "t": 403.7
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 124.6,
        "r": 382.8,
        "t": 155.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 91.3,
        "r": 383.5,
        "t": 123.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 68.6,
        "r": 382.8,
        "t": 89.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "the ear.'$^{3}$^{9} The  entry in Lisān al-/uni02BFarab is  similar, though it adds that niẓām is procedure and conduct: '[Saying that] their affair has no niẓām means that it has no procedure nor anything adhered to ( muta/uni02BFallaq )  nor  rectitude.  It  remains according to a single niẓām , that is: a custom.'$^{4}$^{0} By the time these dictionaries  were  compiled,  the  cosmos  was  not  always  thought,  in  Islamic societies, to be necessarily ordered. This section of the article has shown that the distinction between the cosmos and order emerged, to an extent, from the translation of Greek terms into Arabic. As even more of the distinction is due to meanings that have accrued to certain terminology in the intervening centuries of history, we should be attentive when applying analytic terms derived from Greek to post-classical science in Islamic societies. 2 Cosmic Order in Muʾayyad al-Dīn al-/uni02BFUrḍī's Astronomy Aristotle and Plato linked the order of the cosmos to cosmogony. Because cosmogony was not a topic of /uni02BFilm al-hayʾa , the question of certainty about cosmic order lurked beneath the surface. Of all the /uni02BFilm al-hayʾa texts that this article examines,  Muʾayyad  al-Dīn  al-/uni02BFUrḍī's  (d.  1266) Kitāb  al-Hayʾa (The  Book  of Hayʾa ) featured the greatest concern with epistemological questions, particularly the extent to which one could be certain of one's theories.$^{4}$^{1} Epistemological concerns shaped his argument about why the most perfect motion was a  circular  ( dawriyya )  motion, and of all the things that move circularly, the sphere ( al-kura ) was the most fluid ( aslas ) of all.$^{4}$^{2} T o /uni02BFUrḍī, because circular motion was the simplest motion and because the sphere was the solid each part of which best resembled the rest, it was most likely ( bi-l-ḥarī )  that  the heavens were composed of spheres. Later in Kitāb al-Hayʾa , /uni02BFUrḍī briefly considered Ptolemy's conclusion, in the Planetary Hypotheses ,  that  many of the orbs could be replaced by tori or truncated orbs ( manshūrāt ).$^{4}$^{3}  /uni02BFUrḍī  explained that the torus (or truncated orb) was one of many 'spherical bodies like rings and they had neither poles nor axes'; he wondered, then, 'according to what thing is their impetus ( i/uni02BFtimād ) in motion?' The manshūrāt 'have no proponent because they are far from the most appropriate and likely thing ( al-amr al-awlā wa-l-ashbah ) that might be firmly believed ( bi-mā yu/uni02BFtaqad ) about the 39 Ibid. 40 Ibn Manẓūr, Lisān al-/uni02BFarab , vol. 6, 667. 41 Y. Tzvi Langermann, 'Ibn Kammūna and the 'New Wisdom' of the Thirteenth Century,' Arabic  Sciences  and  Philosophy 15  (2005),  277-327,  295.  /uni02BFUrḍī  was  known  for  paying attention to the epistemological foundations of hayʾa but not through logic. 42 /uni02BFUrḍī, Astronomical Work, ed. Saliba, 37. 43 Ibid., 244. The following quotes from /uni02BFUrḍī 's Kitāb al-hayʾa all come from that page.",
      "bbox": {
        "l": 55.9,
        "b": 459.6,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 419.7,
        "r": 325.5,
        "t": 430.3
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 149.9,
        "r": 384.1,
        "t": 403.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 122.6,
        "r": 95.2,
        "t": 131.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 111.2,
        "r": 209.0,
        "t": 120.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 77.3,
        "r": 383.5,
        "t": 109.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 67.3,
        "r": 213.7,
        "t": 75.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 56.0,
        "r": 361.5,
        "t": 65.3
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.8,
        "t": 39.3
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 370.1,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "heavenly  bodies.'  /uni02BFUrḍī's  argument  for  orbs  against  manshūrāt  was  cosmographic because it focused on the external characteristics of the celestial bodies. Implicit in /uni02BFUrḍī's argument that spheres (and not manshūrāt) were most appropriate and most likely, was an acknowledgement that a preference for spheres (or orbs) could not be decisively substantiated and was, therefore, not certain. Such a qualification was absent from everything that /uni02BFUrḍī said about cosmic order. /uni02BFUrḍī's  conviction  that  the  heavens  were  ordered,  and  that /uni02BFilm  al-hayʾa 's models should reflect that order, emerged in a statement about what earlier practitioners of astronomy had found: 'The essence ( faḥwā ) of their words is their firm belief ( i/uni02BFtiqāduhum ) that the order ( niẓām ) of these motions is accomplished through spheres, with the centers of the mobiles moving through their motion on the circumferences of circles imagined in these spheres moving about their centers with uniform, continual, and continuous motions in an order and arrangement with no disruption in it.'$^{4}$^{4} Motions found their order in uniformity. Even with models comprised of tori, the order would exist nonetheless. Thus, a significant shortcoming of Ptolemy's models was cosmological, because Ptolemy's models did not reflect or explain cosmic order: 'Conceiving the likes of this and its obscurities is from among the likes of that which is not hidden from he who has the least discernment that it is contrary ( mujānib ) to the  settled  principles  ( uṣūl )  ofthis  science,  and  unsuitable  for  the  ordered state  ( ḥāla muntaẓama )  and  the  continuous  affair  ( al-amr al-mustamirr )  in which there are no shortcomings or deficiencies.'$^{4}$^{5} /uni02BFUrḍī's  premise  that  the goal of hayʾa was to explain celestial motions in terms of the cosmos' order, was one respect in which Ptolemy fell short. Just before /uni02BFUrḍī began his chapter on his own model for the upper planets and Venus, he commented that 'all of what he [Ptolemy] said about these things, even if it is improbable ( mustab/uni02BFada ) in the beginning, it has approaches to hayʾa that can be rectified in a way different from that specified in the Almagest ,  and in addition to what he mentioned  in  the Planetary Hypotheses (al-Iqtiṣāṣ),  through  which  this  winding [ iltifāf (a type of motion in latitude)] can be accomplished and it can proceed according to order ( niẓām ) and arrangement ( tartīb ).'$^{4}$^{6} Conformity to cosmic order was the standard that led /uni02BFUrḍī to conclude that his models were better than Ptolemy's even if /uni02BFUrḍī could not be certain that his models offered accurate representations of external reality. 44 Ibid., 28. 45 Ibid., 115. /uni02BFUrḍī has used uṣūl to mean something other than the building-blocks of models, since /uni02BFUrḍī's models contain different building blocks than those of Ptolemy. 46 Ibid., 192.",
      "bbox": {
        "l": 55.3,
        "b": 515.6,
        "r": 383.5,
        "t": 604.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 135.9,
        "r": 383.5,
        "t": 511.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 89.9,
        "r": 108.5,
        "t": 97.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 66.6,
        "r": 382.8,
        "t": 87.3
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 56.0,
        "r": 111.2,
        "t": 64.6
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 39.3
      }
    }
  ],
  "13": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 69.9,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "Although  Ptolemy's  models  did  explain  the  limited  observable  motions, /uni02BFUrḍī  claimed that his way ( ṭarīqunā ) more closely resembles the state of affairs suitable for the heavens.$^{4}$^{7} He concluded the section of Kitāb al-hayʾa , in which he presented his own model for the upper planets and Venus, by commenting: 'In this way, we have corrected the motions of these planets and their matters have been ordered ( wa-intaẓama amruhā ) according to the depiction suitable for the heavenly nature ( al-ṭabī/uni02BFa  al-samāwiyya ).'$^{4}$^{8}  The  only  uncertainty that /uni02BFUrḍī harbored was with respect to the external reality of his own models, not about the existence of a natural order that the models should reflect. A cosmos of ordered motions was an ordered cosmos. The criterion of simplicity, which /uni02BFUrḍī also invoked at times, functioned in a way similar to cosmic order. /uni02BFUrḍī began Kitāb al-Hayʾa by presenting a list of foundations that earlier astronomers had established, often drawing on the conclusions of philosophy: for instance, the idea that the heavens were spherical and the heavens' motions were circular;$^{4}$^{9} or that the earth was spherical and stationary.$^{5}$^{0} Probably the most important of these ideas was that whereby the heavens were seen as comprised of spheres or spherical bodies that revolved uniformly about their own centers. Later in the text, in a critique of Ptolemy's lunar model, /uni02BFUrḍī  said  that  some  ofthese  principles  ( uṣūl )  were taken over from other areas, while others were a priori ( badīhiyya ).$^{5}$^{1}  Conformity to observations and to the adopted principles was evidence for a model's external  reality.$^{5}$^{2}  The  simplest  model  that  met  those  criteria  would  be  the best.$^{5}$^{3} Like cosmic order, the criterion of simplicity stood apart from the foundational principles ( uṣūl ) of /uni02BFUrḍī's models. At the end of the section on the lunar model, /uni02BFUrḍī pointed out that the cosmic order that his models reflected was qualitative, and that the understanding of this cosmic order transcended the definition of mathematical astronomy: Ifit  has  been demonstrated through these observations and principles that Ptolemy used, and which were also precisely what we used, that that which is observed from the states of the moon corresponds to that which emerges  through  calculation,  then  it  is  not  hidden  from  any  rational 47 Ibid., 229. 48 Ibid., 230-231. 49 Ibid., 34. 50 On the earth's sphericity, see Ibid., 38. On the earth's being stationary, see Ibid., 42. 51 Ibid., 116. 52 Ibid., 130. 53 Ibid., 116.",
      "bbox": {
        "l": 55.3,
        "b": 474.3,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 285.1,
        "r": 383.5,
        "t": 471.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 231.2,
        "r": 382.8,
        "t": 282.4
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 78.6,
        "b": 163.2,
        "r": 382.8,
        "t": 215.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 135.9,
        "r": 112.5,
        "t": 144.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 124.6,
        "r": 125.8,
        "t": 133.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 113.9,
        "r": 108.5,
        "t": 122.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 102.6,
        "r": 360.2,
        "t": 111.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 91.9,
        "r": 109.8,
        "t": 99.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 80.6,
        "r": 111.2,
        "t": 89.3
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 109.8,
        "t": 77.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.8,
        "t": 39.3
      }
    }
  ],
  "14": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.8,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "person that our way is more appropriate and truer than Ptolemy's way with respect to the directions of the motions and their quantities. So how can he give up that which corresponds to the principles and agrees with the  branches  ( furū/uni02BF ),  which  are  the  partial  motions,  and  conceiving things that contradict the principles, all the while presuming them [the principles] to be correct. And it has been demonstrated that supposing these things leads to their contradiction. If we accept that an orb moves about its center, with it slowing down at times and speeding up at others, then we have no need for anything at all of that which they have taken on from astronomy ( min amr al-hayʾa ). The outcome of this matter [allowing orbs with non-uniform motions] is the knowledge of the equation of the motions by means of imagining groundless ( bāṭila ) things. It would be sufficient for drawing up tables of the equation that would be taken for granted without investigation ( min ghayr baḥth ), the likes of which are found in the imagining of the matter of  Zawraqī's  projection  ( tasṭīḥ )  and  Ibn  al-Zarqāl  al-Maghribī's  plate since they made the orb fixed and the horizon that which moves. They were persuaded by their work that what emerges from using them [the two instruments] corresponds to what is seen by sight. So there might follow from premises, some of which are fallacious, a veracious conclusion - but not the converse - I mean that a fallacious conclusion does not follow from a veracious premise. Contentment with the likes  ofthese  matters  is  not  the  business  ofthe  verifiers  ( al-muḥaqqiqīn ) from among the sincere.$^{5}$^{4} Rather, he who loves truth and prefers its victory and whose eagerness in everything he researches is for a quest for the truth and setting aside that which is other than it, even if it were the doing of the people whom he loved most, as is said: truth is beloved and the teacher is beloved but the truth is more beloved [than the teacher]. This is the eagerness of he who has drunk from the water of life and who has ascended from the stage of imitation ( taqlīd ) to knowledge (or gnosis: ma/uni02BFrifa ) and who has known the truth and has loved it for itself, so passion did not affect him in it [the pursuit of truth]. Rather, he followed truth and resisted ( radda )  any doctrine opposing it, even if it were his own doctrine by which he had become famous. He is undecided about matter of doctrines about which there has been no proof for their incorrectness or correctness so he has not ventured to refute ( ilā  juḥūdihā ) 54 Cf. /uni02BFUrḍī's comments about Ptolemy in Ibid., 228.",
      "bbox": {
        "l": 78.6,
        "b": 513.6,
        "r": 383.5,
        "t": 604.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 352.4,
        "r": 383.5,
        "t": 511.6
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 123.2,
        "r": 382.8,
        "t": 349.7
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 245.6,
        "t": 77.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 39.3
      }
    }
  ],
  "15": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "them or disprove them, especially if they came from one whose erudition is famous.$^{5}$^{5} In this passage, /uni02BFUrḍī described how one can save the phenomenon with false premises, as evidenced by how certain instruments presumed a fixed celestial orb and a moving horizon. Orbs that revolved non-uniformly would be enough to compose tables. For /uni02BFUrḍī, the value of models that reflected cosmological considerations of order and simplicity was qualitative and not quantitative, as there was no way to confirm these models' external reality through observations,  and  the  preferred  models  offered  no  additional  application.  Still,  the verifiers ( al-muḥaqqiqūn ) ought to go beyond saving the phenomena to explorations of the order of the cosmos, and to proposing models that best correspond with that underlying order. Models that agreed with that underlying order would also reflect it. /uni02BFUrḍī's interest was in exploring the underlying order in a way that went beyond imposing order on observations. But not all of the historical actors understood cosmic order in the same way. 3 Quṭb al-Dīn al-Shīrāzī's Different Understanding of Cosmic Order /uni02BFUrḍī's Kitāb al-hayʾa turned out to be a crucial source for Quṭb al-Dīn al-Shīrāzī's (d. 1311) al-Tuḥfa al-shāhiyya (The Royal Gift).$^{5}$^{6} Given that connection, it is significant that Shīrāzī was more confident that his models were the right models than Urḍī had been confident of his. Shīrāzī also made fewer explicit references to cosmic order.$^{5}$^{7} This perhaps reflected how Arabic lexicographic dictionaries  did  not  link  order  to  the  cosmos  and  Shīrāzī's  ideas  about  the relationship between astronomy and other fields.$^{5}$^{8} Near the beginning of the Tuḥfa , in his presentation of what knowledge ought to be affirmed from phys- 55 Ibid., 135-136. 56 See, e.g., George Saliba, 'The original source of Quṭb al-Dīn al-Shīrāzī's planetary model,' Journal for the History of Arabic Science 3 (1979), 3-18. 57 George Saliba, Islamic Science and the Making of the European Renaissance (Cambridge, MA-London, 2007), 160. Here, Saliba discussed Shīrāzī's comment in Fa/uni02BFaltu  fa-lā talum that of the nine Mercury models he proposed in the Nihāyat al-Idrāk , eight were wrong but that the ninth was correct. Still, Shīrāzī was attuned to the epistemological foundations of his models, as shown by his comment ( al-Tuḥfa al-shāhiyya , Paris MS Arabe 2516, 53r) that some things are known through induction ( istiqrāʾ ) and not through deductive proof ( burhān ). 58 For  Shīrāzī's  view  on  the  relationship  between  astronomy  and  other  fields,  see  Ihsan Fazlıoğlu, 'Between Reality and Mentality: Fifteenth Century Mathematics and Natural Philosophy Reconsidered,' Nazariyat 1  (2014),  1-39,  8.  See  also  F.  Jamil  Ragep,  'Freeing",
      "bbox": {
        "l": 77.9,
        "b": 583.5,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 393.0,
        "r": 382.8,
        "t": 565.6
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 352.4,
        "r": 374.8,
        "t": 363.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 231.2,
        "r": 382.8,
        "t": 335.7
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 201.2,
        "r": 124.5,
        "t": 211.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 179.2,
        "r": 383.5,
        "t": 200.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 101.9,
        "r": 383.5,
        "t": 177.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 383.5,
        "t": 101.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 39.3
      }
    }
  ],
  "16": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "ics, Shīrāzī wrote that the corporeal world ( al-/uni02BFālam al-jismānī ) was everything encompassed by the uppermost orb, meaning that when he used the term /uni02BFālam , he did not always mean a necessarily ordered cosmos.$^{5}$^{9} One of the infrequent references to order in the Tuḥfa occurs in the chapter on the lunar model where Shīrāzī wrote about how a line could be the starting point for a motion: 'if the visible end of it [the line] were made the beginning ( mabda⁠ʾ ) of motion, it [the motion] becomes ordered ( intaẓamat ) and not in a state of turmoil ( wa-mā iḍṭarabat ).'$^{6}$^{0} On the next page, he wrote, 'the matter of the moon has become ordered.'$^{6}$^{1} Shīrāzī could have been saying just that his models imposed order on observations, not that the world was fundamentally ordered. In contrast to the Arabic Fī Mabādiʾ al-kull , neither Shīrāzī nor /uni02BFUrḍī made a parallel between cosmic order and political order, or suggested that the ordered cosmos possessed significance for humans' lives.$^{6}$^{2} The earlier work of the Ikhwān al-Ṣafāʾ had made the point, similar to that found in Fī Mabādiʾ al-kull , that the position of the Sun amongst the planets was that of a king: 'The Moon is like a vizier and a successor to the king.'$^{6}$^{3} That epistle went on to make statements that explicitly turned the cosmos into a religious symbol: 'Know that the stars of the celestial sphere are angels of God and kings of His Heavens […] They [the stars] are caliphs of God in His orbs, just as earthly kings are caliphs of God on His Earth.'$^{6}$^{4} But instead of references to cosmic order, an important goal of the Tuḥfa was predictive and retrodictive accuracy.$^{6}$^{5} The distinction Astronomy from Philosophy: An Aspect of Islamic Influence on Science,' Osiris , second series 16 (2001), 49-71. 59 Shīrāzī, Tuḥfa , 4a. See also Shīrāzī, Nihāyat al-idrāk fī dirāyat al-aflāk, British Library, Add MS 7482, 9a for the similar section. Nihāyat al-idrāk is online at: <www.qdl.qa/%D8%A7 %D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9/archive/81055/ vdc_100023627369.0x000003> last accessed 29.05.2019. 60 Shīrāzī, Tuḥfa , 42b. 61 Ibid., 43a: 'Fa-qad intaẓama amr al-qamar.' 62 Genequand, Alexander of Aphrodisias , 113-115. The Arabic On the Cosmos was concerned more with the implications of cosmological order for human society than with accurately mapping the cosmos. De Caelo found  that  stars  that  were  higher  up  did  not  move  as quickly; the absence of activity was a sign of perfection on a human level too. See Brague, Aristote, 512, following De Caelo 292b. 63 Brethren  of  Purity, On  Astronomia ,  eds.  and  trans.  Taro  Mimura  and  F.  Jamil  Ragep (Oxford, 2015), 79. See also ibid., 80: 'A planet in slow motion is like a weak person losing strength.' 64 Ibid., 73. 65 Shīrāzī, Tuḥfa , 34a. Here, Shīrāzī established five orbs and five motions for the Moon so that there would appear from the model everything that was observed. Shīrāzī, in the Nihāya (47a),  did  note  the  importance  ofpredictive  accuracy.  Shīrāzī  wrote  that  he established four orbs and four motions so that 'its matter would be ordered ( li-yantaẓima amruhu ).' Overall, though, there were not many more references to order in the Nihāya .",
      "bbox": {
        "l": 55.3,
        "b": 324.4,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 289.8,
        "r": 382.8,
        "t": 309.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 245.8,
        "r": 383.5,
        "t": 287.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 234.5,
        "r": 143.8,
        "t": 243.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 223.8,
        "r": 227.0,
        "t": 233.1
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 168.5,
        "r": 383.5,
        "t": 221.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 135.9,
        "r": 382.8,
        "t": 167.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 125.2,
        "r": 107.8,
        "t": 133.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 382.8,
        "t": 124.6
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "17": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "among the writers on /uni02BFilm al-hayʾa was whether and how to explain and communicate the underlying order of the cosmos, the external aspects of which they all examined. Hayʾa was always cosmography, along with occasional cosmological excursuses. Shīrāzī, for his part, was confident about the external reality of his models, but did not reflect explicitly on cosmic order as much as /uni02BFUrḍī had. Still,  Shīrāzī  introduced into hayʾa texts  a  new epistemological term, nafs al-amr (the fact of the matter), that arose also in subsequent astronomers' discussions  ofcosmic  order.$^{6}$^{6}  The Tuḥfa 's  chapter  on uṣūl (here:  hypotheses/ building  blocks  ofmodels)  communicated  that  astronomers'  models  were more  than  explanations  ofthe  particular  astronomical  observations  made. The chapter began: On the ascription of apparently irregular motions known through observation to hypotheses that entail [the motions'] uniformity in the fact of the matter ( fī nafs al-amr ), but their variation with respect to us; for irregular motion does not result from the heavenly bodies.$^{6}$^{7} The uṣūl that Shīrāzī listed were true because they explained the anomalous motions observed in terms of motions of orbs that were uniform (i.e., ordered) in the fact of the matter. The phenomenon of retrograde motion, which the hypotheses ordered, was also a locus for another rare reference in the Tuḥfa to order: '[retrogradation] is as in the wandering planets and they are so named because unordered ( ghayr muntaẓama ) motions arise from them, just as walking, stopping, and returning arise from one who is confused.'$^{6}$^{8} The use of the phrase fī nafs al-amr indicates that the way in which Shīrāzī became certain of the hypotheses' existence had changed. Shīrāzī (and others) used the phrase 'in the fact of the matter' to assert that things could exist in the fact of the matter ( fī nafs al-amr ) without necessarily existing externally.$^{6}$^{9} That the term was more than just a turn of phrase is demonstrated by the fact that al-Sayyid al-Sharīf al-Jurjānī (d. 1413) and Ṭūsī, among others, wrote independent treatises defining the term, though the historical 66 Ibn  Kammūna  used nafs  al-amr with  respect  to  astronomy;  see  Langermann,  'Ibn Kammūna,' 292. See also Fazlıoğlu: 'Between Reality and Mentality,' 7-8 for a discussion of nafs al-amr in Shīrāzī's earlier Nihāyat al-idrāk . 67 Robert Morrison, 'Quṭb al-Dīn al-Shīrāzī's Hypotheses for Celestial Motions,' Journal for the History of Arabic Science 13  (2005), 21-140, 39. See Shīrāzī, Nihāya ,  36a for the same point. 68 Morrison, 'Hypotheses,' 48. 69 Fazlıoğlu, 'Between Reality and Mentality,' 21.",
      "bbox": {
        "l": 55.9,
        "b": 529.6,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 449.6,
        "r": 382.8,
        "t": 526.3
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 384.4,
        "r": 384.1,
        "t": 434.3
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 253.1,
        "r": 383.5,
        "t": 368.4
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 187.2,
        "r": 382.8,
        "t": 251.1
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 137.9,
        "r": 382.8,
        "t": 169.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 104.6,
        "r": 383.5,
        "t": 136.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 93.9,
        "r": 173.8,
        "t": 103.3
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 82.6,
        "r": 236.3,
        "t": 92.6
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 38.6
      }
    }
  ],
  "18": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.8,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "actors disagreed about what the term meant, and Shīrāzī did not provide his own definition.$^{7}$^{0} Ṭūsī defined nafs al-amr as the active (or universal) intellect, while Jurjānī understood something to be true in nafs al-amr when it was a true statement whether or not the subject of that statement existed externally.$^{7}$^{1} Nafs al-amr was a mode of existence and/or a way of knowing. Shīrāzī's assertions that the hypotheses ordered the observations, but in the fact of the matter and not necessarily externally, could be interpreted as a   development of /uni02BFUrḍī's relative confidence that models should reflect cosmic order as well as his acknowledgement that the models he proposed might not have an external reality.  While  Shīrāzī's Tuḥfa lacked  the  cosmological  comments  found  in /uni02BFUrḍī's Kitāb al-Hayʾa , Shīrāzī's use of the term nafs al-amr entailed some perception of cosmic order, even if that order did not exist   externally. 4 Ṣadr al-Sharī/uni02BFa al-Bukhārī's Denial of an Order Inherent in the Cosmos Shīrāzī's use of nafs al-amr also makes sense in the context of the work of another astronomer, Ṣadr al-Sharī/uni02BFa  al-Bukhārī  (d.  1347),  and  his  different  perspective on the epistemological status of hayʾa 's  models and on the type of knowledge afforded by hayʾa . In a study of the astronomer, Ahmad Dallal found that Ṣadr al-Sharī/uni02BFa held that astronomy could not attain knowledge (and, thus, understanding) of general principles, but, instead, only knowledge of the particular motions. Ṣadr al-Sharī/uni02BFa's astronomy discussed neither an underlying cosmic order that existed externally, as we saw in /uni02BFUrḍī's work, nor a cosmic order connected to nafs al-amr .  His  work  on  astronomy  was  purely  cosmographic. He wrote that, 'the science of astronomy is the science (dealing with) the upper (celestial) bodies together with the four lower ones with respect to their  configurations,  quantities,  positions,  and  motions  that  are  intrinsic  to them. Its subject is those (bodies) under the constraints of such configurations 70 See  Naṣīr  al-Dīn  al-Ṭūsī,  ' Risālat  Nafs  al-amr ,'  in  Muḥammad  Mudarrisī  Zanjānī, Sarguzasht wa /uni02BFaqā/uni02BFid-i  falsafī-yi  Khwājah  Naṣīr  al-Dīn (Tehrān,  1957),  169-172;  it  is  also edited in Mudarris Raḍawī, Aḥwāl va athār Muḥammad b. Muḥammad b. al-Ḥasan al-Ṭūsī (Tehran, 1955), 464-467. Raḍawī noted (462-463) that the treatise had multiple names. For Jurjānī's epistle on nafs al-amr , see Recep Duran, 'Nefsu'l-emr Risaleleri,' Ankara Üniversitesi Dil ve Tarih-Coğrafya Fakültesi Araştırma Dergisi 14 (1992), 97-108. 71 Hasan, 'Foundations of Science,' 185.",
      "bbox": {
        "l": 55.3,
        "b": 445.6,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 394.4,
        "r": 357.5,
        "t": 416.3
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 203.8,
        "r": 383.5,
        "t": 377.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 83.3,
        "r": 383.5,
        "t": 158.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 83.3,
        "r": 206.4,
        "t": 91.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "19": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "[ hayʾāt ]  or,  more  correctly,  without  these  constraints.'$^{7}$^{2}  The  configurations (i.e., the hypotheses and models) were not a subject of inquiry on their own. Although Ṣadr al-Sharī/uni02BFa drew heavily on Ṭūsī's and Shīrāzī's theories, his understanding of astronomy's goal differed from that of Ṭūsī, who had claimed that /uni02BFilm  al-hayʾa included knowledge of the heavenly bodies' qualities ( kayfiyyāt ). Shīrāzī, in the Tuḥfa , held that through astronomy one knows ( yu/uni02BFrafu bih ) the causes of the motions, which would include the configurations of orbs that caused the variations in the motions.$^{7}$^{3} Ṣadr al-Sharī/uni02BFa's and Shīrāzī's views could be understood as two sides in a debate about whether astronomy had useful information to offer about cosmic order. Drawing on Ṣadr al-Sharī/uni02BFa's own commentary in Ta/uni02BFdīl al-aflāk , Dallal drew a contrast with Ṭūsī's and Shīrāzī's positions by noting that, according to Ṣadr al-Sharī/uni02BFa, /uni02BFilm al-hayʾa did not afford the reader knowledge of the general principles, but, rather, really only particulars, the observed motions of the planets.$^{7}$^{4} Again, Dallal observed that '[t]he subject matter of astronomy is, according to Ṣadr al-Sharī/uni02BFa, defined as those bodies under the constraints of specific configurations, in contrast to defining astronomy as the study of bodies together with their configurations.'$^{7}$^{5} The implicit disagreement with Ṭūsī and Shīrāzī meant that while Ṣadr al-Sharī/uni02BFa was a cosmographer inasmuch as he studied what the cosmos looked like, the heavens' configurations themselves were not part of his picture of what the cosmos looked like. When Ṣadr al-Sharī/uni02BFa described his lunar model, he presented uniform circular motion as part of the problem that practitioners of astronomy were trying to solve.$^{7}$^{6} No inherent order exists in the cosmos or even in nafs al-amr. His rejection of an inherently ordered cosmos makes sense in the context of the lexicographical dictionaries' definition of /uni02BFālam . Ṣadr al-Sharī/uni02BFa had reasons for his definition of /uni02BFilm  al-hayʾa and the rejection of an inherently ordered cosmos. Dallal has observed: 'Now that the configuration of the universe and the causes of the motions of heavenly bodies were no longer intertwined, astronomers were free to search for mathematical representations without having to worry about first causes. Of course, many philosopher-scientists  continued  to  try  to  track  down  first  causes,  but  the 72 Ṣadr al-Sharī/uni02BFa, An Islamic Response to Greek Astronomy: Kitāb Ta/uni02BFdīl  Hayʾat  al-Aflāk of Ṣadr al-Sharī/uni02BFa, ed., trans. and commentary Ahmad Dallal (Leiden-New York, 1995), 21. For Dallal's commentary, see 313-314. 73 Ibid., 314. 74 Ibid., 314. 75 Ibid., 314. 76 Ibid., 87.",
      "bbox": {
        "l": 55.3,
        "b": 474.3,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 259.1,
        "r": 383.5,
        "t": 471.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 177.2,
        "r": 383.5,
        "t": 255.1
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 113.9,
        "r": 384.1,
        "t": 145.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 101.9,
        "r": 111.2,
        "t": 111.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 90.6,
        "r": 110.5,
        "t": 99.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 79.9,
        "r": 111.2,
        "t": 89.3
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 108.5,
        "t": 77.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 39.3
      }
    }
  ],
  "20": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "overall practice of science was no longer bound to their pursuit.'$^{7}$^{7} Not only were these first causes manifestations of cosmic order, but the pursuit of first causes made /uni02BFilm al-hayʾa more complicated. Dallal's commentary on Ṣadr alSharī/uni02BFa's  astronomy  noted  that  Ṭūsī's  and  Shīrāzī's  adoption  ofphysical  and metaphysical principles left important questions unanswered as 'Shīrāzī's assumption of voluntary souls does not explain how the motion is uniformly transmitted from one orb to the other.'$^{7}$^{8} Dallal observed that while the Tuḥfa 's borrowed principles were geometrical and physical, Ṭūsī at one time added metaphysical principles to those which needed to be borrowed from other sciences, and at another time did not.$^{7}$^{9} Ṣadr al-Sharī/uni02BFa's more cosmographic approach, in which he made a stronger effort to explain things just through the motions' external aspects and, equally important, denied that essential knowledge about celestial motions was possible, could be understood as a response to Ṭūsī's lack of clarity and Shīrāzī's lacunae about his reliance on the physics of falsafa .$^{8}$^{0} 5 Nafs al-Amr and Cosmic Order Ṣadr al-Sharī/uni02BFa's  different  perspective  on  the  definition  of /uni02BFilm  al-hayʾa turns out to be part of the context for understanding Shīrāzī's use of nafs al-amr , and the term's relationship to cosmology. Because Shīrāzī did not define nafs alamr , it is hard to know precisely what he thought it meant to know something in that way, but other scholars from the period did comment on the meaning of the term. An early definition, which Shīrāzī did not necessarily share, came in  chapter  five  ofthe  ninth  path  ( nahj )  of  Ibn  Sīnā's Ishārāt  wa-l-tanbīhāt (Pointers and Admonitions) where he wrote: 77 Ahmad Dallal, Islam, Science, and the Challenge of History (New Haven-London, 2010), 100. 78 Ṣadr  al-Sharī/uni02BFa  (ed.,  trans.,  and  commentary  Dallal), An  Islamic  Response ,  318.  Ṣadr suggested  very  slightly  eccentric  parecliptics,  as  eccentric  orbs  were  one  way  for  an enclosing orb to move an enclosed orb. He wrote, too, that 'the evidence for the motion of the orbs as being voluntary is extremely weak, as has already been mentioned in the section on kalām. ' On that, see Ibid., An Islamic Response , 27. 79 Ṭūsī (ed., trans., and commentary Ragep), Tadhkira ,  98-99. Ṭūsī wrote, 'An Account of What Needs to Be Accepted from Natural Philosophy in This Science.' 80 With regard to Ṭūsī's and Shīrāzī's predecessor, Dallal ( Islam, Science , 96-97) noted that the epicycle center, in /uni02BFUrḍī's lunar model, revolved in the opposite direction to its motion in the Ptolemaic model and at three times the speed. This, for Dallal, was evidence that /uni02BFUrḍī  was  far  more  concerned  with  predictive  accuracy  than  the  physics  ofthe philosophers.",
      "bbox": {
        "l": 55.3,
        "b": 405.7,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 365.7,
        "r": 223.0,
        "t": 376.4
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 244.5,
        "r": 382.8,
        "t": 349.7
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 146.6,
        "r": 382.8,
        "t": 211.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 124.6,
        "r": 383.5,
        "t": 145.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 68.6,
        "r": 382.8,
        "t": 123.2
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 39.3
      }
    }
  ],
  "21": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 71.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "The middle term, if it is the reason - and in one copy the relationship ( alnasab )$^{8}$^{1} - in the fact of the matter ( nafs al-amr ) for the existence of the judgment ( ḥukm ), it being the relationship of some parts of the conclusion to others, then the demonstration is a propter quid ( limma ) demonstration because it gives the reason for the assent to the judgment and gives the reason for the existence of the judgement - and in a [different manuscript] copy - gives the 'why' for the assent and the existence of the judgment - so it absolutely gives the reason - and in a [different manuscript] copy 'gives the reason'. And if it were not like that, rather it was a reason - and in a [different manuscript] copy 'a thing' - only for assent, then it brought the 'why' into existence- and in a copy 'so it brought the why for confirmation and did not bring the why of existence - then it is called  a  quia  ( inna )  demonstration,  because  it  gives  evidence  for  the 'that' of the judgment in itself, but not its 'why' in itself.$^{8}$^{2} Here Ibn Sīnā used the phrase fī nafs al-amr to mean that something existed essentially and not just in a particular case or instant. Ibn Sīnā's use of the term al-taṣdīq (assent) reflects his widely-known position that knowledge involved assent based on external reality. This use of nafs al-amr in the Pointers should not be interpreted as a way of knowing or as an epistemological mode. Naṣīr al-Dīn al-Ṭūsī (d. 1274) was the first to write a dedicated treatise on nafs al-amr ( Risāla fī nafs al-amr ) and that treatise's definition of nafs al-amr came a little closer to the way Shīrāzī seemed to use it. Ṭūsī wrote: Know that  we  do  not  doubt  that  the  certain  judgments  made  by  our minds, e.g., the judgment that one is half of two or that the diagonal of the square is not equal to its side, or that which is judged for it from that which no mind had anticipated, after it was certain and corresponding to what was in the fact of the matter, but not in the judgments that the ignorant firmly believe, contrary to this, such as were one to believe that the diagonal equals the side, etc., not corresponding to what is in the fact of the  matter. We know for certain that the correspondence can be conceived only through two things that are distinct as individuals and united in that with respect to which the comparison occurs. There is no doubt that  the  two  above-mentioned  classes  ( al-ṣinfayn  al-madh  kūrayn )  of 81 The consonantal outlines of sabab and nasab are similar. 82 Ibn Sīnā, al-Ishārāt wa-l-tanbīhāt ma/uni02BFa sharḥ Naṣīr al-Dīn al-Ṭūsī , ed. Sulaymān Dunyā, 3 vols.  (Cairo,  n.d.),  vol.  1,  485-486.  Ragep  ( Tadhkira ,  38-41)  discussed  the  distinction between and role of innī and limmī proofs, though not this passage from the Ishārāt .",
      "bbox": {
        "l": 77.9,
        "b": 419.0,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 338.4,
        "r": 382.8,
        "t": 403.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 298.4,
        "r": 382.8,
        "t": 335.7
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 78.6,
        "b": 136.6,
        "r": 383.5,
        "t": 282.4
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 102.6,
        "r": 274.3,
        "t": 111.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 68.6,
        "r": 382.8,
        "t": 100.6
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 39.3
      }
    }
  ],
  "22": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 369.5,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "judgments share mental existence, therefore it is necessary that the first class, apart from the second, have an existence outside of our minds so that the correspondence between what is in our minds and what is in it [extra-mental existence] be observed, and that is what is expressed by that which is in the fact of the matter ( bi-mā fī nafs al-amr ).$^{8}$^{3} […] Thus there is established the existence of an existent that exists through itself externally without having a place, comprising in actuality ( bi-l-fi'l ) all of the intelligibilia that can emerge into actuality inasmuch as change, transformation, renewal, and disappearance are impossible for it, and it can exist through these attributes forever and ever. If this has been established, then we say that it is not conceivable that that existent is the first of all first things ( awwal al-awwāʾil ), I mean the necessary of existence through His essence, may His names be powerful. That is due to the necessity of that existent [i.e. nafs al-amr ]  comprising multiplicity infinitely in actuality, and it is forbidden that the first of all first things has in it multiplicity and that He is the first principle of multiplicity and that He is a locus that receives the multiplicity represented in Him. Thus, there is established the existence of an existent other than the first necessary [existent], may He be exalted and sanctified through that attribute. Let us name it the universal intellect ( /uni02BFaql al-kull ), and it is what the glorious Qurʾān expressed sometimes as the preserved tablet ( al-lawḥ al-maḥfūẓ ),  and  sometimes  as  the  clear  book  ( al-kitāb  al-mubīn ),  that contains all that is wet and dry.$^{8}$^{4} And that is what we wanted. God grants success and assists.$^{8}$^{5} To show that there is a mode of existence other than external existence and other than mental existence, Ṭūsī explained that one being half of two and the incommensurability of the side of a square and its diagonal are both true in the fact of the matter ( fī nafs al-amr ), even if this truth cannot be established by assent to something that exists externally. Such things that are true but may not exist externally must share something with things that do exist externally; existence in the fact of the matter ( fī nafs al-amr ) is that which is shared. By contrast, the statement that the diagonal of a square was equal to its side could have mental existence ( al-wujūd al-dhihnī )  but not existence in nafs al-amr . The end of the treatise, of which Risāla fī ithbāt jawhar mufāraq was one title, defined nafs  al-amr as  a  separate,  self-subsisting  substance. That  substance 83 Ṭūsī, 'Risāla,' 464-465. 84 Cf. Q6:59. '[…] naught of wet or dry but (it is noted) in a clear record (Ar. kitāb mubīn ).' 85 Ṭūsī, 'Risāla,' 466-467.",
      "bbox": {
        "l": 77.9,
        "b": 540.9,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 78.6,
        "b": 379.0,
        "r": 383.5,
        "t": 538.2
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 287.1,
        "r": 382.8,
        "t": 377.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 123.2,
        "r": 383.5,
        "t": 269.1
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 91.3,
        "r": 155.8,
        "t": 99.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 80.6,
        "r": 376.8,
        "t": 89.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 69.3,
        "r": 156.4,
        "t": 77.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "23": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 623.5,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 628.8
      }
    },
    {
      "label": "text",
      "text": "was not God, but the universal intellect (or the active intellect), an intellect that enabled all human knowledge.$^{8}$^{6} Since nafs al-amr was a separate substance, then one could say that nafs al-amr has become part of the cosmos ( al-/uni02BFālam )  in  that  the  universal  intellect  must  have  been  created.$^{8}$^{7}  Shīrāzī would have agreed that nafs al-amr was a mode in which things could be true without existing externally, but would probably not have equated nafs al-amr with the universal intellect. Nafs al-amr became a significant mode of existence for knowledge of /uni02BFilm al-hayʾa 's theories. Ṭūsī never used the term nafs al-amr in his famous astronomy  text, al-Tadhkira  fī  /uni02BFilm  al-hayʾa ,  but  Shīrāzī's  student,  Niẓām  al-Dīn  alNīsābūrī (d. ca. 1330), in his own commentary on the Tadhkira , wrote that when something was known in the fact of the matter, one could be as sure of those things as of things known via their causes (i.e., through limmī , propter quid proofs).$^{8}$^{8}  Nīsābūrī  distinguished  between  things  known  syllogistically  and things known through the fact of the matter. Presuming that Shīrāzī was using fī  nafs  al-amr in  a  way  roughly similar to how Nīsābūrī used the term, then Shīrāzī was confident that the truth of the uṣūl and his models did not have to come from a comparison with external reality. Ihsan Fazlıoǧlu has argued that the  opening  of  Shīrāzī's Nihāya launched  a  new  approach  to  astronomy  in which mathematical and geometrical proofs are privileged over those from physics and metaphysics, as Shīrāzī observed that scholarly agreement about the latter two sciences was not likely.$^{8}$^{9} We should consider Fazlıoǧlu's viewpoint seriously because Shīrāzī's arguments for the correctness of his theories did not depend on physics and metaphysics, but rather on the theories' existence in nafs al-amr. The theme of an objective but not necesssary external existence was developed in a treatise by al-Sayyid al-Sharīf al-Jurjānī (d. 1413) on nafs al-amr .$^{9}$^{0}  The very existence of this treatise is more evidence that nafs al-amr was a technical 86 For Ṭūsī's use of the term 'active intellect' to describe nafs al-amr , see Fazlıoǧlu, 'Between Reality and Mentality,' 25. 87 As Remi Brague ( Aristote , 30) noted in the very different context of Aristotle's cosmology, for the world to become a cosmos, a point of view, ostensibly a human point of view, was necessary. 88 Nīsābūrī, Tawḍīḥ , Fatih MS 3397, 37v. Nīsābūrī did not comment on whether barāhīn were the only way to know something in the nafs al-amr .  Al-/uni02BF Allāma  al-Ḥillī  (d.  1325),  in  his Jawhar al-naḍīd fī sharḥ Manṭiq al-tajrīd [(Iran, 1970), 172] explained that a limmī proof was a proof that yielded the cause according to nafs al-amr , whereas an innī proof did not. 89 Fazlıoǧlu, 'Between Reality and Mentality,' 8. 90 For  more  on  Jurjānī's  understanding  of nafs  al-amr ,  see  Moiz  Hasan,  'Foundations  of Science in the Post-Classical Islamic Era: The Philosophical, Historical, and Historio  graphical Significance of Sayyid al-Sharīf al-Jurjānī's (d. 1413) Project,' (PhD diss., University",
      "bbox": {
        "l": 55.9,
        "b": 514.3,
        "r": 382.8,
        "t": 604.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 271.1,
        "r": 382.8,
        "t": 510.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 231.2,
        "r": 382.8,
        "t": 268.5
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 190.5,
        "r": 382.8,
        "t": 211.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 157.9,
        "r": 382.8,
        "t": 189.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 107.2,
        "r": 383.5,
        "t": 155.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 102.6,
        "r": 234.3,
        "t": 111.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 68.6,
        "r": 383.5,
        "t": 101.3
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 38.6
      }
    }
  ],
  "24": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.8,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "term and not just a turn of phrase, another way of saying 'the fact of the matter'.  Jurjānī's  treatise  clarified  how nafs  al-amr was  a  mode  ofexistence  for things that did not necessarily exist externally. Jurjānī explained that nafs alamr was more general than externality ( a/uni02BF amm min al-khārij ). That is, a compound body might be compound in nafs al-amr ,  but not externally if such a body does not exist externally.$^{9}$^{1} An example Jurjānī gave was of a blackness ( sawād ) that did not exist externally but did in itself ( fī nafsih ). Such a blackness might plausibly exist, unlike, say, a three-headed monster or the abstractions  ofnumbers.  That  blackness  was  a  color  just  like  colors  the  external existence of which has been assented to. Because the scope of that which exists  in nafs  al-amr subsumes that which exists externally,  Jurjānī  cautioned that most errors resulted from confusion of the judgment ( ḥukm ) of the mind ( dhihn ), external reality, and nafs al-amr .$^{9}$^{2} As Kashf al-Ẓunūn put it, the existence of something in nafs al-amr did not depend directly on either the mind ( dhihn ) or external reality.$^{9}$^{3} Treatises on nafs al-amr such as Ṭūsī's and Jurjānī's argued that certain constructs - e.g., the great circles astronomers discussed on the celestial sphere or the boundaries between the climes - were more than the conjectures that Ibn Sīnā had made them out to be.$^{9}$^{4} Ṣadr al-Sharī/uni02BFa had said that one can certainly know the particulars of the motions of celestial phenomena, but one could not know the essence of these phenomena. In contrast, Shīrāzī and those who used nafs al-amr said that one could know certain things in the fact of the matter even if one could not be certain of whether a given theoretical model had any external reality. Cosmic order turned out to be part of some astronomers' determination about whether something was known in the fact of the matter or whether the judgment of the mind was confused. While discussing Ptolemy's model for Mercury, Shīrāzī used nafs al-amr to explain how Ptolemy's model functioned: Then  this  speaker  conceded  that  the  uniformity  and  the  alignment ( al-muḥādhāh ), if it was presumed with the center of the deferent, then the calculated would not agree with the observed. If it were like that, then it is impossible that the uniformity and the alignment in the fact of the matter ( nafs al-amr )  be  about  the  center  ofthe  deferent  and  that  the of Notre Dame, 2017), 121-287. On 416-427, Hasan translated four texts by Jurjānī on nafs al-amr and related concepts. 91 Duran, 'Nefsuʾl-emr,' 103. 92 Ibid., 104. 93 Ibid., 105. 94 Fazlıoǧlu, 'Between Reality and Mentality,' 11. For Fazlıoǧlu, these treatises argued that certain mathematical entities had an independent existence.",
      "bbox": {
        "l": 55.3,
        "b": 298.4,
        "r": 383.5,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 54.6,
        "b": 243.8,
        "r": 383.5,
        "t": 295.8
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 163.9,
        "r": 382.8,
        "t": 229.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 124.6,
        "r": 382.8,
        "t": 144.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 113.9,
        "r": 165.8,
        "t": 122.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 102.6,
        "r": 111.2,
        "t": 111.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 91.3,
        "r": 111.2,
        "t": 99.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 69.3,
        "r": 382.8,
        "t": 89.3
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "25": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "calculated agree with the observed. If not [about the center of the deferent], then the uniformity and the alignment will be, in the fact of the matter, with the equant, and the calculated will agree with the observed.$^{9}$^{5} In the Ptolemaic system, the criterion of predictive accuracy necessitated the uniformity  and  alignment  ofmotions,  the  point  according  to  which  mean motion was measured, being about the equant and not the deferent center. Shīrāzī's use of nafs al-amr to describe the equant point from the Ptolemaic perspective leads us to grasp an important way in which these discussions of nafs al-amr turn out to be relevant to cosmology. Conceptions of cosmic order are related to arguments about what is known in the fact of the matter. A different conception of cosmic order, e.g., Ptolemy's, led to a different sense of what was known through nafs al-amr . Knowledge gained through nafs al-amr , in the context of astronomy, often imposed order on the disordered. Fazlıoǧlu cited an increasingly well-known passage from the commentary by Jurjānī (d. 1413) on Ījī's Mawāqif in which Jurjānī held that mental concepts 'could tell us something valuable about the real world.'$^{9}$^{6} The passage reads as follows: These [astronomy's mathematical constructs] and their like, even if they do not exist externally, are correctly imagined concepts, corresponding to what is in the fact of the matter as attested by sound instinct; they are not false imaginings such as ghouls' fangs, ruby mountains and two-headed men.  By means of these notions, the states of celestial motions are regularized ( yanḍabiṭ ).$^{9}$^{7} Fazlıoǧlu,  given  his  purposes,  focused  on  the  first  sentence,  but  the  second quoted sentence is important too because it identifies how things known via nafs al-amr order the cosmos. Conversely, if an astronomical theory did not order the cosmos, it would not exist in the fact of the matter for most astronomers. In a sense, that was true even for Ptolemy, though Shīrāzī and other astronomers in the Islamic tradition would have disagreed about the definition 95 Shīrāzī, Tuḥfa ,  52b. It is possible, though, that Shīrāzī was not talking about a different mode of existence since he pointed out that the calculations did not agree with the observations. 96 Hasan, 'Foundations of Science,' 133. See also 260 for Jurjānī's position that mathematical entities - e.g., the great circles imagined on the celestial orb -, while lacking external existence, can nevertheless tell us something true about created objects. 97 Fazlıoǧlu, 'Between Reality and Mentality,' 21. This passage from Jurjānī's commentary was  also  cited  and  translated  in  Abdelhamid  I.  Sabra's  foundational  'Science  and Philosophy  in  Medieval  Islamic  Theology:  The  Evidence  ofthe  Fourteenth  Century,' Zeitschrift für Geschichte der arabisch-islamischen Wissenschaften 9 (1994), 1-42, 39.",
      "bbox": {
        "l": 77.9,
        "b": 567.6,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 379.0,
        "r": 383.5,
        "t": 551.6
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 285.1,
        "r": 382.8,
        "t": 363.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 191.2,
        "r": 382.8,
        "t": 269.1
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 147.2,
        "r": 382.8,
        "t": 177.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 113.9,
        "r": 382.8,
        "t": 145.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 69.3,
        "r": 383.5,
        "t": 111.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.8,
        "t": 39.3
      }
    }
  ],
  "26": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 294.2,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 368.8,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "of cosmic order. Cosmic order was a way to determine whether something was known in the fact of the matter. Shīrāzī's statement, in the Tuḥfa , that his hypotheses were known in the fact of the matter and that his hypotheses ordered the apparent disorder of retrograde motion, agreed with what Jurjānī stated more explicitly a century later. Nīsābūrī's comments on retrograde motion, expressing wonderment at how the  epicycle  and  eccentric  work  so  well,  showed  that  he  related  the  understanding of the hypotheses that ordered retrograde motion to understanding God's role in the cosmos.$^{9}$^{8} In his commentary on Ṭūsī's recension of the Almagest , Nīsābūrī (d. ca. 1330) had written that hayʾa 's lunar models, which correctly forecast when lunar eclipses would and would not occur, gave humans insight into God's wisdom in designing a cosmos in which there should not be lunar eclipses every month.$^{9}$^{9} In a similar vein, Shīrāzī wrote: They reflect ( yatafakkurūn ) on the creation of the heavens and the earth. Our Lord did not create them futilely. When they reflect ( ta'ammalū ) on the states of the moon and they see what they see, they will know from the motion of the moon being about a path that is not the path of the sun due to its latitude with the ringed instrument ( dhāt al-ḥalaq ).$^{1}$^{0}$^{0} During the description of the models for Mercury and Venus, Shīrāzī explained that whether the motion of a planet's epicycle was faster, slower, or equal to the motion of a planet's deferent is a reflection of divine providence.$^{1}$^{0}$^{1} Shīrāzī and Nīsābūrī pointed to the role reflection on God's influence in the cosmos played in one's grasp of cosmic order.$^{1}$^{0}$^{2}  Even  though  Shīrāzī  re-considered /uni02BFilm  al-hayʾa 's  relationship  to  philosophy,  he  retained  a  conviction,  which 98 In Tawḍīḥ al-Tadhkira ,  Nīsābūrī (Fatih MS 3397, 37b) wrote: 'And by my life, achieving truth in eliciting the reasons that necessitate the observed variations of the planets, with their  motions  being  themselves  uniform,  is  something  ofmajestic  import  and  a  true complement for the mathematical perspective of philosophy. As for its great import, it is because what it rests on regarding that are things found in the observable divine bodies which are among the observed bodies, whose affairs proceed directly and orderly.' 99 Occasionally,  in hayʾa texts,  the  author  did  remark  on  how hayʾa was  a  means  for understanding the reason embedded in the cosmos. See Niẓām al-Dīn al-Nīsābūrī, Sharḥ Taḥrīr al-Majisṭī (Tunis MS 3663, 92b). On that passage, see Robert Morrison, Islam and Science: The Intellectual Career of Niẓām al-Dīn al-Nīsābūrī (Abingdon, 2007), 30. 100 Shīrāzī, Tuḥfa , 33a. 101 Ibid. , 52a. 102 Shīrāzī noted how things emerged through contemplation to the clever and insightful person ( yalūḥ bi-l-ta'ammul li-l-fāṭin ). See ibid. , 56b-57a.",
      "bbox": {
        "l": 55.3,
        "b": 582.9,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 433.0,
        "r": 382.8,
        "t": 578.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 77.9,
        "b": 352.4,
        "r": 382.8,
        "t": 417.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 257.8,
        "r": 382.8,
        "t": 335.7
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 157.9,
        "r": 383.5,
        "t": 221.8
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.3,
        "b": 113.2,
        "r": 383.5,
        "t": 155.9
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 101.9,
        "r": 143.1,
        "t": 111.2
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 92.6,
        "r": 111.8,
        "t": 100.6
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 68.6,
        "r": 382.8,
        "t": 89.9
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 30.0,
        "r": 237.7,
        "t": 38.6
      }
    }
  ],
  "27": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 622.8,
        "r": 70.6,
        "t": 629.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.2,
        "b": 622.8,
        "r": 382.1,
        "t": 629.5
      }
    },
    {
      "label": "text",
      "text": "resembled those of Aristotle and Plato, that the cosmos was fundamentally ordered. This fundamental order was due to God's role as creator. 6 Conclusion While earlier research on Islamic cosmology recognized and studied scientific cosmologies, this article has shown that even a single discipline ( /uni02BFilm al-hayʾa ) over a couple of centuries contained cosmology, in the form of cosmography and in the form of discussions of cosmic order. In the fifth section of this paper, I have shown that the emergence of the term nafs al-amr meant that cosmic order  remained  relevant  even  if /uni02BFilm  al-hayʾa texts,  beginning  with  Shīrāzī's Nihāya , started to reconsider that discipline's relationship to the philosophy of Plato and Aristotle as well as whether something could be real without existing externally. While academic studies of cosmology are framed by the semantic range of the Greek kósmos ,  the historical actors' own views were affected by the ways in which the relevant Greek terms were translated and appropriated. In  particular,  the  Arabic /uni02BFālam translated  more  than  just  the  Greek kósmos , and,  over  the  centuries,  a  distinction  emerged  between  the  cosmos,  which came to be thought of more as creation, and cosmic order. I hope to explore discussions of an ordered universe in /uni02BFilm al-hayʾa texts from the fifteenth and early sixteenth centuries in a subsequent publication. 7 Acknowledgments I presented a very early version of this essay at a workshop at Stanford University  entitled  '/uni02BFIlm  wa-/uni02BF Amal:  Nature,  Body,  and  Space  in  Medieval  and  Early Modern Islamicate Societies' and would like to thank the organizers, Paula Findlen and Ali Yaycioglu for inviting me to the workshop. Y. Tzvi Langermann (Bar Ilan University) gave very helpful comments on an earlier version of this article. More recently, in April 2018, I presented this research at a conference in honor of George Saliba at Bowdoin College, and I would like to thank my colleague Glen Cooper, an attendee, for his advice and assistance with Greek. Any errors are my responsibility alone.",
      "bbox": {
        "l": 55.9,
        "b": 581.5,
        "r": 382.8,
        "t": 605.5
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 542.2,
        "r": 140.5,
        "t": 550.9
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 311.8,
        "r": 383.5,
        "t": 524.9
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 271.1,
        "r": 171.8,
        "t": 281.8
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 55.9,
        "b": 136.6,
        "r": 382.8,
        "t": 255.1
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 201.0,
        "b": 30.0,
        "r": 382.1,
        "t": 39.3
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 439.37,
      "h": 666.14
    },
    "2": {
      "w": 439.37,
      "h": 666.14
    },
    "3": {
      "w": 439.37,
      "h": 666.14
    },
    "4": {
      "w": 439.37,
      "h": 666.14
    },
    "5": {
      "w": 439.37,
      "h": 666.14
    },
    "6": {
      "w": 439.37,
      "h": 666.14
    },
    "7": {
      "w": 439.37,
      "h": 666.14
    },
    "8": {
      "w": 439.37,
      "h": 666.14
    },
    "9": {
      "w": 439.37,
      "h": 666.14
    },
    "10": {
      "w": 439.37,
      "h": 666.14
    },
    "11": {
      "w": 439.37,
      "h": 666.14
    },
    "12": {
      "w": 439.37,
      "h": 666.14
    },
    "13": {
      "w": 439.37,
      "h": 666.14
    },
    "14": {
      "w": 439.37,
      "h": 666.14
    },
    "15": {
      "w": 439.37,
      "h": 666.14
    },
    "16": {
      "w": 439.37,
      "h": 666.14
    },
    "17": {
      "w": 439.37,
      "h": 666.14
    },
    "18": {
      "w": 439.37,
      "h": 666.14
    },
    "19": {
      "w": 439.37,
      "h": 666.14
    },
    "20": {
      "w": 439.37,
      "h": 666.14
    },
    "21": {
      "w": 439.37,
      "h": 666.14
    },
    "22": {
      "w": 439.37,
      "h": 666.14
    },
    "23": {
      "w": 439.37,
      "h": 666.14
    },
    "24": {
      "w": 439.37,
      "h": 666.14
    },
    "25": {
      "w": 439.37,
      "h": 666.14
    },
    "26": {
      "w": 439.37,
      "h": 666.14
    },
    "27": {
      "w": 439.37,
      "h": 666.14
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}