{
  "1": [
    {
      "label": "section_header",
      "text": "Armenia, Caucaso e Asia Centrale",
      "bbox": {
        "l": 74.0,
        "b": 884.0,
        "r": 313.0,
        "t": 900.0
      }
    },
    {
      "label": "text",
      "text": "Ricerche 2018",
      "bbox": {
        "l": 75.0,
        "b": 868.0,
        "r": 172.0,
        "t": 881.0
      }
    },
    {
      "label": "text",
      "text": "acura di Carlo Frappi e Aldo Ferrari",
      "bbox": {
        "l": 75.0,
        "b": 841.0,
        "r": 318.0,
        "t": 858.0
      }
    },
    {
      "label": "section_header",
      "text": "Tradition and Innovation in the Cosmology of Anania Sirakac‘i",
      "bbox": {
        "l": 75.0,
        "b": 761.0,
        "r": 522.0,
        "t": 803.0
      }
    },
    {
      "label": "text",
      "text": "Stephanie Pambakian (University of St Andrews, Scotland)",
      "bbox": {
        "l": 75.0,
        "b": 704.0,
        "r": 329.0,
        "t": 737.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 76.0,
        "b": 704.0,
        "r": 329.0,
        "t": 720.0
      }
    },
    {
      "label": "text",
      "text": "Abstract _Anania Sirakac‘iwas a 7th century AD Armenian mathematician trained in the Byzantine Empire whose works embrace treatises in various fields of science. Of the almost 30 texts attrib- Lted to him, most await investigation. His Cosmology is the focus of our research, and we highlight its elements of similarity with Greek tradition, in particular with St Basil's Hexameron, and in the ‘Armenian tradition, to which Anania brings novelty especially in his deeper understanding of astro- nomical phenomena. We suggest that this work, lke Isidore's De Natura Rerum, represents a new genre of Christian literature, and attempts to understand it through the meaning of Cosmos found in Aristotle's De Mundo.",
      "bbox": {
        "l": 74.0,
        "b": 550.0,
        "r": 605.0,
        "t": 667.0
      }
    },
    {
      "label": "text",
      "text": "‘Summary Introduction. -2The Autobiography nd Anania's Alexandrian Formation. - 3 The Corpus ‘of Anania’s Works. - 4 The Cosmology. - 4.1 The Text. - 4.2A Possible Dedicatee-4.3 Sources. - 4.4 From the Land ofthe Greeks...to Armenian Literature. 4.5 A New Genre. - 4.6 Methodology. 5 Conclusion",
      "bbox": {
        "l": 75.0,
        "b": 485.0,
        "r": 605.0,
        "t": 529.0
      }
    },
    {
      "label": "text",
      "text": "Keywords Anania Sirakac'i. Armenia. Cosmology. Tradition and innovation. 7th century AD.",
      "bbox": {
        "l": 75.0,
        "b": 452.0,
        "r": 579.0,
        "t": 466.0
      }
    },
    {
      "label": "section_header",
      "text": "1 Introduction",
      "bbox": {
        "l": 76.0,
        "b": 400.0,
        "r": 212.0,
        "t": 415.0
      }
    },
    {
      "label": "text",
      "text": "Anania Sirakac‘i, also known as Anania of Sirak or Anania Sirakuni, is regarded within the Armenian tradition as the father of mathematical sciences. Active in the 7th century AD, he is considered the first Armenian scholar to have imported a set of scientific notions, and examples of their applications, from the Greek-speaking schools into ‘early Medieval’ Armenia. Writings attributed to him cover a vast array of subjects, including amongst others, arithmetic, computation, astronomy, astrology and natural philosophy. According to tradition, his writings and teachings are the heart of the autonomous development of these fields in the Armenian language, and, significantly, statues of him have been erected in prominent public spaces in the Armenian capital, Yerevan. Nevertheless, studies on this scholar are still at a relatively early stage: the exact form and breadth of his works is not yet established with certainty despite the survival of a large number of manuscripts carrying texts attributed to him. As it",
      "bbox": {
        "l": 74.0,
        "b": 117.0,
        "r": 606.0,
        "t": 365.0
      }
    },
    {
      "label": "page_footer",
      "text": "Eurasiatica 14 1SSN [online] 2510-9435 ISSN [print] 2610-8879",
      "bbox": {
        "l": 76.0,
        "b": 94.0,
        "r": 424.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "2018-06-03",
      "bbox": {
        "l": 467.0,
        "b": 83.0,
        "r": 527.0,
        "t": 94.0
      }
    },
    {
      "label": "page_footer",
      "text": "© 2018 | ©O Creative Commons Attribution 4.0 International Public License",
      "bbox": {
        "l": 75.0,
        "b": 55.0,
        "r": 488.0,
        "t": 69.0
      }
    },
    {
      "label": "page_footer",
      "text": "9",
      "bbox": {
        "l": 597.0,
        "b": 57.0,
        "r": 604.0,
        "t": 68.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 75.0,
        "b": 913.0,
        "r": 296.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "is often the case with Armenian codices, surviving copies are late and miscellaneous, adding difficulty to the already arduous identification of a homogeneous body of works.",
      "bbox": {
        "l": 75.0,
        "b": 847.0,
        "r": 606.0,
        "t": 901.0
      }
    },
    {
      "label": "text",
      "text": "After a small introduction of what is known about Anania Sirakac’i’s education and scholarly formation, we shall give a brief account of the information we have been able to gather on his known attributed works, warning the reader that we have relied on secondary literature and do not wish to make claims over the texts’ authorship, but rather to report data as. it stands at the moment. Once this background is set, we shall move on to the main focus of this paper, the Tiezeragitut‘iwn (Shuqupwghmnyphut) or Cosmology attributed to Anania Sirakac‘i, with a special emphasis on the aspects of this work which belong to a traceable tradition and those that might represent an innovation, especially in regard to Armenian science. We shall also point to some elements of this work that deserve deeper examination.",
      "bbox": {
        "l": 75.0,
        "b": 633.0,
        "r": 606.0,
        "t": 847.0
      }
    },
    {
      "label": "section_header",
      "text": "2 The Autobiography and Anania’s Alexandrian formation",
      "bbox": {
        "l": 75.0,
        "b": 579.0,
        "r": 554.0,
        "t": 602.0
      }
    },
    {
      "label": "text",
      "text": "Anania’s Autobiography (bipiu\\bhuugpmppih) Ink‘nakensagrut‘iwn offers information - about his development as a scholar and about his career - which helps to date his active period. It is a first-hand account of a mathematician’s education in the seventh century, and his formation in the Byzantine Empire, where this Armenian scholar sought a suitable teacher. Anania himself tells us:",
      "bbox": {
        "l": 75.0,
        "b": 454.0,
        "r": 606.0,
        "t": 563.0
      }
    },
    {
      "label": "text",
      "text": "I desired to pursue philosophy. I was particularly lacking in the science of mathematics, since I reckoned that nothing could be worked out without numbers, esteeming [this science] the mother of all knowledge. (Transl. Greenwood 2011, 138)",
      "bbox": {
        "l": 92.0,
        "b": 365.0,
        "r": 606.0,
        "t": 439.0
      }
    },
    {
      "label": "text",
      "text": "What features most prominently is information relevant to his studies and education, so that we are told of his first instruction on Armenian literature and the Scriptures.",
      "bbox": {
        "l": 75.0,
        "b": 294.0,
        "r": 606.0,
        "t": 349.0
      }
    },
    {
      "label": "text",
      "text": "Since no-one could be found in this country of Armenia who knew philoso- phy, and not even books of the sciences could be found anywhere, [...] I made my way to the country of the Greeks. (Transl. Greenwood 2011, 138)",
      "bbox": {
        "l": 93.0,
        "b": 224.0,
        "r": 605.0,
        "t": 277.0
      }
    },
    {
      "label": "text",
      "text": "In Theodosiopolis, Anania was advised to find a mathematician named Kristosatur, but only six months later he decided to look for a more sat-",
      "bbox": {
        "l": 75.0,
        "b": 170.0,
        "r": 605.0,
        "t": 207.0
      }
    },
    {
      "label": "page_footer",
      "text": "10",
      "bbox": {
        "l": 75.0,
        "b": 93.0,
        "r": 90.0,
        "t": 106.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac'i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 606.0,
        "t": 106.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 384.0,
        "b": 912.0,
        "r": 605.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "isfactory teacher, and headed to Constantinople. On his way, he crossed paths with some friends of his who recommended that he go to Trebizond, where a master could accept him as a student.",
      "bbox": {
        "l": 75.0,
        "b": 846.0,
        "r": 605.0,
        "t": 902.0
      }
    },
    {
      "label": "text",
      "text": "Here this Autobiography includes another story, that of the life and curriculum of Tychicos, Anania’s instructor for eight years. We are in- formed that he could speak and write in Armenian, a skill he acquired while campaigning in Armenia under a Byzantine general. He then trav- elled to Jerusalem in search of science and learning, spent three years in Alexandria, some time in Rome, and finally lived and studied many years in Constantinople. Says Anania of Tychicos:",
      "bbox": {
        "l": 75.0,
        "b": 721.0,
        "r": 605.0,
        "t": 847.0
      }
    },
    {
      "label": "text",
      "text": "[In Constantinople] he encountered a celebrated figure, a master from Athens, city of philosophers. [...] a few years later the master died and none of his pupils were found to be of the same level in order to succeed to his position. They begged the much-missed Tychikos to come and take his place. (transl. Greenwood 2011, 141)",
      "bbox": {
        "l": 93.0,
        "b": 615.0,
        "r": 606.0,
        "t": 707.0
      }
    },
    {
      "label": "text",
      "text": "The identity of this most revered master is uncertain. Greenwood discusses the possibility that this scholar may be Stephanos of Alexandria, based on the hypothesis argued by Wolska-Conus that a certain Stephanos of Athens should be identified with the same Stephanos of Alexandria, in- vited to Constantinople by the emperor Heraclius to revive the teaching of mathematical sciences (Greenwood 2011, 149; Wolska-Conus 1989).",
      "bbox": {
        "l": 75.0,
        "b": 490.0,
        "r": 606.0,
        "t": 599.0
      }
    },
    {
      "label": "text",
      "text": "The importance of this possible connection with Alexandria should not be underestimated, for it might help position this scholar within the broad- er context of scientific teaching in Western Europe, where the Alexandrian techniques for calendrical computations were being adopted or rejected to different degrees (see Warntjes 2010, xcxcsoaxiii). We thus expect Ana- nia’s writings on astronomical tables and computations of religious feasts to be especially significant to our understanding of these mathematical sciences and their application in this period. We are equally hopeful that comparisons of works on natural philosophy shall bear interesting fruit and enhance our understanding of the transmission of ideas in this cen- tury. However, a careful re-assessment and analysis of Anania’s attributed corpus has to be addressed one item at a time.",
      "bbox": {
        "l": 75.0,
        "b": 276.0,
        "r": 606.0,
        "t": 491.0
      }
    },
    {
      "label": "section_header",
      "text": "3 The Corpus of Anania’s works",
      "bbox": {
        "l": 75.0,
        "b": 222.0,
        "r": 345.0,
        "t": 245.0
      }
    },
    {
      "label": "text",
      "text": "A formidable reputation as a polymath is unsurprisingly bestowed on Ana- nia Sirakac’i, due to the array of topics covered by the surviving works attributed to him. Although our present paper is only going to focus on the Cosmology, we shall very briefly to assess the state of philological research on this author. The most extensive assessment of his work was",
      "bbox": {
        "l": 75.0,
        "b": 117.0,
        "r": 606.0,
        "t": 206.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakact",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 495.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "rr",
      "bbox": {
        "l": 590.0,
        "b": 93.0,
        "r": 605.0,
        "t": 106.0
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 75.0,
        "b": 913.0,
        "r": 295.0,
        "t": 927.0
      }
    },
    {
      "label": "text",
      "text": "carried out by Abrahamyan and Petrosyan (Abrahamyan 1940, 1944, 1962; Abrahamyan, Petrosyan 1979) and their volumes remain of fundamental importance for whomever ventures into this field. Another extremely pre- cious tool for research is Anasyan's bibliographical compilation, dating from 1959 (731-774). Resources available in English, French or Italian are scarce and offer no clarity about the range and identity of Anania’s works.*",
      "bbox": {
        "l": 75.0,
        "b": 794.0,
        "r": 605.0,
        "t": 899.0
      }
    },
    {
      "label": "text",
      "text": "Some of these treatises’ attributions have been unchallenged for about sixty years, or in some cases even over a hundred, so that a great part of Anania’s attributed works did not withstand the scrutiny of several genera- tions of scholars. That is to say, most of Anania’s heritage has not yet had the benefit of being reassessed and refined by more recent philological science, by new comparisons across oriental studies and by any new de- velopments springing from research on these centuries between ‘late late antiquity’ and ‘early middle ages’, labels that sound all the more unhelpful when stretched as far as Armenia. However, it is far from our intention to dispute Anania’s responsibility for any of the texts, at this stage, and we are only concerned with making a case for caution. Scholars should treat this material carefully, bearing in mind that Armenology is still a field of pioneers, lest hypotheses are elevated to truth without being verified.",
      "bbox": {
        "l": 75.0,
        "b": 562.0,
        "r": 606.0,
        "t": 793.0
      }
    },
    {
      "label": "text",
      "text": "It is important to mention that some texts have attracted more schol- arly attention than others, such as the Geography, historically attributed to Movses Khorenac‘i, then non-unanimously attributed to Anania Sirakac‘i, and which has occasionally been a matter of a discussion that is unresolved to this day? Moreover, some other works attributed to Anania have very recently enjoyed the careful examination of scholars, for example the Ma- thematical Problems (Greenwood 2011), or the treatise On Weights and Measures, which Ervine and Stone identified as an Armenian version of the De Mensuris et Ponderibus by Epiphanius of Salamis (Ervine, Stone 2000). Concerning the Cosmology, Orengo has recently dispelled Abrahamyan’s claim that it used Eznik as a source, and proposed that a number of images common to both authors had circulated in Greek literature for centuries be- fore (2009). It goes without saying that a new critical edition and translation of the Cosmology would contribute to encourage more analyses of this sort.",
      "bbox": {
        "l": 75.0,
        "b": 315.0,
        "r": 606.0,
        "t": 561.0
      }
    },
    {
      "label": "text",
      "text": "Parallel to the study to be carried out on this specific text, it is our intention to publish an updated list complete with bibliographical infor- mation about each item of this ‘preliminary’ corpus. In fact we consider",
      "bbox": {
        "l": 75.0,
        "b": 259.0,
        "r": 606.0,
        "t": 312.0
      }
    },
    {
      "label": "footnote",
      "text": "2. Hewsen proposed a list in English, that is unreliable (1968, 40-5). It was then reprinted as an Appendix to his Geography with unsubstantial variations, where the author adds a paragraph redirecting the reader to Anasyan's list, which he does not seem to have con- sulted (1992, 279-83),",
      "bbox": {
        "l": 74.0,
        "b": 169.0,
        "r": 605.0,
        "t": 225.0
      }
    },
    {
      "label": "footnote",
      "text": "3. An overview of the problem of attribution may be found in Hewsen 1992, 7-15, who ac- cepts Eremyan's attribution to Anania Sirakac‘i, Others defend the original attribution to Khorenac’i, see for instance Geus 2017",
      "bbox": {
        "l": 75.0,
        "b": 119.0,
        "r": 605.0,
        "t": 160.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac'i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 605.0,
        "t": 106.0
      }
    },
    {
      "label": "page_footer",
      "text": "rr",
      "bbox": {
        "l": 75.0,
        "b": 95.0,
        "r": 90.0,
        "t": 105.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 384.0,
        "b": 913.0,
        "r": 605.0,
        "t": 927.0
      }
    },
    {
      "label": "text",
      "text": "it a fundamental tool for further research on Anania Sirakac‘i. This work- in-progress relies on Abrahamyan’s anthologies as a starting point (1940, 1944, 1962) against which we then sought correspondence with Anasyan’s list. In addition to these, the selected work re-printed in volume 4 of Mat- enagirk’ Hayoc’ (henceforth MH 2005)contain references to texts that are in neither.",
      "bbox": {
        "l": 75.0,
        "b": 794.0,
        "r": 605.0,
        "t": 901.0
      }
    },
    {
      "label": "text",
      "text": "So far we have been able to identify 29 pieces, including numerical tables without comments and works whose authorship has been openly disputed (such as the Geography). It seems appropriate here to offer some examples of the variety of topics covered by these texts. Some deal with arithmetic, such as Arithmetic (Quiwpnnmiph.t, hamarolut‘iwn), On odd and even numbers (Sunwqu nwp bi ynéwp pning, yalags dar ew kocar t'uoc’), On Problems and Solutions (Swnwqu hupguwh ti jn.duwh, yalags harc’man ew lucman), Mathematical Pastimes* (or (Jeux) pour les festins, IupwfuGuittwywhp, xraxéanakank’); metrics, like the above mentioned Armenain version of De Mensuris et Ponderibus; astronomy, for example in Tables of the Motions of the Moon (funpwip phpwghp 1nuuny, xorank’ ént‘ac'ik’ lusoy), Cycle 532 (GLE pnynpw, 532 bolorak), On the Rotation of the Skies (unmqu 2nguquynptwi tppthg, yalags Srjagayut’ean erk‘nic’); liturgical calendars, with the Discourse on the Epiphany of the Lord (Sun “h ywyntinphrt mtwnb”, Zar “i haytnut‘iwn tearn”), the Di- scourse on Easter (wn «h quip nbwnt», éaé “i zatki tearn”) and more.",
      "bbox": {
        "l": 75.0,
        "b": 508.0,
        "r": 606.0,
        "t": 794.0
      }
    },
    {
      "label": "text",
      "text": "The list will help future researchers to begin their investigations with fewer time-consuming diversions.",
      "bbox": {
        "l": 75.0,
        "b": 473.0,
        "r": 605.0,
        "t": 509.0
      }
    },
    {
      "label": "section_header",
      "text": "4 The Cosmology",
      "bbox": {
        "l": 75.0,
        "b": 418.0,
        "r": 232.0,
        "t": 440.0
      }
    },
    {
      "label": "section_header",
      "text": "4.1 The Text",
      "bbox": {
        "l": 75.0,
        "b": 366.0,
        "r": 169.0,
        "t": 384.0
      }
    },
    {
      "label": "text",
      "text": "The main focus of our current research, as mentioned, is the Cosmology at- tributed to Anania Sirakac‘i. This text was edited by Abrahamyan in 1940, from the manuscripts M2180, M2762, M1979 and M1973 (MH 2005, 592; with a reprint of the text 712-48). The so-called “middle” recension was published in 1877 in Patkanean’s collection of works attributed to Anania, although the manuscripts on which it is based are not specified (reprinted in MH 2005, 749-66). Alongside other copies preserved at the Matena- daran depository in Yerevan, our catalogue searches have also revealed a copy in Venice, at the Mkhitarist library of San Lazzaro (V1332), and two in the library of St James in Jerusalem: J656, and J1288 (fragmentary). In",
      "bbox": {
        "l": 75.0,
        "b": 170.0,
        "r": 606.0,
        "t": 348.0
      }
    },
    {
      "label": "footnote",
      "text": "4 The English title is our own,",
      "bbox": {
        "l": 75.0,
        "b": 117.0,
        "r": 260.0,
        "t": 132.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakact",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 495.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "B",
      "bbox": {
        "l": 590.0,
        "b": 93.0,
        "r": 605.0,
        "t": 105.0
      }
    }
  ],
  "6": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 75.0,
        "b": 913.0,
        "r": 296.0,
        "t": 926.0
      }
    },
    {
      "label": "text",
      "text": "total, we have so far been able to locate 18 copies of this text, including those that only preserve parts of it.",
      "bbox": {
        "l": 76.0,
        "b": 865.0,
        "r": 605.0,
        "t": 899.0
      }
    },
    {
      "label": "text",
      "text": "In Western scholarship, the Cosmology text knew little circulation: Mahé has translated parts of the long version into French (1987, 196-7), and some have also been translated into English (Hacikyan et al. 1995, 62- 80), although the latter are of little scientific value since they translate Abrahamyan’s version in modern Eastern Armenian (1979, 64-114) rather than his edition in Classical Armenian.",
      "bbox": {
        "l": 75.0,
        "b": 759.0,
        "r": 606.0,
        "t": 863.0
      }
    },
    {
      "label": "text",
      "text": "Although Abrahamyan’s distinction between a long, a middle and a short version has not yet been contested, it was not properly received into later scholarship. The version he labelled as ‘middle’, which corresponds to the text edited and published by Patkanean in 1877, is now often referred to as. ‘short’, whilst the original text that Abrahamyan intended to name ‘short’ was never published on its own, and was thus soon forgotten. To avoid confusion, we shall maintain the labels ‘long’ and ‘middle’. Our research on the manuscript tradition is not yet developed enough to comment fruitfully on these versions. It is nonetheless important to lay out the most important differences between these traditional ‘long’ and ‘middle’ versions. The two are very similar for the most part: the long version only presents a few passages here and there which do not appear in the middle version, with the exception of chapters 5 and 10, where additional material is consider- ably more extensive than elsewhere.*",
      "bbox": {
        "l": 75.0,
        "b": 509.0,
        "r": 606.0,
        "t": 756.0
      }
    },
    {
      "label": "text",
      "text": "Patkanean’s middle edition begins with chapter «On the Sky», and counts 10 chapters in total (Patkanean 1877, 34-65), the last of which, «On the Zodiac Signs», was later judged by Abrahamyan as a work separate from the Cosmology. Despite rejecting this last chapter, Abrahamyan’s ‘long’ Cosmology still counts 10 chapters, as it is provided with an intro- duction, whose title, In the fulfilment of a promise, interestingly hints at the existence of a patron or a recipient of this work.",
      "bbox": {
        "l": 75.0,
        "b": 385.0,
        "r": 606.0,
        "t": 507.0
      }
    },
    {
      "label": "text",
      "text": "What is described in this premise to the long version is coherent with the structure of the following chapters:",
      "bbox": {
        "l": 75.0,
        "b": 348.0,
        "r": 605.0,
        "t": 383.0
      }
    },
    {
      "label": "text",
      "text": "... And after taking up this subject from them in our work, let us lay down this treatise, beginning with the sky and coming to the earth. To then return once more to the sky, elevating ourselves with the mystery of the cosmos we shall be content at making this treatise proceed, chapter by chapter. (Cosmology 1)?",
      "bbox": {
        "l": 92.0,
        "b": 241.0,
        "r": 605.0,
        "t": 329.0
      }
    },
    {
      "label": "footnote",
      "text": "5. This short version is preserved in M1979.",
      "bbox": {
        "l": 75.0,
        "b": 191.0,
        "r": 337.0,
        "t": 204.0
      }
    },
    {
      "label": "footnote",
      "text": "6 Weare simply describing the quantitative difference between the versions rather than passing judgement upon which parts were added and which were curtailed in relation to a lost original.",
      "bbox": {
        "l": 75.0,
        "b": 140.0,
        "r": 605.0,
        "t": 182.0
      }
    },
    {
      "label": "footnote",
      "text": "7 All quotations from the Cosmology are presented in our own translation.",
      "bbox": {
        "l": 75.0,
        "b": 118.0,
        "r": 521.0,
        "t": 131.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac'i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 605.0,
        "t": 106.0
      }
    },
    {
      "label": "page_footer",
      "text": "rr",
      "bbox": {
        "l": 75.0,
        "b": 93.0,
        "r": 90.0,
        "t": 105.0
      }
    }
  ],
  "7": [
    {
      "label": "page_header",
      "text": "Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 384.0,
        "b": 912.0,
        "r": 607.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "In fact, we see in the chapter list that the topics covered go from the sky to the earth, and then slowly rise back up to the clouds, the stars, the moon and sun:*",
      "bbox": {
        "l": 75.0,
        "b": 847.0,
        "r": 609.0,
        "t": 901.0
      }
    },
    {
      "label": "list_item",
      "text": "1. In fulfilment of a vow, i.e. a preface on the author's approach to science and philosophy (present only in the long recension);",
      "bbox": {
        "l": 92.0,
        "b": 811.0,
        "r": 609.0,
        "t": 847.0
      }
    },
    {
      "label": "list_item",
      "text": "2. On the sky, describing the universe structure composed of concen- tric spheres;",
      "bbox": {
        "l": 92.0,
        "b": 776.0,
        "r": 608.0,
        "t": 812.0
      }
    },
    {
      "label": "list_item",
      "text": "3. On the earth, mainly concerned with the four elements and their interaction;",
      "bbox": {
        "l": 92.0,
        "b": 740.0,
        "r": 609.0,
        "t": 776.0
      }
    },
    {
      "label": "list_item",
      "text": "4. On the sea, which talks about the waters and their divisions;",
      "bbox": {
        "l": 92.0,
        "b": 722.0,
        "r": 564.0,
        "t": 740.0
      }
    },
    {
      "label": "list_item",
      "text": "5. Oncelestial bodies, dealing both with the physical sky and with the myths of astrology;",
      "bbox": {
        "l": 92.0,
        "b": 687.0,
        "r": 608.0,
        "t": 722.0
      }
    },
    {
      "label": "list_item",
      "text": "6. On what is between the sky and earth, on the elements and mete- orological phenomena;",
      "bbox": {
        "l": 92.0,
        "b": 651.0,
        "r": 607.0,
        "t": 687.0
      }
    },
    {
      "label": "list_item",
      "text": "7. On the milky way, a very short overview of what it is in myth and in reality;",
      "bbox": {
        "l": 92.0,
        "b": 616.0,
        "r": 608.0,
        "t": 651.0
      }
    },
    {
      "label": "list_item",
      "text": "8. On the northern stars, about the usefulness of stars for man, espe- cially at sea;",
      "bbox": {
        "l": 92.0,
        "b": 580.0,
        "r": 606.0,
        "t": 616.0
      }
    },
    {
      "label": "list_item",
      "text": "9. On the moon, on the nature of the moon and its behaviour;",
      "bbox": {
        "l": 92.0,
        "b": 561.0,
        "r": 551.0,
        "t": 580.0
      }
    },
    {
      "label": "list_item",
      "text": "10. On the sun, on the nature of the sun and its behaviour.",
      "bbox": {
        "l": 92.0,
        "b": 544.0,
        "r": 521.0,
        "t": 562.0
      }
    },
    {
      "label": "section_header",
      "text": "4.2 APossible Dedicatee",
      "bbox": {
        "l": 75.0,
        "b": 491.0,
        "r": 258.0,
        "t": 510.0
      }
    },
    {
      "label": "text",
      "text": "Trusting that the first introductory chapter is authentic, which is, for now, beyond proof, one may speculate about the possible identity of the persons to whom the ‘promise’ to be ‘fulfilled’ was made. It is possible that this cosmological work was commissioned by a king, or a nakharar (noble- man), like the similar and almost contemporary On the Nature of Things, composed in Latin by Isidore of Seville, and dedicated to king Sisebut; but it seems fruitless to pursue such a hypothesis in the absence of evidence, and knowing so little about Anania’s Armenian entourage. There might be more to support the idea that the Cosmology’s dedicatee could have been Catholicos Anastas (661-667), as the tenth-century historian Yovhannes Drasxanakertc’i, in his History of the Armenians (MumUmphit 2uyng, Patmut‘iwnk’ Hayoc’) includes a brief account of how the Catholicos re- quested Anania to produce a fixed calendar (Greenwood 2011, 133). One may suggest that this was not the only work commissioned to Anania, and that other pieces, such as the Cosmology, were also made under the patronage of the Holy See.",
      "bbox": {
        "l": 75.0,
        "b": 188.0,
        "r": 607.0,
        "t": 473.0
      }
    },
    {
      "label": "footnote",
      "text": "8 The chapter selection and order follow Abrahamyan’s.",
      "bbox": {
        "l": 76.0,
        "b": 117.0,
        "r": 414.0,
        "t": 132.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakact",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 496.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "15",
      "bbox": {
        "l": 591.0,
        "b": 92.0,
        "r": 605.0,
        "t": 106.0
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 76.0,
        "b": 913.0,
        "r": 296.0,
        "t": 927.0
      }
    },
    {
      "label": "section_header",
      "text": "4.3 Sources",
      "bbox": {
        "l": 75.0,
        "b": 883.0,
        "r": 166.0,
        "t": 901.0
      }
    },
    {
      "label": "text",
      "text": "Despite a reliable critical edition not being available yet, it is possible to identify a number of sources and precise references for parts of the Cosmology. This endeavour is sometimes made easier by direct men- tions of authorities within the text itself. Muradyan highlighted a num- ber of references in the Cosmology that point mainly to Church Fathers and the Bible (Muradyan 1976); Orengo pointed at the connections with a Greek tradition that includes Achilles Tatius and Carneades (2009); and our work-in-progress is adding even more references to the list.",
      "bbox": {
        "l": 75.0,
        "b": 722.0,
        "r": 606.0,
        "t": 865.0
      }
    },
    {
      "label": "text",
      "text": "Biblical quotations are mainly drawn from the Pentateuch and Psalms, and the author often mentions St Paul, ‘The Apostle’ or Movses as authorities. Given that we read in the Autobiography that Anania was well versed in the Divine Scriptures (Greenwood 2011, 138), it is possible that he quoted by heart rather than copying. In regard to the majority of quotations drawn from Genesis, however, his use of the Bible is mediated, since they are included in his extensive borrowings from St Basil of Caesarea (4th century). Beyond St Basil, there are other doctors upon whose works the Cosmology relies, mentioned by name: Philo (of Alexandria), St Gregory (‘vardapet of the Armenians’, i.e. The Mluminator) and Amphiolocus (Cosmology III.44) who is pre- sumably Amphiolocus of Iconium, although the reference has not yet been identified.",
      "bbox": {
        "l": 75.0,
        "b": 491.0,
        "r": 606.0,
        "t": 722.0
      }
    },
    {
      "label": "text",
      "text": "The Author of the Cosmology certainly knew St Basil’s Discourse on the Six Days of Creation, or Hexameron very well, and quotes exten- sively from it, with or without acknowledgements. As already noted by Muradyan (1976), these quotations and references were not translated from a Greek version of this work, but rather drawn directly from its Armenian version. Comparing these texts, we have been able to find correspondences verbatim, although they often include mistakes, cuts, losses or modifications; some bear a very close resemblance, others just display similar content. The Author of the Cosmology does not seem to make use of all nine homilies, but draws mainly from III, IV and VI, although parallels and resemblances also extend to other parts. Accordingly, not all topics considered by St Basil make an appearance in the Cosmology, whose overall structure is differently organised, as we shall remark below.",
      "bbox": {
        "l": 75.0,
        "b": 241.0,
        "r": 606.0,
        "t": 491.0
      }
    },
    {
      "label": "text",
      "text": "Here is an example of a passage in which chapter 6 of the Cosmology ‘owes much to St. Basil’s IV Homily, with very slight modifications on the sentence order. Our present homily, however, deals with the world- encircling sea which is the most extensive, longest and broadest of all, equal in comparison with the earth. Let no one persist in opposition to this description or name the lakes ‘seas’, although they might have a salty and bitter taste, and being bounded by sand might",
      "bbox": {
        "l": 75.0,
        "b": 117.0,
        "r": 606.0,
        "t": 241.0
      }
    },
    {
      "label": "page_footer",
      "text": "is",
      "bbox": {
        "l": 75.0,
        "b": 92.0,
        "r": 90.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac‘i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 605.0,
        "t": 107.0
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 384.0,
        "b": 912.0,
        "r": 605.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "seem to be in the form of an extensive sea. (St. Basil Hom. VI.4 [113], transl. in Thomson 2012, 125; emphasis added)",
      "bbox": {
        "l": 75.0,
        "b": 865.0,
        "r": 606.0,
        "t": 902.0
      }
    },
    {
      "label": "text",
      "text": "And so the Cosmology echoes this passage:",
      "bbox": {
        "l": 75.0,
        "b": 828.0,
        "r": 390.0,
        "t": 848.0
      }
    },
    {
      "label": "text",
      "text": "And there are many more land-locked seas that are not from the world- sea, despite having this salty and bitter taste, and having sandy shores just like those of the big sea. However, it is not possible to call lakes ‘sea’. (Cosmology IV.12-3; emphasis added)",
      "bbox": {
        "l": 92.0,
        "b": 739.0,
        "r": 606.0,
        "t": 813.0
      }
    },
    {
      "label": "text",
      "text": "Despite Anania’s reliance on St Basil’s Hexameron and on other late-antique scholars, some ideas are much harder to ascribe to a specific source: some Platonic, Aristotelian and Ptolemaic theories were widely accepted, such as. the theory of the four elements, the division of the earth and sky into con- centric spheres and other notions of natural philosophy. Others are literary images used to explain certain concepts, phenomena or arguments that date to the Classical and Hellenistic period, or further back, which were used by a number of scholars or schools, and whose diffusion is hard to assess. For this latter group, examples include the image of the egg to describe the cosmos (Cosmology Ill, see Orengo 2009, 241-2), or some of the arguments against the casting of horoscopes, already put forward by Carneades (Orengo 2009, 236-8). It is important to underline that, even when it is impossible to tell precisely via which source a certain set of images and information have entered the Cosmology, their presence, acceptance and inclusion in the text may still be significant for the transmission and circulation of ideas, as they add to a picture that may be seen with better clarity in the future.",
      "bbox": {
        "l": 75.0,
        "b": 436.0,
        "r": 606.0,
        "t": 723.0
      }
    },
    {
      "label": "section_header",
      "text": "4.4 From the Land of the Greeks... to Armenian Literature",
      "bbox": {
        "l": 75.0,
        "b": 383.0,
        "r": 476.0,
        "t": 403.0
      }
    },
    {
      "label": "text",
      "text": "As regards the notions expressed in the Cosmology in the fields of astronomy, physics or meteorology, nothing constitutes novelty or new discovery in a wide context of Greek science. However, most of them represent a burst of new ideas within the tradition of cosmological writing in Armenian literature. After the Bible itself, the first and foremost literary precedent in which views on the physics of the universe are exposed, the next item with cosmological interest is the Refutation of Sects, also known as De Deo, a theological treatise written in Classical Armenian by the fifth-century scholar Eznik Kolbac’i”",
      "bbox": {
        "l": 75.0,
        "b": 224.0,
        "r": 607.0,
        "t": 367.0
      }
    },
    {
      "label": "footnote",
      "text": "9 Henceforth all quotations of the Hexameron are from Thomson's English translation,",
      "bbox": {
        "l": 75.0,
        "b": 154.0,
        "r": 592.0,
        "t": 170.0
      }
    },
    {
      "label": "footnote",
      "text": "10. The most complete overview on cosmological ideas in Armenia may be found in Thom- son 2012, 31-50,",
      "bbox": {
        "l": 75.0,
        "b": 118.0,
        "r": 606.0,
        "t": 148.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac't",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 495.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "ra",
      "bbox": {
        "l": 590.0,
        "b": 94.0,
        "r": 605.0,
        "t": 105.0
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 75.0,
        "b": 913.0,
        "r": 296.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "Whilst Eznik and Anania repeat similar remarks on (or rather, against) astrology, which seem to derive from the same ancient tradition, their views on the mechanics of the sky are very different. For example, Eznik’s understanding of the origin of moonlight, the phases of the moon and the cause of eclipses is quite poor, whilst Anania’s explanations show him to have well understood the teachings of classical astronomers.",
      "bbox": {
        "l": 75.0,
        "b": 794.0,
        "r": 606.0,
        "t": 901.0
      }
    },
    {
      "label": "text",
      "text": "Let us, for instance, compare the passages in which the light of the moon and its phases are discussed. Eznik exposes his understanding of pagan cosmological ideas to then disagree with them:",
      "bbox": {
        "l": 75.0,
        "b": 740.0,
        "r": 606.0,
        "t": 794.0
      }
    },
    {
      "label": "text",
      "text": "And the moon does not have its own light, but rather it comes from the sun, they [the pagans] say, that from whatever side the sun comes to be, from that very side light begins to emanate to it. (Eznik, De Deo IlI.1 [290}, transl. Blanchard, Young 1998, 156)\"",
      "bbox": {
        "l": 92.0,
        "b": 651.0,
        "r": 606.0,
        "t": 724.0
      }
    },
    {
      "label": "text",
      "text": "... Once again, that the moon does not possess its own light [...] is a lie... (Eznik, De Deo II1.8 [312], transl. by Blanchard, Young 1998, 164; emphasis added)",
      "bbox": {
        "l": 92.0,
        "b": 580.0,
        "r": 605.0,
        "t": 634.0
      }
    },
    {
      "label": "text",
      "text": "This account does not differ much from what appears in the Cosmology’s main Greek source, the above-mentioned Hexameron of St Basil. Here we read, in Homily VI:",
      "bbox": {
        "l": 75.0,
        "b": 509.0,
        "r": 606.0,
        "t": 562.0
      }
    },
    {
      "label": "text",
      "text": "Let no one say that the moon’s light come from elsewhere. They say that when it goes towards the sun it begins to lose its light, and when it moves away from it, it waxes and becomes full. (§3 [176-7]; emphasis added)",
      "bbox": {
        "l": 92.0,
        "b": 419.0,
        "r": 606.0,
        "t": 491.0
      }
    },
    {
      "label": "text",
      "text": "And later in the same Homily:",
      "bbox": {
        "l": 75.0,
        "b": 384.0,
        "r": 294.0,
        "t": 403.0
      }
    },
    {
      "label": "text",
      "text": "Atits waning and decline it [the moon] is not totally deprived of its vessel but of the light which participates and dwells in it... (§5 [175])",
      "bbox": {
        "l": 92.0,
        "b": 331.0,
        "r": 606.0,
        "t": 366.0
      }
    },
    {
      "label": "text",
      "text": "However, Anania’s account displays a clear understanding of this phe- nomenon:",
      "bbox": {
        "l": 75.0,
        "b": 276.0,
        "r": 606.0,
        "t": 314.0
      }
    },
    {
      "label": "text",
      "text": "But our predecessors who took pains to understand it [the moon], said the following: that [...] it does not have light by nature, but by par- ticipation it takes it from the sun, like a mirror being held against the sunflight], it also dispatches many rays from itself, in the same way they say the moon does too. However two certain doctors of the Church said",
      "bbox": {
        "l": 92.0,
        "b": 170.0,
        "r": 606.0,
        "t": 259.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac'i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 605.0,
        "t": 106.0
      }
    },
    {
      "label": "page_footer",
      "text": "18",
      "bbox": {
        "l": 75.0,
        "b": 94.0,
        "r": 90.0,
        "t": 105.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 385.0,
        "b": 912.0,
        "r": 606.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "that the moon has got its own light and [does] not [receive it] from the sun. (Cosmology IX.4-6)",
      "bbox": {
        "l": 92.0,
        "b": 865.0,
        "r": 607.0,
        "t": 902.0
      }
    },
    {
      "label": "text",
      "text": "Unfortunately there is not further information about these Doctors, but it is clear that Anania does not support their theory, and later in the same chapter (9), he goes on to describe moon phases and eclipses, in a way that almost seems to answer the perplexities that emerge from Eznik’s pen (Cosmology IX.59 and De Deo III.8 (315).",
      "bbox": {
        "l": 75.0,
        "b": 757.0,
        "r": 606.0,
        "t": 848.0
      }
    },
    {
      "label": "text",
      "text": "Although this is not the place to go over each example in depth, this passage regarding the moon shows how ancient explanations, even if not unknown in Armenian translations (such as the Hexameron) or original treatise-writing (such as Eznik’s De Deo) are finally interpreted and ex- panded on by the author of the Cosmology. Here novelty is represented not much by the introduction of new notions in Armenia, but rather by their reception and acceptance, which opens many questions about the education of a seventh-century Christian mathematician, When it comes to pinning down Anania’s source for correct information, we need not nec- essarily look for a specific written source, since it is possible that he was taught these basic astronomical notions by his teacher Tychicos.",
      "bbox": {
        "l": 75.0,
        "b": 561.0,
        "r": 606.0,
        "t": 758.0
      }
    },
    {
      "label": "section_header",
      "text": "4.5 ANew Genre",
      "bbox": {
        "l": 75.0,
        "b": 509.0,
        "r": 202.0,
        "t": 528.0
      }
    },
    {
      "label": "text",
      "text": "Despite drawing much from St Basil’s Hexameron, Anania’s work is also significant in contrast with it, most prominently as it belongs to a different genre. In fact, Anania’s Cosmology is not a commentary on the Scriptures, and its structure is not based on the account found in Genesis. The order in which the Cosmology unfolds its chapters and the methods it deploys to explain the world constitute a noteworthy innovation within Christian tradition.",
      "bbox": {
        "l": 75.0,
        "b": 366.0,
        "r": 606.0,
        "t": 491.0
      }
    },
    {
      "label": "text",
      "text": "Whilst hexamera comment faithfully on the first book of Genesis, bibli- cal references are here selected in each section when functional to the themes that are being exposed. Anania himself tells us that he also knows the ‘good pagan philosophers’, and it is in this tradition that we may find models for this work. In particular, we would like to explore the possibility that Anania knew the Aristotelian treatise For Alexander On the Cosmos (De Mundo), or works inspired by it.”",
      "bbox": {
        "l": 75.0,
        "b": 241.0,
        "r": 606.0,
        "t": 366.0
      }
    },
    {
      "label": "text",
      "text": "It has been traditionally held by scholars that the De Mundo was avail- able in Armenian as early as the sixth century (see Conybeare 1892, vi- viii; Bolognesi 1983, 402) thanks to a translation attributed to David the Invincible; however this would not be a necessary condition for Anania to",
      "bbox": {
        "l": 75.0,
        "b": 169.0,
        "r": 606.0,
        "t": 242.0
      }
    },
    {
      "label": "footnote",
      "text": "12. On the attribution of this text, see Reale 1995, 23.57,",
      "bbox": {
        "l": 76.0,
        "b": 117.0,
        "r": 415.0,
        "t": 133.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac't",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 496.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "19",
      "bbox": {
        "l": 591.0,
        "b": 92.0,
        "r": 605.0,
        "t": 106.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 75.0,
        "b": 913.0,
        "r": 296.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "have been influenced by this work. He or his teacher might have known it from its original Greek version, or known similar didactic writing via digests or derivative works. The structure of On the Cosmos is not in fact particularly close to that of the Cosmology, mainly for being much stricter and more solid than the latter. Their resemblance lies in the general idea that the universe may be described following a discourse of natural sci- ences or physical order (i.e. from above downwards, from the small to the big) rather than following Genesis.",
      "bbox": {
        "l": 75.0,
        "b": 758.0,
        "r": 606.0,
        "t": 901.0
      }
    },
    {
      "label": "text",
      "text": "It seems appropriate to point out that, around the same time, the Latin world also sees a similar cosmological compendium, solidly rooted in the Church Fathers’ tradition but differently laid out and incorporating non- Christian philosophers in a synthesis that becomes a new genre: the trea- tise On the Nature of Things (De Natura Rerum), by Isidore of Seville, that would only predate the Cosmology by a few decades, as it was written in 611-612 (Kendall, Wallis 2016). And like Isidore’s, Anania’s originality may also be found in his methods of bringing information together, combining such diverse sources.",
      "bbox": {
        "l": 75.0,
        "b": 598.0,
        "r": 606.0,
        "t": 758.0
      }
    },
    {
      "label": "text",
      "text": "For what concerns the history of science and of ideas, both authors offer an insight into a stage of development in which Christian scholars begin to merge exegesis with philosophy, the word and the world; and we are certain that further analysis on the Cosmology and the traditions it incor- porates will offer material for fruitful comparisons with the Latin West, too.",
      "bbox": {
        "l": 75.0,
        "b": 509.0,
        "r": 606.0,
        "t": 598.0
      }
    },
    {
      "label": "section_header",
      "text": "4.6 Methodology",
      "bbox": {
        "l": 75.0,
        "b": 455.0,
        "r": 203.0,
        "t": 473.0
      }
    },
    {
      "label": "text",
      "text": "In the context of Latin Christian writing, a characteristic that represents innovation in On the Nature of Things is the method by which truth is sought within the pagan and Christian authorities quoted or reported. Kendall and Wallis observe that Isidore “tends to present” pagan poets and philosophers on the same level with the Church Fathers or even the Bible (2016, 22). It is too early for us to pass judgements on Anania’s methodol- ogy, mainly due to the state of the current edition and the fact that not all of his sources of information have been identified, but we would nonethe- less like to anticipate that this particular direction of research may yield useful results, and offer material for comparison. There is one approach in particular that interests us, and in this, too, the themes of tradition and novelty play an important role.",
      "bbox": {
        "l": 75.0,
        "b": 224.0,
        "r": 605.0,
        "t": 438.0
      }
    },
    {
      "label": "text",
      "text": "When dealing with science, one needs to be aware that the co-existence of information from Christian and pagan authors does not necessarily bring competing explanations of the physical mechanics of the world. There often are seemingly different explanations that actually deal with two different layers of investigation, that of the physical and that of the metaphysical. This was already present in the Church Fathers (although",
      "bbox": {
        "l": 75.0,
        "b": 117.0,
        "r": 606.0,
        "t": 223.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac'i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 605.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "20",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 90.0,
        "t": 106.0
      }
    }
  ],
  "13": [
    {
      "label": "page_header",
      "text": "Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 385.0,
        "b": 912.0,
        "r": 607.0,
        "t": 928.0
      }
    },
    {
      "label": "text",
      "text": "the distinction of these two approaches was seldom explicit), and it often happens that a mechanical description of a phenomenon is subordinated to a metaphysical one. Similar instances are, again, also found in On the Nature of Things, where the explanation of eclipses draws on the pagan Hyginus, and then allegorical meanings are sought within Christian sym- bolism (Kendall, Wallis 2016, 21-4).",
      "bbox": {
        "l": 75.0,
        "b": 794.0,
        "r": 607.0,
        "t": 902.0
      }
    },
    {
      "label": "text",
      "text": "Exposing the why may sometimes come to minimise the physical de- scription of the how. The best example of this case is in a passage in Cosmology IV, drawn from St Basil's Hexameron (III.7 [90]); treating the sea-level and its maintenance. The author discards the “bad philosophers” theory that the water flowing out is as much as the water coming into the sea, whilst the “good philosophers” also consider evaporation, which may explain the presence of salt and sediments, left behind by this process. The whole discussion on mechanics, however, is then judged “not pleas- ing” (perhaps in the sense of ‘unsatisfactory’) because of its inferiority to biblical passages that report the divine command for the waters to have a boundary and not to rise above the earth. God’s will settles the discussion, even if it belongs to another level of understanding. Similarly, Isidore also offers examples where the how is explained by reporting pagan traditional theories, and then moves to a Christian allegorical reading of the phenom- enon, and therefore a metaphysical cause for it (Kendall, Wallis 2016, 21).",
      "bbox": {
        "l": 75.0,
        "b": 526.0,
        "r": 607.0,
        "t": 794.0
      }
    },
    {
      "label": "text",
      "text": "Even though one may observe that different weight is given to one or the other level, and that different schools or authors treat the physical and the metaphysical differently, these two approaches remain deeply rooted in Aristotelian philosophy. In the above-mentioned De Mundo, Aristotle says:",
      "bbox": {
        "l": 75.0,
        "b": 454.0,
        "r": 607.0,
        "t": 526.0
      }
    },
    {
      "label": "text",
      "text": "The Universe [Cosmos] then is a system made up of heaven and earth and the elements which are contained in them. But the word is also used in another sense of the ordering and arrangements of all things, preserved by and through God. (De Mundo 391\" 9-12, transl. by Forster 1914)",
      "bbox": {
        "l": 92.0,
        "b": 348.0,
        "r": 609.0,
        "t": 439.0
      }
    },
    {
      "label": "text",
      "text": "Although we still need to understand how Anania’s methodology compares to Platonic and neo-platonic schools at the time, and therefore to have a grasp on his philosophical views, we may certainly say that future analysis of Anania’s methods of investigation in this text may aid our understanding of the late antique and Christian reception of Aristotelian (and potentially Platonic) epistemology. This Cosmology may help tracing their develop- ment in the Byzantine and Armenian tradition, and offer material for com- parison with their better-explored Latin counterparts.",
      "bbox": {
        "l": 75.0,
        "b": 187.0,
        "r": 609.0,
        "t": 331.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakact",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 496.0,
        "t": 108.0
      }
    },
    {
      "label": "page_footer",
      "text": "a",
      "bbox": {
        "l": 591.0,
        "b": 92.0,
        "r": 605.0,
        "t": 106.0
      }
    }
  ],
  "14": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 76.0,
        "b": 912.0,
        "r": 297.0,
        "t": 928.0
      }
    },
    {
      "label": "section_header",
      "text": "5 Conclusion",
      "bbox": {
        "l": 75.0,
        "b": 882.0,
        "r": 200.0,
        "t": 904.0
      }
    },
    {
      "label": "text",
      "text": "In sum, we have presented the figure of Anania Sirakac‘i and shown that evidence from his Autobiography gives grounds upon which to approach him as a recipient of a Byzantine (and perhaps Alexandrian) school of mathematics and natural sciences, whilst his knowledge of the Scriptures and exegesis had its roots in his Armenian education.",
      "bbox": {
        "l": 75.0,
        "b": 775.0,
        "r": 606.0,
        "t": 866.0
      }
    },
    {
      "label": "text",
      "text": "After a description of the current status of his corpus, we have presented the Cosmology, with a brief account of its editions, its content and of the possible existence of a patron for his production.",
      "bbox": {
        "l": 75.0,
        "b": 721.0,
        "r": 606.0,
        "t": 776.0
      }
    },
    {
      "label": "text",
      "text": "Accounting for the traditional elements present in this work, we have paid special attention to its sources, which are named or silent, pagan or Christian. The most prominent of this last group is St Basil’s Hexameron, quoted from its Armenian version. When treating the same content, Ana- nia’s understanding of ancient theories is, however, superior to St Basil’s, and to the Armenian theologian Eznik, the main Armenian precedent that deals with cosmological questions.",
      "bbox": {
        "l": 75.0,
        "b": 597.0,
        "r": 606.0,
        "t": 723.0
      }
    },
    {
      "label": "text",
      "text": "Identifying the exact sources, whether direct or mediated, oral or writ- ten, from which Anania may have learned and understood such theories has not yet been possible. What may be said with certainty is that, in the context of Classical Armenian literature, the Cosmology is the first to interpret and explain some of those traditional theories that had been misunderstood and discarded by Eznik.",
      "bbox": {
        "l": 75.0,
        "b": 490.0,
        "r": 606.0,
        "t": 599.0
      }
    },
    {
      "label": "text",
      "text": "For respect to the structure, Anania’s Cosmology does not follow suit in the making of a commentary on Genesis like the Church Fathers, but rather seems inspired by a tradition of pagan treatises. A very likely model for the Cosmology might have been Aristotle's De Mundo, or another text belonging to the same milieu.",
      "bbox": {
        "l": 75.0,
        "b": 402.0,
        "r": 606.0,
        "t": 491.0
      }
    },
    {
      "label": "text",
      "text": "A point that deserves careful examination is the way in which Anania compares and merges these traditions, that of a pagan natural philosophy, of a Christian natural philosophy, and of biblical exegesis. We have also indicated that alongside different physical accounts, some explanations deal with the metaphysical, and although these are sought within Chris- tian and Jewish symbolism and tradition, the very approach seems to have Aristotelian origins, as the Philosopher pointed out at the start of his De Mundo, ‘order’ is intended on two levels.",
      "bbox": {
        "l": 75.0,
        "b": 258.0,
        "r": 606.0,
        "t": 402.0
      }
    },
    {
      "label": "text",
      "text": "In conclusion, when viewed as a Byzantine text, the Cosmology's origi- nality may be sought in the way in which pagan and Christian traditions are combined (and often intrinsically intertwined), and much may be learned about the ‘making of science’ in the context of the seventh-century. Within the specific context of Armenian literature, this text deals with many as- pect of natural philosophy in unprecedented depth.",
      "bbox": {
        "l": 75.0,
        "b": 152.0,
        "r": 605.0,
        "t": 259.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac'i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 606.0,
        "t": 108.0
      }
    },
    {
      "label": "page_footer",
      "text": "2",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 91.0,
        "t": 107.0
      }
    }
  ],
  "15": [
    {
      "label": "page_header",
      "text": "Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 385.0,
        "b": 912.0,
        "r": 606.0,
        "t": 927.0
      }
    },
    {
      "label": "section_header",
      "text": "Bibliography",
      "bbox": {
        "l": 75.0,
        "b": 883.0,
        "r": 171.0,
        "t": 903.0
      }
    },
    {
      "label": "list_item",
      "text": "Abrahamyan, Ashot G. (1940). Tiezeragitut‘iwn ev tomar. Erevan: Haypethrat.",
      "bbox": {
        "l": 75.0,
        "b": 829.0,
        "r": 605.0,
        "t": 865.0
      }
    },
    {
      "label": "list_item",
      "text": "Abrahamyan, Ashot G. (1944). Sirakac‘u Matenagrut‘yuna. Yerevan: HSSR Matenadarani Hrataraké‘utyun.",
      "bbox": {
        "l": 74.0,
        "b": 794.0,
        "r": 606.0,
        "t": 829.0
      }
    },
    {
      "label": "list_item",
      "text": "Abrahamyan, Ashot G. (1962). Lusni parberasrjannere. Erevan: Haykakan SSH Gitowt'yownneri Akademia.",
      "bbox": {
        "l": 74.0,
        "b": 758.0,
        "r": 606.0,
        "t": 794.0
      }
    },
    {
      "label": "list_item",
      "text": "Abrahamyan, Ashot G. ; Petrosyan, Garegin B. (1979). Anania Sirakac‘i Matenagrut‘yun. Erevan: Sovetakan grot Hrataraké‘utyun.",
      "bbox": {
        "l": 74.0,
        "b": 722.0,
        "r": 606.0,
        "t": 758.0
      }
    },
    {
      "label": "list_item",
      "text": "Anasyan, Hagop S. (1959). Haykakan Matenagrut‘yun 5 - 18 dd., vol. 1. Yerevan.",
      "bbox": {
        "l": 74.0,
        "b": 687.0,
        "r": 605.0,
        "t": 722.0
      }
    },
    {
      "label": "list_item",
      "text": "Berbérian, H. (1964). “Autobiographie d’Anania Sirakac’i’. Revue des Etudes Arméniennes, 1, 189-94.",
      "bbox": {
        "l": 75.0,
        "b": 651.0,
        "r": 606.0,
        "t": 687.0
      }
    },
    {
      "label": "list_item",
      "text": "Blanchard, Monica J.; Young, Robin D. (1998). Eznik of Kotb. On God. Leuven: Peeters.",
      "bbox": {
        "l": 75.0,
        "b": 616.0,
        "r": 605.0,
        "t": 650.0
      }
    },
    {
      "label": "list_item",
      "text": "Bolognesi Giancarlo, (1983). “Remarques sur la version arménienne Patmowt'iwn yalags aSxarhi attribuée a David I'Invicible”. Brutian, Georg Abeli; Arevshatian, S.S.; Grigorian, G.O. et al. (eds), Davit’ Anhait’, Hin Hayastani Mec P‘ilisop‘an. Erevan: Haykakan SSH GA Hratarakch’ut‘yun, 402-18.",
      "bbox": {
        "l": 75.0,
        "b": 526.0,
        "r": 606.0,
        "t": 616.0
      }
    },
    {
      "label": "list_item",
      "text": "Conybeare, Frederick C. (1889). “On the Ancient Armenian Versions of Plato”. The Classical Review, 3(8), 340-3.",
      "bbox": {
        "l": 75.0,
        "b": 491.0,
        "r": 607.0,
        "t": 527.0
      }
    },
    {
      "label": "list_item",
      "text": "Conybeare, Frederick C. (1892). A Collation with the Ancient Armenian Versions of the Greek Text of Aristotle’s Categories: “De interpreta- tione”, “De mundo’, “De virtutibus et vitiis” and of Porphyry’s “Introduc- tion”. Oxford: Clarendon Press.",
      "bbox": {
        "l": 75.0,
        "b": 419.0,
        "r": 606.0,
        "t": 491.0
      }
    },
    {
      "label": "list_item",
      "text": "Conybeare, Frederick C. (1896). “Ananias of Sirak upon Christmas”. The Expositor, 321-37.",
      "bbox": {
        "l": 75.0,
        "b": 384.0,
        "r": 606.0,
        "t": 420.0
      }
    },
    {
      "label": "list_item",
      "text": "Conybeare, Frederick C. (1897). “Anania of Sirak. His Autobiography; His tract of Easter”. Byzantinische Zeitschrift, 6, 572-84.",
      "bbox": {
        "l": 75.0,
        "b": 348.0,
        "r": 605.0,
        "t": 384.0
      }
    },
    {
      "label": "list_item",
      "text": "Ervine, Roberta; Stone, Micheal E. (2000). The Armenian Text of the “De mensuris et ponderibus” by Epiphanius of Salamis. Leuven: Peeters. Forster, Edward S. (1914). De Mundo. Oxford.",
      "bbox": {
        "l": 75.0,
        "b": 295.0,
        "r": 606.0,
        "t": 348.0
      }
    },
    {
      "label": "list_item",
      "text": "Geus, Klaus (2017). “Die ,Oikumene-Beschreibung” (Xwpoypagia oixov- hevixi) des Pappos von Alexandria und die armenische ,Welt-Schau\" (ASxarhac’oyc’) des Movses von Chorene: Zur Rezeption des Ptolemaios im Griechischen und Armenischen”, Rollinger, Robert (Hrsg.), Die Sicht auf die Welt zwischen Ost und West (750 v. Chr. - 550 n. Chr). Wiesbaa den: Harrassowitz Verlag.",
      "bbox": {
        "l": 75.0,
        "b": 188.0,
        "r": 607.0,
        "t": 295.0
      }
    },
    {
      "label": "list_item",
      "text": "Greenwood, Timothy W. (2011). “A Reassessment of the Life and Mathes matical Problems of Anania Sirakac‘i”. Revue des Etudes Arméniennes, 33, 131-86.",
      "bbox": {
        "l": 75.0,
        "b": 135.0,
        "r": 608.0,
        "t": 187.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakact",
      "bbox": {
        "l": 76.0,
        "b": 92.0,
        "r": 495.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "3",
      "bbox": {
        "l": 590.0,
        "b": 93.0,
        "r": 605.0,
        "t": 105.0
      }
    }
  ],
  "16": [
    {
      "label": "page_header",
      "text": "‘Armenia, Caucaso e Asia Centrale, 9-24",
      "bbox": {
        "l": 75.0,
        "b": 912.0,
        "r": 296.0,
        "t": 928.0
      }
    },
    {
      "label": "list_item",
      "text": "Hacikyan, Agop J. et al. (1995). The Heritage of Armenian Literature, vol. 2. Detroit: Wayne State University Press.",
      "bbox": {
        "l": 75.0,
        "b": 865.0,
        "r": 605.0,
        "t": 901.0
      }
    },
    {
      "label": "list_item",
      "text": "Hewsen, Robert H. (1968). “Science in the Seventh century”. Isis, 59(1), 32-45.",
      "bbox": {
        "l": 75.0,
        "b": 830.0,
        "r": 605.0,
        "t": 866.0
      }
    },
    {
      "label": "list_item",
      "text": "Hewsen, Robert H. (1992). The Geography of Ananias of Sirak (ASxarjac‘oyc’). Wiesbaden: Reichert.",
      "bbox": {
        "l": 75.0,
        "b": 794.0,
        "r": 605.0,
        "t": 830.0
      }
    },
    {
      "label": "list_item",
      "text": "Kendall, Calvin B.; Wallis, Faith (2016). Isidore of Seville, On the Nature of Things. Translated with notes and commentary. Liverpool: Liverpool University Press.",
      "bbox": {
        "l": 75.0,
        "b": 740.0,
        "r": 605.0,
        "t": 794.0
      }
    },
    {
      "label": "list_item",
      "text": "Lapidge, Michael (1995). “The Career of Archbishop Theodore”. Lapid- ge, Michael, Archbishop Theodore. Cambridge: Cambridge University Press.",
      "bbox": {
        "l": 74.0,
        "b": 688.0,
        "r": 606.0,
        "t": 739.0
      }
    },
    {
      "label": "list_item",
      "text": "Mahé, Jean-Pierre (1987). “Quadrivium et cursus d’études au Vile siécle en Arménie et dans le monde byzantin d’aprés le K‘nnikon d’Anania Sirakac‘i’. Travaux et Mémoires, 10, 159-206.",
      "bbox": {
        "l": 75.0,
        "b": 633.0,
        "r": 606.0,
        "t": 687.0
      }
    },
    {
      "label": "list_item",
      "text": "Muradyan, Kim (1976). Barset Kesarac’in ew nra vec‘érean hay matena- growt’yan mej. Erevan: Haykakan SSH GA Hratarakch‘ut'yun.",
      "bbox": {
        "l": 75.0,
        "b": 598.0,
        "r": 605.0,
        "t": 634.0
      }
    },
    {
      "label": "list_item",
      "text": "Orengo, A. (2009). “Anania Sirakac‘i ed Eznik Kolbac’i’. Egitto e Vicino Oriente, 32, 235-43.",
      "bbox": {
        "l": 75.0,
        "b": 562.0,
        "r": 605.0,
        "t": 598.0
      }
    },
    {
      "label": "list_item",
      "text": "Patkanean, K’erovbé (1877). Ananiayi Sirakunwoy mnac‘ordk’ banic’. St. Petersburg: Tp. Kayserakan Cemarani Gitut’eanc’.",
      "bbox": {
        "l": 75.0,
        "b": 525.0,
        "r": 605.0,
        "t": 562.0
      }
    },
    {
      "label": "list_item",
      "text": "Reale, Giovanni (1995). II trattato sul cosmo per Alessandro attribuito ad Aristotele: monografia introduttiva, testo greco con traduzione a fronte commentario, bibliografia ragionata e indici. Milano: Vita e Pensiero.",
      "bbox": {
        "l": 75.0,
        "b": 472.0,
        "r": 606.0,
        "t": 527.0
      }
    },
    {
      "label": "list_item",
      "text": "Thomson, Robert W. (1995). A Bibliography of Classical Armenian Litera- ture to 1500 AD. Turnhout: Brepols.",
      "bbox": {
        "l": 74.0,
        "b": 437.0,
        "r": 606.0,
        "t": 473.0
      }
    },
    {
      "label": "list_item",
      "text": "Thomson, Robert W. (2007). “Supplement to ‘A Bibliography of Classical Armenian Literature to 1500 AD’. Publications 1993-2005”. Le Muséon, 120(1-2), 163-84.",
      "bbox": {
        "l": 74.0,
        "b": 384.0,
        "r": 605.0,
        "t": 438.0
      }
    },
    {
      "label": "list_item",
      "text": "Thomson, Robert W. (2012). Saint Basil of Caesarea and Armenian Cosmol- ogy. A Study of the Armenian Version of Saint Basil's Hexaemeron and Its Influence on Medieval Armenian Views About the Cosmos. Leuven: Peeters.",
      "bbox": {
        "l": 75.0,
        "b": 313.0,
        "r": 606.0,
        "t": 384.0
      }
    },
    {
      "label": "list_item",
      "text": "Tihon, Anne (1994). Etudes d’astronomie byzantine. Aldershot: Brookfield. Variorum Collected Studies.",
      "bbox": {
        "l": 75.0,
        "b": 277.0,
        "r": 605.0,
        "t": 313.0
      }
    },
    {
      "label": "list_item",
      "text": "Warntijes, Immo (2010). The Munich Computus, Text and Translation: Irish Computistics Between Isidore of Seville and the Venerable Bede and Its Recepton in Carolingian Times. Stuttgart: Franz Steiner Verlag.",
      "bbox": {
        "l": 74.0,
        "b": 223.0,
        "r": 605.0,
        "t": 277.0
      }
    },
    {
      "label": "list_item",
      "text": "Wolska-Conus, Wanda (1989). “Stéphanos d’Athénes et Stéphanos d’A- lexandrie. Essai d’identification et de biographie”. Revue des Etudes Byzantines, 47, 5-89.",
      "bbox": {
        "l": 74.0,
        "b": 170.0,
        "r": 605.0,
        "t": 224.0
      }
    },
    {
      "label": "list_item",
      "text": "Yegavian, Zaven (ed.) (2005). Matenagirk’ Hayoc’, vol. 4. Antelias: Arme- nian Catholicosate of Cilicia.",
      "bbox": {
        "l": 75.0,
        "b": 135.0,
        "r": 606.0,
        "t": 170.0
      }
    },
    {
      "label": "page_footer",
      "text": "Pambakian. Tradition and innovation in the Cosmology of Anania Sirakac'i",
      "bbox": {
        "l": 186.0,
        "b": 92.0,
        "r": 606.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "ey",
      "bbox": {
        "l": 75.0,
        "b": 93.0,
        "r": 90.0,
        "t": 106.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 681,
      "h": 978
    },
    "2": {
      "w": 681,
      "h": 978
    },
    "3": {
      "w": 681,
      "h": 978
    },
    "4": {
      "w": 681,
      "h": 978
    },
    "5": {
      "w": 681,
      "h": 978
    },
    "6": {
      "w": 681,
      "h": 978
    },
    "7": {
      "w": 681,
      "h": 978
    },
    "8": {
      "w": 681,
      "h": 978
    },
    "9": {
      "w": 681,
      "h": 978
    },
    "10": {
      "w": 681,
      "h": 978
    },
    "11": {
      "w": 681,
      "h": 978
    },
    "12": {
      "w": 681,
      "h": 978
    },
    "13": {
      "w": 681,
      "h": 978
    },
    "14": {
      "w": 681,
      "h": 978
    },
    "15": {
      "w": 681,
      "h": 978
    },
    "16": {
      "w": 681,
      "h": 978
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}