{
  "1": "Armenia, Caucaso e Asia Centrale\nRicerche 2018\na cura di Carlo Frappi e Aldo Ferrari\nTradition and Innovation in the Cosmology\nof Anania Širakac'i\nStephanie Pambakian\n(University of St Andrews, Scotland)\nAbstract Anania Širakac'i was a 7th century AD Armenian mathematician trained in the Byzantine\nEmpire whose works embrace treatises in various fields of science. Of the almost 30 texts attrib-\nuted to him, most await investigation. His Cosmology is the focus of our research, and we highlight\nits elements of similarity with Greek tradition, in particular with St Basil's Hexameron, and in the\nArmenian tradition, to which Anania brings novelty especially in his deeper understanding of astro-\nnomical phenomena. We suggest that this work, like Isidore's De Natura Rerum, represents a new\ngenre of Christian literature, and attempts to understand it through the meaning of Cosmos found\nin Aristotle's De Mundo.\nSummary 1 Introduction. - 2 The Autobiography and Anania's Alexandrian Formation. - 3 The Corpus\nof Anania's Works. - 4 The Cosmology.-4.1 The Text.-4.2 A Possible Dedicatee-4.3 Sources. - 4.4 From\nthe Land of the Greeks... to Armenian Literature. - 4.5 A New Genre. - 4.6 Methodology. - 5 Conclusion.\nKeywords Anania Širakac'i. Armenia. Cosmology. Tradition and innovation. 7th century AD.\n1 Introduction\nAnania Širakac'i, also known as Anania of Širak or Anania Širakuni, is\nregarded within the Armenian tradition as the father of mathematical\nsciences. Active in the 7th century AD, he is considered the first Armenian\nscholar to have imported a set of scientific notions, and examples of\ntheir applications, from the Greek-speaking schools into 'early Medieval'\nArmenia. Writings attributed to him cover a vast array of subjects, including\namongst others, arithmetic, computation, astronomy, astrology and natural\nphilosophy. According to tradition, his writings and teachings are the heart\nof the autonomous development of these fields in the Armenian language,\nand, significantly, statues of him have been erected in prominent public\nspaces in the Armenian capital, Yerevan. Nevertheless, studies on this\nscholar are still at a relatively early stage: the exact form and breadth\nof his works is not yet established with certainty despite the survival of\na large number of manuscripts carrying texts attributed to him. As it\nEurasiatica 11 ISSN [online] 2610-9433 | ISSN [print] 2610-8879\nDOI 10.30687/978-88-6969-279-6/004 | Submitted: 2018-05-21 | Accepted: 2018-06-03\nISBN [ebook] 978-88-6969-279-6 | ISBN [print] 978-88-6969-280-2\n©2018 | Creative Commons Attribution 4.0 International Public License\n9",
  "2": "Armenia, Caucaso e Asia Centrale, 9-24\nis often the case with Armenian codices, surviving copies are late and\nmiscellaneous, adding difficulty to the already arduous identification of a\nhomogeneous body of works.\nAfter a small introduction of what is known about Anania Širakac'i's\neducation and scholarly formation, we shall give a brief account of the\ninformation we have been able to gather on his known attributed works,\nwarning the reader that we have relied on secondary literature and do not\nwish to make claims over the texts' authorship, but rather to report data as\nit stands at the moment. Once this background is set, we shall move on to\nthe main focus of this paper, the Tiezeragitut'iwn (Shuqunuqhunniphiu) or\nCosmology attributed to Anania Širakac'i, with a special emphasis on the\naspects of this work which belong to a traceable tradition and those that\nmight represent an innovation, especially in regard to Armenian science.\nWe shall also point to some elements of this work that deserve deeper\nexamination.\n2 The Autobiography and Anania's Alexandrian formation\nAnania's Autobiography (hupuultuuшqip) Ink'nakensagrut'iwn\noffers information about his development as a scholar and about his\ncareer which helps to date his active period. It is a first-hand account\nof a mathematician's education in the seventh century, and his formation\nin the Byzantine Empire, where this Armenian scholar sought a suitable\nteacher. Anania himself tells us:\nI desired to pursue philosophy. I was particularly lacking in the science\nof mathematics, since I reckoned that nothing could be worked out\nwithout numbers, esteeming [this science] the mother of all knowledge.\n(Transl. Greenwood 2011, 138)¹\nWhat features most prominently is information relevant to his studies and\neducation, so that we are told of his first instruction on Armenian literature\nand the Scriptures.\nSince no-one could be found in this country of Armenia who knew philoso-\nphy, and not even books of the sciences could be found anywhere, [...] I\nmade my way to the country of the Greeks. (Transl. Greenwood 2011, 138)\nIn Theodosiopolis, Anania was advised to find a mathematician named\nK'ristosatur, but only six months later he decided to look for a more sat-\n1 Greenwood's addition to the text.\n10\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i",
  "3": "Armenia, Caucaso e Asia Centrale, 9-24\nisfactory teacher, and headed to Constantinople. On his way, he crossed\npaths with some friends of his who recommended that he go to Trebizond,\nwhere a master could accept him as a student.\nHere this Autobiography includes another story, that of the life and\ncurriculum of Tychicos, Anania's instructor for eight years. We are in-\nformed that he could speak and write in Armenian, a skill he acquired\nwhile campaigning in Armenia under a Byzantine general. He then trav-\nelled to Jerusalem in search of science and learning, spent three years in\nAlexandria, some time in Rome, and finally lived and studied many years\nin Constantinople. Says Anania of Tychicos:\n[In Constantinople] he encountered a celebrated figure, a master from\nAthens, city of philosophers. [...] a few years later the master died and\nnone of his pupils were found to be of the same level in order to succeed\nto his position. They begged the much-missed Tychikos to come and take\nhis place. (transl. Greenwood 2011, 141)\nThe identity of this most revered master is uncertain. Greenwood discusses\nthe possibility that this scholar may be Stephanos of Alexandria, based\non the hypothesis argued by Wolska-Conus that a certain Stephanos of\nAthens should be identified with the same Stephanos of Alexandria, in-\nvited to Constantinople by the emperor Heraclius to revive the teaching\nof mathematical sciences (Greenwood 2011, 149; Wolska-Conus 1989).\nThe importance of this possible connection with Alexandria should not\nbe underestimated, for it might help position this scholar within the broad-\ner context of scientific teaching in Western Europe, where the Alexandrian\ntechniques for calendrical computations were being adopted or rejected\nto different degrees (see Warntjes 2010, xxx-xxxiii). We thus expect Ana-\nnia's writings on astronomical tables and computations of religious feasts\nto be especially significant to our understanding of these mathematical\nsciences and their application in this period. We are equally hopeful that\ncomparisons of works on natural philosophy shall bear interesting fruit\nand enhance our understanding of the transmission of ideas in this cen-\ntury. However, a careful re-assessment and analysis of Anania's attributed\ncorpus has to be addressed one item at a time.\n3 The Corpus of Anania's works\nA formidable reputation as a polymath is unsurprisingly bestowed on Ana-\nnia Širakac'i, due to the array of topics covered by the surviving works\nattributed to him. Although our present paper is only going to focus on\nthe Cosmology, we shall very briefly to assess the state of philological\nresearch on this author. The most extensive assessment of his work was\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n11",
  "4": "Armenia, Caucaso e Asia Centrale, 9-24\ncarried out by Abrahamyan and Petrosyan (Abrahamyan 1940, 1944, 1962;\nAbrahamyan, Petrosyan 1979) and their volumes remain of fundamental\nimportance for whomever ventures into this field. Another extremely pre-\ncious tool for research is Anasyan's bibliographical compilation, dating\nfrom 1959 (731-774). Resources available in English, French or Italian are\nscarce and offer no clarity about the range and identity of Anania's works.²\nSome of these treatises' attributions have been unchallenged for about\nsixty years, or in some cases even over a hundred, so that a great part of\nAnania's attributed works did not withstand the scrutiny of several genera-\ntions of scholars. That is to say, most of Anania's heritage has not yet had\nthe benefit of being reassessed and refined by more recent philological\nscience, by new comparisons across oriental studies and by any new de-\nvelopments springing from research on these centuries between 'late late\nantiquity' and 'early middle ages', labels that sound all the more unhelpful\nwhen stretched as far as Armenia. However, it is far from our intention to\ndispute Anania's responsibility for any of the texts, at this stage, and we\nare only concerned with making a case for caution. Scholars should treat\nthis material carefully, bearing in mind that Armenology is still a field of\npioneers, lest hypotheses are elevated to truth without being verified.\nIt is important to mention that some texts have attracted more schol-\narly attention than others, such as the Geography, historically attributed to\nMovses Khorenac'i, then non-unanimously attributed to Anania Širakac'i,\nand which has occasionally been a matter of a discussion that is unresolved\nto this day. Moreover, some other works attributed to Anania have very\nrecently enjoyed the careful examination of scholars, for example the Ma-\nthematical Problems (Greenwood 2011), or the treatise On Weights and\nMeasures, which Ervine and Stone identified as an Armenian version of the\nDe Mensuris et Ponderibus by Epiphanius of Salamis (Ervine, Stone 2000).\nConcerning the Cosmology, Orengo has recently dispelled Abrahamyan's\nclaim that it used Eznik as a source, and proposed that a number of images\ncommon to both authors had circulated in Greek literature for centuries be-\nfore (2009). It goes without saying that a new critical edition and translation\nof the Cosmology would contribute to encourage more analyses of this sort.\nParallel to the study to be carried out on this specific text, it is our\nintention to publish an updated list complete with bibliographical infor-\nmation about each item of this 'preliminary' corpus. In fact we consider\n2 Hewsen proposed a list in English, that is unreliable (1968, 40-5). It was then reprinted\nas an Appendix to his Geography with unsubstantial variations, where the author adds a\nparagraph redirecting the reader to Anasyan's list, which he does not seem to have con-\nsulted (1992, 279-83).\n3 An overview of the problem of attribution may be found in Hewsen 1992, 7-15, who ac-\ncepts Eremyan's attribution to Anania Širakac'i. Others defend the original attribution to\nKhorenac'i, see for instance Geus 2017.\n12\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i",
  "5": "Armenia, Caucaso e Asia Centrale, 9-24\nit a fundamental tool for further research on Anania Širakac'i. This work-\nin-progress relies on Abrahamyan's anthologies as a starting point (1940,\n1944, 1962) against which we then sought correspondence with Anasyan's\nlist. In addition to these, the selected work re-printed in volume 4 of Mat-\nenagirk' Hayoc' (henceforth MH 2005) contain references to texts that are\nin neither.\nSo far we have been able to identify 29 pieces, including numerical\ntables without comments and works whose authorship has been openly\ndisputed (such as the Geography). It seems appropriate here to offer some\nexamples of the variety of topics covered by these texts. Some deal with\narithmetic, such as Arithmetic (Zuuunnnniphiu, hamarołut'iwn), On odd\nand even numbers (Յաղագս դար եւ կոճար թուոg, yałags dar ew kočar\nt'uoc'), On Problems and Solutions (Bunuqu hunguшu ti niduuu, yalags\nharc'man ew lucman), Mathematical Pastimes (or (Jeux) pour les festins,\nIʊpшháшuшчшup, xraxčanakank'); metrics, like the above mentioned\nArmenain version of De Mensuris et Ponderibus; astronomy, for example\nin Tables of the Motions of the Moon (lunдшup дupшghp дniunj, xorank'\nĕnt'ac'ik' lusoy), Cycle 532 (GLP pnjnnul, 532 bolorak), On the Rotation\nof the Skies (Յաղագս շրջագայութեան երքնից, yałags šrjagayut'ean\nerk'nic'); liturgical calendars, with the Discourse on the Epiphany of the\nLord (Xun \"h jujunчphi tunu\", čar \"i haytnut'iwn tearn\"), the Di-\nscourse on Easter (Xun «h quunuh untunu», čar \"i zatki tearn\") and more.\nThe list will help future researchers to begin their investigations with\nfewer time-consuming diversions.\n4 The Cosmology\n4.1 The Text\nThe main focus of our current research, as mentioned, is the Cosmology at-\ntributed to Anania Širakac'i. This text was edited by Abrahamyan in 1940,\nfrom the manuscripts M2180, M2762, M1979 and M1973 (MH 2005, 592;\nwith a reprint of the text 712-48). The so-called \"middle\" recension was\npublished in 1877 in Patkanean's collection of works attributed to Anania,\nalthough the manuscripts on which it is based are not specified (reprinted\nin MH 2005, 749-66). Alongside other copies preserved at the Matena-\ndaran depository in Yerevan, our catalogue searches have also revealed a\ncopy in Venice, at the Mkhitarist library of San Lazzaro (V1332), and two\nin the library of St James in Jerusalem: J656, and J1288 (fragmentary). In\n4 The English title is our own.\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n13",
  "6": "Armenia, Caucaso e Asia Centrale, 9-24\ntotal, we have so far been able to locate 18 copies of this text, including\nthose that only preserve parts of it.\nIn Western scholarship, the Cosmology text knew little circulation: Mahé\nhas translated parts of the long version into French (1987, 196-7), and\nsome have also been translated into English (Hacikyan et al. 1995, 62-\n80), although the latter are of little scientific value since they translate\nAbrahamyan's version in modern Eastern Armenian (1979, 64-114) rather\nthan his edition in Classical Armenian.\nAlthough Abrahamyan's distinction between a long, a middle and a short\nversion has not yet been contested, it was not properly received into later\nscholarship. The version he labelled as 'middle', which corresponds to the\ntext edited and published by Patkanean in 1877, is now often referred to as\n'short', whilst the original text that Abrahamyan intended to name 'short'\nwas never published on its own, and was thus soon forgotten. To avoid\nconfusion, we shall maintain the labels 'long' and 'middle'. Our research on\nthe manuscript tradition is not yet developed enough to comment fruitfully\non these versions. It is nonetheless important to lay out the most important\ndifferences between these traditional 'long' and 'middle' versions. The two\nare very similar for the most part: the long version only presents a few\npassages here and there which do not appear in the middle version, with\nthe exception of chapters 5 and 10, where additional material is consider-\nably more extensive than elsewhere.\"\nPatkanean's middle edition begins with chapter «On the Sky>>, and\ncounts 10 chapters in total (Patkanean 1877, 34-65), the last of which, <<On\nthe Zodiac Signs», was later judged by Abrahamyan as a work separate\nfrom the Cosmology. Despite rejecting this last chapter, Abrahamyan's\n'long' Cosmology still counts 10 chapters, as it is provided with an intro-\nduction, whose title, In the fulfilment of a promise, interestingly hints at\nthe existence of a patron or a recipient of this work.\nWhat is described in this premise to the long version is coherent with\nthe structure of the following chapters:\n... And after taking up this subject from them in our work, let us lay down\nthis treatise, beginning with the sky and coming to the earth. To then\nreturn once more to the sky, elevating ourselves with the mystery of the\ncosmos we shall be content at making this treatise proceed, chapter by\nchapter. (Cosmology I)'\n5 This short version is preserved in M1979.\n6 We are simply describing the quantitative difference between the versions rather than\npassing judgement upon which parts were added and which were curtailed in relation to\na lost original.\n7 All quotations from the Cosmology are presented in our own translation.\n14\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i",
  "7": "Armenia, Caucaso e Asia Centrale, 9-24\nIn fact, we see in the chapter list that the topics covered go from the sky\nto the earth, and then slowly rise back up to the clouds, the stars, the\nmoon and sun:\n1. In fulfilment of a vow, i.e. a preface on the author's approach to\nscience and philosophy (present only in the long recension);\n2. On the sky, describing the universe structure composed of concen-\ntric spheres;\n3. On the earth, mainly concerned with the four elements and their\ninteraction;\n4. On the sea, which talks about the waters and their divisions;\n5. On celestial bodies, dealing both with the physical sky and with the\nmyths of astrology;\n6. On what is between the sky and earth, on the elements and mete-\norological phenomena;\n7. On the milky way, a very short overview of what it is in myth and\nin reality;\n8. On the northern stars, about the usefulness of stars for man, espe-\ncially at sea;\n9. On the moon, on the nature of the moon and its behaviour;\n10. On the sun, on the nature of the sun and its behaviour.\n4.2 A Possible Dedicatee\nTrusting that the first introductory chapter is authentic, which is, for now,\nbeyond proof, one may speculate about the possible identity of the persons\nto whom the 'promise' to be 'fulfilled' was made. It is possible that this\ncosmological work was commissioned by a king, or a nakharar (noble-\nman), like the similar and almost contemporary On the Nature of Things,\ncomposed in Latin by Isidore of Seville, and dedicated to king Sisebut; but\nit seems fruitless to pursue such a hypothesis in the absence of evidence,\nand knowing so little about Anania's Armenian entourage. There might be\nmore to support the idea that the Cosmology's dedicatee could have been\nCatholicos Anastas (661-667), as the tenth-century historian Yovhannes\nDrasxanakertc'i, in his History of the Armenians (uniphiu <ujng,\nPatmut'iwnk' Hayoc') includes a brief account of how the Catholicos re-\nquested Anania to produce a fixed calendar (Greenwood 2011, 133). One\nmay suggest that this was not the only work commissioned to Anania,\nand that other pieces, such as the Cosmology, were also made under the\npatronage of the Holy See.\n8 The chapter selection and order follow Abrahamyan's.\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n15",
  "8": "Armenia, Caucaso e Asia Centrale, 9-24\n4.3 Sources\nDespite a reliable critical edition not being available yet, it is possible\nto identify a number of sources and precise references for parts of the\nCosmology. This endeavour is sometimes made easier by direct men-\ntions of authorities within the text itself. Muradyan highlighted a num-\nber of references in the Cosmology that point mainly to Church Fathers\nand the Bible (Muradyan 1976); Orengo pointed at the connections with\na Greek tradition that includes Achilles Tatius and Carneades (2009);\nand our work-in-progress is adding even more references to the list.\nBiblical quotations are mainly drawn from the Pentateuch and\nPsalms, and the author often mentions St Paul, 'The Apostle' or Movses\nas authorities. Given that we read in the Autobiography that Anania\nwas well versed in the Divine Scriptures (Greenwood 2011, 138), it is\npossible that he quoted by heart rather than copying. In regard to the\nmajority of quotations drawn from Genesis, however, his use of the\nBible is mediated, since they are included in his extensive borrowings\nfrom St Basil of Caesarea (4th century). Beyond St Basil, there are\nother doctors upon whose works the Cosmology relies, mentioned by\nname: Philo (of Alexandria), St Gregory ('vardapet of the Armenians',\ni.e. The Illuminator) and Amphiolocus (Cosmology III.44) who is pre-\nsumably Amphiolocus of Iconium, although the reference has not yet\nbeen identified.\nThe Author of the Cosmology certainly knew St Basil's Discourse on\nthe Six Days of Creation, or Hexameron very well, and quotes exten-\nsively from it, with or without acknowledgements. As already noted by\nMuradyan (1976), these quotations and references were not translated\nfrom a Greek version of this work, but rather drawn directly from its\nArmenian version. Comparing these texts, we have been able to find\ncorrespondences verbatim, although they often include mistakes, cuts,\nlosses or modifications; some bear a very close resemblance, others\njust display similar content. The Author of the Cosmology does not\nseem to make use of all nine homilies, but draws mainly from III, IV\nand VI, although parallels and resemblances also extend to other parts.\nAccordingly, not all topics considered by St Basil make an appearance\nin the Cosmology, whose overall structure is differently organised, as\nwe shall remark below.\nHere is an example of a passage in which chapter 6 of the Cosmology\nowes much to St. Basil's IV Homily, with very slight modifications on\nthe sentence order. Our present homily, however, deals with the world-\nencircling sea which is the most extensive, longest and broadest of all,\nequal in comparison with the earth. Let no one persist in opposition\nto this description or name the lakes 'seas', although they might\nhave a salty and bitter taste, and being bounded by sand might\n16\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i",
  "9": "Armenia, Caucaso e Asia Centrale, 9-24\nseem to be in the form of an extensive sea. (St. Basil Hom. VI.4\n[113], transl. in Thomson 2012, 125; emphasis added)'\nAnd so the Cosmology echoes this passage:\nAnd there are many more land-locked seas that are not from the world-\nsea, despite having this salty and bitter taste, and having sandy\nshores just like those of the big sea. However, it is not possible to\ncall lakes 'sea'. (Cosmology IV.12-3; emphasis added)\nDespite Anania's reliance on St Basil's Hexameron and on other late-antique\nscholars, some ideas are much harder to ascribe to a specific source: some\nPlatonic, Aristotelian and Ptolemaic theories were widely accepted, such as\nthe theory of the four elements, the division of the earth and sky into con-\ncentric spheres and other notions of natural philosophy. Others are literary\nimages used to explain certain concepts, phenomena or arguments that date\nto the Classical and Hellenistic period, or further back, which were used by a\nnumber of scholars or schools, and whose diffusion is hard to assess. For this\nlatter group, examples include the image of the egg to describe the cosmos\n(Cosmology III, see Orengo 2009, 241-2), or some of the arguments against\nthe casting of horoscopes, already put forward by Carneades (Orengo 2009,\n236-8). It is important to underline that, even when it is impossible to tell\nprecisely via which source a certain set of images and information have\nentered the Cosmology, their presence, acceptance and inclusion in the\ntext may still be significant for the transmission and circulation of ideas,\nas they add to a picture that may be seen with better clarity in the future.\n4.4 From the Land of the Greeks... to Armenian Literature\nAs regards the notions expressed in the Cosmology in the fields of astronomy,\nphysics or meteorology, nothing constitutes novelty or new discovery in a\nwide context of Greek science. However, most of them represent a burst of\nnew ideas within the tradition of cosmological writing in Armenian literature.\nAfter the Bible itself, the first and foremost literary precedent in which views\non the physics of the universe are exposed, the next item with cosmological\ninterest is the Refutation of Sects, also known as De Deo, a theological treatise\nwritten in Classical Armenian by the fifth-century scholar Eznik Kołbac'i.10\n9 Henceforth all quotations of the Hexameron are from Thomson's English translation.\n10 The most complete overview on cosmological ideas in Armenia may be found in Thom-\nson 2012, 31-50.\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n17",
  "10": "Armenia, Caucaso e Asia Centrale, 9-24\nWhilst Eznik and Anania repeat similar remarks on (or rather, against)\nastrology, which seem to derive from the same ancient tradition, their\nviews on the mechanics of the sky are very different. For example, Eznik's\nunderstanding of the origin of moonlight, the phases of the moon and the\ncause of eclipses is quite poor, whilst Anania's explanations show him to\nhave well understood the teachings of classical astronomers.\nLet us, for instance, compare the passages in which the light of the moon\nand its phases are discussed. Eznik exposes his understanding of pagan\ncosmological ideas to then disagree with them:\nAnd the moon does not have its own light, but rather it comes from the\nsun, they [the pagans] say, that from whatever side the sun comes to be,\nfrom that very side light begins to emanate to it. (Eznik, De Deo III.1\n[290], transl. Blanchard, Young 1998, 156)\"\n... Once again, that the moon does not possess its own light [...]\nis a lie... (Eznik, De Deo III.8 [312], transl. by Blanchard, Young 1998,\n164; emphasis added)\nThis account does not differ much from what appears in the Cosmology's\nmain Greek source, the above-mentioned Hexameron of St Basil. Here we\nread, in Homily VI:\nLet no one say that the moon's light come from elsewhere. They\nsay that when it goes towards the sun it begins to lose its light, and\nwhen it moves away from it, it waxes and becomes full. (§3 [176-7];\nemphasis added)\nAnd later in the same Homily:\nAt its waning and decline it [the moon] is not totally deprived of its vessel\nbut of the light which participates and dwells in it... (§5 [175])\nHowever, Anania's account displays a clear understanding of this phe-\nnomenon:\nBut our predecessors who took pains to understand it [the moon], said\nthe following: that [...] it does not have light by nature, but by par-\nticipation it takes it from the sun, like a mirror being held against the\nsun[light], it also dispatches many rays from itself, in the same way they\nsay the moon does too. However two certain doctors of the Church said\n11 From here onwards all quotations from De Deo are taken from Blanchard and Young.\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n18",
  "11": "Armenia, Caucaso e Asia Centrale, 9-24\nthat the moon has got its own light and [does] not [receive it] from the\nsun. (Cosmology IX.4-6)\nUnfortunately there is not further information about these Doctors, but it\nis clear that Anania does not support their theory, and later in the same\nchapter (9), he goes on to describe moon phases and eclipses, in a way\nthat almost seems to answer the perplexities that emerge from Eznik's\npen (Cosmology IX.59 and De Deo III.8 [315]).\nAlthough this is not the place to go over each example in depth, this\npassage regarding the moon shows how ancient explanations, even if not\nunknown in Armenian translations (such as the Hexameron) or original\ntreatise-writing (such as Eznik's De Deo) are finally interpreted and ex-\npanded on by the author of the Cosmology. Here novelty is represented\nnot much by the introduction of new notions in Armenia, but rather by\ntheir reception and acceptance, which opens many questions about the\neducation of a seventh-century Christian mathematician. When it comes\nto pinning down Anania's source for correct information, we need not nec-\nessarily look for a specific written source, since it is possible that he was\ntaught these basic astronomical notions by his teacher Tychicos.\n4.5 A New Genre\nDespite drawing much from St Basil's Hexameron, Anania's work is also\nsignificant in contrast with it, most prominently as it belongs to a different\ngenre. In fact, Anania's Cosmology is not a commentary on the Scriptures,\nand its structure is not based on the account found in Genesis. The order\nin which the Cosmology unfolds its chapters and the methods it deploys\nto explain the world constitute a noteworthy innovation within Christian\ntradition.\nWhilst hexamera comment faithfully on the first book of Genesis, bibli-\ncal references are here selected in each section when functional to the\nthemes that are being exposed. Anania himself tells us that he also knows\nthe 'good pagan philosophers', and it is in this tradition that we may find\nmodels for this work. In particular, we would like to explore the possibility\nthat Anania knew the Aristotelian treatise For Alexander On the Cosmos\n(De Mundo), or works inspired by it.¹²\nIt has been traditionally held by scholars that the De Mundo was avail-\nable in Armenian as early as the sixth century (see Conybeare 1892, vi-\nviii; Bolognesi 1983, 402) thanks to a translation attributed to David the\nInvincible; however this would not be a necessary condition for Anania to\n12 On the attribution of this text, see Reale 1995, 23-57.\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n19",
  "12": "Armenia, Caucaso e Asia Centrale, 9-24\nhave been influenced by this work. He or his teacher might have known\nit from its original Greek version, or known similar didactic writing via\ndigests or derivative works. The structure of On the Cosmos is not in fact\nparticularly close to that of the Cosmology, mainly for being much stricter\nand more solid than the latter. Their resemblance lies in the general idea\nthat the universe may be described following a discourse of natural sci-\nences or physical order (i.e. from above downwards, from the small to the\nbig) rather than following Genesis.\nIt seems appropriate to point out that, around the same time, the Latin\nworld also sees a similar cosmological compendium, solidly rooted in the\nChurch Fathers' tradition but differently laid out and incorporating non-\nChristian philosophers in a synthesis that becomes a new genre: the trea-\ntise On the Nature of Things (De Natura Rerum), by Isidore of Seville, that\nwould only predate the Cosmology by a few decades, as it was written in\n611-612 (Kendall, Wallis 2016). And like Isidore's, Anania's originality may\nalso be found in his methods of bringing information together, combining\nsuch diverse sources.\nFor what concerns the history of science and of ideas, both authors offer\nan insight into a stage of development in which Christian scholars begin\nto merge exegesis with philosophy, the word and the world; and we are\ncertain that further analysis on the Cosmology and the traditions it incor-\nporates will offer material for fruitful comparisons with the Latin West, too.\n4.6 Methodology\nIn the context of Latin Christian writing, a characteristic that represents\ninnovation in On the Nature of Things is the method by which truth is\nsought within the pagan and Christian authorities quoted or reported.\nKendall and Wallis observe that Isidore \"tends to present\" pagan poets and\nphilosophers on the same level with the Church Fathers or even the Bible\n(2016, 22). It is too early for us to pass judgements on Anania's methodol-\nogy, mainly due to the state of the current edition and the fact that not all\nof his sources of information have been identified, but we would nonethe-\nless like to anticipate that this particular direction of research may yield\nuseful results, and offer material for comparison. There is one approach\nin particular that interests us, and in this, too, the themes of tradition and\nnovelty play an important role.\nWhen dealing with science, one needs to be aware that the co-existence\nof information from Christian and pagan authors does not necessarily\nbring competing explanations of the physical mechanics of the world.\nThere often are seemingly different explanations that actually deal with\ntwo different layers of investigation, that of the physical and that of the\nmetaphysical. This was already present in the Church Fathers (although\n20\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i",
  "13": "Armenia, Caucaso e Asia Centrale, 9-24\nthe distinction of these two approaches was seldom explicit), and it often\nhappens that a mechanical description of a phenomenon is subordinated\nto a metaphysical one. Similar instances are, again, also found in On the\nNature of Things, where the explanation of eclipses draws on the pagan\nHyginus, and then allegorical meanings are sought within Christian sym-\nbolism (Kendall, Wallis 2016, 21-4).\nExposing the why may sometimes come to minimise the physical de-\nscription of the how. The best example of this case is in a passage in\nCosmology IV, drawn from St Basil's Hexameron (III.7 [90]); treating the\nsea-level and its maintenance. The author discards the \"bad philosophers\"\"\ntheory that the water flowing out is as much as the water coming into the\nsea, whilst the \"good philosophers\" also consider evaporation, which may\nexplain the presence of salt and sediments, left behind by this process.\nThe whole discussion on mechanics, however, is then judged \"not pleas-\ning\" (perhaps in the sense of 'unsatisfactory') because of its inferiority to\nbiblical passages that report the divine command for the waters to have a\nboundary and not to rise above the earth. God's will settles the discussion,\neven if it belongs to another level of understanding. Similarly, Isidore also\noffers examples where the how is explained by reporting pagan traditional\ntheories, and then moves to a Christian allegorical reading of the phenom-\nenon, and therefore a metaphysical cause for it (Kendall, Wallis 2016, 21).\nEven though one may observe that different weight is given to one or\nthe other level, and that different schools or authors treat the physical and\nthe metaphysical differently, these two approaches remain deeply rooted in\nAristotelian philosophy. In the above-mentioned De Mundo, Aristotle says:\nThe Universe [Cosmos] then is a system made up of heaven and earth\nand the elements which are contained in them. But the word is also\nused in another sense of the ordering and arrangements of all things,\npreserved by and through God. (De Mundo 391b 9-12, transl. by Forster\n1914)\nAlthough we still need to understand how Anania's methodology compares\nto Platonic and neo-platonic schools at the time, and therefore to have a\ngrasp on his philosophical views, we may certainly say that future analysis\nof Anania's methods of investigation in this text may aid our understanding\nof the late antique and Christian reception of Aristotelian (and potentially\nPlatonic) epistemology. This Cosmology may help tracing their develop-\nment in the Byzantine and Armenian tradition, and offer material for com-\nparison with their better-explored Latin counterparts.\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n21",
  "14": "Armenia, Caucaso e Asia Centrale, 9-24\n5 Conclusion\nIn sum, we have presented the figure of Anania Širakac'i and shown that\nevidence from his Autobiography gives grounds upon which to approach\nhim as a recipient of a Byzantine (and perhaps Alexandrian) school of\nmathematics and natural sciences, whilst his knowledge of the Scriptures\nand exegesis had its roots in his Armenian education.\nAfter a description of the current status of his corpus, we have presented\nthe Cosmology, with a brief account of its editions, its content and of the\npossible existence of a patron for his production.\nAccounting for the traditional elements present in this work, we have\npaid special attention to its sources, which are named or silent, pagan or\nChristian. The most prominent of this last group is St Basil's Hexameron,\nquoted from its Armenian version. When treating the same content, Ana-\nnia's understanding of ancient theories is, however, superior to St Basil's,\nand to the Armenian theologian Eznik, the main Armenian precedent that\ndeals with cosmological questions.\nIdentifying the exact sources, whether direct or mediated, oral or writ-\nten, from which Anania may have learned and understood such theories\nhas not yet been possible. What may be said with certainty is that, in the\ncontext of Classical Armenian literature, the Cosmology is the first to\ninterpret and explain some of those traditional theories that had been\nmisunderstood and discarded by Eznik.\nFor respect to the structure, Anania's Cosmology does not follow suit\nin the making of a commentary on Genesis like the Church Fathers, but\nrather seems inspired by a tradition of pagan treatises. A very likely model\nfor the Cosmology might have been Aristotle's De Mundo, or another text\nbelonging to the same milieu.\nA point that deserves careful examination is the way in which Anania\ncompares and merges these traditions, that of a pagan natural philosophy,\nof a Christian natural philosophy, and of biblical exegesis. We have also\nindicated that alongside different physical accounts, some explanations\ndeal with the metaphysical, and although these are sought within Chris-\ntian and Jewish symbolism and tradition, the very approach seems to have\nAristotelian origins, as the Philosopher pointed out at the start of his De\nMundo, 'order' is intended on two levels.\nIn conclusion, when viewed as a Byzantine text, the Cosmology's origi-\nnality may be sought in the way in which pagan and Christian traditions are\ncombined (and often intrinsically intertwined), and much may be learned\nabout the 'making of science' in the context of the seventh-century. Within\nthe specific context of Armenian literature, this text deals with many as-\npect of natural philosophy in unprecedented depth.\n22\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i",
  "15": "Armenia, Caucaso e Asia Centrale, 9-24\nBibliography\nAbrahamyan, Ashot G. (1940). Tiezeragitut'iwn ev tomar. Erevan:\nHaypethrat.\nAbrahamyan, Ashot G. (1944). Širakac'u Matenagrut'yunəǝ. Yerevan: HSSR\nMatenadarani Hratarakč'utyun.\nAbrahamyan, Ashot G. (1962). Lusni parberašrjannerǝ. Erevan: Haykakan\nSSH Gitowt'yownneri Akademia.\nAbrahamyan, Ashot G.; Petrosyan, Garegin B. (1979). Anania Širakac'i\nMatenagrut'yun. Erevan: Sovetakan groł Hratarakč'utyun.\nAnasyan, Hagop S. (1959). Haykakan Matenagrut'yun 5 - 18 dd., vol. 1.\nYerevan.\nBerbérian, H. (1964). \"Autobiographie d'Anania Širakac'i\". Revue des\nÉtudes Arméniennes, 1, 189-94.\nBlanchard, Monica J.; Young, Robin D. (1998). Eznik of Kołb. On God.\nLeuven: Peeters.\nBolognesi Giancarlo, (1983). \"Remarques sur la version arménienne\nPatmowt'iwn yałags ašxarhi attribuée à David l'Invicible\". Brutian,\nGeorg Abeli; Arevshatian, S.S.; Grigorian, G.O. et al. (eds), Davit'\nAnhalt', Hin Hayastani Mec P'ilisop'an. Erevan: Haykakan SSH GA\nHratarakch'ut'yun, 402-18.\nConybeare, Frederick C. (1889). \"On the Ancient Armenian Versions of\nPlato\". The Classical Review, 3(8), 340-3.\nConybeare, Frederick C. (1892). A Collation with the Ancient Armenian\nVersions of the Greek Text of Aristotle's Categories: \"De interpreta-\ntione\", \"De mundo\", \"De virtutibus et vitiis\" and of Porphyry's \"Introduc-\ntion\". Oxford: Clarendon Press.\nConybeare, Frederick C. (1896). \"Ananias of Širak upon Christmas\". The\nExpositor, 321-37.\nConybeare, Frederick C. (1897). \"Anania of Širak. His Autobiography; His\ntract of Easter\". Byzantinische Zeitschrift, 6, 572-84.\nErvine, Roberta; Stone, Micheal E. (2000). The Armenian Text of the \"De\nmensuris et ponderibus\" by Epiphanius of Salamis. Leuven: Peeters.\nForster, Edward S. (1914). De Mundo. Oxford.\nGeus, Klaus (2017). \"Die „,Oikumene-Beschreibung\" (Xwpoуpapíα oikov-\nμεvɩкŃ) des Pappos von Alexandria und die armenische Welt-Schau\"\n(Ašxarhac'oyc') des Movses von Chorene: Zur Rezeption des Ptolemaios\nim Griechischen und Armenischen\". Rollinger, Robert (Hrsg.), Die Sicht\nauf die Welt zwischen Ost und West (750 v. Chr. - 550 n. Chr.). Wiesbaa\nden: Harrassowitz Verlag.\nGreenwood, Timothy W. (2011). \"A Reassessment of the Life and Mathes\nmatical Problems of Anania Širakac'i\". Revue des Études Arméniennes,\n33, 131-86.\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i\n23",
  "16": "Armenia, Caucaso e Asia Centrale, 9-24\nHacikyan, Agop J. et al. (1995). The Heritage of Armenian Literature, vol.\n2. Detroit: Wayne State University Press.\nHewsen, Robert H. (1968). \"Science in the Seventh century\". Isis, 59(1),\n32-45.\nHewsen, Robert H. (1992). The Geography of Ananias of Širak (Ašxarjac'oyc').\nWiesbaden: Reichert.\nKendall, Calvin B.; Wallis, Faith (2016). Isidore of Seville, On the Nature\nof Things. Translated with notes and commentary. Liverpool: Liverpool\nUniversity Press.\nLapidge, Michael (1995). \"The Career of Archbishop Theodore\". Lapid-\nge, Michael, Archbishop Theodore. Cambridge: Cambridge University\nPress.\nMahé, Jean-Pierre (1987). \"Quadrivium et cursus d'études au VIIe siècle\nen Arménie et dans le monde byzantin d'après le K'nnikon d'Anania\nŠirakac'i\". Travaux et Mémoires, 10, 159-206.\nMuradyan, Kim (1976). Barseł Kesarac'in ew nra vec'ōrean hay matena-\ngrowt'yan mej. Erevan: Haykakan SSH GA Hratarakch'ut'yun.\nOrengo, A. (2009). \"Anania Širakac'i ed Eznik Kołbac'i\". Egitto e Vicino\nOriente, 32, 235-43.\nPatkanean, K'erovbě (1877). Ananiayi Širakunwoy mnac'ordk' banic'. St.\nPetersburg: Tp. Kayserakan Čemarani Gitut'eanc'.\nReale, Giovanni (1995). Il trattato sul cosmo per Alessandro attribuito ad\nAristotele: monografia introduttiva, testo greco con traduzione a fronte\ncommentario, bibliografia ragionata e indici. Milano: Vita e Pensiero.\nThomson, Robert W. (1995). A Bibliography of Classical Armenian Litera-\nture to 1500 AD. Turnhout: Brepols.\nThomson, Robert W. (2007). \"Supplement to 'A Bibliography of Classical\nArmenian Literature to 1500 AD'. Publications 1993-2005\". Le Muséon,\n120(1-2), 163-84.\nThomson, Robert W. (2012). Saint Basil of Caesarea and Armenian Cosmol-\nogy. A Study of the Armenian Version of Saint Basil's Hexaemeron and\nIts Influence on Medieval Armenian Views About the Cosmos. Leuven:\nPeeters.\nTihon, Anne (1994). Études d'astronomie byzantine. Aldershot: Brookfield.\nVariorum Collected Studies.\nWarntijes, Immo (2010). The Munich Computus, Text and Translation: Irish\nComputistics Between Isidore of Seville and the Venerable Bede and Its\nRecepton in Carolingian Times. Stuttgart: Franz Steiner Verlag.\nWolska-Conus, Wanda (1989). \"Stéphanos d'Athènes et Stéphanos d'A-\nlexandrie. Essai d'identification et de biographie\". Revue des Études\nByzantines, 47, 5-89.\nYegavian, Zaven (ed.) (2005). Matenagirk' Hayoc', vol. 4. Antelias: Arme-\nnian Catholicosate of Cilicia.\n24\nPambakian. Tradition and Innovation in the Cosmology of Anania Širakac'i"
}