[
  {
    "key": "3NV8QXDS",
    "title": "A Little Semantic Web Goes a Long Way in Biology",
    "year": "2005",
    "authors": "Wolstencroft; Brass; Horrocks; Lord; Sattler; Turi; Stevens",
    "item_type": "bookSection",
    "place": "",
    "publisher": "Springer",
    "abstract": "We show how state-of-the-art Semantic Web technology can be used in e-Science, in particular, to automate the classification of proteins in biology. We show that the resulting classification was of comparable quality to that performed by a human expert, and how investigations using the classified data even resulted in the discovery of significant information that had previously been overlooked, leading to the identification of a possible drug-target.",
    "pub_title": "The Semantic Web – ISWC 2005:4th International Semantic Web Conference, ISWC 2005, Galway, Ireland, November 6-10, 2005. Proceedings",
    "pages": "786-800",
    "url": "",
    "tags": [],
    "notes": [],
    "pdf_status": "stored",
    "pdf_path": "data/collections/general-case-studies/pdfs/3NV8QXDS.pdf",
    "doc_type": "embedded",
    "page_count": 15,
    "avg_chars_pg": 2875,
    "language": "en",
    "extracted": true,
    "quality_score": 28.75,
    "recommendation": "",
    "has_reader": true,
    "text_quality": "good",
    "chars_per_page": 2874.6,
    "availability": "stored",
    "pdf_staged_path": "data/collections/general-case-studies/pdfs/3NV8QXDS.pdf",
    "pdf_original_name": "11574620_56.pdf",
    "pdf_staged_at": "2026-02-22T01:26:09",
    "pdf_zotero_key": "XI4C4AVM"
  },
  {
    "key": "4PSTTB2B",
    "title": "The Migration History of Humans: DNA Study Traces Human Origins Across the Continents",
    "year": "July",
    "authors": "Stix",
    "item_type": "magazineArticle",
    "place": "",
    "publisher": "",
    "abstract": "DNA furnishes an ever clearer picture of the multimillennial trek from Africa all the way to the tip of South America",
    "pub_title": "Scientific American",
    "pages": null,
    "url": "http://www.sciam.com/article.cfm?id=the-migration-history-of-humans",
    "tags": [],
    "notes": [],
    "pdf_status": "url_only",
    "pdf_path": null,
    "doc_type": "unknown",
    "page_count": null,
    "avg_chars_pg": null,
    "language": null,
    "extracted": false,
    "quality_score": null,
    "recommendation": "",
    "has_reader": false,
    "text_quality": null,
    "chars_per_page": null,
    "availability": "unavailable"
  },
  {
    "key": "GUN3KCE8",
    "title": "Resist RKB Explorer",
    "year": "",
    "authors": "",
    "item_type": "webpage",
    "place": "",
    "publisher": "",
    "abstract": null,
    "pub_title": null,
    "pages": null,
    "url": "http://www.rkbexplorer.com/explorer/",
    "tags": [],
    "notes": [],
    "pdf_status": "url_only",
    "pdf_path": null,
    "doc_type": "unknown",
    "page_count": null,
    "avg_chars_pg": null,
    "language": null,
    "extracted": false,
    "quality_score": null,
    "recommendation": "",
    "has_reader": false,
    "text_quality": null,
    "chars_per_page": null,
    "availability": "unavailable"
  },
  {
    "key": "S7ADSMJE",
    "title": "The Piazza peer data management system",
    "year": "2004",
    "authors": "Halevy; Ives; Jayant Madhavan; Mork; Suciu; Tatarinov",
    "item_type": "journalArticle",
    "place": "",
    "publisher": "",
    "abstract": "Intuitively, data management and data integration tools are well-suited for exchanging information in a semantically meaningful way. Unfortunately, they suffer from two significant problems: They typically require a comprehensive schema design before they can be used to store or share information and they are difficult to extend because schema evolution is heavyweight and may break backward compatibility. As a result, many small-scale data sharing tasks are more easily facilitated by nondatabase-oriented tools that have little support for semantics. The goal of the peer data management system (PDMS) is to address this need: We propose the use of a decentralized, easily extensible data management architecture in which any user can contribute new data, schema information, or even mappings between other peers' schemes. PDMSs represent a natural step beyond data integration systems, replacing their single logical schema with an interlinked collection of semantic mappings between peers' individual schemas. This paper describes-several aspects of the Piazza PDMS, including the schema mediation formalism, query answering and optimization algorithms, and the relevance of PDMSs to the semantic Web.",
    "pub_title": "Knowledge and Data Engineering, IEEE Transactions on",
    "pages": "787-798",
    "url": "",
    "tags": [
      "Piazza peer data management system",
      "data integration tools",
      "data integrity",
      "database",
      "decentralized architecture",
      "distributed databases",
      "optimization algorithm",
      "query answering",
      "query processing",
      "schema design",
      "schema mediation",
      "semantic mapping",
      "semantic web"
    ],
    "notes": [],
    "pdf_status": "no_attachment",
    "pdf_path": null,
    "doc_type": "unknown",
    "page_count": null,
    "avg_chars_pg": null,
    "language": null,
    "extracted": false,
    "quality_score": null,
    "recommendation": "",
    "has_reader": false,
    "text_quality": null,
    "chars_per_page": null,
    "availability": "unavailable"
  },
  {
    "key": "T3CRJCRR",
    "title": "Towards a Semantic Web of Relational Databases: A Practical Semantic Toolkit and an In-Use Case from Traditional Chinese Medicine",
    "year": "2006",
    "authors": "Chen; Wang; Wang; Mao; Tang; Zhou; Yin; Wu",
    "item_type": "bookSection",
    "place": "",
    "publisher": "",
    "abstract": "Integrating relational databases is recently acknowledged as an important vision of the Semantic Web research, however there are not many well-implemented tools and not many applications that are in large-scale real use either. This paper introduces the Dartgrid which is an application development framework together with a set of semantic tools to facilitate the integration of heterogenous relational databases using semantic web technologies. For examples, DartMapping is a visualized mapping tool to help DBA in defining semantic mappings from heterogeneous relational schemas to ontologies. DartQuery is an ontology-based query interface helping user to construct semantic queries, and capable of rewriting SPARQL semantic queries to a set of SQL queries. DartSearch is an ontology-based search engine enabling user to make full-text search over all databases and to navigate across the search results semantically. It is also enriched with a concept ranking mechanism to enable user to find more accurate and reliable results. This toolkit has been used to develop an currently in-use application for China Academy of Traditional Chinese Medicine (CATCM). In this application, over 70 legacy relational databases are semantically interconnected by an ontology with over 70 classes and 800 properties, providing integrated semantic-enriched query, search and navigation services to TCM communities.",
    "pub_title": "The Semantic Web - ISWC 2006",
    "pages": "750-763",
    "url": "http://dx.doi.org/10.1007/11926078_54",
    "tags": [],
    "notes": [],
    "pdf_status": "url_only",
    "pdf_path": null,
    "doc_type": "unknown",
    "page_count": null,
    "avg_chars_pg": null,
    "language": null,
    "extracted": false,
    "quality_score": null,
    "recommendation": "",
    "has_reader": false,
    "text_quality": null,
    "chars_per_page": null,
    "availability": "unavailable"
  },
  {
    "key": "HNXACPXD",
    "title": "Information Integration Via an End-to-End Distributed Semantic Web System",
    "year": "2006",
    "authors": "Dimitrov; Heflin; Qasem; Wang",
    "item_type": "bookSection",
    "place": "",
    "publisher": "",
    "abstract": "A distributed, end-to-end information integration system that is based on the Semantic Web architecture is of considerable interest to both commercial and government organizations. However, there are a number of challenges that have to be resolved to build such a system given the currently available Semantic Web technologies. We describe here the ISENS prototype system we designed, implemented, and tested (on a small scale) to address this problem. We discuss certain system limitations (some coming from underlying technologies used) and future ISENS development to resolve them and to enable an extended set of capabilities.",
    "pub_title": "The Semantic Web - ISWC 2006",
    "pages": "764-777",
    "url": "https://link.springer.com/content/pdf/10.1007/11926078_55.pdf",
    "tags": [],
    "notes": [],
    "pdf_status": "url_only",
    "pdf_path": null,
    "doc_type": "unknown",
    "page_count": null,
    "avg_chars_pg": null,
    "language": null,
    "extracted": false,
    "quality_score": null,
    "recommendation": "",
    "has_reader": false,
    "text_quality": null,
    "chars_per_page": null,
    "availability": "unknown"
  }
]