{
  "1": [
    {
      "label": "section_header",
      "text": "Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 170.0,
        "b": 952.0,
        "r": 584.0,
        "t": 973.0
      }
    },
    {
      "label": "section_header",
      "text": "OMAR ANCHASSI",
      "bbox": {
        "l": 324.0,
        "b": 925.0,
        "r": 430.0,
        "t": 938.0
      }
    },
    {
      "label": "section_header",
      "text": "UNIVERSITY OF BERN",
      "bbox": {
        "l": 318.0,
        "b": 903.0,
        "r": 437.0,
        "t": 917.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 318.0,
        "b": 903.0,
        "r": 437.0,
        "t": 917.0
      }
    },
    {
      "label": "text",
      "text": "This article explores how mulakallimiin engaged with competing visions of the cosmos—traditionalist and Aristotelian-Ptolemaic—to the beginning of the sixth/ twelfth century. Drawing on works of kaldm, Quran commentary, and items from other genres, I demonstrate that rationalist theologians remained divided on such questions as the shape of the earth tothe end ofthis period. These disagreements, ‘moreover, cannot be explained in terms of school affiliation. Based on a compre- hensive examination of published sources, I argue that cosmographical opinion among mutakallimiin was a function of exposure to late ancient learning, intellee- ‘ual formation, and personal inclination more than doctrinal commitment.",
      "bbox": {
        "l": 178.0,
        "b": 728.0,
        "r": 576.0,
        "t": 872.0
      }
    },
    {
      "label": "text",
      "text": "In 219/834 Ahmad b. Hanbal (d. 241/855) was hauled before the caliphal confidante Ishq b. Ibrahim (d. 235/850) for interrogation (i.., mitna).! Shown “an image of the heavens and the earth and other such things,” Ibn Hanbal responded with confusion. “I know noth- ing about it,” he protested, “I do not know what this is (md adri ma hadhd).”? It is not clear why cosmography—ideas concerning the physical structure of the cosmos*—featured in this reported encounter between theological “rationalism” and “traditionalism.”* We know that Ibn Hanbal pitted himself against a range of adversaries, among whom the Baghdad",
      "bbox": {
        "l": 98.0,
        "b": 574.0,
        "r": 658.0,
        "t": 700.0
      }
    },
    {
      "label": "text",
      "text": "Author's note: 1 thank the following (in alphabetical order) for their comments on drafts of this article: Feray ‘Coskun, Ahmed El Shamsy, Nahyan Fancy, Yossef Rapoport, Kevin Reinhart, and Emilie Savage-Smith. I extend ‘my thanks to Robert Morrison for his constructive criticism, to the three anonymous reviewers for JAOS for their suggestions, and to others, who are acknowledged below, for discussions of specific points in this essay. A list of abbreviations used for publications in references can be found atthe end of the article. This study is dedicated to my parents, my first and most important teachers.",
      "bbox": {
        "l": 98.0,
        "b": 451.0,
        "r": 658.0,
        "t": 539.0
      }
    },
    {
      "label": "text",
      "text": "1, For Isha b. Ibrahim’s involvement in the mifna from the outset (as chief of the Baghdad police, shurta), see Muhammad b. Jair al-Tabasl, The History of al-Tabari, vol. 32: The Reunification of the ‘Abbasid Caliphate, tt. C. E. Bosworth (Albany: SUNY Press, 1987), 199; J. A. Nawas, Al-Ma’min, the Inquisition, and the Quest for Caliphal Authority (Atlanta: Lockwood Press, 2015), 39-60.",
      "bbox": {
        "l": 98.0,
        "b": 391.0,
        "r": 658.0,
        "t": 449.0
      }
    },
    {
      "label": "text",
      "text": "2. Hanbal b. Ishaq (d. 273/886), Dhikr mihnat al-imdm Akad b. Hanbal, ed. M. Naghash (Cairo: Die Nashe al-Thagafa, 1403A), 42; idem, Kisdb al-Mihna, ed. A. al-Hanball and M. al-Qabbant (Riyadh: Markaz al-Malik Faysal, 1440/2019), 96-97. The latter editors speculate that he may have been shown an image or a book on the subject. On an image of “the universe with its spheres,” see M. Cooperson, Al Ma?mun (Oxford: Oneworld, 2005), 104, Hanbal b. Ishq was a cousin of Ahmad b. Hanbal, and received this report from him direct.",
      "bbox": {
        "l": 98.0,
        "b": 316.0,
        "r": 658.0,
        "t": 389.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 316.0,
        "r": 658.0,
        "t": 389.0
      }
    },
    {
      "label": "text",
      "text": "3. Binyamin Abrahamov (art. World, EQ, 5: S51-S4) notes that there is no quranic term for “cosmos”; the clos- est equivalent is “the heavens and the earth” (al-samawat wa--ard), The word lam, a better fit is a loanword from Hebrew or Aramaie/Syriae.",
      "bbox": {
        "l": 98.0,
        "b": 271.0,
        "r": 657.0,
        "t": 314.0
      }
    },
    {
      "label": "text",
      "text": "4. My use of theological “rationalism” and “traditionalism” is taken from B, Abrahamov’s Islamic Theology: Traditionalism and Rationalism (Edinburgh: Edinburgh Univ. Press, 1998), ix-xi (this particular formulation of the binary comes, ultimately, from George Makdisi). The usefulness of these terms has been critiqued, but I feel they remain valuable, as the reason-tradition binary is intemal to the Islamic tradition, For Sherman Jackson's critique, see his On the Boundaries of Theological Tolerance in Islam: Abi Hamid al-Ghazdits Faysal al-Tafriga Bayna al-slim wa al-Zandaga (Oxford: Oxford Univ. Press, 2002), 19-29; idem, Islam and the Problem of Black Suf- Jering (New York: Oxford Univ. Press, 2009), 10. In this article, I use the terms “traditionalist” and “proto-Sunni” interchangeably when speaking of the formative period. On the term “proto-Sunni,” see M. Kuiper, “The Roots ‘and Achievements of the Early Proto-Sunni Movement: A Profile and Interpretation,” The Muslim World 104.1-2 (2014): 71-88",
      "bbox": {
        "l": 98.0,
        "b": 122.0,
        "r": 658.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 122.0,
        "r": 658.0,
        "t": 269.0
      }
    },
    {
      "label": "text",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 97.0,
        "b": 96.0,
        "r": 397.0,
        "t": 110.0
      }
    },
    {
      "label": "page_footer",
      "text": "851",
      "bbox": {
        "l": 636.0,
        "b": 98.0,
        "r": 655.0,
        "t": 109.0
      }
    },
    {
      "label": "page_footer",
      "text": "Ibtps://doi.org/10.7817/ja0s.142.4.2022.a1033",
      "bbox": {
        "l": 97.0,
        "b": 43.0,
        "r": 321.0,
        "t": 56.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "852",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Muttazilis.* We also know that this period marked the apogee of the Translation Movement, which brought the corpus of late ancient learning, including astronomy, into Arabic.° One wonders which vision of the cosmos Ibn Hanbal’s Mu‘tazili persecutors subscribed to, tradi tionalist or Aristotelian-Ptolemaic. 7 Later sources suggest that the rationalist mutakallimiin (exponents of kaldm, dialectic theology) were typically hostile to the Aristotelian-Ptolemaic “science of the stars” (‘ilm al-nujiim), an amalgam of astrology and astronomy for much of this period,* and that this system had long been established as the regnant “scientific” paradigm in the Near East. The overall significance of the episode, nevertheless, remains unclear.",
      "bbox": {
        "l": 97.0,
        "b": 816.0,
        "r": 658.0,
        "t": 973.0
      }
    },
    {
      "label": "text",
      "text": "While Ibn Hanbal’s confusion sheds little light on the faultlines between theological ratio- nalism and traditionalism in the third/ninth century, it does raise interesting questions. We are relatively well informed about the traditionalist cosmography and its sources, but know far less about the relevant views of the mutakallimiin.'° A number of important studies have addressed the physical theory of kalidm, but these are focused on “kalam atomism [. . .] the one notable exception [. . .] ends in the eleventh century and does not explore later",
      "bbox": {
        "l": 98.0,
        "b": 706.0,
        "r": 658.0,
        "t": 811.0
      }
    },
    {
      "label": "list_item",
      "text": "5. C. Melchert, “The Adversaries of Ahmad thn Hanbal,” Arabica 44 (1997): 234-83. Melchert stresses the diversity of tba Hanbal’s opponents and de-emphasizes the significance of the Muttazlis (esp. pp. 239-45). Alnoor Dhanani notes thatthe Baghdad Mu‘tazilis formed close ties with the early Abbasids and presided over the mina; ‘A. Dhanani, The Physical Theory of Kalam: Atoms, Space, and Void in Basrian Mu‘wcilt Cosmology (Leiden: EJ Brill, 1994), 8. Cf. Nawas, 4l-Ma’miin, the Inuisiton, 31-37. On the “genealogy” of the Baghdad and Basran schools, see D. Bennett, “The Mu‘tazli Movement (1: The Early Mutazlis,” in The Oxford Handbook of Islamic Theology, ed. S. Schmidtke (Oxford: Oxford Univ. Pres, 2016), 142-88, at 144-45. See also S. Schmidike, “The Mu'tazili Movement (ID): The Scholastic Phase,” in ibid. 159-80, at 159-60. Sabine Schmidtke holds that it is anachronistic to speak of Baghdad and Basran schools in this period.",
      "bbox": {
        "l": 97.0,
        "b": 512.0,
        "r": 658.0,
        "t": 644.0
      }
    },
    {
      "label": "list_item",
      "text": "6. The classic treatment ofthe Translation Movement is D. Guas, Greek Thought, Arabic Culture: The Gracco- Arabic Translation Movement in Baghdad and Early Abbasid Society (2nd--th/Sth-10th Centuries) (Oxford: Rout- ledge, 1998) For a refutation of Ignéc Goldziher’s claims about traditionalist opposition to the Greek sciences, see esp. pp. 166-75.",
      "bbox": {
        "l": 97.0,
        "b": 451.0,
        "r": 658.0,
        "t": 509.0
      }
    },
    {
      "label": "list_item",
      "text": "7. On the contrast between the two views, see J. F. Ragep, “Islamic Culture and the Natural Sciences,” in The Cambridge History of Seience, vol. 2: Medieval Science, ed. D.C. Lindberg and M. H. Shank (Cambridge: Cam- bridge Univ. Press, 2013), 27",
      "bbox": {
        "l": 98.0,
        "b": 407.0,
        "r": 658.0,
        "t": 449.0
      }
    },
    {
      "label": "list_item",
      "text": "8. On the general hostility ofthe mutakallimin toward astrology, see R. G. Morrison, “Discussions of Astrology in Early Tafsir” JQS 11.2 (2009): 49-71, at 60-62 (for exceptions, see p. 60). On the emergence of the distinction between astronomy and astrology, see ibid. 49; idem, “Cosmography, Cosmology, and Kalém from Samargand to Istanbul,” 211 (online December 2020) 308-37, t 308-9. Forth earliest known example of a work of astronomy proper, shorn of astrological elements, see V. Mahdavi, \"Abd Sa‘ al-Sigz{ and the ‘Structure of the Orbs, the Ear- liest Known Work on Haya,” ASP 31.1 (2021): 45-94, at 71, For one early Mu‘tazl ertique of astrology, see Aba ‘Alt al-Jubbs\" (atrib), Kisdb al-Magala, ed. 0. Simsek, A 1. Sanca, and Y. Ankaner (Istanbul: Endolas, 2020), 300, The thrust ofthe critique is that astrologers are incapable of benefiting from their supposed knowledge ofthe Future (*most of them die of hunger, thirst, and poverty\"). Cf. Ibn Tawi (4 664/1266), Fara al-mahmiim ft rik Slama? al-nujim (Qom: Manshirat al-RidS, 1363h), 154-57.",
      "bbox": {
        "l": 98.0,
        "b": 257.0,
        "r": 658.0,
        "t": 404.0
      }
    },
    {
      "label": "list_item",
      "text": "9. See K. van Bladel, “Heavenly Cords and Prophetic Authority in the Quran and Its Late Antique Context.” ‘BSOAS 70.2 2007): 223-46, at 225-26; D. Janos, “QuPnic Cosmography in Its Historical Perspective: Some Notes on the Formation of a Religious Worldview,” Religion 42.2 2012): 215-31, at 223; J. E. Wright, The Early History of Heaven (New York: Oxford Univ. Press, 2000), 139-40; T. Tesei, “Some Cosmological Notions from Late Antiquity in Q 18:60-65: The Quran in Light of lt Cultural Context,” J4OS 135.1 (2015): 19-32, a 31. Only 4 minority of Christians seem to have accepted the Hebraic cosmography in this period. I use the term “scientific” with full awareness of its anachronistic application tothe premodern world",
      "bbox": {
        "l": 97.0,
        "b": 152.0,
        "r": 658.0,
        "t": 254.0
      }
    },
    {
      "label": "list_item",
      "text": "10, That is, much more has been published on the traditionalist cosmography than on the views of the ‘mutakallimin. See also M.A. Tabatabai and S. Mirsadri, “The QuPnie Cosmology as an Identity in Ise! ica 63.3-4 2016) 201-34, at 202; anos, “Qur&nic Cosmography,” 215.",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 658.0,
        "t": 149.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "853",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "developments.” In this article I aim to remedy the deficit, focusing not on atomism or “cosmology”—an extremely broad category encompassing a multitude of topics—but on the physical structure of the heavens and the earth as discussed by rationalist theologians (mostly Basran and Baghdad Mu‘tazilis, Ash‘aris, and Maturidis).'? Josef van Ess collected some of the relevant material in his monumental Theologie und Gesellschaft (1991-95), but his atten- tion is directed toward the second and third Islamic centuries; in addition, many important sources have since been edited. My focus is on the period from the second/eighth to the early sixth/twelfth centuries, viz., from the dissemination of the Aristotelian-Ptolemaic paradigm in Arabic to al-Ghazaili’s (d. 505/111) generation,",
      "bbox": {
        "l": 97.0,
        "b": 815.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "For the purposes of this article, the Aristotelian-Ptolemaic cosmography is the view that the earth is an immobile sphere, nestled in the center of a series of concentric celestial orbs or shells. The precise number of orbs or shells, and the exact nature of their interaction, along with much else, was the subject of considerable disagreement among Aristotle and Ptolemy's interpreters and interlocutors in later centuries, Muslim or otherwise. !3 Notwith- standing their divergences, however, they “were in agreement with regard to the sphericity of the Earth and its position at the center of the universe, as well as the sphericity and the circular motion of the heavens.” \" These fundamental features of the Aristotelian-Ptolemaic paradigm remained stable down to modernity, '$ and for this reason I choose to present them as a single model or paradigm,",
      "bbox": {
        "l": 97.0,
        "b": 634.0,
        "r": 658.0,
        "t": 812.0
      }
    },
    {
      "label": "text",
      "text": "This cosmography espoused by Muslim advocates of ‘iim al-nujim in the period surveyed is the alternative against which traditionalists defined themselves, as shall become clear. The traditionalist cosmography, to which I devote a separate section below, consists of belief in a flat earth, beneath which are a further six earths. Instead of the celestial spheres of the Aristotelian-Ptolemaic cosmography, there is a series of seven heavens (either domed or vaulted), above which is God’s throne (‘arsh). What lies beneath the seventh and lowermost arth was, in the traditionalist corpus, subject to considerable disagreement. Nonetheless, the basic features of the traditionalist cosmography permit one to refer to it as a single model, or paradigm, since it remains remarkably stable.",
      "bbox": {
        "l": 97.0,
        "b": 472.0,
        "r": 659.0,
        "t": 632.0
      }
    },
    {
      "label": "text",
      "text": "I make three key interventions. First, I demonstrate that, other things being equal, the disagreement between mutakallimiin on cosmographical questions broadly resembles the late ancient Christian debate on the merits of the Greek and Hebraic models of the cosmos. Then, more significantly, I establish that there is no correspondence between (rationalist) theological affiliation and cosmographical opinion. \"© That is to say, one can find Basran",
      "bbox": {
        "l": 97.0,
        "b": 382.0,
        "r": 658.0,
        "t": 470.0
      }
    },
    {
      "label": "footnote",
      "text": "11, A. Dallal, “Early Islam,” in Science and Religion around the World, e. J. H. Brooke and R. L. Numbers (New York: Oxford Univ. Press, 2011), 120-47, at 143",
      "bbox": {
        "l": 98.0,
        "b": 331.0,
        "r": 658.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 331.0,
        "r": 658.0,
        "t": 359.0
      }
    },
    {
      "label": "footnote",
      "text": "12. Dhanani, Physical Theory, 6. While mutakallimiin with other affiliations certainly existed, they do not figure in the debate qua sectarians but largely as adherents of one of these four methods. Exceptions will be noted",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 657.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 657.0,
        "t": 329.0
      }
    },
    {
      "label": "footnote",
      "text": "13. As Ibn al-Malahimt (d. 536/1142) tarlly observes, “they have no doctrine but that they disagree about it”; Ibn al-Malihiml, Kid al-Mu‘tamad ft us al-din, ed. W. Madelung (Tebran: Mirith-i Maktab, 2012), 647.",
      "bbox": {
        "l": 97.0,
        "b": 272.0,
        "r": 658.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 272.0,
        "r": 658.0,
        "t": 299.0
      }
    },
    {
      "label": "footnote",
      "text": "14, P. Omodeo and 1. Tupikova, “Cosmology and Epistemology: A Comparison between Aristotle's and Ptolemy's Approaches to Geocentrism,” in Spatial Thinking and External Representation: Towards a Historical Epistemology of Space, ed. M. Schemmel (Berlin: Pro Business Digital Printing, 2016), 145-74, at 146, butps:// ‘www.mprl-series.mpe.de/studies/8/index html. For Aristotle's views, see, ¢2.,\"On the Heavens,” in The Complete Works of Aristole: The Revised Oxford Translation, ed. J. Bares, 2 vols. (Princeton: Princeton Univ. Press, 1984), 1: 447-S11. For a useful summary of the views of Aristotle and Ptolemy and the differences between them, see E. Grant, “Cosmology,” in Lindberg and Shank, Medieval Science, 436-5, at 443-45,",
      "bbox": {
        "l": 97.0,
        "b": 167.0,
        "r": 658.0,
        "t": 270.0
      }
    },
    {
      "label": "footnote",
      "text": "15. See, eg., the defence of the immobility of the earth in three treatises of Ahmad Rida Khan (d. 1921), Fatdwa Ridawiyya, ed. R. Yash, 30 vols. (Lahore: Jamia Nizamiyya Ridawiyya, nd.) 27: 195-382",
      "bbox": {
        "l": 97.0,
        "b": 137.0,
        "r": 657.0,
        "t": 164.0
      }
    },
    {
      "label": "footnote",
      "text": "16, The demonstration of noncorrespondence is, like that of correspondence, a useful scholarly contribution (On the noncorrespondence between the theological and legal-theoretical commitments of four Shafi‘ jurists, for",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 657.0,
        "t": 134.0
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "854",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Muttazilis who are basically traditionalist in their cosmographical outlook alongside other Basran Mu‘tazilis who reject the plain-sense meaning (zahir) of the Quran’s cosmographical passages. This general rule of noncorrespondence between theological school and cosmog- raphy requires qualification: (1), the Ash‘aris are consistent in their occasionalism, which shapes their views on, e.g., the cause of the immobility (wugii/) of the earth, and (2), the Maturidis are not “genetically” or geographically linked to the other three major schools, and are therefore typically less interested in exploring questions of cosmography in a kaldm con- text.!7 With these qualifications, the rule of noncorrespondence holds. My third intervention relates to questions of diachronic development. Up to the early sixth/twelfth century there is no evidence of a trend of increasing accommodation of Greek cosmography by theologians of the four main rationalist schools. The question of the shape of the earth, for example, continued to be contested. This remained true even as the distinction between astronomy ilm al-hay?a) and astrology (ahkam al-nujiim) emerged with greater clarity, and the former was (increasingly) shorn of metaphysical assumptions—developments that would clearly facilitate such an accommodation. \"8 To make my case, I draw on the published corpus of kala treatises of the period, along with Quran commentaries authored by theologians, and, occasionally, works from other genres. My evidentiary basis for these conclusions is com- prehensive, though by no means exhaustive, and will admittedly have to be revised as new sources come to light",
      "bbox": {
        "l": 97.0,
        "b": 634.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "I begin with a brief survey of quranic cosmography. I then proceed to explore traditional- ist doctrine, and whether and to what extent it represents a departure from the vision of the cosmos presented in the Quran, I also attempt a characterization of traditionalist attitudes toward rival nontraditionalist viewpoints. These are necessary contexts for the study of the cosmography of the mutakallimiin, representing the standard against which they reacted. Their discussions show evidence of extensive engagement with cosmographical traditional- ism, sometimes by way of critique and at other times of adherence, in preference to the Greek alternatives. I then address the cosmographical views of individual rationalist theologians whose works are extant or whose opinions are preserved in later sources in more or less chronological order. This discussion forms the bulk of the paper.",
      "bbox": {
        "l": 97.0,
        "b": 454.0,
        "r": 658.0,
        "t": 631.0
      }
    },
    {
      "label": "text",
      "text": "Thave made a number of choices about terminology. I write of traditionalist “cosmogra- phy” rather than the more typical “cosmology,” the term Anton Heinen used in his seminal study and translation of al-Hay?a al-saniyya of al-Suyiiti (d. 911/1505).'° While “cosmol- ogy” is broader than “cosmography” and suggests the “divinely governed order of the uni- verse and the place of humans within it,”2 and “cosmography” has no clear parallel in the traditionalist lexicon, the most proximate equivalent being hay’a, though this is not used",
      "bbox": {
        "l": 97.0,
        "b": 346.0,
        "r": 658.0,
        "t": 451.0
      }
    },
    {
      "label": "text",
      "text": "example, see M. Eissa, The Jurist and the Theologian: Speculative Theology in Shaft Legal Theory (Piscataway, NJ: Gorgias Press, 2017), esp. 44, 48",
      "bbox": {
        "l": 97.0,
        "b": 286.0,
        "r": 658.0,
        "t": 314.0
      }
    },
    {
      "label": "footnote",
      "text": "17, The Baghdad and Basran Mu‘tazilis, along with the Ash‘aris (and unlike the Maturidis), “are not only geographically proximate to each other [.. J they are genetically linked”; Dhanani, Physical Theory, 6. On AbO ‘Mansdral-Maturfdt (d. 333/944) and his school, see U. Rudolph, 4l-Maturidf and the Development of Sunni Theo!- ‘ogy in Samargand, . R. Adem (Leiden: Brill, 2015). Although Rudolph emphasizes the (mostly negative) influence of the Baghdad Mu‘tazili Abd al-Qasim al-Ka‘bi (d. 319/931) on the theology of al-Maturidl (pp. 158-59), there remain fundamental differences between this relationship and that of al-Ash‘ar (d. 324/935. to the Mu‘tazilis—for ‘example, al-MaturldT makes no reference to atomism in his Kitdb al-Tawhid (p. 245), an omission that would be inconceivable for al-Ash‘at.",
      "bbox": {
        "l": 97.0,
        "b": 167.0,
        "r": 658.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 167.0,
        "r": 658.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "18, On these developments, se, e., Dallal, “Early Islam,” 123-24,",
      "bbox": {
        "l": 116.0,
        "b": 151.0,
        "r": 450.0,
        "t": 164.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 151.0,
        "r": 450.0,
        "t": 164.0
      }
    },
    {
      "label": "list_item",
      "text": "19, ALSuyAlf, Islamic Cosmology: A Study of as-Suyi?s al-Hay°a as-santya ff -hay’a as-sunniya, ed. and tr A.M. Heinen (Beirut: Franz Steiner, 1982),",
      "bbox": {
        "l": 97.0,
        "b": 122.0,
        "r": 656.0,
        "t": 149.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 122.0,
        "r": 656.0,
        "t": 149.0
      }
    },
    {
      "label": "list_item",
      "text": "20. A. Neuwirth, art. Cosmology, EQ, 1: 440-57, at 448. For an overview of the uses of and distinctions",
      "bbox": {
        "l": 114.0,
        "b": 106.0,
        "r": 658.0,
        "t": 119.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "855",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "systematically in the formative period, I regard it, following David King, as appropriate.2! 1 include under this rubric a number of related discussions, such as those on the finitude of the cosmos, the causes of the immobility of the earth, and, to a lesser extent, void. Because the traditionalist cosmography includes material about the structure and composition of the heav- ens and the earth, there is a certain overlap with the discourse of the astronomer-astrologers (munajjimiin) of the period. I have already alluded to the problem of disaggregating astrol- ogy and astronomy, which needs still to be treated systematically in its Islamicate context.",
      "bbox": {
        "l": 97.0,
        "b": 849.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "In addressing the formative period of Islamic thought, in particular, one cannot avoid the problem of the dearth of extant sources. Unfortunately, these problems continue beyond the second/eighth century. Large multivolume works such as the Quran commentary (tafsir) of Abii ‘AIT al-Jubba’r (d. 303/915f,) are lost to us, surviving only in quotation (especially by later Twelver authors, because of their Mu‘tazili commitments).2> Where possible I have sought to corroborate quotations of lost works by drawing on multiple sources, including the five-volume series Mawsit‘at tafiisir al-mu‘tazila and the recently published encyclopaedic al-Tahdhtb fr al-tafsir of al-Hlakim al-Jishumi (d. 494/1101), both published in Beirut.2* As a general rule, there is a high degree of consistency in the cosmographical views attributed to early theologians by later authors. I have not noticed any notable discrepancies between different genres in this regard. Any divergences in the views attributed to particular figures will be noted where relevant.",
      "bbox": {
        "l": 98.0,
        "b": 637.0,
        "r": 659.0,
        "t": 848.0
      }
    },
    {
      "label": "section_header",
      "text": "I. THE QURANIC AND TRADITIONALIST COSMOGRAPHIES",
      "bbox": {
        "l": 192.0,
        "b": 596.0,
        "r": 563.0,
        "t": 610.0
      }
    },
    {
      "label": "text",
      "text": "The provenance of quranic cosmography has long been of interest to Western scholar ship, with theories that the seven heavens of Babylonian mythology were the (ultimate) source of Muslim belief on this point, that one cannot speak of “scientific” interest in the",
      "bbox": {
        "l": 97.0,
        "b": 535.0,
        "r": 659.0,
        "t": 587.0
      }
    },
    {
      "label": "text",
      "text": "‘between the two terms, see Morrison, “Cosmography, Cosmology, and Kaldm,” 309-10, where Morrison notes that “cosmology” has become overly capacious.”",
      "bbox": {
        "l": 97.0,
        "b": 466.0,
        "r": 658.0,
        "t": 494.0
      }
    },
    {
      "label": "footnote",
      "text": "21. 1 adopt “cosmography” out of deference to David King: see his review of Heinen, J4OS 109.1 (1989) 124-27, at 125. For a definition of cosmography as a “description or representation of the universe,” htps:/www. dictionary.com/browse/cosmography (accessed April 27, 2021)",
      "bbox": {
        "l": 98.0,
        "b": 421.0,
        "r": 657.0,
        "t": 464.0
      }
    },
    {
      "label": "footnote",
      "text": "22. For further discussion, see G. Saliba, “Islamic Astronomy in Context: Attacks on Astrology and the Rise of the Hay’a Tradition,” Bulletin of the Royal Institute for Inter-Faith Studies 2 (2002): 25-46. See also A. T. Sen, “Astrology in the Service of the Empire: Knowledge, Prognostication, and Politics at the Ottoman Cour, 1450s-1550s\" (PHD diss, Univ. of Chicago, 2016), 64-79. I thank Nahyan Fancy for referring me to this disserta- tion,",
      "bbox": {
        "l": 97.0,
        "b": 348.0,
        "r": 658.0,
        "t": 419.0
      }
    },
    {
      "label": "footnote",
      "text": "23. For partial reconstructions based on surviving fragments, see Taftr Abi ‘Alt alsJubbi?7, ed. K. M. Nabhs (Beirut: Dar al-Kutub alIimiyya, 1428/2007); D. Gimaret, Une lecture mu‘tasilite du Coran: Le Tafsie d'Abi ‘Alt al-Djubba?? (m. 303/915) partiellement reconsttué d partir de ces citateurs (Louvain: Peeters, 1995); R. W. Gwynne, “The Tafsir of Abd “Ali al-Jubba: First Steps Toward a Reconstruction with Texts, Translation, Biographi- cal Introduction and Analytical Essay” (PhD diss., Univ. of Washington, 1982). Gimaret’s reconstruction isthe most comprehensive, drawing on the broadest range of sources. On the appropriation (and citation) of Muttazili afstr texts by Twelver Shi'a, see S. A. Mourad, “The Survival of the Mu‘tazila Tradition of Quranic Exegesis in Shand Sunnt tafsir,” JQS 12.12 (2010): $3-108, at 84-86; on the adoption of Mu‘tazli theology by Twelver Shia, see H. Ansari and S. Schmidtke, “The Twelver S1 Reception of Mu‘tazilsm,” in eidem, Studies in Medieval Islamic ‘Intellectual Traditions (Atlanta: Lockwood Press, 2017), 293-308.",
      "bbox": {
        "l": 97.0,
        "b": 196.0,
        "r": 658.0,
        "t": 344.0
      }
    },
    {
      "label": "footnote",
      "text": "24. KM. Nabhi’s Mawsitat taftsir al-mutazila is based mostly on fragments cited in the Quran commentaries of al-Tast (4. 460/1067),al-Tabrist (4, $48/1153), and al-Razt (d.606/1210),",
      "bbox": {
        "l": 98.0,
        "b": 167.0,
        "r": 657.0,
        "t": 194.0
      }
    },
    {
      "label": "footnote",
      "text": "25. C. Nalino, ‘Hm al-falak: Tartkhuhu ‘ind al‘arab ft al-quriin al-wustd (Cairo: Maktabat al-Dar al“Arabiyya Kitab, 1413/1993), 105-6; I. Hehmeyer, “The Configuration of the Heavens in Islamic Astronomy.” in Roads to Paradise: Eschatology and Concepts of the Hereafter in Islam, ed. S. Ganther and T. Lawson, 2 vols. (Leiden: Brill, 2017), 1: 1083-98, at 1086. On possible Nestorian influence, see B. Radtke, “Persian Cosmography, Early Taf,",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 658.0,
        "t": 164.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 658.0,
        "t": 164.0
      }
    }
  ],
  "6": [
    {
      "label": "page_header",
      "text": "856",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "cosmos among Muslims until more than a century after the death of the Prophet,2¢ and that relationship between the pre-Islamic Arabian star lore of the rising and setting of asterisms (anwé?) and knowledge of the lunar stations (mandzil al-gamar) is doubtful?” The quranic cosmography has been described as scientifically “naive,”2* containing no reflection of the late ancient debate between supporters of the biblical and Aristotelian-Ptolemaic models of the universe, but “evidently already familiar in its rough outline to the ancient peoples of the Near East,”3° featuring seven heavens and seven earths (Q 65:12),3! above which is God’s throne, a solid edifice (e.g., Q 69:17).2? There is some disagreement about the place of the kurs7 (“footstool,” Q 2:255) in this arrangement, or indeed whether itis a discrete physi- cal structure at all.*3 There is also some dispute about the shape of the firmament according to the Quran—are the seven heavens flat or dome-shaped?**—but the firmament itself is a solid structure, held up “without pillars that you [can] see” (bi-ghayri ‘amadin tarawnaha, Q 13:2),38 which prevent it from collapsing onto the earth, by God’s leave (Q 22:65).¢",
      "bbox": {
        "l": 98.0,
        "b": 742.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "‘and Nestorian Exegesis.\" in La science dans le monde iranien @ l'épogue islamique, ed. Z. Vesel, H. Beikbaghban, and B. T. de Crussol des Espesse (Tehran: Institut Francais de Recherche en Iran, 2004), 323-35, at 332.",
      "bbox": {
        "l": 98.0,
        "b": 692.0,
        "r": 657.0,
        "t": 719.0
      }
    },
    {
      "label": "list_item",
      "text": "26. That is, until the translation of late ancient knowledge into Arabie; Nallino, “m al-falak, 137-38. Ahmad Dallal states that for over a century after the rise of Islam, “Arabs had no science”; see his Islam, Science, and the Challenge of History (New Haven: Yale Univ. Press, 2010), 10; while there is also an assertion (Tabataba\"i and Mirsadri, “Quranic Cosmology,” 223) that the heavens (excluding particular celestial bodies) hardly feature in the ‘extant pre-Islamic Arabie poetry.",
      "bbox": {
        "l": 98.0,
        "b": 616.0,
        "r": 658.0,
        "t": 689.0
      }
    },
    {
      "label": "list_item",
      "text": "27. D. M. Varisco, art. Anwi?, ED, online (accessed July 17, 2020); idem, “The Origin of the Amwd? in Arab “Tradition,” Smdia Islamica 74 (1991): 5-28, at 13-22. The system of the amd? is instead “best understood as a system for divining rain.” and therefore presupposes no degree of scientific interest (p. 22)",
      "bbox": {
        "l": 98.0,
        "b": 571.0,
        "r": 658.0,
        "t": 614.0
      }
    },
    {
      "label": "list_item",
      "text": "28, Tabatabs°i and Mirsadri, “Quranic Cosmology.” 211, 214. For an alternative view, see ABO Rayhan al-Birdint (d, 440/1048), Alberunt’s India, t. E. C. Sachau, 2 vols. (London: Kegan Paul, Trench, Trabner & Co., 1910), 1: 263.",
      "bbox": {
        "l": 97.0,
        "b": 527.0,
        "r": 658.0,
        "t": 569.0
      }
    },
    {
      "label": "list_item",
      "text": "29, Van Bladel, “Heavenly Cords,” 226. Tommaso Tesei, by contrast, holds (unpersuasively, in my view) that the Quran refers to both of the competing models, “Cosmological Notions,” 31. He cites Angelika Neuwirth (art. Cosmology, 445), who, like Edith Jachimowicz, mistakenly states the seven heavens of the Quran to be spherical, See E. Jachimowicz, “Islamic Cosmology.” in Ancient Cosmologies, ed. C. Blacker and M. Loewe (London: Allen and Unwin, 1975), 143-55, at 148. Heinen foregrounds the distinction, pointing out that later commentators on the (Quran sought to reconcile it with the Aristotelian-Ptolemaic cosmography by making precisely this move (interpret- ing the seven heavens as spheres); A. Heinen, art. Sami?, E/2, 8: 1014-18, at 1015.",
      "bbox": {
        "l": 97.0,
        "b": 421.0,
        "r": 658.0,
        "t": 524.0
      }
    },
    {
      "label": "list_item",
      "text": "30. M, Jarrar, art. Heaven and Sky, EQ, 2: 410-12, at 412. On this point, see J.P. Monferrer-Sala, “Al-Bahr al-mubit ward? al-samawet wa-al-ard. Jewish and Christian Cosmogonic Beliefs in Early Islam,” Islam and Chris- tign-Muslim Relations 22 (2011): 147-60. See also J. Dechameux, “Creation and Contemplation: The Cosmology ofthe Qurn and Its Late Antique Background (PhD diss., Université libre de Bruxelles, 2021)",
      "bbox": {
        "l": 98.0,
        "b": 361.0,
        "r": 658.0,
        "t": 419.0
      }
    },
    {
      "label": "list_item",
      "text": "31. But see Tabataba’i and Mirsadri, Quranic Cosmology,” 211, where it is claimed (unpersuasively, in my view) that Q 65:12 does not attest tothe seven earths",
      "bbox": {
        "l": 97.0,
        "b": 331.0,
        "r": 657.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "32. J. Elias, at, Throne of God, EQ, 5: 276-78, at 277.",
      "bbox": {
        "l": 115.0,
        "b": 316.0,
        "r": 386.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "33. Cl Huart-([J. Sadan], art Kurst, £2, S: 509. Jamal Elias (prev. note) notes the early opinions on the kurs? 1s knowledge,” a view we will see repeated by the mutakallimiin. On the kurst as the “place of the two feet (mawdi al-gadamayn), see ton Khuzayma (d. 311/923), Kitdb al-Tawhid wa-ithbat sfatal-rabb, ed, ‘A. al-Shahwan (Riyadh: Daral-Rushd, 1408/1988), 248-49. For the quranic verses that attracted the most discussion, see appendix",
      "bbox": {
        "l": 97.0,
        "b": 256.0,
        "r": 658.0,
        "t": 314.0
      }
    },
    {
      "label": "list_item",
      "text": "‘34, For the flatness of the quranic firmament, see Janos, “QuPénic Cosmography,” 216-17; Tabatabs'i and Mirsadri, “Quranic Cosmology.” 218-19,",
      "bbox": {
        "l": 97.0,
        "b": 226.0,
        "r": 657.0,
        "t": 255.0
      }
    },
    {
      "label": "list_item",
      "text": "435, For the early difference of opinion on whether this meant “without pillars that you [can] see,” oF “without pillars [at all,” see al-Tabatt, Jami al-baydn “an ta?wil dy al-Qur’dn, ed. A. al-Turkl et al., 6 vols. (Cairo: Hijr, 1422/2001), 13: 408-11. Al-Tabat! himself endorses the fist position (p. 411). For the late antique background of the quran pillars, ee J. Dechareux, “Maintenir le ciel en I'air « sans colonnes visibles » et quelques autres motifs de la creatio continua selon le Coran en dialogue ave les homélies de Jacques de Saroug,” Oriens Christianus 102 (2019): 237-67, at 238-43. Al quranic translations are my own,",
      "bbox": {
        "l": 97.0,
        "b": 136.0,
        "r": 658.0,
        "t": 224.0
      }
    },
    {
      "label": "list_item",
      "text": "36. On the significance of the expression “by God's leave (illd bi-idhni en Pair.” 243-50. * see Dechameux, “Maintenir le ciel",
      "bbox": {
        "l": 97.0,
        "b": 107.0,
        "r": 657.0,
        "t": 134.0
      }
    }
  ],
  "7": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 994.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "857",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1009.0
      }
    },
    {
      "label": "text",
      "text": "Heavenly ropes or cords (¢.g., Q 40:37) run along the top of this edifice, allowing it to be “traversed physically by people who arrive at them.”37 Spiritual elites are thus permitted to ascend heavenward. A plain-sense reading of the quranic text renders the earth as flat (e.g., Q88:20),*8 and the seven flat earths are (implicitly) piled atop one another like “a stack of plates.”3° All of these details were debated by Muslims, but itis important to distinguish later opinion from the content of the Quran itself. °",
      "bbox": {
        "l": 98.0,
        "b": 868.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Given the relatively late provenance of the extant sources, it is worth pausing to comment ‘on the development of traditionalist cosmography in the postquranic period. I propose that this proceeded (no later than the first half of the second Islamic century) from two major impulses. The first was the explication of quranic material on the subject. The Prophet may have done this himself, and the same may be true of Ibn “Abbas (d. 68/687) and his circle, among other early Muslims credited for their activities in tafsir.*! Much cosmographical ‘material is also attributed to transmitters of the so-called Isr@”iliyyat, ? such as Ka‘b al-Ahbar (d.ca. 32/652) and Wahb b. Munabbih (d. 131/748). Ascribing definite cosmographical views to any of these early figures is, of course, fraught with difficulty given the problems of the sources. Nonetheless, based on a perusal of the safsir of Mugatil b. Sulayman (d. 150/767), the key features of traditionalist cosmography were evidently in circulation by the time of his death in 150, that is, no later than the first half of the second century, and I shall adduce Mugatil’s rafsir as evidence of the early date of various features of this cosmography.*° The second major impulse was the attempt to situate the Prophet’s life in the context of a broader sacred history. The Sira of Ibn Ishaq (d. 150/767) is known to have originally consisted of three parts, the first of which, al-Mubtada’, addressed origins and the history of the prophets to the emergence of Islam. As such, itis extremely likely to have included cosmographical traditions.*® Unfortunately, owing to the transmission of the Sira, reconstructing this element of the text is likely to prove very challenging. #",
      "bbox": {
        "l": 98.0,
        "b": 526.0,
        "r": 659.0,
        "t": 866.0
      }
    },
    {
      "label": "list_item",
      "text": "37. Van Bladel, “Heavenly Cords,” 226",
      "bbox": {
        "l": 115.0,
        "b": 467.0,
        "r": 313.0,
        "t": 479.0
      }
    },
    {
      "label": "list_item",
      "text": "38. Eg, H. Toelle, art. Earth, EQ, 2: 2-5, at. Cf. H. al-RAwl, Shak! al-ard: Dirdsa li-talawwur alfikra Sind alarab (Baghdad: Matba‘atal-Majmat al-‘iml al-‘Tragi, 1382/1962), 3, for the pre-Islamic Arabians referring to the earth as basita “outspread (or flat)”",
      "bbox": {
        "l": 97.0,
        "b": 421.0,
        "r": 658.0,
        "t": 464.0
      }
    },
    {
      "label": "list_item",
      "text": "39. M. Cook, Muhammad (Oxford: Oxford Univ. Press, 1986), 26.",
      "bbox": {
        "l": 115.0,
        "b": 406.0,
        "r": 442.0,
        "t": 419.0
      }
    },
    {
      "label": "list_item",
      "text": "40. As emphasized by Tabatabs?i and Mirsadri, “QuPnic Cosmology.” 206,",
      "bbox": {
        "l": 115.0,
        "b": 391.0,
        "r": 489.0,
        "t": 404.0
      }
    },
    {
      "label": "list_item",
      "text": "41. Nicolai Sinai seems to accept, following Harald Motzki, that the group usually regarded as Ibn ‘Abbas’s students engaged in 1jsir. See his “The Quranic Commentary of Mugatil b. Sulayman and the Evolution of Early Tafsir Literature,” in Tafsir and Islamic Intellectual History: Exploring the Boundaries of a Genre, ed, A. Gotke and J. Pink (New York: Oxford Univ. Press, 2014), 113-43, at 122, 129.",
      "bbox": {
        "l": 97.0,
        "b": 332.0,
        "r": 658.0,
        "t": 389.0
      }
    },
    {
      "label": "list_item",
      "text": "42. On this term, see R. Tottoli, “Origin and Use of the Term /sriiyydr in Muslim Literature,” Arabica 46.2 (1999); 193-210.",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 657.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "43. I defer to Sinai, “Quranic Commentary,” 117: “we can with some confidence accept the text’ attribution to ‘Mugatil and operate with a rerminus ante quem of c. 152/770 (it may well be considerably earlier)”",
      "bbox": {
        "l": 97.0,
        "b": 271.0,
        "r": 658.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "Anthony, Muhammad and the Empires of Faith: The Making of the Prophet of Islam (Oakland: Univ. nia Press, 2020), 158-59. Ibn Ishq’s younger contemporary, Abin b. “Uthmdn al-Abmar (4. 140/757 or 200/815), is known to have written a similar work, Kitdb al-Mubtada? wa-l-mab%ath wa-l-maghd=t wa-L-wafat wa-- sagifa wa-l-ridda; H. Modartessi, Tradition and Survival: A Bibliographical Survey of Early Shi‘ue Literature, vol 1 (Oxford: Oneworld, 2003), 130,",
      "bbox": {
        "l": 97.0,
        "b": 197.0,
        "r": 657.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "45. Gordon Newby does not include any such material in his attempt to reconstruct this part; G. Newby, The Making of the Last Prophet: A Reconstruction of the Earliest Biography of Muhammad (Columbia: Univ. of South Carolina Press, 1989). However, as Franz Rosenthal notes, “Ibn Ishiq’s work on the Beginnings [. ..] can be assumed to be the source of much of the material reported by Taba”: al-Tabatl, The History of al-Tabari, vol. 1 General Introduction and From the Creation to the Flood, tt. F. Rosenthal (Albany: SUNY Press, 1989), 172 n. 26 46, For a list ofthe major recensions, see Anthony, Muhammad and the Empires of Faith, 160-65.",
      "bbox": {
        "l": 97.0,
        "b": 107.0,
        "r": 658.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 115.0,
        "b": 106.0,
        "r": 597.0,
        "t": 119.0
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "858",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "‘The traditionalists drew on the quranic cosmography and supplemented it in various ways. Their views are found in compilations of hadith,4” works of theology, ** and Quran commentaries, and are widely reported by geographers, historians, and encyclopaedists.°° Their views are also found in specialized treatises dedicated to elaborating a “tradition based” cosmography, including the postclassical al-Hay’a al-saniyya of al-Suyaty, “the most important systematization of this worldview,”*! based largely on much earlier material, from the third and fourth Islamic centuries. ? The popularity of this treatise suggests that the tra- ditionalist cosmography enjoyed a high degree of stability, at least in its basic outlines, for many centuries. The chief differences between the quranic and traditionalist systems are in points of detail. For example, the traditionalists usually stipulate a distance of five hundred years’ travel between each of the seven heavens and the seven earths, a view that seems to be",
      "bbox": {
        "l": 97.0,
        "b": 778.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "list_item",
      "text": "47. Since examples are too voluminous to lis, I limit myself to pointing out that specific theological-cosmo- graphical topics quickly came to form the subject of independent treatises, for example, the Kufan Muhammad b. “Uthman b. Abt Shayba's(d.297/910, not to be confused with the compiler of Musannaf lbn Abi Shayba, d. 235/849) Kitab al-Arsh, ed. M.al-Timsmat (Riyadh: Maktabat al-Rushd, 1418/1998)",
      "bbox": {
        "l": 98.0,
        "b": 676.0,
        "r": 657.0,
        "t": 734.0
      }
    },
    {
      "label": "list_item",
      "text": "48. Eg. al-Buthart (4. 256870), Khalg ofa! al-“ibdd wacl-radd “ald al-jahmiyya wa-ashdb alta, ed F. al-Fuhayd, 2 vols. (Riyadh: Dir Aas al-Khade?, 1425/2005), 2: 17; (Uthman b. Safldal-Darimi (4, 282/893), Kudb al-Radd ‘ala aljahmiyya, ed. G. Vitestam (Leiden: EJ. Brill, 1960), 8-12; bn Khuzayma, Kitab al-Tawhid, 248-49. For a general discussion, see ‘Abd a-Qahir a-Baghdd (d.429/1038),al-Asmd? wa-lsifat ed A. M.‘A al-Shargawt et al, 3 vols. Damascus: Dar al-Taqw, 1441/2020), 2: 486-98,",
      "bbox": {
        "l": 97.0,
        "b": 602.0,
        "r": 657.0,
        "t": 674.0
      }
    },
    {
      "label": "list_item",
      "text": "49. See appendix 1.",
      "bbox": {
        "l": 116.0,
        "b": 586.0,
        "r": 215.0,
        "t": 599.0
      }
    },
    {
      "label": "list_item",
      "text": "50. For geographical texts (advocating the Arstotelian-Prolemaic viewpoint and sometimes documenting the alternatives), see, efor the thirdninth century, Ibn Khurradadhbih (. ca. 280/893), al-Masalik wa-l-mamalik (Beirut: Dar Sadir, nd), 4-5; for the fih/leventh century, AbO “Abd Allah al-Bakrt al-Andalus (4, 487/1094, al-Masalik wa-lmamdlik, ed. 8. Ghurib, 2 vols. (Beirut Dar al-Gharb al-tslimt, 1992), 1: 53-57; and forthe sev- centhithirteenth century, Yat al-Hamaw (4. 626/1229), Mu‘jam al-buldén (Beirut: Dir Sir, 1995), 1: 16-24. See also the discussion of the translation of late ancient works into Arabic in S. M. Ahmad, A History of Arab-Islamie Geography (9-16th Century 4.D,) (Arman: Al al-Bayt Univesity, 1416/1995), 9-17. On cosmography in his- torical texts, see B. Radke, Weligeschichte und Wetbeschreibung im mittelalterichen Islam (Beitut: Franz Steiner, 1992). I thank Christian Lange for drawing my attention to this source. For examples, se al-Taba, . Rosenthal, 1: 217-49; tb Tahir al-Magdist (A fourtvtenth century), Kitab al-Bad? wa-bidrth, ed. C. Huart, 6 vols. (Cairo Maktabatal-Thaghfaal-Diniyya, nd), 1: 146-S1, 2: 7-73. For cosmography in encyclopaedias, see al-Nuwaytt (6.733/1333), Nihdyata-arab ffunin a-adab, ed. M. Qumayha et a., 33 vols. (Beirut Dar al-Kutub al-Timiyya, 2004), 1: 21-64, 187-206; Ibn Fadl Allah al“Umart (d.749/1349), Masalikal-abydr ff mamalikal-amsar, ed. K Selman al-Subart etal, 27 vols. (Beirut: Da al-Kutub alUmiyya, 2010), 1: 121-34",
      "bbox": {
        "l": 98.0,
        "b": 377.0,
        "r": 658.0,
        "t": 584.0
      }
    },
    {
      "label": "list_item",
      "text": "SI. M.Riexinger, “ALGhazali's ‘Demarcation of Science’: A Commonplace Apology inthe Muslim Reception cof Modem Seience—and Its Limitations” in Islam and Rationality: The Impact of al-Ghazall. Papers Collected on His 900th Anniversary, ol. 2, ed. F. Grifel (Leiden: Brill, 2016), 283-308, at 285. Later citations of the text are ubiquitous. David King (\"Review.” 126) refers to al-Suybt's treatise as espousing “the most conservative attitudes concerming the nature ofthe universe.” He also suggests thatthe corect til ofthe work ought to be al-Hliy’a. On an early example of the “Islamic cosmography” genre, dated tothe second half of the sixthtwelih century, see B. Radike, ‘Die alteste islamische Kosmographie: Muhammad-i Tisis ‘Ag@b ul-mahligat,” Der Islam 64 (1987) 278-88.",
      "bbox": {
        "l": 97.0,
        "b": 258.0,
        "r": 658.0,
        "t": 374.0
      }
    },
    {
      "label": "list_item",
      "text": "52. Heinen (Islamic Cosmology, 38) highlights al-SuyOi’s dependence on Abd al-Shaykh al-lsfahant (4. 369/979) in panicular:al-ay’a alsaniyya “owes almost every fragment wo him.” Fortunately, thas been edited: ‘iuab al-‘Azama, ed, Ral-Mubsrakafus,§ vols. (Riyadh: Dar al-‘Rsima, nd), See also M. Salmasi and F. Negah- ban, “Aba al-Shaykh al-tfahint,” Encyclopaedia Islamica, online accessed July 24, 2020). Th earliest work with the title Kudb al-4zama is atsibuted (Heinen, Islamic Cosmology, 48) to Ibn Abt al-Dunys (d. 281/894). Although some cosmographical data can be found in Ibn Ab al-Duny8's Kitt al-Matar wacl-ra‘d wacl-barg waslrih (See F.ab-Raggl ed., Mawsi‘at Ibn Abi al-Dunya, 7 vols. (Riyadh: Dir Atlas al-Khade, 1433/2012), 5: 537-85), no work by that tie is listed as belonging to Ibn Abi al-Duny& by any of his premodern of modem biographers, how- ever, and the attribution seems to be based solely on the ascrption in the Istanbul MS. 1 thank Arafat Razzaque for discussing this point with me",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 658.0,
        "t": 254.0
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "ANCHASSt: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "859",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "of Jewish provenance.‘ Other hadith suggest lesser distances, and in the third century tradi- tionalist theologians made attempts to reconcile these divergences.*# The throne also was a subject particularly dear to the traditionalists’ hearts. It raised the question of the locus of God, whom they insisted was above the heavens, in contradistinction to a range of theologi- cal opponents. The followers (the so-called Jahmiyya) of Jahm b. Safwan (d. 128/745f)—the “first Muslim ‘theologian’ in the full and proper sense”S*—seem to have been the first to doubt this, probably under non-Muslim influence.*7 Various hadith add further detail to our knowledge of the heavenly realm, including the existence of a cosmic animal (such as the fish, hiit) and sometimes transmogrified angels, who support the throne and keep the (flat) earth anchored in place, in some versions of the traditionalist account. * There was also occa- sional discussion of the Milky Way, no later than the third Islamic century (reporting much earlier material).*? The earth was understood to be encircled by a mountain range, Qaf.® The",
      "bbox": {
        "l": 97.0,
        "b": 760.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "list_item",
      "text": "453, Mugitilb, Sulayman, Zr, ed. ‘A. M. Shibdta,$ vols. (Beirut: Mwassasatal-Takh al‘Arabf, 1423/2002), 1: 213; 4: 389, 679. Foran interpretation ofthe “five hundred years\" hadith, see Heinen, Islamic Cosmology, 88-98 For the Jewish provenance ofthis figure, see L. Ginzberg, The Legends of the Jews, t. H. Szold, 7 vols. Philadl- phia: The Jewish Publication Society of America, 1909-38), 1:1; forthe references, 5:13. For the hadith itsel, se, ©, Musnad Ahmad b. Hanbal, ed. S. l-Arna’a eta, $0 vols. (Beirut: Muasasata-Risila, nd), 3: 282-93. The editor notes the (many) collections in which the hadith is found and points out the flaws in the relevant ansmission chains. See also al-Ifahdnt, Kua al-Azama, 3: 1047",
      "bbox": {
        "l": 97.0,
        "b": 632.0,
        "r": 657.0,
        "t": 734.0
      }
    },
    {
      "label": "list_item",
      "text": "‘4. For variants, where the distance between the heaven i given as Seventy-one, seventy-two, oF seventy-three years, see, eg, Sunan ABF Dawid, ed, 8. al-Am@t, M. K. Qurahbalall, and A. H. Allah, 7 vols. (Damascus: Dir aL-Risila alAlamiyya, 1430/2008), 7: 105; Sunan al-Tirmidt ed. B. ‘A. Mari, 6 vols. (Beirut: D&r al-Gharb al-Lslimt, 1996, 5: 348-49; al-lsfahint, Kitab al-‘Azama, 3: 1051. Reconciling the divergent reports, Ibn Khuzaymma (Kitab al-Tawhid, 250) writes that “the [pace of} travel varies; similarly, the pace of riding animals such as horse, camels, mules and donkeys [...] also varies” See also L. Holtzman and M. Ovadia, “On Divine Aboveness (al- Fawgisya): The Development of Rationaized Hadith-Based Argumentations in Islamic Theology,” in Rationaliza- tion in Religions: Judaism, Christianity and Islam, ed Y. Friedmann and C. Markschies (Berlin: De Gruyter, 2019), 224-69, a 252-33. I thank Livnat Holtzman for a prepublication version ofthe article",
      "bbox": {
        "l": 97.0,
        "b": 497.0,
        "r": 658.0,
        "t": 629.0
      }
    },
    {
      "label": "list_item",
      "text": "$5, Eg, alDavimt, Kd al-Radd, 8-12 (also pp. 25-28 of introd),al-Ifahdnt, Kt al-“Azama, 2: 543-665",
      "bbox": {
        "l": 116.0,
        "b": 481.0,
        "r": 655.0,
        "t": 494.0
      }
    },
    {
      "label": "list_item",
      "text": "56. C. Schock, “Jahm b. Safwan (d. 128/745-6) and the ‘Jahmiyya’ and Dir b. ‘Am (4. 200/815)” in Schmidike, Oxford Handbook of Islamic Theology, 55-80, at 56",
      "bbox": {
        "l": 97.0,
        "b": 451.0,
        "r": 658.0,
        "t": 479.0
      }
    },
    {
      "label": "list_item",
      "text": "7. ALBukhast, Khalg afl al‘bad, 2: 17-18 (for Jahm’s debate with one of the Sumaniyya, usually identified as Buddhists); ton ‘Abd Rabbih (4. 328/940), al‘Igd alfarid, ed. M. M. Qumayha, 9 vols. (Beirut: Dar al-Kutub al‘llmiyya, nd), 2: 252 (for his debate on God's attributes with “one of the Greeks\"). On the sources of Jahmi theology, se Schock, “Jahm,” S6-S8; Y. Kazi, Magdldtal-Jahm b. Safwdin wa-atharuha fal-firaq al-islamiya, 2 vols. Riyadh: Adwi?al-Salaf, 142612005) {thank Yast Kazi for kindly sending me a copy of his book, and fora discussion of Jahm’s theology. On the Sumaniyya generally, see G. Monno, art. Sumaniyya, EI2 9: 869-70.",
      "bbox": {
        "l": 97.0,
        "b": 362.0,
        "r": 658.0,
        "t": 449.0
      }
    },
    {
      "label": "list_item",
      "text": "‘58. Eg, hadith al-a'al (bexes or mountain goats), see alarms, Kiudb al-Radd, 19, Heinen, art. Sami? For a defense of the hadith, see tbn Taymiyya (d. 728/1328), Majmi®al-faéwd, ed. ‘A. b. M. b. Qlsim, 35 vols. (Medina: Matba‘at al-Malik Fahd, 1416h),3: 192-93 (I thank Mohammad Abu Shareea for bringing this discussion to my attention); Mugatilb. Sulayman, Tr, 1: 213; ab-sfahint, Kab al-“Azama, 3: 948-71 (on the bearers of te throne). On different solutions to the problem of what rested below the earth (the details differ considerably, see Mugatil b. Sulayman, Tafsir, 4: 403; Heinen, Islamic Cosmology, 140, 143-45. On the cosmic fish (it, see, eg. allsfahint, Kitab al-“Azama, 4: 1393-418. Michael Cook (Muhammad, 26) remarks that “the whole structure is said to have posed serious underpinning problems, to which colourful solutions were found.” See also al-Ash‘art, Magalat al-isimiyyin wa-thtlafal-musalli, ed. H. Rite (Beirut al-Ma‘had al-Alman liL-Abhath al-Shargiyya, 1426/1980), 210-12.",
      "bbox": {
        "l": 97.0,
        "b": 212.0,
        "r": 658.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "59. A. Eekat, “Ibn Rahs Test on the Milky Way: Perception ofthe Milky Way inthe Early Islamic Society.” ASP 29 (2019): 227-60; idem, “Use of the Galaxy asa Tool for Spatial and Temporal Orientation during the Early Islamic Period and up to the 15th Century.” ASP 31 (2021): 1-84",
      "bbox": {
        "l": 98.0,
        "b": 167.0,
        "r": 658.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "‘60. Mugatlb, Sulayman, Tar, 4: 109 (where the mountain is an emerald, giving the sky its “green” hue; see 1 148 on lawn, below). See also M. Steck and A. Miquel, art. KAf, £72, 4: 400-402; a-sfahint,Kiuab al-‘Azama, 4: 1484-92. Mount Qat and other elements ofthe traditionalist cosmography were often said to be constituted of precious or semi-precious stones.",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 658.0,
        "t": 164.0
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "860",
      "bbox": {
        "l": 98.0,
        "b": 999.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "six subterranean earths were depicted either as worlds unto themselves or, not infrequently, as layers of hell.*! Paradise was located immediately beneath God’s throne. The tradition alist cosmography, broadly shared by the early Shi‘a,*° is in all of its various iterations thus pregnant with meaning. To come close to God is literally to ascend, and to defy him is to be literally cast downward into hell. ©",
      "bbox": {
        "l": 98.0,
        "b": 888.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Carlo Nallino understood the presence of cosmographical traditionalism in the tafsir liter~ ature (among other genres) as evidence that early Muslims lacked even the most rudimentary scientific curiosity, but this is something of a stretch. Because Nallino cites these views by way of the Mafaith al-ghayb of al-Razi—a theologian familiar with and sympathetic to aspects of contemporaneous philosophers’ understandings of the cosmos—it only goes to prove the point that cosmographical traditionalism could and did coexist alongside more Hellenized perspectives.\" The nature of this relationship requires further study. Heinen has speculated that al-Suyai’s al-Hay’a al-saniyya may have “strengthened the foundation of the sciences of the cosmos, since it frees them from being completely derived from the works of foreigners, or non-Muslims.” On the other hand, he notes that the treatise “may have discouraged a good number of prospective students of the sciences by offering them a hay’a [. | truly in harmony with their religion.”®",
      "bbox": {
        "l": 97.0,
        "b": 670.0,
        "r": 658.0,
        "t": 884.0
      }
    },
    {
      "label": "text",
      "text": "The traditionalists occasionally expressed their hostility toward the scientific cosmogra- phy. As knowledge of the contents of translated works radiated westward from Baghdad in the third/ninth century, some in al-Andalus grumbled at the new-fangled ideas (kaldm dispu- tation no less than Aristotelian-Ptolemaic cosmography).”° $a‘id al-Andalust (d. 462/1070) reports that Aba “Ubayda Muslim b. Ahmad al-Balansi (d. 295/908), a man leamed in the science of the stars as well as law (figh) and hadith, was pilloried in verse for teaching the roundness of the earth, among other related errors.”! Another Iberian, the traditionalist",
      "bbox": {
        "l": 97.0,
        "b": 545.0,
        "r": 658.0,
        "t": 668.0
      }
    },
    {
      "label": "list_item",
      "text": "61. Mug b, Sulayman, Taft, 4: 368; Jachimowicz “Islamic Cosmology.” 147; al-Lsfabant, Kitab a-‘Azama, 4:1378-92",
      "bbox": {
        "l": 97.0,
        "b": 498.0,
        "r": 658.0,
        "t": 524.0
      }
    },
    {
      "label": "list_item",
      "text": "62. C. Lange, Paradise and Hell in Islamic Traditions (New York: Cambridge Univ. Press, 2016), 131",
      "bbox": {
        "l": 116.0,
        "b": 482.0,
        "r": 617.0,
        "t": 494.0
      }
    },
    {
      "label": "list_item",
      "text": "63. See, e, Tafiral-Qummi, ed. M. B. M. al-Abjabt etal, 3 vols. (Qom: Mu?assasat al-Imm al-Mahd, 143%), 2: 616, 3: 1003; al“AyyAsh (d, 3200932), al-Tafir, 3 vols. (Qom: Murasssat al-Ba'tha, 1421/), 3: 113; al-Kulaynt, al-Kaft, 8 vols. (Beirut: Manshardtal-Faj, 1428/2007), 8: 88-89. Additionally, there isa massive amount of relevant material (some of whichis early) in Mubammad Bagiral-Majlist (4. 1110/1699), Bihar al-anwar, 110 vols. (Beirut: Dar Thy? al-Turdth al‘Arabi, 1403/1983), vols. $4-63 (al-samd? wa-k‘dlam). This material awaits funher study.",
      "bbox": {
        "l": 97.0,
        "b": 393.0,
        "r": 658.0,
        "t": 479.0
      }
    },
    {
      "label": "list_item",
      "text": "(4. The aber-traditionalist (Uthman b, Sad al-Darim proclaims, “God is closer (agrab) tothe top of a moun- tain than its foot (asflih).” He also cites the early traditionalist Abd Allah bl-Mubrak (4. 181/797) approvingly as saying, “the top of a minaret is closer to God than its base.” See Radd al-inm al-Darimi Uthmdn b, Said “ald Bish al-Marist al“anid, ed. M. Hl al-Figh (Beirut Dar al-Kutub alUmiyya, nd), 100. For the views of Ton al-Mubarak, see F Salem, The Emergence of Early Sufi Piety and Sunni Scholatiism: ‘Abdallah b,al-Mubirak and the Formation of Sunnt Identity in the Second Islamic Century (Leiden: Brill, 016), 30.",
      "bbox": {
        "l": 97.0,
        "b": 301.0,
        "r": 658.0,
        "t": 389.0
      }
    },
    {
      "label": "list_item",
      "text": "65. Lange, Paradise and Hell, 42-43,",
      "bbox": {
        "l": 116.0,
        "b": 287.0,
        "r": 302.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "66, Nallino im al-falak, 137-40.",
      "bbox": {
        "l": 116.0,
        "b": 272.0,
        "r": 284.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "67. Ibid, 140. See, eg. a-RA2i, al-Marlibal-iya min al‘ alli, ed. M.A. Shahin, 9 vols. in 3 (Beirut Dr al-Kutub al-‘limiyya, 1420/1999), 3: 197-233.",
      "bbox": {
        "l": 97.0,
        "b": 242.0,
        "r": 657.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "68. Heinen, Islamic Cosmology, 14",
      "bbox": {
        "l": 116.0,
        "b": 226.0,
        "r": 293.0,
        "t": 239.0
      }
    },
    {
      "label": "list_item",
      "text": "69, Ibid, 1",
      "bbox": {
        "l": 115.0,
        "b": 213.0,
        "r": 176.0,
        "t": 224.0
      }
    },
    {
      "label": "list_item",
      "text": "70. On early Iberian hostility to kam, see M. Cook, “Ibn Sadi on Truth-Blindness,” Jerusalem Studies in Arabic and Islam 22 (2007): 169-78.",
      "bbox": {
        "l": 97.0,
        "b": 181.0,
        "r": 657.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "TL, S4fid al-Andalust, Kitab Tabagdtal-umam, ed. L. Shaykh (Cheikho) (Beirut: al-Matba‘aal-Kathotikiya, 1912), 64-65); ed. and wS. 1 Salem and A. Kumar, Science in the Medieval World: “Book of the Categories of Nations\", (Austin: Univ. of Texas Press, 1991, 60 (the editors make numerous mistakes in transiterating the names of jurists); D. A. King, “The Enigmatic Orientation of the Great Mosque of Cérdoba,” Suhay! 16-17 2018-19) 33-111, at 80. See appendix 2 for a translation ofthe verse.",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 658.0,
        "t": 179.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 994.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "861",
      "bbox": {
        "l": 634.0,
        "b": 999.0,
        "r": 655.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "theologian ‘Abd Allah b. Muhammad al-Qahtani (d. 383/993), denounces the same doctrine in his versified creed.”? Without delving any deeper into the subject, it seems reasonable to conclude that the traditionalists did more than assert their own cosmography. At least some of the time they actively challenged the alternatives. 78",
      "bbox": {
        "l": 98.0,
        "b": 903.0,
        "r": 658.0,
        "t": 973.0
      }
    },
    {
      "label": "section_header",
      "text": "I, COSMOGRAPHY IN EARLY KALAM: FIRST CONTACT",
      "bbox": {
        "l": 204.0,
        "b": 868.0,
        "r": 551.0,
        "t": 879.0
      }
    },
    {
      "label": "text",
      "text": "Muslim awareness of the Aristotelian-Ptolemaic cosmography predates the apogee of the Translation Movement by several decades. The earliest opinions on the subject from ‘mutakallimiin, preserved in later doxographies and other sources, already reflect familiarity with Aristotle, as noted by Josef van Ess.” Hishdm b. al-Hakam (d. 179/79Sf.), a disciple of the Shifi Imam Ja‘far al-Sadiq (d. 148/765), played the leading role in introducing cosmo- graphical questions to kalaim; his lead was followed by younger contemporaries, including Abi al-Hudhayl al-‘Allaf (d. 226/840f.) and al-Nazzam (d. 220/835 or 230/845).75 Though it is not clear precisely when the distinction between the “subtleties” (dagig, also lati, ghamid) and “main topics” (Jali!) of kalam emerged, cosmography belonged firmly to the former domain and generated disagreement from the outset. > Cosmography was a standard feature of the discourse of the mutakallimiin, and the main lines of inquiry were already well estab- lished, before they received focused elaboration at the hands of theological systematizers toward the end of the third/ninth century. Cosmographical discussion in this period occurs in the context of questions of bodies, motion, and void (ie., physics) and, to a lesser extent, in the refutation of other religions. On all of these issues, dialogue and polemical exchange with non-Muslims seem to have been the main driver of opinion. The relative paucity of material ‘on cosmography, moreover, suggests that it was rather incidental to larger, more narrowly “theological” debates.",
      "bbox": {
        "l": 98.0,
        "b": 534.0,
        "r": 659.0,
        "t": 856.0
      }
    },
    {
      "label": "list_item",
      "text": "72. Naniyyat al-Qahtdni, ed. M. Ahmad (Jeddah: Maktabat al-Suwadt, 1410/1989), 28-29: “The geometer (nuhandis) bas lied, and the munayjim is no diferent—they are both {false claimants to God's knowledge; / The Earth is round, according to both—they coincide in this opinion; / The earth, according to those of {sound} inte lect, is flat, in accordance with the truthful, clear testimony of the Quran.” For a comparable example from the Quran commentary authored jointly by alSuyOff and his teacher Jalal al-Din al-Maballt(d. 864/145), see Tir alsJlalayn, ed F. Qabiwa (Beirut: Maktabat Lubsdn, 2003), 592. In the next century, Ibn Hazm (4. 45611064) ‘would defend the quranic basis ofthe roundness ofthe earth at length in al-Fisal ft al-milal weel-ahve? wa-l-nihal, 5 vols. (Cairo: Maktabat al-Ilim al-Rlamiyya, nd), 2: 78-84",
      "bbox": {
        "l": 97.0,
        "b": 392.0,
        "r": 658.0,
        "t": 510.0
      }
    },
    {
      "label": "list_item",
      "text": "73. This can also be reasonably inferred from the titles of works of Islamic cosmography listed by Heinen (slamie Cosmology, 7-9), €, al-Hay’a al-shar‘yya, ala al-islamiyya. The use of such terms as sharia and ildmiyyais deliberately oppositional; for this argument, ee J. I Smith, An Historical and Semantic Study ofthe Term “Islam” as Seen in a Sequence of Quran Commentaries (Missoula, MT: Scholars Press, 1975). Traitional- ist reluctance to engage with the science of the stars is evident ina number of places, eg, the Hanbali theologian Ghulam Khalil (d. 275/888) writes, “Observe the stars only sparingly {and solely} as an ad to determining the times M.Jarrar, with S. Gonther, ed. and t, Doctrinal Instruction in Early Islam: The Book of the Explanation ‘Sunna by Ghuldn Khalil ( 275/888) (Leiden: Bil, 2020), 179.",
      "bbox": {
        "l": 97.0,
        "b": 271.0,
        "r": 658.0,
        "t": 389.0
      }
    },
    {
      "label": "list_item",
      "text": "74, J. van Ess, Theology and Society in the Second and Third Centuries of the Hira: A History of Religious Thought in Early Islam, vol. 1,3. O'Kane (Leiden: Brill, 017), 427-28; vol. 3, G. Golibloom (Leiden: Brill, 2018), 256-57",
      "bbox": {
        "l": 98.0,
        "b": 227.0,
        "r": 658.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "75. Dhanani, Physical Theory 8. David Bennett notes that Hishim “seems to have been the first Islamic thinker to thoroughly integrate” theology and physical theory; idem, art Hishim b. al-Hakam, £73, online (accessed Sep- tember 7, 2020),",
      "bbox": {
        "l": 98.0,
        "b": 182.0,
        "r": 658.0,
        "t": 224.0
      }
    },
    {
      "label": "list_item",
      "text": "76. On the significance of the distinction, see Dhanani, Physical Theory, 3-4; on the early history of these categories, see J. Weaver, “A Footnote to the Composition History of Magda al-isimiyyin: The internal Parallels in al-Ash‘a’s Material on the Shia.\" Journal of Abbasid Studies 4.2 (2017): 142-86, at 147-48. Fr a critique of the Mu‘tazils’ comprehensiveness in theological discussion, see Abd al-Husayn al-Malatt (d. 337/987), al-Tanbih waclradd ‘ald ahlal-ahwa? wa--bida‘ ed. S. Dedering (Istanbul: Matba‘atal-Davla, 1936), 33.",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 659.0,
        "t": 179.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "862",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "As the first theologian known to have entertained views on Greek cosmography, Hisham b. al-Hakam’s profile emerges with the faintest of clarity in the sources. He is reported to have refuted the opinion that the earth extends infinitely in all directions, which Aristotle attributes (with some variation) to Xenophanes of Colophon.” The earth’s suspension in place raised important theological questions about God’s role in the maintenance of the cos- ‘mos, hence the sustained interest of mutakallimiin in the subject. Hisham is claimed to have taught that the earth rests on a body with a tendency to ascend (jism sad), which counter- acts the earth’s tendency to fall, thus keeping the latter in place. ”* By seeking a rationalistic explanation for the earth’s suspension, as opposed to assuming it rests (e.g.) on the back of a cosmic fish, Hisham implicitly rejects the traditionalist cosmography. There is, however, no hint in the sources as to his views on the shape of the earth. Hisham is also reported to have persuaded a Zoroastrian priest (mibadh) that there is nothing beyond the (finite) cosmos, i.e,, that we would not be able to see anything or extend an outstretched hand beyond its bor- ders.” We also know that he was associated with corporealism, famously advocating God as the possessor of “a body unlike bodies,” located above the throne. It is not clear, however, ‘what bearing this had on his views on more strictly cosmographical questions.",
      "bbox": {
        "l": 97.0,
        "b": 688.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "‘Among Hishdm’s contemporaries, Abii al-Hudhayl and al-Nazzam entertained similar questions, and the extant sources are equally reticent on their views. Abii al-Hudhayl seems to have been the first mutakallim to refute the claim that the earth plummets downward per- petually. ! His argument closely recalls De Caelo: a stone dropped to the ground lands there. Were the earth indeed falling, the stone would never reach it.\" Abii al-Hudhayl also con- tended that the earth is held in place by divine fiat, without the support of ascending bodies or anything else (an implicit rejection of cosmographical traditionalism). We know some- what less about the views of al-Nazzim, whom the Mu‘tazili biographical literature suggests was both junior to and partly dependent on Hisham and Abi al-Hudhayl.® He is known to have refuied the dualists on the infinitude of the cosmos, but it is not clear if he defended an",
      "bbox": {
        "l": 97.0,
        "b": 510.0,
        "r": 658.0,
        "t": 686.0
      }
    },
    {
      "label": "list_item",
      "text": "77. Ibn ‘Abd Rabbih, al‘Tgd al-farid, 2: 251; van Ess, Theology and Society, 1: 426; Aristotle, “On the Heav- fens,” 1: 484 (Xenophanes’s view is that the earth extends infinitely downward, obviating the need to explain its suspension); Simplicius, On Aristotle On the Heavens 2.10-14, ut. I. Mueller (London: Duckworth, 2005), 62-63; L. Elders, Aristotle Cosmology: A Commentary on the De Caelo (Assen: VanGorcum, 1965), 249-50,",
      "bbox": {
        "l": 97.0,
        "b": 422.0,
        "r": 658.0,
        "t": 479.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 422.0,
        "r": 658.0,
        "t": 479.0
      }
    },
    {
      "label": "list_item",
      "text": "78. AbO al-Qasim al-Ka'bl, Kitdb al-Magalat wa-ma‘ahu Uyin al-masd?il wa-l-jawabdt, ed. H. Hansu, R. Kurdi, and A. Kurdl (Amman: Dar al-Fath, 1439/2018), 449-50; Yaqut, Mu‘jam al-bulddn, 1: 16, AL-Ka‘bt reports this view via Ja‘farb. Harb (d. 236/850); it is possible that his source for this is Kisdb al-Radd ‘ald ashab ‘al-zaba?¥atributed to Ja‘far by Ibn al-Nadim (d. 380/990). See Fihristal-Nadim, ed. A. F. Sayyid, 2 vols. in 4 (Lon- don: al-Furgan, 1430/2009), 1: 591. This view is mentioned without attribution to Hishim by al-Ash‘arl; Magalat al-isimiyyin, 326.",
      "bbox": {
        "l": 97.0,
        "b": 332.0,
        "r": 658.0,
        "t": 419.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 332.0,
        "r": 658.0,
        "t": 419.0
      }
    },
    {
      "label": "list_item",
      "text": "79, thn ‘Abd Rabbil Theory, 73. al-‘Igd al-farid, 2: 251. On the question of extracosmie void, see Dhanani, Physical",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "80. Van Ess, Theology and Society, 1: 426; al-Ash‘arl, Magaldtal-islamiyyin, 207-8, 210.",
      "bbox": {
        "l": 116.0,
        "b": 286.0,
        "r": 556.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "81. ‘Abd al-Qahir al-Baghdad, al-Farg bayn al-firag wa-bayan al-firga al-ndjiya minkum, ed. M. 1. al-Hasan (Cairo: Maktabat bn Sind, n.d), 285 (where itis attributed to the materialist Dahriyya); contrast with idem, Kitab Usa al-din (Istanbul: Dar al-Funtn, 1927), 60-61 (where it is attributed, as is usually the case, to the Sumaniyya); Thn Mattawayh (fl first half of the fith/eleventh century), al-Tadhkira ft abkdm al-jawahir wa-ba‘rid, ed 1D. Gimaret, 2 vols. (Cairo: IFAO, 2009), 1: 283 (where its attributed to the dualists); van Ess, Theology and Soci- ety, 3: 257 m3.",
      "bbox": {
        "l": 98.0,
        "b": 196.0,
        "r": 658.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "82, ALQldI ‘Abd al-Jabbar (d. 415/1025), Kitab Fad! al-‘zal wa-tabagat al-mu‘tacila, ed. F.S al-Dar al-Tonisiyya li-1-Nashr, 1393/1974), 259; van Ess, Theology and Society, 3: 257. yyid (Tunis:",
      "bbox": {
        "l": 98.0,
        "b": 166.0,
        "r": 656.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "83, ALKa'bf, Kitdb al-Magdlat, 449; al-Ash‘arl, Magdlat al-islamiyyin, 326; van Ess, Theology and Society, 3 257-88; Yaqat, Mu‘jam al-buldan, 1: 16",
      "bbox": {
        "l": 97.0,
        "b": 137.0,
        "r": 656.0,
        "t": 164.0
      }
    },
    {
      "label": "list_item",
      "text": "84. ‘Abd al-Jabbar, Fadl! al-‘izal, 254 (Ab0 al-Hudhayl precedes him in looking into questions of natural philosophy); J. van Ess, “Theology and Science: The Case of Abl Ishq an-Nazzim,” in idem, Kleine Schrifien, ed",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 657.0,
        "t": 134.0
      }
    }
  ],
  "13": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "863",
      "bbox": {
        "l": 634.0,
        "b": 999.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "opinion on the shape of the earth. *® Like his contemporaries, al-Nazzm’s opinions reflect awareness of Aristotle, whose books he is improbably claimed to have memorized. * His stu- dent al-Jahiz (d. 255/868), who preserves most of the relevant material in Kitab al-Hayawan, advocates the earth’s roundness in his al-Tarbi® wa-l-tadwir, but reports nothing from his master on the issue.*7 According to some later sources, al-Nazzim explained the earth’s immobility (sukiin) as a function of the absence of a place for it to move in.** It is not until the decades after his death that more systematic discussions of cosmography emerge",
      "bbox": {
        "l": 98.0,
        "b": 850.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Collectively, the theological triumvirs Hisham, Abii al-Hudhayl, and al-Nazzim broached some of the major cosmographical issues that would preoccupy subsequent generations of ‘mutakallimiin. Most prominently, they entertained opinions on the cause of the earth’s immo- bility and on the finitude of the cosmos, usually in opposition to various non-Muslim groups. None is known to have addressed the earth’s shape, or to have explicitly engaged with the traditionalist cosmography, however. In the case of al-Nazzim, this may be a result of his extreme scepticism toward hadith and other transmitted material, which he may have felt were beneath his attention. With respect to Abii al-Hudhayl and Hisham, the possible rea- sons for this apparent lack of engagement with traditionalism are less straightforward. The absence may be simply a function of the paucity of source material.% Nevertheless, with these foundations, the basis for more systematic exploration of cosmography in kaldim was laid.",
      "bbox": {
        "l": 97.0,
        "b": 637.0,
        "r": 659.0,
        "t": 848.0
      }
    },
    {
      "label": "section_header",
      "text": "III. THE BEGINNINGS OF SYSTEMATIZATION: THE LONG THIRD/NINTH CENTURY",
      "bbox": {
        "l": 118.0,
        "b": 599.0,
        "r": 637.0,
        "t": 611.0
      }
    },
    {
      "label": "text",
      "text": "No later than the middle of the third Islamic century, discussions of cosmography in kalam become less fragmentary, more systematic, and the relevant material is preserved in greater abundance. For the first time, significantly, we have contemporaneous attestation of cosmographical doctrine, and explicit engagement with traditionalist viewpoints. The Shi‘a, in their various manifestations, continue to play a prominent role in this period, which seems to owe much to their increasing adoption of Mu‘tazili theology. Additionally, the importance",
      "bbox": {
        "l": 97.0,
        "b": 481.0,
        "r": 659.0,
        "t": 587.0
      }
    },
    {
      "label": "text",
      "text": "H. Biesterfeldt,3 vos. (Leiden: Brill, 018), 2: 1147-69, at 1167 (fr the suggestion that al-Nazzm took his rejc- tion of atomism from Hishim; onthe rivalry between Abd al-Hudhayl and al-Nazzim, 2: 1152)",
      "bbox": {
        "l": 97.0,
        "b": 421.0,
        "r": 657.0,
        "t": 449.0
      }
    },
    {
      "label": "list_item",
      "text": "85. Al-Khayyat (4. 299/911), Kisdb al-adsdr wa--radd ‘ald Ibn al-Rawandt al-mulhid, ed. U.S. Nyberg (Cairo: Matba‘at Dar al-Kutub al-Mistiyya, 1344/1925), 32-33; J. van Ess, Theologie und Gesellschaft im 2. und 3. Jahrhundert Hidschra: Eine Geschichte des religiasen Denkens im frien Islam, 6 vos. (Betin: Walter de Gruyter, 1991-97): 6: 105-6; Ibn al-Malabimt, Kiudb al-Mu‘tamad, 677. According to al-NAsh? al-Akbar (4. 293/906) in ‘Kitab al-Awsat, the Zoroastians are in fat divided onthe question of the infinitude of the cosmos; J. van Ess, ed, Frake mu‘ucilische Haresiographie: Zwel Werke des Nas? Akbar (gest. 293 H,) (Beirut: al-Ma‘had al-Almdat -Abhith al-Sharqiyya, 1971), 74",
      "bbox": {
        "l": 97.0,
        "b": 316.0,
        "r": 658.0,
        "t": 419.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 316.0,
        "r": 658.0,
        "t": 419.0
      }
    },
    {
      "label": "list_item",
      "text": "86, Dhanani, Physical Theory, 188",
      "bbox": {
        "l": 117.0,
        "b": 301.0,
        "r": 291.0,
        "t": 314.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 301.0,
        "r": 291.0,
        "t": 314.0
      }
    },
    {
      "label": "list_item",
      "text": "87. Al-Jahiz, “al-Tarb wa-btadwir,” in Rasi?ilalsJdhic, ed. ‘A. M. Hartn, 4 vols. (Beirut: Dar al 1411/1991), 3:68.",
      "bbox": {
        "l": 98.0,
        "b": 273.0,
        "r": 658.0,
        "t": 300.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 273.0,
        "r": 658.0,
        "t": 300.0
      }
    },
    {
      "label": "list_item",
      "text": "88. Ibn Mattawayh, alsTadhkira, 1: 287; van Ess, Theologie und Gesellschaft, 6: 112; ton al-Malahimt, Kitab al-MiStamad, 649,",
      "bbox": {
        "l": 97.0,
        "b": 243.0,
        "r": 658.0,
        "t": 269.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 243.0,
        "r": 658.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "89. See the fragments of his Kitab al-Nakth edited by Josef van Ess: Das Kitab an-Nakt des Nazzdm und seine Reception im Kid al-Fuya des Gahiz: Eine Sammlung der Fragmente mit Uberseteung und Kommemar (Got- tingen: Vandenhoeck und Ruprecht, 1972), R.e-Omari, “Accommodation and Resistance: Classical Mu'tziites ‘on Hadith,” Journal of Near Easter Studies 71 (2012): 231-56, at 23S. The opposition between kaldm and hadith transmission was much les stark among the early Shi'a See, eg, H. Ansari and S. Schmidtke, “The SHI Recep- tion of Mu‘tazilism (I): Twelver Shs,” in Schmidike, Oxford Handbook of Islamic Theology, 196-214, at 197, T. Bayhom-Daou, Shaykh Mufid (Oxford: Oneworld, 005), 91-93",
      "bbox": {
        "l": 97.0,
        "b": 136.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 136.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "text",
      "text": "90. For instance, Ibn al-Nadim (ed. Sayyid, 1: $66) attributes a Kitab al-lam al-kabir to al-Nazzim, which ‘might conceivably have addressed these questions.",
      "bbox": {
        "l": 98.0,
        "b": 106.0,
        "r": 657.0,
        "t": 134.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 106.0,
        "r": 657.0,
        "t": 134.0
      }
    }
  ],
  "14": [
    {
      "label": "page_header",
      "text": "864",
      "bbox": {
        "l": 98.0,
        "b": 999.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "of teacher-disciple relationships to the transmission of cosmographical opinion becomes ever more prominent. By the end of the long third/ninth century, with the careers of major systematizers such as the Basran Mu‘tazilis Abii ‘AIT al-Jubba% and his son Abi Hashim (a, 321/933), and the chief of the Baghdad Mu‘tazilis Abi al-Qasim al-Ka‘bi, the discussion of cosmography attains a high degree of sophistication.%",
      "bbox": {
        "l": 98.0,
        "b": 887.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "The earliest cosmographical discussion in kalam for which we are not dependent on frag- ‘ments and later doxographies comes from Kitab al-Dalil al-kabir of the Zaydi Imam al-Qasim b. Ibrahim al-Rassi (d. 246/860).°2 Unlike Hisham, Abi al-Hudhayl, and al-Nazzam, al-Rasst spent most of his career in the cultural backwater of Medina, far removed from the cutting- edge developments of Baghdad and Basra. He seems to have been relatively well informed on the cosmographical opinions of various non-Muslim groups, however, most likely as the result of a sojourn in Egypt, where he is known to have interacted with Jews and Chris- tians, Al-Rassi’s cosmographical views emerge with a clarity atypical of earlier generations. He explicitly rejects cosmographical traditionalism, condemning the proto-Sunnis (hashw hadhihi al-umma) for their belief that the earth rests on the back of a fish (hit).* He advo- cates the view that the earth is kept aloft by a mixture of void and air (hawd?) beneath it, not- ing and dismissing the alternatives that the earth is, variously, the foundation of the cosmos, that it floats on a cosmic sea, that it seeks its “natural place” (as per Aristotle), and that there is only void beneath it, or only air.°® Kitab al-Dalil al-kabir contains nothing on the shape of the earth, but it is not unlikely that al-Rasst pondered this question, though extant kaldim sources do not address the issue until later in the century.9°",
      "bbox": {
        "l": 98.0,
        "b": 599.0,
        "r": 658.0,
        "t": 884.0
      }
    },
    {
      "label": "text",
      "text": "Al-Rassi’s grandson and fellow Zaydi, Imam Yahya b. al-Husayn, known as al-Hadt ila al-Hagg (d. 298/911), shared his disdain for the proto-Sunnis (ie., mushabbiha), but rec- ognized the footstool as a physical structure encompassing the heavens and the earth.” He reports the “five hundred years” hadith in order to promote a sense of God’s manifest great- ness in his readers” hearts.°* In another treatise he observes that the seven heavens and earths are held in midair (ff al-hawa?), without physical support, by virtue of divine fiat, much like Abii al-Hudhayl,® His views are subtly different from those of his grandfather, but reflect comparable assimilation of Mu‘tazili ideas and corresponding scorn for the proto-Sunnis.",
      "bbox": {
        "l": 97.0,
        "b": 454.0,
        "r": 658.0,
        "t": 596.0
      }
    },
    {
      "label": "list_item",
      "text": "91. On the significance of this phase of Mu‘azli theology, see Dhanani, Physical Theory, 9",
      "bbox": {
        "l": 116.0,
        "b": 391.0,
        "r": 567.0,
        "t": 404.0
      }
    },
    {
      "label": "list_item",
      "text": "92. AL-Qlsim b.fbrahim,al-Dalil al-kabir ft al-radd ‘ala al-zanddiga wa-L-mulhidin wa-yalthial-Radd ‘ala al-mulhid, ed. H.‘Albd lsh (Cato: Dar al-AfBq al-‘Arabiyya, 1420/2000), 45-47; van Ess, Theology and Soci- 0), 258 n.7",
      "bbox": {
        "l": 97.0,
        "b": 346.0,
        "r": 658.0,
        "t": 389.0
      }
    },
    {
      "label": "list_item",
      "text": "93. W, Madelung, art. al-Rass, £72, 8: 453-54",
      "bbox": {
        "l": 116.0,
        "b": 332.0,
        "r": 350.0,
        "t": 344.0
      }
    },
    {
      "label": "list_item",
      "text": "94. AL-Qisim b Ibrahim, a-Dal! al-kabir, 46; on the meaning ofthe expression hash, see A. S. Halkin, “The Hashwiyya,” J4OS 54.1 (1934): 1-28. For al-Qlsim’s interpretation ofthe ‘arsh and kursf, see his “Taft al“arsh ‘wa-L-kurst.\" in Mami kurub wa-ras@la-imdm Qasim b. Ibrahim al-Rasst (169-246), ed. ‘A.A. Jadabin, 2 vols Sanaa: Dar al-Hikma al-Yamniyya, 1422/2001), 1: 655-85",
      "bbox": {
        "l": 97.0,
        "b": 272.0,
        "r": 658.0,
        "t": 330.0
      }
    },
    {
      "label": "list_item",
      "text": "95. ALQisim b Ibrahim, al-Dallal-abir, 47",
      "bbox": {
        "l": 116.0,
        "b": 257.0,
        "r": 346.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "96. The authenticity of much of al-Qasim b, bvahimn’s corpus has been disputed as anachronistically reflect- ing later, more obviously Mu‘tazili perspectives. See H. Ansar, S. Schmidtke, and J. Thiele, “Zaydi Theology in Yemen,” in Schmidike, Oxford Handbook of Islamic Theology, 473-93, at 474 n. 3. However, a far as 1 know, nobody has questioned the attribution of al-Dallal-kabir",
      "bbox": {
        "l": 98.0,
        "b": 196.0,
        "r": 658.0,
        "t": 254.0
      }
    },
    {
      "label": "list_item",
      "text": "97. “Kitdb Tafsir al-kurs.” in Majma® kutub wa-ras@il al-imdm al-HadFild al-Hagg al-Qawim Yahya b aL-Husayn b. al-Qasim, ed. A. b. M. al-Shidhlt (Sada: Markaz Ahl al-Baytli-Dirdsital-lldmiyya, 14214), 205-8.",
      "bbox": {
        "l": 98.0,
        "b": 153.0,
        "r": 657.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "98. Ibid, 208,",
      "bbox": {
        "l": 116.0,
        "b": 138.0,
        "r": 187.0,
        "t": 149.0
      }
    },
    {
      "label": "list_item",
      "text": "9, “Kitab al-‘Arsh wa-L-kurst,\" in ibid, 212. In this teatise Vabya b. al-Husayn equates the throne and foot- stool with God's essence.",
      "bbox": {
        "l": 98.0,
        "b": 108.0,
        "r": 658.0,
        "t": 134.0
      }
    }
  ],
  "15": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "865",
      "bbox": {
        "l": 634.0,
        "b": 999.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Among the Imami Shifa, the mutakallim al-Hasan b. Misi al-Nawbakhtt (4. bet. 300/912 and 310/922) is known to have “adopted several theses of the Mu‘tazilf theological school.” Unlike al-RassT and al-Hadi ila al-Hagq, however, he enjoyed privileged access to the cosmographical knowledge of late antiquity through his residence in Baghdad and his association “with a group of translators of Greek philosophical works.”!°! His views on astronomy and astrology have been carefully reconstructed by Wilferd Madelung based on later texts. \" Because the relevant work has already been done, I shall mention only a few of the most pertinent cosmographical points. Al-Nawbakhtt is known to have written against ‘Abii ‘AIT al-Jubba’’s critique of the science of the stars.'° Notwithstanding this, however, al-Nawbakhif was decidedly opposed to Aristotle, the pagans of Harrn, and other exponents of that branch of learning. He produced an early account of the divergent views on the sub- ject among Muslims and non-Muslims that demonstrates extensive firsthand knowledge, including of Aristotle’s De Caelo and its commentaries. ! Al-Nawbakhti is not always con- sistent in naming some of the mutakallimiin associated with particular cosmographical opin- ions. 1° He ascribes the opinion that the earth rests “on the back of a fish [. ..] on the horn of a bull [.. .] standing on the ground (hara)” to a group among the proto-Sunnis (qawm min ahl al-hadith), without commenting on it.\" Like Abi al-Hudhayl, al-Nawbakhtl refutes the perpetual downward fall of the earth by appealing to the example of an object dropped to the ground (a feather or a clod of mud). Notwithstanding his very extensive exposure to late ancient knowledge, however, he remained “in outlook a Muslim kaldm theologian, not a phi- losopher,” and shared “the basic rationalist principles of the Mu‘tazila.” 8 His wide-ranging criticisms of the astronomers and astrologers (Madelung’s translations of munajjimiin and ashab al-ahkam respectively) was to prove a valuable source for later theologians of dispa- rate tendencies, including the idiosyncratic Hanbali Ibn al-Jawzi (d. 597/1201).!°",
      "bbox": {
        "l": 97.0,
        "b": 545.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Abii ‘Ali al-Jubba%, one of al-Nawbakhti’s key interlocutors and a pioneering figure in the “scholastic” phase of Mu‘tazilism, had much to say on cosmography, both as a mutakallim and in his capacity of Quran commentator (not to put too fine a point on the distinction). His role as the leading figure of Basran Mu‘tazilism in his generation—or even its architect, in some accounts—likely explains the devotion to preserving his opinions by scholars of later generations. Though Abii “Alf’s importance to the school came to be eclipsed by his son Abi Hashim, we are much better informed about the cosmographical opinions of the former. Abii “AIT is the first mucakallim known to have figuratively interpreted Q 18:86 (“until he reached the setting-place of the sun; he found it setting into a muddy spring”), pointing out that the",
      "bbox": {
        "l": 97.0,
        "b": 382.0,
        "r": 658.0,
        "t": 542.0
      }
    },
    {
      "label": "list_item",
      "text": "100. J. Weaver, art. al-Nawbakhif, al-Hasan b, Mas, £73, online (accessed August 15, 2020)",
      "bbox": {
        "l": 117.0,
        "b": 331.0,
        "r": 571.0,
        "t": 344.0
      }
    },
    {
      "label": "list_item",
      "text": "101. W. Madelung, “Al-Hasan b. Masa al-Nawbakhit on the Views of Astronomers and Astrologers,” in Law ‘and Tradition in Classical Islamic Thought: Studies in Honor of Professor Hossein Modarressi, ed. M. Cook etal (New York: Palgrave Macmillan, 2013), 269-78, at 269,",
      "bbox": {
        "l": 97.0,
        "b": 286.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "102. The most important source of these views, Kitdb al-Mu‘tamad ft us! al-din of Yon al-Malahimt, is now available in a much expanded edition: H. Ansari and W. Madelung, ed., Tuhfar al-mutakallimin ft al-radd ‘ala al-falasifa (Tehran: Iranian Institute of Philosophy, 2008), 114-23 (for his refutation ofthe philosophers” views on heavenly motion).",
      "bbox": {
        "l": 97.0,
        "b": 227.0,
        "r": 657.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "103. Madelung, “Al-Hasan b. Masi,” 270.",
      "bbox": {
        "l": 116.0,
        "b": 212.0,
        "r": 324.0,
        "t": 224.0
      }
    },
    {
      "label": "list_item",
      "text": "104, The account is reported at length in Ibn al falahiml, Kitdb al-Mu‘tamad, 648-83.",
      "bbox": {
        "l": 116.0,
        "b": 197.0,
        "r": 542.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "105. The opinion associated with Hisham b. example, is reported anonymously; ibid, 649. Hakam on bodies with tendencies to ascend below the earth, for",
      "bbox": {
        "l": 98.0,
        "b": 166.0,
        "r": 658.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "106. Ibid, 649-50",
      "bbox": {
        "l": 116.0,
        "b": 153.0,
        "r": 211.0,
        "t": 164.0
      }
    },
    {
      "label": "list_item",
      "text": "107. Madelung, “Al-Hasan b. Masa,” 274",
      "bbox": {
        "l": 116.0,
        "b": 137.0,
        "r": 326.0,
        "t": 149.0
      }
    },
    {
      "label": "list_item",
      "text": "108. Ibid, 277,",
      "bbox": {
        "l": 116.0,
        "b": 123.0,
        "r": 193.0,
        "t": 134.0
      }
    },
    {
      "label": "list_item",
      "text": "109. Ibn al-Jawz1, Talbis Ibis, ed. A.A. al-Tabba (Beirut: Dar al-Qalam, 14034), e.g, 76.",
      "bbox": {
        "l": 116.0,
        "b": 106.0,
        "r": 558.0,
        "t": 119.0
      }
    }
  ],
  "16": [
    {
      "label": "page_header",
      "text": "866",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "sun does not literally set into a body of water, but only appears to from afar,\"\"° and may have inaugurated this tradition of understanding the verse.\" This interpretation contradicts both the plain-sense meaning of the Quran and the widely reported hadith of the Companion Abii Dharr al-Ghifart (d. 31/652) on the rising of the sun. !? He is also known to have advo- cated the flatness of the earth against those learned in the science of the stars, apparently on uranic grounds. 3 Abii ‘AIT also rejects the view that the sky is held up by pillars; were this the case, he avers, they would have to be “massive bodies (ajsdman ghildzdn) and would be visible.” He similarly eschews most of the standard kalam explanations for the immobility of the earth on the grounds that weight is not an accident but a quality (ma‘nd) pertaining to bodies themselves. 5 Abii ‘Alf affirms the existence of seven earths (as per Q 65:12),!\"6 and denies (in one report) that any distance, gaps (sg. khalal), or clefis (fut) separate the sub- terranean levels from our own. \"7 He also refuses to identify the seven heavens (samawait) of the Quran with the celestial spheres, whose motion he implicitly concedes.\" Abii ‘AIT thus proves to be critical of the traditionalist cosmography on some points, and is no less willing to reject the Greek view on others.!!9 He is independently minded and discards popular interpretations of the Quran, or hadith, when they seem to contradict his sense of ‘what is rational. !2° His sense of rationality, however, cannot be equated with the views of the ‘munajjimiin, of whom he was, as we have seen, intensely critical.",
      "bbox": {
        "l": 97.0,
        "b": 653.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "The cosmographical views of Abi Hashim al-Jubba always occur alongside discussions of the opinions of his father, Abi ‘AIT. On many issues, including cosmography, they fail to see eye to eye; they are even said to have anathematized one another (i.¢., takfir).\"2! The information on Abii Hashim is somewhat contradictory. He is reported as advocating the roundness of the earth, as suspending judgment on the issue (while “inclining” to accept",
      "bbox": {
        "l": 97.0,
        "b": 562.0,
        "r": 658.0,
        "t": 650.0
      }
    },
    {
      "label": "list_item",
      "text": "110. Tafsir Abr ‘Alt alsJubba?, ed. K. M. Nab (Beirut: Dar al-Kutub al‘Iimiyya, 1428/2007), 368; al-Jishumt, al-Tahdhib ft al-tafsr, ed. ‘A.b. S. al-Salimt, 10 vols. (Cairo: Dar al-Kitb al-Mist, 1439), 6: 4482.",
      "bbox": {
        "l": 97.0,
        "b": 512.0,
        "r": 657.0,
        "t": 539.0
      }
    },
    {
      "label": "list_item",
      "text": "TIL. Compare the views of al-Jubba™ with those in al-Tabart, Jami al-bayn, 15: 374-75. On the variant readings of this verse, see ‘A. al-Khatib, Mujam al-gira’at, 11 vols. (Damascus: Dar Shams al-Din, 1422h), 5: 290-91; A. M. ‘Umar and ‘A. S. Makram, Mu‘jam al-gira’atal-gur’aniyya, 8 vols. (Kuwait City: Matba‘at Jima‘at al-Kuwayt, 1408/1988), 4: 9-10.",
      "bbox": {
        "l": 97.0,
        "b": 452.0,
        "r": 658.0,
        "t": 509.0
      }
    },
    {
      "label": "list_item",
      "text": "112. The most common version of this hadith, on the prostration of the sun before God's throne, is found in ‘numerous compilations. In a variant reported via the Kufan Abd ‘Abd Allah al-Hakam b. ‘Utayba (d. 113/731f}), the sun is reported to set into a hot spring. Fora thorough discussion of the transmission of the hadith and its variants, see “al-Sabth wasf al-shams annaha “tasjud tabt alarsh” wa-laysa “taghrib ff ‘aym hamiya’,” htips:/islamga info! amp/ar/answers/176375 (accessed August 16, 2020)",
      "bbox": {
        "l": 97.0,
        "b": 376.0,
        "r": 658.0,
        "t": 449.0
      }
    },
    {
      "label": "list_item",
      "text": "113. Tafsir Abt Alf, ed. Nabh8, 68; al-Sishumt, al-Tahdhtb, 1: 283; AbO Rashid al-Nayssbirt (d. 460/1068), Kitab al-Masi? ft al-khilaf bayn al-basriyyin wa-l-baghdédiyyin, ed. M. Ziyida and R. al-Sayyid (Tripoli: Ma‘had al-Inm’? ak‘Arabi, 1979), 100; al-Sharifal-Murtada (d. 436/1044), Amait al-Murtada: Ghuraral-fawa?id wa-durar al-gal@?id, ed. M.A. Ibrahim, 2 vols. (Caio: Dar thy al-Kutub al‘Arabiyya, 1373/1954), 2: 187-88.",
      "bbox": {
        "l": 97.0,
        "b": 316.0,
        "r": 658.0,
        "t": 374.0
      }
    },
    {
      "label": "list_item",
      "text": "114, Tafsir ABTA, ed. Nab, 332.",
      "bbox": {
        "l": 117.0,
        "b": 302.0,
        "r": 293.0,
        "t": 314.0
      }
    },
    {
      "label": "list_item",
      "text": "11S. Ibn Mattawayh, al-Tadhira, 1: 284. 1 thank Mariam Shehata for discussing this particularly knotty pas- sage with me",
      "bbox": {
        "l": 97.0,
        "b": 272.0,
        "r": 657.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "116, Tafstr ABTA, ed. Nabhi, 469,",
      "bbox": {
        "l": 117.0,
        "b": 256.0,
        "r": 293.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "117, Ab-Jishumt, al-Tahdhib, 10: 6981, contra the “five hundred years” hadith",
      "bbox": {
        "l": 116.0,
        "b": 241.0,
        "r": 499.0,
        "t": 254.0
      }
    },
    {
      "label": "list_item",
      "text": "8. Ibid, 8: $859. For a refutation of this view, see, eg, Ibn Taymiyya, al-Risdla al“arshiyya (Cairo: drat al-Tiba‘a al-Munttiyya, 1925), 12.",
      "bbox": {
        "l": 97.0,
        "b": 212.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "list_item",
      "text": "119. His general hostility to the Aristoteian-Ptolemaic view is claimed by al-Shaykl al-Mufid (4. 413/1032) in Awa? al-magdlar, ed. |. al-AnsBet (Tehran: al-Mu’tamar al‘AlantliAlfiyyat al-Shaykh al-Mufid, 1413h), 100,",
      "bbox": {
        "l": 97.0,
        "b": 182.0,
        "r": 658.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "120. This approach is particularly evident in Aba ‘AI al-Jubba\"'s Kitab al-Magalat (probably correctly attrib uted to him), which is forthe most pat a polemic against the proto-Sunnis,e ., pp. 246-57,",
      "bbox": {
        "l": 97.0,
        "b": 152.0,
        "r": 657.0,
        "t": 178.0
      }
    },
    {
      "label": "list_item",
      "text": "121, Abd Hayyain al-Tawhtdt (4. 414/1023), al-Bas@ir wa-l-dhakhd’ir, ed. M. al-S. (Uthman, 2 vols. (Beirut Dar al-Kutub alUimiyya, 2014), 2: 303; J. van Ess, The Flowering of Muslim Theology, tt. . Marie Todd (Cam- bridge: Harvard Univ. Press, 2006), 9-10",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 657.0,
        "t": 149.0
      }
    }
  ],
  "17": [
    {
      "label": "page_header",
      "text": "st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "867",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "its roundness), and as accepting the equal possibility of it being either round or flat.'?2 The view that the earth is comprised of two halves, one with the tendency to ascend and the other with the tendency to fall (thus keeping the earth stationary), is also sometimes attributed to him.",
      "bbox": {
        "l": 97.0,
        "b": 906.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "The chief systematizer of the Baghdad Mu‘tazilis, Abi al-Qasim al-Ka‘br, disagreed with Aba ‘AIT al-Jubbai on most questions of cosmography, and unlike Abi Hashim is almost always remembered to have unambiguously affirmed the earth’s roundness.\" There is no evidence, however, that any of these divergences were motivated by their competing doctri- nal affiliations. Al-Ka‘bi agreed with the munajjimiin in believing the earth to be immobile at the center of the cosmos, encompassed by the celestial spheres, but he shared this belief with “many of the af! al-tawhid ie., fellow Mu‘tazilis],” along with many of the “ancients.” !?5 The extent of his agreement with the munajjimiin, however, seems to have been unique among theologians of his generation, including his view on the cause of the earth’s suspen- sion (its place at the center of the spheres). Al-Ka‘bi, like Abii ‘Aly, interprets Q 18:86 figuratively, arguing that the sun is much larger than the earth, so cannot set into any part of it. 27 He also denies the existence of intra- and extracosmic void, !28 and continues the tradition of his Mu‘tazili forebears in refuting the infinitude of the cosmos. \"2 He is reported to have frequented the teaching circle of Abii Muslim al-Isfahani (d. 322/943), a fellow Baghdad Mu‘tazili who similarly interpreted Q 18:86 figuratively and denied that the sky is held up by pillars. 3°",
      "bbox": {
        "l": 97.0,
        "b": 616.0,
        "r": 658.0,
        "t": 902.0
      }
    },
    {
      "label": "text",
      "text": "The rationalist theologians of the mid-third to early fourth/tenth century built on the foun- dations laid by the triumvirs and expanded the repertoire of cosmographical topics found in kalam discourse. Notwithstanding the dearth of early sources, this claim complements our existing knowledge of the period, and thus appears to be reasonable. The shape of the earth emerged as a point of controversy no later than the late third Islamic century, attract ing the attention of traditionalists and others. The issue generated disagreement among the Muttazilis that cannot be explained in terms of school affiliation; here, too, the Basrans Abi “Alf and his son Abi Hashim al-Jubba% adopted more or less opposing viewpoints on the question. Opinion on such topics, belonging to the domain of dagig al-kalam, was a function",
      "bbox": {
        "l": 97.0,
        "b": 454.0,
        "r": 658.0,
        "t": 614.0
      }
    },
    {
      "label": "footnote",
      "text": "122. See, respectively, Ibn Mattawayh,al-Tadikira, 1:84; al-NaysAbOst,al-Masd?il ft al-Khilaf, 100, al-shumt, al-Tahdhib, 1: 284, Fora discussion of the contradiction, see Ibn Mattawayh, al-Tadhkira, 1: 305; M. J. MeDermott, The Theology of al-Shaikh al-Muftd (d. 413/1022) (Beirut: Dar al-Machteg, 1978), 215. For a passage that seems to suggest his agreement with his father, se al-Mufld, wd? il al-magalat, 100.",
      "bbox": {
        "l": 97.0,
        "b": 361.0,
        "r": 658.0,
        "t": 420.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 361.0,
        "r": 658.0,
        "t": 420.0
      }
    },
    {
      "label": "footnote",
      "text": "123. Ibid_, 496-98, $27. In no other source have I come across this View attributed to a named theologian, eg, al-Ka‘bi, Kitdb al-Magalat, 449.",
      "bbox": {
        "l": 97.0,
        "b": 332.0,
        "r": 657.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 332.0,
        "r": 657.0,
        "t": 359.0
      }
    },
    {
      "label": "footnote",
      "text": "124. There is no reference to this question in al-Ka‘bi's Magdildt. See al-Jishumt, al-Tahdhib, 1: 284; al-Naysdbarl, al-Masa?i ft al-khilaf, 100; al-Muftd, 4wa?i!al-magalat, 100; R_ el Omari, The Theology of Abi L-Qasim al-Balkhial-Ka‘bt (d. 319/931) (Leiden: Brill, 2016), 86. Elsewhere, al-Ka°bt is claimed to have held that the earth cannot be round; Tafsir ABT al-Qasim al-Ka‘bi al-Balkhi, ed. K. M. Nabh& (Beirut: Dar al-Kutub al-‘Timiyya, 1428/2007), 110. This isa relatively late report and is probably mistaken,",
      "bbox": {
        "l": 97.0,
        "b": 256.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 256.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "footnote",
      "text": "125, ALMutd, Awe il al-magalat, 9.",
      "bbox": {
        "l": 117.0,
        "b": 241.0,
        "r": 303.0,
        "t": 254.0
      }
    },
    {
      "label": "footnote",
      "text": "126. Ibid, 100. Al-Ka‘bt is reported to have attended the cirele of a certain Aba Ahmad al-munajjim; this could conceivably have played a role inthe shaping of his cosmographical views. See Ibn al-Murtads (d_ 840/1437), Kitdb Tabagat al-mu‘tacila, ed. H. Ritter and A. Dietrich (Beirut: Franz Steiner, 1961), 88.",
      "bbox": {
        "l": 97.0,
        "b": 196.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "footnote",
      "text": "127. Tafstr Abt al-Qasim, ed. Nabbi, 260.",
      "bbox": {
        "l": 117.0,
        "b": 182.0,
        "r": 320.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 182.0,
        "r": 320.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "128. El Omari, Theology of Abit !-Qasim, 85-86; Cf. Dhanani, Physical Theory, 73; al-Ka‘bl, Magalat, 485.",
      "bbox": {
        "l": 116.0,
        "b": 166.0,
        "r": 644.0,
        "t": 179.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 166.0,
        "r": 644.0,
        "t": 179.0
      }
    },
    {
      "label": "list_item",
      "text": "129. AL-Ka‘bi, Magalat, 591-97.",
      "bbox": {
        "l": 116.0,
        "b": 152.0,
        "r": 278.0,
        "t": 164.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 152.0,
        "r": 278.0,
        "t": 164.0
      }
    },
    {
      "label": "footnote",
      "text": "130. On the relationship between them, see Ibn al-Murtads, Tabagdt al-mu‘tazila, 91. On AbO Muslim's inter- pretation of Q 18:86 and view of pillars, see Tafsir ABI Muslim Muhammad b. Bahr al-dsfahdnl, ed. K. M. Nabhi (Beinut: Dar al-Kutub al-Timiyya, 1428/2007), 181-82 and 160; al-Jishumt,al-Tahdhtb, 6: 4482.",
      "bbox": {
        "l": 98.0,
        "b": 106.0,
        "r": 658.0,
        "t": 149.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 106.0,
        "r": 658.0,
        "t": 149.0
      }
    }
  ],
  "18": [
    {
      "label": "page_header",
      "text": "868",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "of individual inclination, exposure to late ancient learning, and other factors. Intimate famil- iarity with the science of the stars, however, in no sense precluded hostility toward it, as is evident in the case of al-Nawbakhti—apparently the best-informed theologian on the subject.",
      "bbox": {
        "l": 98.0,
        "b": 923.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "In the course of the period, quranic hermeneutics came to figure prominently in kalm discussions of cosmography, perhaps for the first time. Most of the relevant material is found not in works of theology proper, but in Quran commentaries authored by mutakallimiin. The rationalist theologians seem to have turned to authoring full-length works of afsir late in the third/ninth century, which forced them to confront cosmographical questions that might otherwise have eluded them. A number of key quranic verses emerged as the focal points for discussion (appendix 1).",
      "bbox": {
        "l": 98.0,
        "b": 796.0,
        "r": 658.0,
        "t": 920.0
      }
    },
    {
      "label": "text",
      "text": "The trends witnessed in the work of Abi ‘AIT al-Jubba’T and al-Ka‘bi, the chiefS of the Basran and Baghdad Mu‘tazilis, continued into the next period of cosmographical discus- sion in kaldm, which is marked by considerable continuity but is also notable for its depar- tures. The major development is the theological careers of Abii al-Hasan al-Ash‘ari and Abi Mansir al-Maturidf. Neither seems to have been especially important during his lifetime, and ‘one cannot speak of Ash‘ari or Maturidi “schools” until well after their deaths. \"3! Neverthe- less, with their advent one can retrospectively speak of the beginnings of what would become classical Sunni theology, with all that this entails for cosmographical doctrine.",
      "bbox": {
        "l": 98.0,
        "b": 652.0,
        "r": 658.0,
        "t": 794.0
      }
    },
    {
      "label": "section_header",
      "text": "IV. THE ROAD TO CLASSICAL SUNNISM: THE NEXT GENERATION",
      "bbox": {
        "l": 167.0,
        "b": 617.0,
        "r": 588.0,
        "t": 628.0
      }
    },
    {
      "label": "text",
      "text": "Of these eponyms of the two most prominent schools of Sunni kaldm, the career of al-Ash‘ari has the most significance for the development of cosmographical discourse in kalam. Notwithstanding his dramatic “conversion,” traditionally dated to the (significant) year 300/912f,,!3? al-Ash‘ari “retained much of the subject matter, rationalist methodology, and cosmology of the Mu‘tazilis.”\"33 As such, his views on cosmography share obvious structural similarities with theirs, and he addresses the points expected of a Mu‘tazili theolo- gian of the period. Al-Ash‘ari’s most sustained treatment of the question is found, unsurpris- ingly, in his Magalat al-islémiyyin, and important material is also reported from him in Ibn Farak’s Mujarrad.** It is generally agreed that Magalat al-islamiyyin was written in stages, some predating al-Ash‘ari’s conversion. '35 The question of the book’s sources remains more controversial; James Weaver argues for the dependence of al-Ash‘ari on al-Ka‘bi, while van Ess suggests that they both relied on a common source. 6 Reading their respective accounts of cosmography alongside each other, important differences in structure give weight to van",
      "bbox": {
        "l": 97.0,
        "b": 373.0,
        "r": 659.0,
        "t": 605.0
      }
    },
    {
      "label": "list_item",
      "text": "131, On the emergence ofthe Ash‘ari school, see J. Thiele, “Between Cordoba and Nistbar: The Emergence and Consolidation of Asharism (Fourth-Fifth/Tenth-Eleventh Century),” in Schmidtke, Orford Handbook of Islamic Theology, 225-41. Thiele (p. 229) locates its consolidation in the careers of al-Baqillin (d_ 403/1013), fbn Farak (4406/1015), and Abd Ishaq al-IsfariPint (d_ 418/1027). On the emergence of a Maturidi school and its early relationship with the Ash‘aris, see Rudolph, Al-Maturtdi, 319-23,",
      "bbox": {
        "l": 97.0,
        "b": 256.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 256.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "footnote",
      "text": "132. M. Watt, art al-Ash‘arf, Abu \"I-Hasan, £72, 1: 694-95, at 694. The date may represent an attempt to enhance the claims made by Ibn ‘Asdkir (d. 571/1176), among others, that al-Ash‘arT was the reviver (mujaddid) of the third Islamie century and belonged to the salaf (both of which claims would be undermined if his conversion postdated the turn of the century); Ibn “Asikir, Tabyin kadhib al-muftart ff md nusiba tld al-imdm Abt al-Hasan al-Ash‘ari, ed, MZ. al-Kawtharl (Damascus: Dar a-Fikr, 1399h), S2-S4, 142-48.",
      "bbox": {
        "l": 97.0,
        "b": 181.0,
        "r": 658.0,
        "t": 254.0
      }
    },
    {
      "label": "footnote",
      "text": "133. Ragep, “Islamic Culture,” $5.",
      "bbox": {
        "l": 117.0,
        "b": 166.0,
        "r": 288.0,
        "t": 179.0
      }
    },
    {
      "label": "footnote",
      "text": "134, AL-Asharl, Magdlat al-islamiyyin, 326; Ibn FUrak, Mujarrad magalat al-shaykh Abr al-Hlasan al-Ashar, ed. D. Gimaret (Beirut: Dar al-Machreq, 1987), 275, 277-78.",
      "bbox": {
        "l": 97.0,
        "b": 137.0,
        "r": 658.0,
        "t": 164.0
      }
    },
    {
      "label": "footnote",
      "text": "135, Weaver, “Footnote,” 144.",
      "bbox": {
        "l": 117.0,
        "b": 122.0,
        "r": 269.0,
        "t": 134.0
      }
    },
    {
      "label": "footnote",
      "text": "136. Ibid, 157,",
      "bbox": {
        "l": 116.0,
        "b": 107.0,
        "r": 195.0,
        "t": 119.0
      }
    }
  ],
  "19": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "869",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Ess’s thesis. 57 Al-Ash‘ari’s presentation of the competing views of the mutakallimiin on the subject is dispassionate, and it is unclear which of the four opinions he reports is regarded as the correct one. Ibn Furak provides the necessary information. He notes that al-Ash‘arT held that “there is no reason for the suspension of the earth [in place] other than God’s volition (ikhtiyar),” 158 Of the four solutions documented in Magalat al-islamiyyin, this cor- responds most closely to the view, attributed to Abi al-Hudhayl, that the earth does not rest on a body. 59 Al-Ash‘ari explicitly rejects, in good occasionalist fashion, all alternative causal accounts of the earth’s immobility, whether produced by advocates of faba’ (the four elemental qualities) *° or rawallud (Mu'tazilis): “God, the most exalted, is the one who holds the earth [in place], preserves, and oversees i, [the one who] renders the mobile bod- thereon immobile, by his will.” ! Similarly, in al-Ash‘arl’s Risala ila ahl al-thaghr it is God alone who prevents the firmament from collapsing onto the earth (echoing Q 22:65). \"2",
      "bbox": {
        "l": 97.0,
        "b": 760.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "AL-Ash‘ari repudiated all claims about the inherent “nature” of bodies, whether it was the supposed tendency of fire to rise or of stones to fall, and, like Hisham b. al-Hakam, he denied that one could stretch a hand beyond the cosmos. The view that the earth is hurtling downward, attributed by Ibn Firak to the materialists (Dahriyya), is rejected by al-Ash‘ari, as is the (more unusual) opinion that it floats upward, also ascribed to them. The opinion that the earth is comprised of parts whose properties counteract each other (the fourth solu- tion presented in Magalat al-islamiyyin) is also refuted, as is the claim that it rests on a body that is re-created every moment for this purpose (solution three): God instead re-creates the accident of motionlessness (fi al-sukiin) in it every instant, # The bottom surface (al-saftha al-sufla) of the earth cannot be described as either immobile or moving, al-Ash‘ari points out, seemingly because it cannot be described as having a place (makan). 5 To summarize his contributions to the debate, al-Ash‘ati takes the cosmographical framework of the Mu‘tazilis as his point of departure, while rejecting most of the solutions they proposed to its most enduring problems, e.g., the cause of the earth’s immobility. His occasionalist commitments are the cause of these divergences. At no point in his extant work does al-Ash‘ati explicitly reference traditionalist cosmography, though by denying that the earth rests on a body, he implicitly rejects one important element of it",
      "bbox": {
        "l": 97.0,
        "b": 454.0,
        "r": 658.0,
        "t": 757.0
      }
    },
    {
      "label": "text",
      "text": "‘The case of al-Maturidt is somewhat different, notwithstanding his well-known disagree- ‘ments with al-Ka‘bi. He does not demonstrate an interest in the cosmographical questions that exercised al-Ash‘ari and his peers. This is most likely because al-Maturidi’s theology lacks a comparable genealogical connection to the Mu‘tazilis, and so mostly reflects different",
      "bbox": {
        "l": 97.0,
        "b": 381.0,
        "r": 658.0,
        "t": 451.0
      }
    },
    {
      "label": "footnote",
      "text": "137, Ina comparison of al-Ash'arl, Magdlar al-isldmiyyin, 326, with al-Ka'bt, Kitab al-Magalat, 449-50, al-Ash‘arl places his solutions to the question of the earth's immobility and suspension in a different order than al-Ka‘b, in the sequence (using al-Ka'b's presentation) 1, 4,2, 3. Unlike al-Ka‘b, he does not mention the notion that the earth rests at the center of the spheres. Al-Ash‘art directs readers interested in more information on the ‘cosmographical views of the ancients to his (lost) Magalat al-mulhidin, which is not listed by Ibn al-Nadim (ed. Sayyid, 1: 649).",
      "bbox": {
        "l": 98.0,
        "b": 272.0,
        "r": 658.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 272.0,
        "r": 658.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "138, Ibn Furak, Mujarrad, 27",
      "bbox": {
        "l": 117.0,
        "b": 257.0,
        "r": 270.0,
        "t": 269.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 257.0,
        "r": 270.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "139. AL-Ash'arl, Magalat al-islamiyyin, 326",
      "bbox": {
        "l": 117.0,
        "b": 242.0,
        "r": 334.0,
        "t": 254.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 242.0,
        "r": 334.0,
        "t": 254.0
      }
    },
    {
      "label": "list_item",
      "text": "140. On the proponents of saba’s, see G. Schwarb, “Early Kalim and the Medical Tradition,” in Philosophy ‘and Medicine in the Formative Period of Islam, ed, P. Adamson and P.E. Pormann (London: The Warburg Institute, 2017), 104-69, at 105, passim. I thank one of the anonymous reviewers for bringing this paper to my attention",
      "bbox": {
        "l": 98.0,
        "b": 197.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 197.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "list_item",
      "text": "141. Ibn Farak, Muiarrad, 275.",
      "bbox": {
        "l": 117.0,
        "b": 182.0,
        "r": 270.0,
        "t": 194.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 182.0,
        "r": 270.0,
        "t": 194.0
      }
    },
    {
      "label": "footnote",
      "text": "142. Al-Ash‘arl, Risdla tld ahl al-thaghr, ed. ‘A. Sh. M_ al-Junayd (Medina: Maktabat al-‘Ulom wa-l-Hikam, 1422/2002), 155.",
      "bbox": {
        "l": 98.0,
        "b": 153.0,
        "r": 657.0,
        "t": 179.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 153.0,
        "r": 657.0,
        "t": 179.0
      }
    },
    {
      "label": "list_item",
      "text": "143. Ibn Furak, Mujarrad, 277",
      "bbox": {
        "l": 117.0,
        "b": 136.0,
        "r": 271.0,
        "t": 149.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 136.0,
        "r": 271.0,
        "t": 149.0
      }
    },
    {
      "label": "list_item",
      "text": "144, Ibid.",
      "bbox": {
        "l": 117.0,
        "b": 123.0,
        "r": 165.0,
        "t": 134.0
      }
    },
    {
      "label": "list_item",
      "text": "145. Ibid, 278",
      "bbox": {
        "l": 116.0,
        "b": 107.0,
        "r": 191.0,
        "t": 119.0
      }
    }
  ],
  "20": [
    {
      "label": "page_header",
      "text": "870",
      "bbox": {
        "l": 98.0,
        "b": 999.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "concerns, characteristic of eastern Hanafism. His one (fleeting) reference to cosmographical debate in a kalam context is in Kitab al-Tawhtd, where the earth’s perpetual falling is attrib- uted to the Sumaniyya. 46",
      "bbox": {
        "l": 98.0,
        "b": 924.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "‘Owing to the preservation of al-Maturidi’s Quran commentary, we know much more about his cosmographical views than those of al-Ash‘ar7. In nearly all of the key verses where ‘one might expect to find his commentary on the relevant verses to be inflected by kaldim debates, al-Maturidi either endorses traditionalist positions explicitly or reports them without comment. He seems to be unaware of Mu‘tazili views on these points, or at the very least refrains from discussing them. In his tafsir of Q 18:86—as we have seen, a site of Mu‘tazili cosmographical intervention since at least the time of Abii ‘Alf al-Jubba’i—al-Maturidi lim- its himself to mentioning variae lectiones.'7 In his exegesis of Q 50:1 he acknowledges the world-encompassing mountain range (made of green or red ruby), but suggests that this cannot be the correct interpretation as “the [pagan] Arabs knew nothing of Mt. Qaf or its greatness.” 8 God would not swear an oath, presumably, by anything unfamiliar to the origi- nal, mostly pagan audience of the quranic revelation. Al-Maturidi’s reading of Q 65:12 is revealing of his general approach to the subject. He notes three interpretations for the seven earths: that they are layered one above the other like the heavens (as per the traditionalist view); that these “earths” are in fact seven continents (jazéir);\"*° and that the six earths are located somewhere beyond the lowest heaven (al-samd? al-dunya, Q 67:5). Refusing to com- mit himself to any of these options, al-Maturidi writes, “We have no need to know the nature, modality, or number of [the earths}, because there is no legal ruling (/iukm) attached thereto, and God knows best.”!50 This attitude clearly diverges sharply from the approach of the Muttazilis, who had no qualms about entertaining such conjectures. Al-Maturidi only affirms figurative interpretations of cosmographical data when the proper understanding of God’s attributes is at stake, as in the case of the throne and the footstool. 'S! He does mention the possibility that the firmament is not held up by pillars, but this view is also reported by the contemporaneous al-Tabar7, and has no necessary connection to the mutakallimiin as such. 2",
      "bbox": {
        "l": 97.0,
        "b": 490.0,
        "r": 658.0,
        "t": 920.0
      }
    },
    {
      "label": "text",
      "text": "One case that confirms the impression that cosmographical perspective was, among the ‘mutakallimiin, more a matter of individual inclination than doctrinal or sectarian affiliation, is Ibn al-Ikhshid (4. 326/938). According to Jean-Claude Vadet, his theology was “more pietistic and more popular, more in accordance with his ShafiT ideas and his knowledge of hadith and of tafsir” than was commonly the case for his Mu‘tazili peers.'*> He treats",
      "bbox": {
        "l": 97.0,
        "b": 401.0,
        "r": 657.0,
        "t": 488.0
      }
    },
    {
      "label": "list_item",
      "text": "146, ALMaturtdl, Ki al-Tawhid, ed. B. Topaloglu and M. Arugt (Istanbul: Maktabat al-trshad, 2001), 221",
      "bbox": {
        "l": 116.0,
        "b": 347.0,
        "r": 646.0,
        "t": 359.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 347.0,
        "r": 646.0,
        "t": 359.0
      }
    },
    {
      "label": "footnote",
      "text": "147, A-Maturidl, Ta?wildt al-Qur’an, ed. A. Vanioglu and B. Topaloglu, 18 vols. (Istanbul: Dar al-Mizin, 2007), 9: 99.",
      "bbox": {
        "l": 97.0,
        "b": 317.0,
        "r": 658.0,
        "t": 344.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 317.0,
        "r": 658.0,
        "t": 344.0
      }
    },
    {
      "label": "text",
      "text": "148. Ibid., 14: 85. He notes that the greenness of the ruby (ydgitta) gives the sky its greenish hue. On the greenness of the sky and Mt. Qaf, see A. Morabia, art. Lawn, £72, 5: 698-707, at 700, 706 respectively. Morabia remarks that Mt Qaf is made of “green emerald,” i., zumurrud. On rubies generally, see al-BIrGnl, al-Jamahir ff al-jawahir, ed. Y. al-HAdt (Tebran: Maktab Nashr al-Turith al-Makhtdt, 1416/1995), 107-55. For al-Biran's critique of Mt. Qaf (made of emerald), which he dismisses as mete superstition (khurdfar), see pp. 269-70. He claims the “Shumaniyya” (closer to the Sanskrit srmana than the normal Sumaniyya, reflecting his knowledge of that language) to be the source of this notion (pp. 270-71), because of their comparable belief in Mt. Meru, “a lofty ‘mountain situated under the north pole, whose four sides are comprised of rubies of various colors.” See also idem, Alberunis India, 1: 243-50 (p. 249 for Mt Qaf, “as itis called by our common peopl",
      "bbox": {
        "l": 97.0,
        "b": 181.0,
        "r": 658.0,
        "t": 314.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 181.0,
        "r": 658.0,
        "t": 314.0
      }
    },
    {
      "label": "list_item",
      "text": "149. For the related notion ofthe seven earths as climes (agdlim), see Jachimowicz, “Islamic Cosmology.” 147.",
      "bbox": {
        "l": 117.0,
        "b": 166.0,
        "r": 656.0,
        "t": 179.0
      }
    },
    {
      "label": "list_item",
      "text": "150, AL-Maturtdi, Za’wilasal-Qur’dn, 15: 244,",
      "bbox": {
        "l": 116.0,
        "b": 151.0,
        "r": 346.0,
        "t": 165.0
      }
    },
    {
      "label": "list_item",
      "text": "151. Ibid, 2: 157, 7: 132.",
      "bbox": {
        "l": 116.0,
        "b": 137.0,
        "r": 242.0,
        "t": 149.0
      }
    },
    {
      "label": "list_item",
      "text": "152. Ibid. 7: 380. For al-Tabar, see above.",
      "bbox": {
        "l": 116.0,
        "b": 122.0,
        "r": 330.0,
        "t": 134.0
      }
    },
    {
      "label": "list_item",
      "text": "153. J-C. Vadet, art. Ibn al-Ikhshid, £72, 3: 807,",
      "bbox": {
        "l": 116.0,
        "b": 107.0,
        "r": 354.0,
        "t": 119.0
      }
    }
  ],
  "21": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "87",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 655.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Q 18:86 accordingly: the sun “actually sets into a muddy spring, in accordance with the plain-sense meaning (zahir) of the Quran,” !54",
      "bbox": {
        "l": 98.0,
        "b": 940.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Thus, by the early fourtlvtenth century, key patterns of cosmographical thinking (in the context of schools of kaldm) had emerged that would have a decisive bearing on subsequent developments. Following his conversion, al-Ash‘ari committed himself to occasionalism— which would endure as a distinctive feature of Ash‘ari theology—while retaining an interest in the kalam questions and methods of his Mu‘tazili teachers, including those pertaining to cosmography. Al-Maturidi’s vision of the cosmos was, on the other hand, much more closely related to that of al-Tabari than to that of the Mu‘tazila, and he was not exercised by the same set of questions. Even among the Mu‘tazilis, formative exposure to the traditionalist disciplines (most importantly, hadith) could produce a corresponding inclination, as we have seen with Ibn al-Ikhshid, Overall, among these three theologians of clearly divergent view- points, theological affiliation is not an accurate index of cosmographical opinion. Similar conclusions may apply outside the Muslim community for this period: the Jewish mutakal- lim Dawiid al-Mugammas (d. ca. 325/937), whom most scholars regard to have been deeply influenced by the Mu‘tazilis, claims that the earth is discoid and the sky dome-shaped, in ‘good Talmudic fashion. \"5",
      "bbox": {
        "l": 98.0,
        "b": 670.0,
        "r": 659.0,
        "t": 937.0
      }
    },
    {
      "label": "section_header",
      "text": "Y. THE BAGHDAD EPICENTER: COSMOGRAPHY IN THE EARLY CLASSICAL THEOLOGICAL SCHOOLS",
      "bbox": {
        "l": 138.0,
        "b": 615.0,
        "r": 618.0,
        "t": 646.0
      }
    },
    {
      "label": "text",
      "text": "In his study of the formation of the Sunni schools of law to the end of the fourth/tenth century, Christopher Melchert observes that the jurists of Baghdad were “usually leading the way, [or] almost always at least keeping pace.”!5° Wolfhart Heinrichs has also remarked that this period witnessed Islamdom’s intellectual coming-of-age across the disciplines gen- erally.!57 Because of its role as the preeminent center of patronage, Muslim-non-Muslim encounter, and translation into Arabic, Buyid Baghdad played an oversize role in the his- tory of kaldim in this period. The city was characterized by “frequent polemical encounters between members of the various groups.” It figures prominently in the early history of the classical theological schools, with all that this entails for the development of cosmographical opinion. In this period the theological dissection of this material becomes more sophisticated as the classical theological schools crystallize; some mutakallimiin, such as al-Balkhi and al-Shaykh al-Mufid, demonstrate a clear sympathy for the perspectives of the munajjimiin None of the most basic points of cosmography was settled in theological discourse, however, and the disagreement does not clearly reflect school affiliation. Even by the close of the fifth/ eleventh century, one cannot speak of clear patterns of opinion among the theologians writ-",
      "bbox": {
        "l": 97.0,
        "b": 335.0,
        "r": 658.0,
        "t": 603.0
      }
    },
    {
      "label": "list_item",
      "text": "154, Tafstr Abt al-Qdsim, ed. Nabhi, 260; al-ishumt, al-Tahdlhb, 6: 4483. Al-Jishumt adds that this is the opin- jon of “most ofthe Quran commentators” (as opposed to the theologians).",
      "bbox": {
        "l": 98.0,
        "b": 286.0,
        "r": 657.0,
        "t": 314.0
      }
    },
    {
      "label": "text",
      "text": "155. A-Mugammas, Twenty Chapters, ed. and tr S. Stroumsa (Provo: Brigham Young Univ. Press, 2016), xxili-xxiv, 114-15 respectively (Stroumsa argues that Muttazili influence on the Jews postdates al-Mugammas, While recognizing that his treatise is produced in the conventional kaldm style). On the Talmudic vision of the cosmos, see J. Brown, New Heavens and a New Earth: The Jewish Reception of Copernican Thought (New York: Oxford Univ. Press, 2013), 27-41",
      "bbox": {
        "l": 97.0,
        "b": 212.0,
        "r": 658.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 212.0,
        "r": 658.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "156, C. Melchert, The Formation of the Sunni Schools of Law: 91h-10th Centuries CE. (Leiden: Brill, 1997), 200,",
      "bbox": {
        "l": 97.0,
        "b": 184.0,
        "r": 657.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "157. W. P. Heinrichs, “On the Figurative (maja=) in Muslim Interpretation and Legal Hermeneutics,” in Jmer- ppreting Scriptures in Judaism, Christianity and Islam: Overlapping Inquiries, ed. M. Z. Cohen and A. Berlin (Cambridge: Cambridge Univ. Press, 2016), 249-65, at 250; HA. Abdulsater, Shi Doctrine, Mu‘acili Theology Al-Sharifal-Murtada and Imami Discourse (Edinburgh: Edinburgh Univ. Press, 2017), 16",
      "bbox": {
        "l": 97.0,
        "b": 121.0,
        "r": 658.0,
        "t": 179.0
      }
    }
  ],
  "22": [
    {
      "label": "page_header",
      "text": "sn",
      "bbox": {
        "l": 98.0,
        "b": 999.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "ing on the subject; one can only note the failure of the Aristotelian-Ptolemaic model to have successfully displaced any of the alternatives.",
      "bbox": {
        "l": 98.0,
        "b": 941.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Before his death, al-Ash‘ari migrated from his native Basra to Baghdad, as did his stu- dent Ibn Mujahid al-Basri (d. 370/980f.).\"5° Another Basran, al-Ju‘al b. ‘Alf, better known as Abii ‘Abd Allah al-Basti (d. 369/980), the chief Bahshami of his generation, made the same journey. © Abii ‘Abd Allah, a student of Abi Hashim al-Jubba’7, who counted al-gadr “Abd al-Jabbar and the vizier Ibn ‘Abbad!*! (d. 385/995) among his own students, was a major figure in the early history of the school. '© Because of these migrations, the signi- fiers “Basran” and “Baghdad” (i.c., of the Mu‘tazilis) lost their geographical meaning; in a manner of speaking, they transitioned from “regional” to “classical” schools of theology. Similarly, among the Twelver Shi‘a, Ibn Babawayh (d. 380/991) established his reputation as star theologian of the community in Baghdad, before returning eastward. The career of his student al-Shaykh al-Mutid, a resident of the city, marked a major turing point in the his- tory of Twelver theology. Though there would be further eastward migration, especially by the Ash‘aris (for whom Nishapur became a major center), Baghdad retained its importance well into the fifth/eleventh century. This has a significant bearing on the transmission of cosmographical doctrine.",
      "bbox": {
        "l": 98.0,
        "b": 671.0,
        "r": 659.0,
        "t": 938.0
      }
    },
    {
      "label": "text",
      "text": "In Baghdad al-Ash‘ari’s student, Aba al-Hasan al-Bahilt (d. ca. 370/980f.), taught the major theologians of the next generation of the school: al-Baqillani, Ibn Firak, and Abi Ishq al-Isfardint.\"® Of the three, al-Bagillant’s oeuvre is the best preserved. He is conver- sant in the views of the munajjimiin and refutes their claim that the stars influence sublunar events,\" but does not adopt a position on any of the major cosmographical questions. Of al-Isfariini’s corpus, we possess only fragments. 65 Beyond his description of al-Ash‘ari’s views in Mujarrad, Ibn Furak’s comments on cosmography are fairly limited. The Quran commentary attributed to him—approximately one-third of the original, beginning with Q 23, is extant—is a curious work, written in question-and-answer format and inconsistent in its engagement of theological points. 6 Ibn Farak echoes al-Ash‘ari’s affirmation of the exclusive character of divine agency: “The earth is immobile by virtue of God’s holding it in place, and none can support heavy things in place without pillars other than him.” He does distinguish between the heavens and the celestial spheres (aflak), rather than rejecting the latter outright, suggesting a certain deference to the views of the astronomers. 7 Ibn Fiirak mentions “the world-encompassing mountain” as one of several interpretations of Q 50:1,",
      "bbox": {
        "l": 97.0,
        "b": 401.0,
        "r": 658.0,
        "t": 668.0
      }
    },
    {
      "label": "list_item",
      "text": "159, thn ‘Asakir, Tabyin, 177.",
      "bbox": {
        "l": 116.0,
        "b": 362.0,
        "r": 262.0,
        "t": 374.0
      }
    },
    {
      "label": "list_item",
      "text": "160. AL-Khatib al-Baghdidt, Tarikh madinat al-saldm, ed. B. ‘A. Ma‘rOf, 17 vols. (Beirut: Dar al-Gharb al-slimt, 1422/2001), 8: 626-27; G. Schwarb, art. Abd ‘Abdallah al-Bast1, £73, online (accessed September 10, 2020). The Bahshamis are the followers of Abd Hashim al-Jubb&, whose views proved more influential on subse- {quent Multazilis than those of his father, Abd ‘A",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 658.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "161. AbO al-Muzaffar al-tsfarayint (d. 471/1078), notes that the Bahshamis dominate contemporaneous ‘Mu‘azilism owing to the lasting influence of al-Sahib b, “Abad; al-Isfarayint, al-Tabsir ff al-din wa-tamyte al-firga al-ndjiya ‘an al-frag al-halikin, ed. M.al-Khalifa (Beirut: Dar Ibn Hazm, 1429/2008), 279.",
      "bbox": {
        "l": 97.0,
        "b": 256.0,
        "r": 658.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "162. ‘Abd al-Jabbir, Kitab Fadl al-i‘rizdl, 325. There is no cosmographical material in the extant fragments of Ibn ‘Abbadl’s writings.",
      "bbox": {
        "l": 97.0,
        "b": 227.0,
        "r": 658.0,
        "t": 254.0
      }
    },
    {
      "label": "list_item",
      "text": "163. Ibn ‘Asakir, Zabyin, 178,",
      "bbox": {
        "l": 117.0,
        "b": 212.0,
        "r": 262.0,
        "t": 224.0
      }
    },
    {
      "label": "list_item",
      "text": "164, AL-Bagilnt, Kitdb al-Tamhid, ed. R. 1. McCarthy (Beirut: al-Maktaba al-Sharqiyya, 1957), 48-52",
      "bbox": {
        "l": 116.0,
        "b": 196.0,
        "r": 624.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "165. On his biography, see A. Brodersen, art. Abd Ishaq al-tsfarayint, EP, online (accessed September 18, 2020).",
      "bbox": {
        "l": 97.0,
        "b": 168.0,
        "r": 658.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "166. On this point, see M. Nguyen, “Exegetes of Nishapur: A Preliminary Survey of QuPanie Works by Iba Habtb, ton Forak, and ‘Abs al-Qahir al-Baghdadt,” JQS 20.2 (2018): 47-73, at 39-60.",
      "bbox": {
        "l": 98.0,
        "b": 136.0,
        "r": 658.0,
        "t": 164.0
      }
    },
    {
      "label": "list_item",
      "text": "167. bn Farak, Tafsir al-Qur’an al-mansit li-Abi Bakr Muhammad b. al-Hasan b. Farak, ed. M.al-Sulaymant etal, 3 vols, (Cairo: Council of Muslim Elders, 1441/2020), 1: 451",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 657.0,
        "t": 134.0
      }
    }
  ],
  "23": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "873",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "points to Q 65:12 as the only quranic evidence for the existence of seven earths, and men- tions the possibility that Q 68:1 refers to the cosmic fish that bears the earths aloft. * Over- all, his position on cosmographical questions is thus difficult to characterize: he does not overtly criticize traditionalist views, but distinguishes the heavens from the celestial spheres in a manner that suggests an attempt at harmonization,",
      "bbox": {
        "l": 97.0,
        "b": 887.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Contemporaneously operating with these three in the polemically charged context of Baghdad, al-Shaykh al-Mufid is known to have met and exchanged views with al-Bagillant and ‘Abd al-Jabbar. ' Al-Mufid has typically been understood to have made major con- tributions to the adoption of Mu‘tazili theology in the Twelver school, paving the way for “the greater rationalization of Imamism that took place at the hands of his pupils.” Like his more traditionally inclined shaykh, Ibn Babawayh, al-Mufid understood God’s throne figuratively. None of the dubious reports about the angelic bearers of the throne, he notes, is widely transmitted (ie., they are dhadi), and so do not constitute part of correct doc- trine.!7\" AL-Mufid defines the cosmos (‘alam) in two places as “the sky and the earth, what- ever they contain and whatever is between them.”!7? In his wail al-magaiat, he concurs with al-Balkhi and the munajjimiin in believing the earth to be an immobile sphere at the center of the cosmos. This location at the center (ff al-markaz) is the cause of the earth’s immobility—contra al-JubbaT pére et fils, as well as many other theologians. !73 Much like al-Balkhi in a previous generation, al-Mufid’s views align very closely with the advocates of the science of the stars, at least as far as narrow questions of cosmography are concerned. Like al-Balkhi—distinctively among the Baghdad Mu‘tazilis—al-Mutid denies the existence of intracosmic void, against most of the mutakallimiin and the Ash‘aris (ie., mutakallimi al-hashwiyya wa-ahl al-jabr wa-l-tashbth).175 This seemingly deliberate alignment with al-Balkhi, the chief of the Baghdad Mu‘tazilis, is explained by al-Mufid’s general sympathy for the Baghdad school, which would shift in his students’ generation, Al-Mufid’s inclination toward the cosmographical views of the munajjimiin was echoed by his student Abii al-Fath al-Karajiki (d. 449/1057), whose endorsement is, if anything, more full-throated. 17",
      "bbox": {
        "l": 97.0,
        "b": 491.0,
        "r": 659.0,
        "t": 884.0
      }
    },
    {
      "label": "text",
      "text": "The Buyid chief judge ‘Abd al-Jabbar, who is reported to have taught both al-Mufid and his student al-Sharif al-Murtada, played a key role in ensuring the triumph of the Bah- shami Mu‘tazilis in his generation, His influence on the subsequent history of the school was an enduring one. ‘Abd al-Jabbar studied in Baghdad and elsewhere, but relocated to Rayy to take up his judicial post, where he attracted further students (among whom, Ibn",
      "bbox": {
        "l": 97.0,
        "b": 400.0,
        "r": 658.0,
        "t": 488.0
      }
    },
    {
      "label": "list_item",
      "text": "168. Ibid, 2: 384, 3:70, 96, respectively",
      "bbox": {
        "l": 117.0,
        "b": 362.0,
        "r": 318.0,
        "t": 374.0
      }
    },
    {
      "label": "list_item",
      "text": "169. Bayhom-Daou, Shaykh Mufid, 23. Al-Mufdis also reported asa student of “Abd al-Jabbar; M.T. Heems- kerk, art. ‘Abd al-Jabbar b. Ahmad al-Hamadhni, £73, online (accessed September 18, 2020).",
      "bbox": {
        "l": 97.0,
        "b": 332.0,
        "r": 657.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "170, Bayhom-Daou, Shaykh Mufid, 9; see also Abdulster, Shit Doctrine, Mu‘tazili Theology, 2-7 (on the perennial question of “influence” and the incommensurabilty of Mu‘tzilism and Imami Shi‘ism).",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "17 AbMufd, Tashi tigadat al-imdmiyya, ed. H. Darga (Tehran: al-Mu\"tamar al‘Rlamt li-Alfiyyat al Shaykh al-Mufid, 1413h), 75-78. For Ibn Babawayh’s views, ee his Kitab al-Tuigadar (Qom: Mu?assasatal-Imam al-HBdt, 1389%), 100, 102-8; idem, al-Tawhtd, ed. H.al-Husayat al-Tibrt (Beirut: Dar al-Mattifa, 1387h), 250, 317.",
      "bbox": {
        "l": 97.0,
        "b": 243.0,
        "r": 658.0,
        "t": 299.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 243.0,
        "r": 658.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "172. ALMufid, Aue? al-magdla, 99; idem, “al-Nukat 11 mugaddimat al-usl,” in al-Nukar a-igadliya, ed MR al-Jalal al-Hlusaynt et al. (Tehran: Dir al-Mufld, 14314), 30 (where the word order is slightly different.",
      "bbox": {
        "l": 97.0,
        "b": 212.0,
        "r": 656.0,
        "t": 239.0
      }
    },
    {
      "label": "list_item",
      "text": "173, AL-Mufid, 4wd?il al-magdlat, 99-100.",
      "bbox": {
        "l": 116.0,
        "b": 197.0,
        "r": 328.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "174, For a summary with translations, see McDermott, Theology ofal-Shaikhal-Mufi, 213-15.",
      "bbox": {
        "l": 116.0,
        "b": 182.0,
        "r": 587.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "175. Al-Mufid, 4w2?il al-magdlar, 100. On void, see A. M. Kandemir, “The Hand Extending beyond the Cos- ‘mos: Discussions on the Khald? (Void) between the Basran and Baghdid Schools of Mu‘tazla,” i. A. Ozkan, Nazariyat 7 (2021): 1-38.",
      "bbox": {
        "l": 97.0,
        "b": 137.0,
        "r": 658.0,
        "t": 179.0
      }
    },
    {
      "label": "list_item",
      "text": "176. Abd al-Fathal-Karajikt, Kans al-fawd, ed, ‘A. Nitma, 2 vols. (Beirut: Dar al-Agwa?, 1405/1985), 2: 101-4",
      "bbox": {
        "l": 98.0,
        "b": 107.0,
        "r": 657.0,
        "t": 134.0
      }
    }
  ],
  "24": [
    {
      "label": "page_header",
      "text": "874",
      "bbox": {
        "l": 98.0,
        "b": 999.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Mattawayh). \"77 Cosmography hardly features in the extant volumes and fragments of his voluminous al-Mughni fi abwab al-tawhid wa-l-‘adl, but may have been addressed in its lost parts. Like previous Mu‘tazilis, ‘Abd al-Jabbar refutes the dualist belief in the infinitude of the cosmos.'” In his Tanzth al-Qur?an ‘an al-mata‘in, an apologetic work written against the text’s critics, he maintains that the firmament is not held up by pillars and the sun does not literally set into a body of water.\" Al-Jishumi reports ‘Abd al-Jabbar as suspending judgment on the shape of the earth, which suggests that he regarded the evidence for both sides of the argument as equipollent (takéfi’ al-adilla)'*! This period marked the almost complete assimilation of the heritage of late antiquity in textual form, a development power- fully evidenced by the career of the greatest of the philosophers, Ibn Sind (d. 428/1037).'82 The reluctance of the leading Bahshami to concede the most basic points of the Aristotelian- Ptolemaic viewpoint is thus deeply revealing",
      "bbox": {
        "l": 97.0,
        "b": 760.0,
        "r": 658.0,
        "t": 975.0
      }
    },
    {
      "label": "text",
      "text": "“Abd al-Jabbar’s student Ibn Mattawayh produced the most extensive extant account of kalam physics in al-Tadhkira ff ahkam al-jawahir wa-l-a‘rad, which includes long passages on cosmography (mostly in the context of discussions of motion). 5 Given its length, I can only allude to some of the most salient points. Ibn Mattawayh affirms the immobility of the heavens and the earth, based on Q 35:41. He notes three views on the cause of the earth’s immobility, and refutes the notion that it is kept in place by the attraction or repulsion of the spheres; were these forces in operation, they would have the effect of a mighty wind (77h if), which we clearly do not witness. '*5 Ibn Mattawayh argues that the firmament does not encompass the earth from all sides, contra al-Balkhi, for if the earth is below the firmament, then it must always be beneath it wherever on the earth one is. Al-Ka‘bi’s mistaken view entails that if one dug deep enough into the earth, eventually the stars and heavens would be visible beneath one’s feet, and this is absurd. 86 Ibn Mattawayh condemns the masses (‘Gmma) for their belief that the earth rests on the back of some animal (hayawan). This belief is refuted on the grounds that if God could cause the earth to rest on a single object bearing its weight, he could likewise cause it to rest on nothing at all, keeping its aloft by his",
      "bbox": {
        "l": 97.0,
        "b": 490.0,
        "r": 658.0,
        "t": 758.0
      }
    },
    {
      "label": "list_item",
      "text": "177. Heemskerk, at ‘Abd al-Jabbr al-Fishumt, “Sharh al‘Uyiin,” in Fad! alsa! wa-tabagat al-mu‘tazila, ced. F. Sayyid (Tunis al-Dar al-Tunisiyya lisl-Nashr, 1393/1974), 389.",
      "bbox": {
        "l": 98.0,
        "b": 406.0,
        "r": 658.0,
        "t": 434.0
      }
    },
    {
      "label": "list_item",
      "text": "178. I make this laim based on ‘Abd al-Jabbar's interest in cosmography in his extant work, and on the fact that certain cosmographical points had become established as staples of kal prior to his career; thus, itis reasonable to assume that he addressed the issue Somewhere in al-Mugh (ed. K. M. Nabhd, 14 vos. in 10 (Beirut Dar al-Kutub al‘limiyya, 1433/2012), intended as a comprehensive guide to Mu‘tazli theology.",
      "bbox": {
        "l": 97.0,
        "b": 346.0,
        "r": 658.0,
        "t": 404.0
      }
    },
    {
      "label": "list_item",
      "text": "179. ‘Abd al-Sabbar,a-Mught, $28 (specifically the Manicheans).‘Albd al-Jabbar borrows liberally from the discussion of their views by al-Nawbakbe.",
      "bbox": {
        "l": 98.0,
        "b": 317.0,
        "r": 657.0,
        "t": 344.0
      }
    },
    {
      "label": "list_item",
      "text": "180. ‘Abd al-abbar, Tans al-QuP’dn ‘an al-mata‘in (Cairo: al-Maktaba al-Azhariyya, 13294), 179, 217 respectively. For his views on Q 18:86, see also al-Sshumt,al-Tahdhib, 6: 4482",
      "bbox": {
        "l": 98.0,
        "b": 286.0,
        "r": 658.0,
        "t": 314.0
      }
    },
    {
      "label": "list_item",
      "text": "181, Ab-Jishumt,al-Tahdhib, 1: 284",
      "bbox": {
        "l": 118.0,
        "b": 272.0,
        "r": 296.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "182. For Ibn Sins cosmographical views, which closely follow those of Aristotle, see, e.., his al-Shi?, ed Anawati etal, 10 vols. (Qom: Manshirat Maktabat Ayat Allah alUzmi al-Mar‘ash l-Najaf, 1405h),2: 58-63. See also D. Janos, “Moving the Orbs: Astronomy, Physics, and Metaphysies, and the Problem of Celestial Motion ‘According to Iba Sind,\" ASP 21 (2011): 165-214",
      "bbox": {
        "l": 97.0,
        "b": 211.0,
        "r": 657.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "183. Tbn Mattawayh, a-Tadhira, 1: 283-88, 305-7, see also S. Schmidtke, An Anonymous Commentary on ‘Kitab al-Tadhkira by Ibn Mattawayh: Facsimile Edition of Mahdavi Codex 514 (6i/121h Century) (Tehran: Ira- nian Institute of Philosophy, 2006), $2a-85b. CF. tba al-MurtadS, Mugaddimat Kit al-Bahr al-zakhbhar alam omadhahib Salama? al-amsar, ed. ‘A. b.‘A. al-Jarft (Sanaa: Dat al-Hikma al-Yamdniyya, 1409/1988), 103-4",
      "bbox": {
        "l": 97.0,
        "b": 152.0,
        "r": 658.0,
        "t": 209.0
      }
    },
    {
      "label": "footnote",
      "text": "184, thn Mattawayh,al-Tadira, 1: 283,",
      "bbox": {
        "l": 116.0,
        "b": 136.0,
        "r": 320.0,
        "t": 149.0
      }
    },
    {
      "label": "footnote",
      "text": "185. Ibid, 286",
      "bbox": {
        "l": 117.0,
        "b": 122.0,
        "r": 193.0,
        "t": 134.0
      }
    },
    {
      "label": "footnote",
      "text": "186, Ibid, 287",
      "bbox": {
        "l": 116.0,
        "b": 108.0,
        "r": 194.0,
        "t": 119.0
      }
    }
  ],
  "25": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "815",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "volition alone. Were this not the case, something would be required to support the underlying object ad infinitum, an obvious absurdity. 87",
      "bbox": {
        "l": 98.0,
        "b": 940.0,
        "r": 657.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "‘Among the Ash‘aris of this generation, there was no reluctance whatever to critique the ‘munajjimiin. ‘Abd al-Qahir al-Baghdadi, a student of al-Isfardint (alongside whom he was buried), '88 condemns their views at length, deferring to largely traditionalist positions on cosmography. His exposition of the subject in Kitdb Usiilal-din expands on the treatment in al-Ash‘arT’s Magalat al-islamiyyin, on which itis evidently based, \" In the course of his sur- vey, al-Baghdadi mentions more obscure ancients, including Eudoxus of Cnidus (Qanddis, d_ 337 BCE) and Menelaus of Alexandria (Milawash, d. 140 ce). !%° Muslims, Jews, and Chris- tians, al-BaghdadT informs us, are all agreed that the earth is immobile, with the exception of the occasional earthquake afilicting its inhabitants. On this point, they concur with such luminaries as Plato, Aristotle, Ptolemy, and Euclid. Other opinions include the notion that the arth spins on its axis while remaining in place (Eudoxus, and allegedly Menelaus), or the view that it is the earth that moves and the firmament that is fixed, contra the munajjimiin.\"?! Following al-Ash‘ari, al-Baghdad?’s main purpose in the discussion is to argue that the earth remains in place only by virtue of God’s power: “God [. . .] has suspended it [in place] nei- ther by means of a body [on which it rests] nor by means of the air that encompasses it.” In a later chapter he foregrounds his cosmographical traditionalism, writing that the seven heavens are stationary plates (sg. fabag) one above the other and the “stars (kawdkib) are all located in the lowermost heaven,” against the astronomers, who claim that the firmament is a sphere. 3 He insists that the heavens are both flat and immobile, and is even more strident ‘on these points in his heresiography, al-Farg bayn al-firag. In his recently published al-Asmé wa-t-sifat, al-Baghdadi similarly criticizes the munajjimiin for diverging from the correct view on “the layout (siira) of the heavens, the stars, [and] the earth [.. .).”!95",
      "bbox": {
        "l": 97.0,
        "b": 545.0,
        "r": 658.0,
        "t": 938.0
      }
    },
    {
      "label": "list_item",
      "text": "187, Ibid.",
      "bbox": {
        "l": 116.0,
        "b": 468.0,
        "r": 165.0,
        "t": 479.0
      }
    },
    {
      "label": "list_item",
      "text": "188. Ibn ‘Asikir, Tabyin, 253-54,",
      "bbox": {
        "l": 116.0,
        "b": 452.0,
        "r": 281.0,
        "t": 464.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 452.0,
        "r": 281.0,
        "t": 464.0
      }
    },
    {
      "label": "list_item",
      "text": "189. Comparing, eg. al-Ash‘arl, Magdlat al-islamiyyin, 326 with al-Baghdadi, Kitab Usilal-din, 60-63,",
      "bbox": {
        "l": 116.0,
        "b": 436.0,
        "r": 630.0,
        "t": 449.0
      }
    },
    {
      "label": "list_item",
      "text": "190. Al-Baghdadl is known to have been a competent mathematician, and translations of (at least some of) ‘Menelaus’s work into Arabic would quite possibly have been available to him, but his phrasing suggests that he accessed these views from a doxography (hukiva ‘an; Kisdb Usil al-din, 61). On Arabic translations of Menelaus’s ‘works, see Ibn al-Nadim, ed. Sayyid, 2: 214. Ibn al-Nadim gives his name more accurately as Minalawus. On al-Baghdidi as a mathematician, see, e.g, Ibn ‘Asikir, Zabyin, 254 (where he is described in glowing terms as al-mdhir fm al-hisdby, Nguyen, “Exegetes of Nishapur,” 60",
      "bbox": {
        "l": 97.0,
        "b": 346.0,
        "r": 658.0,
        "t": 434.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 346.0,
        "r": 658.0,
        "t": 434.0
      }
    },
    {
      "label": "footnote",
      "text": "191. Al-Baghd8di, Kitab Usiil alin, 61",
      "bbox": {
        "l": 117.0,
        "b": 331.0,
        "r": 317.0,
        "t": 344.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 331.0,
        "r": 317.0,
        "t": 344.0
      }
    },
    {
      "label": "list_item",
      "text": "192, Ibid, tn al-Baghdad’s oeuvre itis unclear whether the denial thatthe earth rests on a body entails that there is nothing beneath it (against the traditionalists), or merely that it is God’s power and not the influence of an adjacent bbody that keeps the earth aloft.",
      "bbox": {
        "l": 97.0,
        "b": 286.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 286.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "193. Ibid,, 64-66, Kawkab could be used to refer to a planet or star interchangeably. In later periods it tended to mean star exclusively; tbn ManzOr (4. 711/1311f), Lisdn al“arab, 15 vols. (Beirut: Dir Sadi, nd., 1: 720-21",
      "bbox": {
        "l": 97.0,
        "b": 256.0,
        "r": 657.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "194, Al-Baghd8di,al-Farg bayn alfirag, 285-86. This passage is very clearly evoked by the Quran commentator al-Qurtubt (4. 671/1273), who observes that Q 12:3 “refutes those who claim the earth is round”; alJdmi li-ahkam al-Qur’an, ed. ‘A. b. ‘Abd al-Mubsin al-Turkt et al, 24 vols. (Beirut: Mu?assasat al-Risdla, 1427/2006), 12: 8-9. Ibn Taymiyya (al-Risdla al“arshiyya, 12-13) is probably alluding to al-Baghdadt when he criticizes mutakallimin ‘who “contradict the philosophers on the [issue of] the {heavenly} spheres with views that lack a basis in seripture or in reason, all the while thinking they champion religion thereby”; see also Ibn al-Qayyim (d. 751/13S0), Mifiah dar al-sa‘dda wa-manshir wildyat al-‘ilm wa-l-irdda, 2 vols. (Beitut: Dar al-Kutub al-Umiyya, 1419/1998), 2: 212. For a modem debate on this material, see M. Sali al-Ghursl, Manha al-asha‘ira ft al-Cagida bayn al-hagd?iq wa-l- ‘awhdm (Konya: Ravza, 1429/2008), 153-55",
      "bbox": {
        "l": 97.0,
        "b": 122.0,
        "r": 657.0,
        "t": 254.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 97.0,
        "b": 122.0,
        "r": 657.0,
        "t": 254.0
      }
    },
    {
      "label": "footnote",
      "text": "195. Al-Baghd8di, al-Asmd? wa-L-sift, 3: 294.",
      "bbox": {
        "l": 116.0,
        "b": 106.0,
        "r": 346.0,
        "t": 119.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 106.0,
        "r": 346.0,
        "t": 119.0
      }
    }
  ],
  "26": [
    {
      "label": "page_header",
      "text": "876",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Like ‘Abd al-Qahir al-Baghdadi, the Twelver nagib al-ashrif (head of the Prophet’s descendants), “lim, and man of letters al-Sharif al-Murtada was keen to refute astrology. Crucially, the astrologers” accurate predictions of eclipses, he insists, ought not to be taken as a sign of the broader validity of their claims.'%7 As a student of al-Mufid (and leader of Baghdad’s Twelver community after his death), \" al-Murtada unsurprisingly endorses the roundness of the earth (against Aba ‘Ali al-Jubba?) and like his shaykh (Abd al-Jabbar, reads Q 18:86 figuratively. %° Hussein Abdulsater characterizes al-Murtada as largely pursuing established trends within rationalist Shi‘ism, with some departures, and as having engaged much more critically with the Mu‘tazilism of the school of ‘Abd al-Jabbar.2” Unlike al-Mufid, however, he identified more closely with the views of the Basran than Baghdad Muttazilis, but his disagreements with the former remain legion.\"",
      "bbox": {
        "l": 97.0,
        "b": 779.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Abii Rashid al-NaysabirT was also a student of ‘Abd al-Jabbar, whom he succeeded as the leading theologian of the Bahshami school.20? Al-Naysabiri had defected from the Baghdad wing of the Mu‘tazilis, and so his account of the differences between them, Kitab al-Mas@il fi al-khildf, is an invaluable source. In it he reviews the debate on the shape of the earth, finally upholding its flatness against the claims of Aristotle’s De Caelo and Ptolemy's Almagest.2°° Al-Naysibiii produces three main arguments to prove the earth is flat, in addi- tion to refuting several objections. If the earth were round, he writes, it would be equidistant at all points from the firmament, like a dot drawn at the center point of a circle. If this were the case, one would not see the sun rise and set, nor would it appear higher and lower in the sky at various points during the day, increasing and decreasing in size, because it would not move farther from or draw closer to the earth in the course of its daily cycle. Furthermore, bodies of water would not remain in place on a round earth; there would be nothing to keep them from falling into the surrounding air. Finally, the earth’s roundness contradicts the straightforward meaning of Q 79:30, according to which God spread out or “flattened” the earth (dahaha) following its creation.?°S While al-Naysdbiiri does note that this verse can be interpreted as referring to parts rather than to the whole of the earth (the view favored by al-Murtada), he does not ultimately agree.?° He does not express his opinion in a tone that",
      "bbox": {
        "l": 97.0,
        "b": 472.0,
        "r": 658.0,
        "t": 776.0
      }
    },
    {
      "label": "footnote",
      "text": "196, Al-Murtads, Rasd?ilal-Murtada, ed A l-Husaynf and M.al-Raj, 4 vols. (Qom: Dir al-Quean al-Karim, M405h),2: 301-12.",
      "bbox": {
        "l": 98.0,
        "b": 407.0,
        "r": 657.0,
        "t": 434.0
      }
    },
    {
      "label": "footnote",
      "text": "198. Abdulsater, Shit Doctrine, Mu‘tactli Theology, 19. For a survey of the theological differences between them, see McDermott, Theology of al-Shaikh al-Muftd, 373-94; Abdulsater, Sh‘l Doctrine, Mu‘ucili Theology, 213-14.",
      "bbox": {
        "l": 97.0,
        "b": 348.0,
        "r": 658.0,
        "t": 389.0
      }
    },
    {
      "label": "footnote",
      "text": "199. Tafsir al-Sharf al-Murtada, ed. M. A. al-Mosawt et al, 3 vols. (Beirut: Markaz al-A‘lamt, nd), 1 311; idem, Amaltal-Murtada, 2: 187-88. There is some incidental traditionalist cosmographical material in Nahj ‘al-balagha, compiled by his brother al-Shari l-Radt (d. 06/1015). Fora crtical commentary on these points, see lpn Abt al-Hladid, Sharh Nah al-baldgha, ed, M. Ibrahim, 11 vols. (Baghdad: Dar al-Kitsh al‘Arabf, 1428/2007), 1:56 (where he refutes the “five hundred years” hadith, interprets the seven earths as climes, and denounces belief in the “tock, the fish andthe cow {i bull” as superstitious).",
      "bbox": {
        "l": 98.0,
        "b": 256.0,
        "r": 658.0,
        "t": 344.0
      }
    },
    {
      "label": "footnote",
      "text": "201. For examples of agreement, see ibid, e-2, 52-83, 77-78, 99-100; for disagreement, see, eg, 111-13, 213-16.",
      "bbox": {
        "l": 98.0,
        "b": 211.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 211.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "list_item",
      "text": "202, Alsishumf, “Sharh alUytn,” 382.",
      "bbox": {
        "l": 116.0,
        "b": 197.0,
        "r": 315.0,
        "t": 209.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 197.0,
        "r": 315.0,
        "t": 209.0
      }
    },
    {
      "label": "list_item",
      "text": "203. AbNaysabiit, Kiab al-Masdl fr a-ha, 100-104",
      "bbox": {
        "l": 116.0,
        "b": 182.0,
        "r": 402.0,
        "t": 194.0
      }
    },
    {
      "label": "list_item",
      "text": "204. Ibid, 100-101",
      "bbox": {
        "l": 116.0,
        "b": 168.0,
        "r": 219.0,
        "t": 179.0
      }
    },
    {
      "label": "list_item",
      "text": "208. tid. 101",
      "bbox": {
        "l": 116.0,
        "b": 153.0,
        "r": 194.0,
        "t": 164.0
      }
    },
    {
      "label": "footnote",
      "text": "206. The objection is that “God intended {by this verse] only parts of the earth (ba‘d al-ard); for the earth contains flat expanses, and there is no reason not to restrict the scope [ofthis phrase i some evidence requires it ibid, 101; compare with al-MasawT et al eds, Taftral-Sharif al-Murtada, : 311",
      "bbox": {
        "l": 98.0,
        "b": 106.0,
        "r": 658.0,
        "t": 149.0
      }
    }
  ],
  "27": [
    {
      "label": "page_header",
      "text": "NCHA: st: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "877",
      "bbox": {
        "l": 634.0,
        "b": 998.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "is suggestive of certainty, writing that the earth’s flatness is “the position closest to the truth (agrab),” much as a jurist would say of a disputed point of law.2°7",
      "bbox": {
        "l": 98.0,
        "b": 940.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Baghdad was to remain the “intellectual center for kalam among the Imamis [. . .] until the Saljuq invasion of the city in 447/1056.”2\"* Before this tumultuous end to the so-called Shi‘i century, Abii Ja‘far Muhammad b. Hasan al-Tisi, shaykh al-1a?ifa, would emerge as the undisputed leader of the Baghdad community. Like most of the leading Twelver theologians of his generation, al-Tiist had studied under al-Mutfid as well as al-Murtada.2 He authored major works in the domains of figh, kaldm, and hadith, though it is his Quran commen- tary (among his extant published titles) that shows the most engagement with cosmography. AL-Tasi concurs with Abii ‘AIv al-Jubba’T that the firmament is not held up by pillars,?!° and like him refuses to identify the quranic heavens (samawat) with the spheres of the astrono- mers, on the grounds that the former (like the earth) are immobile.2\"' Al-Tast also affirms the existence of the seven earths, but implies that six are uninhabited.?!? His tafsir bears the impress of Abii ‘AI’, so it is perhaps no surprise to note that, like al-Murtad, he inclined to Basran positions,",
      "bbox": {
        "l": 98.0,
        "b": 706.0,
        "r": 658.0,
        "t": 938.0
      }
    },
    {
      "label": "text",
      "text": "Though Baghdad was to remain important as a hub of interaction between the various theological schools, by the time of the Saljug invasion of 447/1056, many of these had estab- lished their main intellectual centers elsewhere. This was particularly true of the Ash‘aris, now ensconced in Nishapur, and would soon be the case for the Twelver Shi'a. The aggres- sively anti-Shi‘ stance of the Saljugs radically constrained their opportunities to attract patronage.?!5 The Maturidis remained an eastern concern at this point. I was able to find little cosmographical material in any of their extant published kalaim texts of the period. Abi Shakir al-Salimi’s (4. after 460/1068) al-Tamhid ft bayan al-tawhid focuses its critique of the ‘munajjimiin on astrology, revealing nothing of al-Salimt’s cosmographical commitments. ?\"4 Somewhat more promisingly, Bahr al-kaldm of Abii al-Mu‘tn al-Nasafi (d. 508/1114f.) denounces the astronomers’ belief that the lowermost of the heavens (al-sama? al-dunya) contains only the moon among the celestial bodies. 2!",
      "bbox": {
        "l": 97.0,
        "b": 490.0,
        "r": 658.0,
        "t": 704.0
      }
    },
    {
      "label": "section_header",
      "text": "VI. CONCLUSIONS: ENTER AL-~GHAZALI?",
      "bbox": {
        "l": 245.0,
        "b": 455.0,
        "r": 510.0,
        "t": 468.0
      }
    },
    {
      "label": "text",
      "text": "It is clear that the Aristotelian-Ptolemaic vision of the cosmos remained contested by theologians of all stripes to the end of the fifth/eleventh century, though some (particu-",
      "bbox": {
        "l": 97.0,
        "b": 409.0,
        "r": 658.0,
        "t": 443.0
      }
    },
    {
      "label": "list_item",
      "text": "207. AlNaysibavt, Kiab al-Masal fr a-ha, 104",
      "bbox": {
        "l": 115.0,
        "b": 362.0,
        "r": 377.0,
        "t": 374.0
      }
    },
    {
      "label": "list_item",
      "text": "208. Ansari and Schmidike, “Shs Reception ofthe Mu‘tazila,",
      "bbox": {
        "l": 116.0,
        "b": 347.0,
        "r": 451.0,
        "t": 359.0
      }
    },
    {
      "label": "list_item",
      "text": "208. tid",
      "bbox": {
        "l": 115.0,
        "b": 333.0,
        "r": 165.0,
        "t": 345.0
      }
    },
    {
      "label": "list_item",
      "text": "210, AL-TOst, al-Tit al‘Arabt, nd), 6 213, dn ft tafir al-Qur’én, ed. A. H. Q. alRmif, 10 vols, (Beirut: Dir thy al-Tursth",
      "bbox": {
        "l": 97.0,
        "b": 302.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "211, Ibid, 8: 437, AL-TOst therefore accepts the existence of the celestial spheres of the astronomers.",
      "bbox": {
        "l": 115.0,
        "b": 286.0,
        "r": 607.0,
        "t": 299.0
      }
    },
    {
      "label": "list_item",
      "text": "212. Ibid, 10:41",
      "bbox": {
        "l": 115.0,
        "b": 273.0,
        "r": 205.0,
        "t": 284.0
      }
    },
    {
      "label": "list_item",
      "text": "213. On Saljug religious policy, see, e.¢, Safi, The Politics of Knowledge in Premodern Islam: Negotiating Ideology and Religious Inquiry (Chapel Hill: Univ. of North Carolina Press, 2006), xxv-X3Wi, 93-97,",
      "bbox": {
        "l": 97.0,
        "b": 241.0,
        "r": 658.0,
        "t": 269.0
      }
    },
    {
      "label": "list_item",
      "text": "214, Al-Salimt regards the practice of astrology as blameworthy, but notes that as long as practitioners main- tain their belief in God as the determiner of all affairs, they are merely erroneous (rather than unbelieving). He notes that astrology was permissible in the time of Enoch (drs), but that this permissibility was abrogated inthe Muhammadan dispensation, idem, Ei-Temhid ft beydn'ttevkid, ed, 0, Tarkmen (Istanbul: Turkiye Diyanet Vaki Yayinlan, 2016), 85-88.",
      "bbox": {
        "l": 97.0,
        "b": 166.0,
        "r": 658.0,
        "t": 239.0
      }
    },
    {
      "label": "list_item",
      "text": "215. His point is that, in accordance with traditionalist doctrine, the lowest heaven contains both the sun and ‘moon, See al-Nasaft, Bah al-kalam, ed, M.al-S.al-Barsi (Amman: Dar al-Fath, 1435/2014), 25S. CF. Rukn al-Din al-Turayththt (4, after 400/1010), Muashabihal-QuP'n, ed. ‘A. al-Salimt (Cairo: al-Hlay'a alAmma licDar al- Kutub wa-Wathiq al-Qawmiyya, 1436/2015), 978",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 658.0,
        "t": 164.0
      }
    }
  ],
  "28": [
    {
      "label": "page_header",
      "text": "878",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "larly al-BalkhT and those inclined to follow him) made generous concessions to it. Nor can ‘one speak of a ready embrace of the traditionalist cosmography among the mutakallimiin Al-Jishiimi’s Quran commentary, written toward the end of the period, makes the extent of the Mu‘tazili disagreement clear. Unfortunately, his own opinions are frustratingly hard to pin down.2! Among the Ash‘aris, ‘Abd al-Qahir al-Baghdad? comes closest to adopting the traditionalist view of the cosmos, but owing to the paucity of the sources, it is impossible to state how far exactly this agreement extends.2!7 Imam al-Haramayn (d. 478/1085) reiter- ates the standard Ash‘ari view on the immobility of the earth against some of the ancients, without further comment.?!*",
      "bbox": {
        "l": 98.0,
        "b": 817.0,
        "r": 659.0,
        "t": 974.0
      }
    },
    {
      "label": "text",
      "text": "Thus, by the end of that century, the disagreement among mutakallimiin on cosmography ‘was far from being resolved, and such little nodes of common opinion as I have been able to find do not fit readily into patterns of school affiliation. This is perhaps unsurprising given cosmography’s location in dagig al-kaldm, beyond the domain of “theology” proper and so subject to perennial dispute (at least in theory). Nevertheless, it seems clear that the practitio- ners of scientific astronomy had not made tremendous headway in persuading the theological thought-leaders of Islamdom to accept even their premises, e-g., the roundness of the earth or the earth’s location at the center of a system of concentric heavenly spheres. These con- cessions would eventually emerge among theologians, but not in the period under scrutiny.",
      "bbox": {
        "l": 97.0,
        "b": 653.0,
        "r": 658.0,
        "t": 812.0
      }
    },
    {
      "label": "text",
      "text": "Though it can hardly be much more than conjecture, given the state of the field, I would like to suggest in parting that al-Ghazali made a significant contribution toward facilitating the rehabilitation of the Aristotelian-Ptolemaic view (at least in its broadest outlines).?! Judging from the evidence of its citation history, the material on the cause of eclipses in his al-Mungidh and Tahéfut seems to have exercised broad influence.22° If proven, al-Ghazali would seem to have had the same effect on rehabilitating Greek cosmography as he did on logic. The two are interesting parallel cases, beginning on the margins of theological discourse before working their way into the disciplinary toolkit of postclassical religious learned culture.22! Mounting this argument in detail is evidently beyond the scope of this paper. It is clear, however, that even after the mutakallimiin had embraced the main fea~ tures of the Aristotelian-Ptolemaic view, works of traditionalist cosmography continued to",
      "bbox": {
        "l": 97.0,
        "b": 455.0,
        "r": 658.0,
        "t": 650.0
      }
    },
    {
      "label": "footnote",
      "text": "216. Eg, al-ishumt, al-Tahditb, 7: 4817-18 (for his distinguishing the falak from the sama without clearly adopting the notion of heavenly spheres); 9: 6547 (for his reporting the interpretation of Q&f as a mountain range of green emerald without criticism); 10: 7392 (for his discussion of Q 88:20 without defending an opinion on the shape of the earth),",
      "bbox": {
        "l": 97.0,
        "b": 377.0,
        "r": 658.0,
        "t": 434.0
      }
    },
    {
      "label": "footnote",
      "text": "217. Al-Baghdadt's fr is partly extant in a unicum manuscript in Tashkent. I thank Martin Nguyen for dis ccussing his work on ths text with me.",
      "bbox": {
        "l": 97.0,
        "b": 346.0,
        "r": 658.0,
        "t": 374.0
      }
    },
    {
      "label": "footnote",
      "text": "218. Thave not been able to find a reference to this discussion in Imm al-Haramayn al-Juwaynt's Kitdb al-rshiid a gawan al-adilla ft us al-tigdd, ed, M. Y. Mos and ‘A. ‘A. ‘Abd al-Hamid (Cairo: Maktabat al-Khinji, 1369/1950). However, the relevant text can be found in his student Abd al-Qasim al-Ansirt's (d. 512/118) Sharh al-Irshad, ed. K.al-‘Adwani, 3 vols. (Kuwait: Dir al-Diy®?, 1443/2022), 1: 404-7.",
      "bbox": {
        "l": 97.0,
        "b": 287.0,
        "r": 658.0,
        "t": 344.0
      }
    },
    {
      "label": "footnote",
      "text": "219. On al-Ghazal’s role and influence, see, eg., A. Shibadeh, “From al-Ghazall to al-RazK: 6th/12th Century Developments in Muslim Philosophical Theology,” ASP 15.1 (2005): 141-79, at 149-50.",
      "bbox": {
        "l": 97.0,
        "b": 257.0,
        "r": 657.0,
        "t": 284.0
      }
    },
    {
      "label": "footnote",
      "text": "220. For the passages in question, see al-GhazAll, The Incoherence of the Philosophers, tr. M. Marmura (Prove: Brigham Young Univ. Press, 2000), 6-7; idem, 4l-Ghazali’s Path to Sufism: His Deliverance from Error, al-Mung- {dh min l-Dalal,u. R. J. McCarthy (Louisville: Fons Vitae, 2000), 32-33. For a discussion of the influence of these passages in the modern period, see Riexinger, “Al-Ghazall’s ‘Demarcation of Science’.” I am currently collecting citations of this material in premodern works,",
      "bbox": {
        "l": 97.0,
        "b": 181.0,
        "r": 657.0,
        "t": 255.0
      }
    },
    {
      "label": "footnote",
      "text": "221. For a characterization of rationality in the postclassical curriculum, see J. Walbridge, God and Logie in Islam: The Caliphate of Reason (New York: Cambridge Univ. Press, 2011), 107-20. For an important contribution that contests the common view that logic was, on the whole, warmly received by Sunni scholars after al-Ghazal, see M. Ali,\"“A Statistical Portrait of the Resistance to Logie by Sunni Muslim Scholars Based on the Works of Jalal al-Din al-SuyUtt (849-909/14448-1505),\" Islamic Law and Soctety 15 (2008): 250-67.",
      "bbox": {
        "l": 97.0,
        "b": 106.0,
        "r": 657.0,
        "t": 179.0
      }
    }
  ],
  "29": [
    {
      "label": "page_header",
      "text": "ANCHASSt: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 995.0,
        "r": 560.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "879",
      "bbox": {
        "l": 634.0,
        "b": 999.0,
        "r": 656.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "be widely read, copied, and translated from Arabic.22? The circulation of such literature in the modem period deserves further comment; here I have essayed a preliminary sketch for the early period, based on the existing published corpus, but much essential work remains to be done.",
      "bbox": {
        "l": 97.0,
        "b": 907.0,
        "r": 658.0,
        "t": 974.0
      }
    },
    {
      "label": "section_header",
      "text": "APPENDIX 1",
      "bbox": {
        "l": 338.0,
        "b": 869.0,
        "r": 415.0,
        "t": 880.0
      }
    },
    {
      "label": "section_header",
      "text": "Quranic Verses That Attracted the Most Sustained Cosmographical Commentary",
      "bbox": {
        "l": 106.0,
        "b": 839.0,
        "r": 649.0,
        "t": 856.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 106.0,
        "b": 839.0,
        "r": 649.0,
        "t": 856.0
      }
    },
    {
      "label": "list_item",
      "text": "2:22: [God] who has made the earth a bed [outspread] for you,223 and the sky an edifice (bin@an);",
      "bbox": {
        "l": 98.0,
        "b": 786.0,
        "r": 658.0,
        "t": 819.0
      }
    },
    {
      "label": "list_item",
      "text": "2:255: his footstool (kursiuhu) encompasses the heavens and the earth;",
      "bbox": {
        "l": 115.0,
        "b": 768.0,
        "r": 548.0,
        "t": 783.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 115.0,
        "b": 768.0,
        "r": 548.0,
        "t": 783.0
      }
    },
    {
      "label": "list_item",
      "text": "9:129: and he [God] is the Lord of the great throne (al-‘arsh al-‘azim);",
      "bbox": {
        "l": 116.0,
        "b": 749.0,
        "r": 547.0,
        "t": 765.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 116.0,
        "b": 749.0,
        "r": 547.0,
        "t": 765.0
      }
    },
    {
      "label": "list_item",
      "text": "13:2-3: It is God who raised the heavens without pillars that you [can] see (bi-ghayri ‘amadin tarawnaha); then he settled on the throne, and subjected the sun and the moon, each running [in their courses] until an appointed time [...] he spread the earth (madd al-ard) and placed mountains and rivers therein;",
      "bbox": {
        "l": 97.0,
        "b": 677.0,
        "r": 658.0,
        "t": 747.0
      }
    },
    {
      "label": "list_item",
      "text": "16:15: He [God] set mountains [deep] into the earth, lest it shake with you (an tamida bikum;",
      "bbox": {
        "l": 97.0,
        "b": 643.0,
        "r": 657.0,
        "t": 675.0
      }
    },
    {
      "label": "text",
      "text": "18:86: Until he [Dhi al-Qamayn] reached the setting-place of the sun; he found it setting into a muddy spring (‘aynin hamiatin);",
      "bbox": {
        "l": 98.0,
        "b": 606.0,
        "r": 658.0,
        "t": 639.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 606.0,
        "r": 658.0,
        "t": 639.0
      }
    },
    {
      "label": "text",
      "text": "21:33 He [God] created the night and the day, the moon and the sun, each coursing through the sky (ft falakin yasbahiin),™",
      "bbox": {
        "l": 98.0,
        "b": 570.0,
        "r": 657.0,
        "t": 603.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 570.0,
        "r": 657.0,
        "t": 603.0
      }
    },
    {
      "label": "list_item",
      "text": "35:41: God holds the heavens and the earth, lest they fall away (an taziila);22° and if they fall away, none could hold them [in place] but God;",
      "bbox": {
        "l": 98.0,
        "b": 533.0,
        "r": 658.0,
        "t": 567.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 533.0,
        "r": 658.0,
        "t": 567.0
      }
    },
    {
      "label": "list_item",
      "text": "65:12: It is God who created the seven heavens; and of the earth, the like thereof (wa-min al-ardi mithlahunn),",
      "bbox": {
        "l": 97.0,
        "b": 480.0,
        "r": 657.0,
        "t": 513.0
      }
    },
    {
      "label": "text",
      "text": "88:20: [Do they not look] at the earth, and how it is spread out (susihat)?",
      "bbox": {
        "l": 116.0,
        "b": 444.0,
        "r": 560.0,
        "t": 459.0
      }
    },
    {
      "label": "list_item",
      "text": "222. 1 thank Feray Coskun for kindly sharing with me a daft of “Celestial Phenomena, Nature and Human Beings in Ottoman Cosmographies” (on translations into Ottoman Turkish) Indeed, books of “Islamic cosmog- raphy wete copied and readin the Ottoman Empite from the ninth fifteenth to the thirteenthnineteenth centuries onwards\"; F.Coskup, “An Ottoman Preacher's Perception of a Medieval Cosmography: Mahmbd al-Hatibs Trans- lation of Khartdata-4?ib wa Fartdatal-Ghard?ib,” Al-Masag 23 (2011): 53-66, at 59",
      "bbox": {
        "l": 98.0,
        "b": 256.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "list_item",
      "text": "223, Al-Tabart renders this “a carpet you can walk on, anda settling place for you to rest on.” Jimi al-bayn, 1: 387. To determine which re the most pertinent verses, I consulted M. Sh al-Als' (. 1924) fd dalla ‘alayhi al-Qu’’an mimma ya‘dud al-hay?a al-jadida al-qawina al-burkdn, ed. M. Z. al-Shawish (Beirut: al-Makiab al-{slimf, 1997), which surveys all ofthe Quran's cosmographical verses in sequence, and was written 10 support Copernican (\"new\") astronomy. I have omitted reference 10 the heavenly ropes or cords (asbdb), as these have already received sufficient attention inthe secondary literature; and Ihave given only the most pertinent part ofthe verse in many instances",
      "bbox": {
        "l": 97.0,
        "b": 152.0,
        "r": 658.0,
        "t": 254.0
      }
    },
    {
      "label": "list_item",
      "text": "224, For this and alternative interpretations, see al-Tabas, mi al-baydn, 16: 264-67.",
      "bbox": {
        "l": 115.0,
        "b": 137.0,
        "r": 542.0,
        "t": 149.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 115.0,
        "b": 137.0,
        "r": 542.0,
        "t": 149.0
      }
    },
    {
      "label": "list_item",
      "text": "225. Ibid, 19: 390-92.",
      "bbox": {
        "l": 115.0,
        "b": 122.0,
        "r": 226.0,
        "t": 134.0
      }
    },
    {
      "label": "list_item",
      "text": "226. Often understood to be a reference to the hit (ish on whose back the earth is spread), as has preceded",
      "bbox": {
        "l": 115.0,
        "b": 106.0,
        "r": 644.0,
        "t": 119.0
      }
    }
  ],
  "30": [
    {
      "label": "page_header",
      "text": "880",
      "bbox": {
        "l": 98.0,
        "b": 998.0,
        "r": 119.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "Journal of the American Oriental Society 142.4 (2022)",
      "bbox": {
        "l": 209.0,
        "b": 995.0,
        "r": 545.0,
        "t": 1010.0
      }
    },
    {
      "label": "section_header",
      "text": "APPENDIX 2",
      "bbox": {
        "l": 338.0,
        "b": 960.0,
        "r": 416.0,
        "t": 972.0
      }
    },
    {
      "label": "section_header",
      "text": "Ibn ‘Abd Rabbih’s Poem against Abi ‘Ubayda Muslim b. Ahmad al-Balanst",
      "bbox": {
        "l": 122.0,
        "b": 931.0,
        "r": 634.0,
        "t": 948.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 122.0,
        "b": 931.0,
        "r": 634.0,
        "t": 948.0
      }
    },
    {
      "label": "text",
      "text": "Ibn ‘Abd Rabbih”” criticizes al-Balansi on five points: his problematic theology (1. 2); his allegiance to a mathematically determined gibla (I. 3); his advocacy of astrology (Il. 4-5), and his belief in a spherical earth and heavens (II. S~6). On all of these points, al-Balan: ‘radicts traditionalist doctrine. On the second charge, specifically, one should note that early Muslims relied on nonscientific means for determining the direction of the Ka‘ba (along with prayer times, etc.). The adoption of other (mathematical) means, following the translation of late ancient learning into Arabic, met with resistance in Iberia (and presumably elsewhere), as noted by David King. Ibn ‘Abd Rabbih’s main argument against the roundness of the earth seems to be that lands separated by vast distances experience the same seasons at the same time. Were the earth round, he suggests, this would not be the case. ‘on-",
      "bbox": {
        "l": 98.0,
        "b": 734.0,
        "r": 659.0,
        "t": 911.0
      }
    },
    {
      "label": "section_header",
      "text": "Translation",
      "bbox": {
        "l": 98.0,
        "b": 702.0,
        "r": 168.0,
        "t": 715.0
      }
    },
    {
      "label": "list_item",
      "text": "O Abii ‘Ubayda! The one questioned for information // only recounts to whomever asks;",
      "bbox": {
        "l": 98.0,
        "b": 676.0,
        "r": 628.0,
        "t": 691.0
      }
    },
    {
      "label": "list_item",
      "text": "You follow only that which tums you aside from the community (jamd‘atind); // the Murj? and Mu‘tazili never attain {the truth];",
      "bbox": {
        "l": 97.0,
        "b": 640.0,
        "r": 648.0,
        "t": 673.0
      }
    },
    {
      "label": "list_item",
      "text": "As [with the] the original gibla, [which you have] substituted [with another], // declining {the original] and seeking no alternative [to your false one];",
      "bbox": {
        "l": 97.0,
        "b": 603.0,
        "r": 631.0,
        "t": 637.0
      }
    },
    {
      "label": "list_item",
      "text": "‘You allege that Mars or Venus bestow provision on us (yarzugund), // or even Mercury, Jupiter, or Saturn!",
      "bbox": {
        "l": 97.0,
        "b": 567.0,
        "r": 622.0,
        "t": 601.0
      }
    },
    {
      "label": "list_item",
      "text": "You claim that all creation by an orb (falak) // is encompassed that determines [creation’s] fate;",
      "bbox": {
        "l": 97.0,
        "b": 535.0,
        "r": 638.0,
        "t": 565.0
      }
    },
    {
      "label": "list_item",
      "text": "And that the earth is round, encompassed by the firmament // from above and below, and that it [the earth] is a point, for example;",
      "bbox": {
        "l": 97.0,
        "b": 495.0,
        "r": 631.0,
        "t": 529.0
      }
    },
    {
      "label": "list_item",
      "text": "‘The south’s summer is the north’s winter, // each taking turns [in alternating];",
      "bbox": {
        "l": 97.0,
        "b": 477.0,
        "r": 563.0,
        "t": 493.0
      }
    },
    {
      "label": "list_item",
      "text": "December in Sanaa and Cordoba // is cold; in September, fires are kindled [to keep warm];",
      "bbox": {
        "l": 98.0,
        "b": 458.0,
        "r": 643.0,
        "t": 475.0
      }
    },
    {
      "label": "list_item",
      "text": "This is the proof [of the correctness of our opinion}, and no other [view] deserves // adherence in thought or deed;",
      "bbox": {
        "l": 97.0,
        "b": 424.0,
        "r": 600.0,
        "t": 457.0
      }
    },
    {
      "label": "list_item",
      "text": "Just as Ibn Masa? persists in his waywardness, // until he made easy things [difficult], like ‘mountains;",
      "bbox": {
        "l": 97.0,
        "b": 388.0,
        "r": 651.0,
        "t": 421.0
      }
    },
    {
      "label": "list_item",
      "text": "227. Ibn ‘Abd Rabbi, Drwdn Ibn Abd Rabbih, ed. M. R. al-Daya (Beirut: MuPassasat al-Risdla, 1399/1979), 138-39. My translation draws on Shaykho's edition of al-Andalus!’s Kisab Tabagdt al-umam and Ibn ‘Abd Rab- bih’s texts, and diverges from the translation of Salem and Kumar on a number of points (see n. 71 above). For ba ‘Abd Rabbih’s biography, see IJ. Boullata, The Unique Necklace: al-‘gd al-Farid, vol. | (Reading: Garmet, 2006), xiv-xxii; A. P. Himor, art. Ibn ‘Abd Rabbih, £73, online (accessed July, 31, 2020) For his theological views, see al-igd al farid, 2: 216-24, 232-51",
      "bbox": {
        "l": 98.0,
        "b": 242.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 242.0,
        "r": 658.0,
        "t": 329.0
      }
    },
    {
      "label": "text",
      "text": "228. D. A. King, “The Enigmatic Orientation of the Great Mosque of Cordoba,” Suhay! 16-17 (2018-19) 133-111, at 58; idem, “Folk Astronomy in the Service of Religion: The Case of Islam,” in Astronomies and Cultures: Papers Derived from the Third “Oxford” International Symposium on Archaeoastronomy, St. Andrews, UK, Sep- tember 1990, ed. C.L..N. Ruggles and N. J. Saunders (Boulder: Univ. Press of Colorado, 1993), 124-38, at 131. In this latter article, King does, however, note that “Writers on folk astronomy [. .| do not mention the mathematical tradition” (p. 132), and (pp. 133-34) remarks that folk and scientific astronomy only rarely interacted, with impor- tant exceptions.",
      "bbox": {
        "l": 97.0,
        "b": 137.0,
        "r": 657.0,
        "t": 239.0
      }
    },
    {
      "label": "text",
      "text": "229. Qasim b. Masé al-Katib, ie., bn al-Afshin, another individual leamed in the sciences of the ancients; al-Andalusf, Tabagdt al-umam, 65.",
      "bbox": {
        "l": 98.0,
        "b": 106.0,
        "r": 657.0,
        "t": 134.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 98.0,
        "b": 106.0,
        "r": 657.0,
        "t": 134.0
      }
    }
  ],
  "31": [
    {
      "label": "page_header",
      "text": "ANCHASSt: Against Ptolemy? Cosmography in Early Kalam",
      "bbox": {
        "l": 194.0,
        "b": 994.0,
        "r": 559.0,
        "t": 1010.0
      }
    },
    {
      "label": "page_header",
      "text": "881",
      "bbox": {
        "l": 635.0,
        "b": 999.0,
        "r": 655.0,
        "t": 1010.0
      }
    },
    {
      "label": "text",
      "text": "Inform Mu‘awiya,?° who pays heed to their opinions, // that I have renounced their opinions and works! 73!",
      "bbox": {
        "l": 98.0,
        "b": 941.0,
        "r": 656.0,
        "t": 973.0
      }
    },
    {
      "label": "section_header",
      "text": "ABBREVIATIONS",
      "bbox": {
        "l": 323.0,
        "b": 904.0,
        "r": 431.0,
        "t": 915.0
      }
    },
    {
      "label": "text",
      "text": "EL The Encyclopaedia of Islam, 2nd ed. (12 vols., 1960-2006), 3rd ed. (online, 2007-)",
      "bbox": {
        "l": 98.0,
        "b": 845.0,
        "r": 604.0,
        "t": 859.0
      }
    },
    {
      "label": "footnote",
      "text": "230. A Qurasht genealogist ibid",
      "bbox": {
        "l": 116.0,
        "b": 121.0,
        "r": 278.0,
        "t": 134.0
      }
    },
    {
      "label": "footnote",
      "text": "231. I thank Tarig al-Timimi for his help with translating the final three lines.",
      "bbox": {
        "l": 115.0,
        "b": 106.0,
        "r": 495.0,
        "t": 119.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 756,
      "h": 1080
    },
    "2": {
      "w": 756,
      "h": 1080
    },
    "3": {
      "w": 756,
      "h": 1080
    },
    "4": {
      "w": 756,
      "h": 1080
    },
    "5": {
      "w": 756,
      "h": 1080
    },
    "6": {
      "w": 756,
      "h": 1080
    },
    "7": {
      "w": 756,
      "h": 1080
    },
    "8": {
      "w": 756,
      "h": 1080
    },
    "9": {
      "w": 756,
      "h": 1080
    },
    "10": {
      "w": 756,
      "h": 1080
    },
    "11": {
      "w": 756,
      "h": 1080
    },
    "12": {
      "w": 756,
      "h": 1080
    },
    "13": {
      "w": 756,
      "h": 1080
    },
    "14": {
      "w": 756,
      "h": 1080
    },
    "15": {
      "w": 756,
      "h": 1080
    },
    "16": {
      "w": 756,
      "h": 1080
    },
    "17": {
      "w": 756,
      "h": 1080
    },
    "18": {
      "w": 756,
      "h": 1080
    },
    "19": {
      "w": 756,
      "h": 1080
    },
    "20": {
      "w": 756,
      "h": 1080
    },
    "21": {
      "w": 756,
      "h": 1080
    },
    "22": {
      "w": 756,
      "h": 1080
    },
    "23": {
      "w": 756,
      "h": 1080
    },
    "24": {
      "w": 756,
      "h": 1080
    },
    "25": {
      "w": 756,
      "h": 1080
    },
    "26": {
      "w": 756,
      "h": 1080
    },
    "27": {
      "w": 756,
      "h": 1080
    },
    "28": {
      "w": 756,
      "h": 1080
    },
    "29": {
      "w": 756,
      "h": 1080
    },
    "30": {
      "w": 756,
      "h": 1080
    },
    "31": {
      "w": 756,
      "h": 1080
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}