{
  "1": "Against Ptolemy? Cosmography in Early Kalam\nOMAR ANCHASSI\nUNIVERSITY OF BERN\nThis article explores how mutakalliman engaged with competing visions of the\ncosmos traditionalist and Aristotelian-Ptolemaic-to the beginning of the sixth/\ntwelfth century. Drawing on works of kalam, Quran commentary, and items from\nother genres, I demonstrate that rationalist theologians remained divided on such\nquestions as the shape of the earth to the end of this period. These disagreements,\nmoreover, cannot be explained in terms of school affiliation. Based on a compre-\nhensive examination of published sources, I argue that cosmographical opinion\namong mutakallimün was a function of exposure to late ancient learning, intellec-\ntual formation, and personal inclination more than doctrinal commitment.\nIn 219/834 Ahmad b. Hanbal (d. 241/855) was hauled before the caliphal confidante Isḥāq\nb. Ibrāhīm (d. 235/850) for interrogation (i.e., miḥna). Shown \"an image of the heavens\nand the earth and other such things,\" Ibn Hanbal responded with confusion. \"I know noth-\ning about it,\" he protested, \"I do not know what this is (mā adrī mā hādhā).\" It is not clear\nwhy cosmography-ideas concerning the physical structure of the cosmos 3-featured in\nthis reported encounter between theological \"rationalism\" and \"traditionalism.\"4 We know\nthat Ibn Hanbal pitted himself against a range of adversaries, among whom the Baghdad\nAuthor's note: I thank the following (in alphabetical order) for their comments on drafts of this article: Feray\nCoşkun, Ahmed El Shamsy, Nahyan Fancy, Yossef Rapoport, Kevin Reinhart, and Emilie Savage-Smith. I extend\nmy thanks to Robert Morrison for his constructive criticism, to the three anonymous reviewers for JAOS for their\nsuggestions, and to others, who are acknowledged below, for discussions of specific points in this essay. A list of\nabbreviations used for publications in references can be found at the end of the article. This study is dedicated to my\nparents, my first and most important teachers.\n1. For Ishaq b. Ibrahim's involvement in the miḥna from the outset (as chief of the Baghdad police, shurta),\nsee Muḥammad b. Jarir al-Ṭabari, The History of al-Tabari, vol. 32: The Reunification of the 'Abbasid Caliphate,\ntr. C. E. Bosworth (Albany: SUNY Press, 1987), 199; J. A. Nawas, Al-Ma'mun, the Inquisition, and the Quest for\nCaliphal Authority (Atlanta: Lockwood Press, 2015), 59-60.\n2. Hanbal b. Ishaq (d. 273/886), Dhikr mihnat al-imam Ahmad b. Hanbal, ed. M. Naghash (Cairo: Där Nashr\nal-Thaqāfa, 1403h), 42; idem, Kitāb al-Miḥna, ed. A. al-Hanbali and M. al-Qabbānī (Riyadh: Markaz al-Malik\nFaysal, 1440/2019), 96-97. The latter editors speculate that he may have been shown an image or a book on the\nsubject. On an image of \"the universe with its spheres,\" see M. Cooperson, Al Ma'mun (Oxford: Oneworld, 2005),\n104. Hanbal b. Ishaq was a cousin of Ahmad b. Hanbal, and received this report from him directly.\n3. Binyamin Abrahamov (art. World, EQ, 5: 551-54) notes that there is no quranic term for \"cosmos\"; the clos-\nest equivalent is \"the heavens and the earth\" (al-samāwāt wa-l-ard). The word 'alam, a better fit, is a loanword from\nHebrew or Aramaic/Syriac.\n4. My use of theological \"rationalism\" and \"traditionalism\" is taken from B. Abrahamov's Islamic Theology:\nTraditionalism and Rationalism (Edinburgh: Edinburgh Univ. Press, 1998), ix-xi (this particular formulation of the\nbinary comes, ultimately, from George Makdisi). The usefulness of these terms has been critiqued, but I feel they\nremain valuable, as the reason-tradition binary is internal to the Islamic tradition. For Sherman Jackson's critique,\nsee his On the Boundaries of Theological Tolerance in Islam: Abu Hamid al-Ghazali's Faysal al-Tafriqa Bayna\nal-Islam wa al-Zandaqa (Oxford: Oxford Univ. Press, 2002), 19-29; idem, Islam and the Problem of Black Suf-\nfering (New York: Oxford Univ. Press, 2009), 10. In this article, I use the terms \"traditionalist\" and \"proto-Sunni\"\ninterchangeably when speaking of the formative period. On the term \"proto-Sunni,\" see M. Kuiper, \"The Roots\nand Achievements of the Early Proto-Sunni Movement: A Profile and Interpretation,\" The Muslim World 104.1-2\n(2014): 71-88.\nJournal of the American Oriental Society 142.4 (2022)\nhttps://doi.org/10.7817/jaos.142.4.2022.ar033\n851",
  "2": "852\nJournal of the American Oriental Society 142.4 (2022)\nMu'tazilis. We also know that this period marked the apogee of the Translation Movement,\nwhich brought the corpus of late ancient learning, including astronomy, into Arabic.6 One\nwonders which vision of the cosmos Ibn Hanbal's Mu'tazili persecutors subscribed to, tradi-\ntionalist or Aristotelian-Ptolemaic. Later sources suggest that the rationalist mutakallimūn\n(exponents of kalām, dialectic theology) were typically hostile to the Aristotelian-Ptolemaic\n\"science of the stars\" (\"ilm al-nujum), an amalgam of astrology and astronomy for much\nof this period, and that this system had long been established as the regnant \"scientific\"\nparadigm in the Near East. The overall significance of the episode, nevertheless, remains\nunclear.\nWhile Ibn Hanbal's confusion sheds little light on the faultlines between theological ratio-\nnalism and traditionalism in the third/ninth century, it does raise interesting questions. We\nare relatively well informed about the traditionalist cosmography and its sources, but know\nfar less about the relevant views of the mutakallimūn. 10 A number of important studies have\naddressed the physical theory of kalām, but these are focused on \"kalam atomism [. . .]\nthe one notable exception [...] ends in the eleventh century and does not explore later\n5. C. Melchert, \"The Adversaries of Aḥmad Ibn Hanbal,\" Arabica 44 (1997): 234-53. Melchert stresses the\ndiversity of Ibn Hanbal's opponents and de-emphasizes the significance of the Mu'tazilis (esp. pp. 239-45). Alnoor\nDhanani notes that the Baghdad Mu'tazilis formed close ties with the early Abbasids and presided over the miḥna,\nA. Dhanani, The Physical Theory of Kalam: Atoms, Space, and Void in Basrian Mu'tazili Cosmology (Leiden: E.J.\nBrill, 1994), 8. Cf. Nawas, Al-Ma'mun, the Inquisition, 31-37. On the \"genealogy\" of the Baghdad and Basran\nschools, see D. Bennett, \"The Mu'tazili Movement (II): The Early Mu'tazilis,\" in The Oxford Handbook of Islamic\nTheology, ed. S. Schmidtke (Oxford: Oxford Univ. Press, 2016), 142-58, at 144-45. See also S. Schmidtke, \"The\nMu'tazili Movement (III): The Scholastic Phase,\" in ibid., 159-80, at 159-60. Sabine Schmidtke holds that it is\nanachronistic to speak of Baghdad and Basran schools in this period.\n6. The classic treatment of the Translation Movement is D. Gutas, Greek Thought, Arabic Culture: The Graeco-\nArabic Translation Movement in Baghdad and Early 'Abbasid Society (2nd-4th/8th-10th Centuries) (Oxford: Rout-\nledge, 1998). For a refutation of Ignác Goldziher's claims about traditionalist opposition to the Greek sciences, see\nesp. pp. 166-75.\n7. On the contrast between the two views, see J. F. Ragep, \"Islamic Culture and the Natural Sciences,\" in The\nCambridge History of Science, vol. 2: Medieval Science, ed. D. C. Lindberg and M. H. Shank (Cambridge: Cam-\nbridge Univ. Press, 2013), 27.\n8. On the general hostility of the mutakallimün toward astrology, see R. G. Morrison, \"Discussions of Astrology\nin Early Tafsir,\" JOS 11.2 (2009): 49-71, at 60-62 (for exceptions, see p. 60). On the emergence of the distinction\nbetween astronomy and astrology, see ibid., 49; idem, \"Cosmography, Cosmology, and Kalam from Samarqand to\nIstanbul,\" IHIW (online December 2020): 308-37, at 308-9. For the earliest known example of a work of astronomy\nproper, shorn of astrological elements, see Y. Mahdavi, \"Abu Sa'id al-Siğzī and the 'Structure of the Orbs', the Ear-\nliest Known Work on Hay'a,\" ASP 31.1 (2021): 45-94, at 71. For one early Mu'tazili critique of astrology, see Abū\n'Ali al-Jubba'i (attrib.), Kitāb al-Maqālāt, ed. O. Şimşek, A. İ. Sarica, and Y. Arıkaner (Istanbul: Endülüs, 2020),\n300. The thrust of the critique is that astrologers are incapable of benefiting from their supposed knowledge of the\nfuture (\"most of them die of hunger, thirst, and poverty\"). Cf. Ibn Tawūs (d. 664/1266), Faraj al-mahmum fi tarikh\n'ulama' al-nujum (Qom: Manshūrāt al-Ridă, 1363h), 154-57.\n9. See K. van Bladel, \"Heavenly Cords and Prophetic Authority in the Quran and Its Late Antique Context,\"\nBSOAS 70.2 (2007): 223-46, at 225-26; D. Janos, \"Qur'anic Cosmography in Its Historical Perspective: Some\nNotes on the Formation of a Religious Worldview,\" Religion 42.2 (2012): 215-31, at 223; J. E. Wright, The Early\nHistory of Heaven (New York: Oxford Univ. Press, 2000), 139-40; T. Tesei, \"Some Cosmological Notions from\nLate Antiquity in Q 18:60-65: The Quran in Light of Its Cultural Context,\" JAOS 135.1 (2015): 19-32, at 31. Only\na minority of Christians seem to have accepted the Hebraic cosmography in this period. I use the term \"scientific\"\nwith full awareness of its anachronistic application to the premodern world.\n10. That is, much more has been published on the traditionalist cosmography than on the views of the\nmutakallimun. See also M. A. Tabataba'i and S. Mirsadri, \"The Qur'anic Cosmology, as an Identity in Itself,\" Ara-\nbica 63.3-4 (2016): 201-34, at 202; Janos, \"Qur'anic Cosmography,” 215.",
  "3": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n853\ndevelopments.\"11 In this article I aim to remedy the deficit, focusing not on atomism or\n\"cosmology\" an extremely broad category encompassing a multitude of topics--but on the\nphysical structure of the heavens and the earth as discussed by rationalist theologians (mostly\nBasran and Baghdad Mu'tazilis, Ash'aris, and Maturidis). 12 Josef van Ess collected some of\nthe relevant material in his monumental Theologie und Gesellschaft (1991-95), but his atten-\ntion is directed toward the second and third Islamic centuries; in addition, many important\nsources have since been edited. My focus is on the period from the second/eighth to the early\nsixth/twelfth centuries, viz., from the dissemination of the Aristotelian-Ptolemaic paradigm\nin Arabic to al-Ghazali's (d. 505/1111) generation.\nFor the purposes of this article, the Aristotelian-Ptolemaic cosmography is the view that\nthe earth is an immobile sphere, nestled in the center of a series of concentric celestial orbs\nor shells. The precise number of orbs or shells, and the exact nature of their interaction,\nalong with much else, was the subject of considerable disagreement among Aristotle and\nPtolemy's interpreters and interlocutors in later centuries, Muslim or otherwise. 13 Notwith-\nstanding their divergences, however, they \"were in agreement with regard to the sphericity\nof the Earth and its position at the center of the universe, as well as the sphericity and the\ncircular motion of the heavens.\" 14 These fundamental features of the Aristotelian-Ptolemaic\nparadigm remained stable down to modernity, 15 and for this reason I choose to present them\nas a single model or paradigm.\nThis cosmography espoused by Muslim advocates of 'ilm al-nujum in the period surveyed\nis the alternative against which traditionalists defined themselves, as shall become clear. The\ntraditionalist cosmography, to which I devote a separate section below, consists of belief\nin a flat earth, beneath which are a further six earths. Instead of the celestial spheres of the\nAristotelian-Ptolemaic cosmography, there is a series of seven heavens (either domed or\nvaulted), above which is God's throne ('arsh). What lies beneath the seventh and lowermost\nearth was, in the traditionalist corpus, subject to considerable disagreement. Nonetheless, the\nbasic features of the traditionalist cosmography permit one to refer to it as a single model, or\nparadigm, since it remains remarkably stable.\nI make three key interventions. First, I demonstrate that, other things being equal, the\ndisagreement between mutakallimün on cosmographical questions broadly resembles the\nlate ancient Christian debate on the merits of the Greek and Hebraic models of the cosmos.\nThen, more significantly, I establish that there is no correspondence between (rationalist)\ntheological affiliation and cosmographical opinion. 16 That is to say, one can find Basran\n11. A. S. Dallal, \"Early Islam,\" in Science and Religion around the World, ed. J. H. Brooke and R. L. Numbers\n(New York: Oxford Univ. Press, 2011), 120-47, at 143.\n12. Dhanani, Physical Theory, 6. While mutakallimün with other affiliations certainly existed, they do not figure\nin the debate qua sectarians but largely as adherents of one of these four methods. Exceptions will be noted.\n13. As Ibn al-Malāḥimi (d. 536/1142) tartly observes, \"they have no doctrine but that they disagree about it\";\nIbn al-Malāḥimi, Kitab al-Mu'tamad fi usul al-din, ed. W. Madelung (Tehran: Miräth-i Maktüb, 2012), 647.\n14. P. Omodeo and I. Tupikova, \"Cosmology and Epistemology: A Comparison between Aristotle's and\nPtolemy's Approaches to Geocentrism,\" in Spatial Thinking and External Representation: Towards a Historical\nEpistemology of Space, ed. M. Schemmel (Berlin: Pro Business Digital Printing, 2016), 145-74, at 146, https://\nwww.mprl-series.mpg.de/studies/8/index.html. For Aristotle's views, see, e.g., \"On the Heavens,\" in The Complete\nWorks of Aristotle: The Revised Oxford Translation, ed. J. Barnes, 2 vols. (Princeton: Princeton Univ. Press, 1984),\n1: 447-511. For a useful summary of the views of Aristotle and Ptolemy and the differences between them, see\nE. Grant, \"Cosmology,\" in Lindberg and Shank, Medieval Science, 436-55, at 443-45.\n15. See, e.g., the defence of the immobility of the earth in three treatises of Ahmad Ridā Khan (d. 1921), Fatawa\nRidawiyya, ed. R. Yash, 30 vols. (Lahore: Jämi'a Nizamiyya Ridawiyya, n.d.), 27: 195-382.\n16. The demonstration of noncorrespondence is, like that of correspondence, a useful scholarly contribution.\nOn the noncorrespondence between the theological and legal-theoretical commitments of four Shafi'i jurists, for",
  "4": "854\nJournal of the American Oriental Society 142.4 (2022)\nMu'tazilis who are basically traditionalist in their cosmographical outlook alongside other\nBasran Mu'tazilis who reject the plain-sense meaning (zahir) of the Quran's cosmographical\npassages. This general rule of noncorrespondence between theological school and cosmog-\nraphy requires qualification: (1), the Ash'aris are consistent in their occasionalism, which\nshapes their views on, e.g., the cause of the immobility (wuquf) of the earth, and (2), the\nMaturidis are not \"genetically\" or geographically linked to the other three major schools, and\nare therefore typically less interested in exploring questions of cosmography in a kalām con-\ntext. 17 With these qualifications, the rule of noncorrespondence holds. My third intervention\nrelates to questions of diachronic development. Up to the early sixth/twelfth century there is\nno evidence of a trend of increasing accommodation of Greek cosmography by theologians\nof the four main rationalist schools. The question of the shape of the earth, for example,\ncontinued to be contested. This remained true even as the distinction between astronomy\n(Film al-hay'a) and astrology (aḥkām al-nujum) emerged with greater clarity, and the former\nwas (increasingly) shorn of metaphysical assumptions-developments that would clearly\nfacilitate such an accommodation. 18 To make my case, I draw on the published corpus of\nkalām treatises of the period, along with Quran commentaries authored by theologians, and,\noccasionally, works from other genres. My evidentiary basis for these conclusions is com-\nprehensive, though by no means exhaustive, and will admittedly have to be revised as new\nsources come to light.\nI begin with a brief survey of quranic cosmography. I then proceed to explore traditional-\nist doctrine, and whether and to what extent it represents a departure from the vision of the\ncosmos presented in the Quran. I also attempt a characterization of traditionalist attitudes\ntoward rival nontraditionalist viewpoints. These are necessary contexts for the study of the\ncosmography of the mutakallimūn, representing the standard against which they reacted.\nTheir discussions show evidence of extensive engagement with cosmographical traditional-\nism, sometimes by way of critique and at other times of adherence, in preference to the Greek\nalternatives. I then address the cosmographical views of individual rationalist theologians\nwhose works are extant or whose opinions are preserved in later sources in more or less\nchronological order. This discussion forms the bulk of the paper.\nI have made a number of choices about terminology. I write of traditionalist \"cosmogra-\nphy\" rather than the more typical \"cosmology,\" the term Anton Heinen used in his seminal\nstudy and translation of al-Hay'a al-saniyya of al-Suyūtī (d. 911/1505). 19 While \"cosmol-\n).19\nogy\" is broader than \"cosmography\" and suggests the \"divinely governed order of the uni-\nverse and the place of humans within it,\" 20 and \"cosmography\" has no clear parallel in the\ntraditionalist lexicon, the most proximate equivalent being hay'a, though this is not used\nexample, see M. Eissa, The Jurist and the Theologian: Speculative Theology in Shaffi Legal Theory (Piscataway,\nNJ: Gorgias Press, 2017), esp. 44, 48.\n17. The Baghdad and Basran Mu'tazilis, along with the Ash'aris (and unlike the Maturidis), \"are not only\ngeographically proximate to each other [...] they are genetically linked\"; Dhanani, Physical Theory, 6. On Abu\nMansur al-Maturīdī (d. 333/944) and his school, see U. Rudolph, Al-Maturīdī and the Development of Sunni Theol-\nogy in Samarqand, tr. R. Adem (Leiden: Brill, 2015). Although Rudolph emphasizes the (mostly negative) influence\nof the Baghdad Mu'tazili Abu al-Qasim al-Ka'bi (d. 319/931) on the theology of al-Mäturīdī (pp. 158-59), there\nremain fundamental differences between this relationship and that of al-Ash'arī (d. 324/935f.) to the Mu'tazilis-for\nexample, al-Māturīdī makes no reference to atomism in his Kitab al-Tawhid (p. 245), an omission that would be\ninconceivable for al-Ash'arī.\n18. On these developments, see, e.g., Dallal, \"Early Islam,\" 123-24.\n19. Al-Suyuti, Islamic Cosmology: A Study of as-Suyuti's al-Hay'a as-saniya fi l-hay'a as-sunniya, ed. and tr.\nA. M. Heinen (Beirut: Franz Steiner, 1982).\n20. A. Neuwirth, art. Cosmology, EQ, 1: 440-57, at 448. For an overview of the uses of and distinctions",
  "5": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n855\nsystematically in the formative period, I regard it, following David King, as appropriate. 21 I\ninclude under this rubric a number of related discussions, such as those on the finitude of the\ncosmos, the causes of the immobility of the earth, and, to a lesser extent, void. Because the\ntraditionalist cosmography includes material about the structure and composition of the heav-\nens and the earth, there is a certain overlap with the discourse of the astronomer-astrologers\n(munajjimūn) of the period. I have already alluded to the problem of disaggregating astrol-\nogy and astronomy, which needs still to be treated systematically in its Islamicate context. 22\nIn addressing the formative period of Islamic thought, in particular, one cannot avoid the\nproblem of the dearth of extant sources. Unfortunately, these problems continue beyond the\nsecond/eighth century. Large multivolume works such as the Quran commentary (tafsir) of\nAbū 'Ali al-Jubba'ī (d. 303/915f.) are lost to us, surviving only in quotation (especially by\nlater Twelver authors, because of their Mu'tazili commitments). 23 Where possible I have\nsought to corroborate quotations of lost works by drawing on multiple sources, including the\nfive-volume series Mawsu'at tafasir al-mu'tazila and the recently published encyclopaedic\nal-Tahdhib fi al-tafsir of al-Hakim al-Jishumi (d. 494/1101), both published in Beirut. 24 As\na general rule, there is a high degree of consistency in the cosmographical views attributed\nto early theologians by later authors. I have not noticed any notable discrepancies between\ndifferent genres in this regard. Any divergences in the views attributed to particular figures\nwill be noted where relevant.\nI. THE QURANIC AND TRADITIONALIST COSMOGRAPHIES\nThe provenance of quranic cosmography has long been of interest to Western scholar-\nship, with theories that the seven heavens of Babylonian mythology were the (ultimate)\nsource of Muslim belief on this point, 25 that one cannot speak of \"scientific\" interest in the\nbetween the two terms, see Morrison, \"Cosmography, Cosmology, and Kalām,\" 309-10, where Morrison notes that\n**cosmology' has become overly capacious.\"\n21. I adopt \"cosmography\" out of deference to David King; see his review of Heinen, JAOS 109.1 (1989):\n124-27, at 125. For a definition of cosmography as a \"description or representation of the universe,\" https://www.\ndictionary.com/browse/cosmography (accessed April 27, 2021).\n22. For further discussion, see G. Saliba, \"Islamic Astronomy in Context: Attacks on Astrology and the Rise\nof the Hay'a Tradition,\" Bulletin of the Royal Institute for Inter-Faith Studies 2 (2002): 25-46. See also A. T.\nŞen, \"Astrology in the Service of the Empire: Knowledge, Prognostication, and Politics at the Ottoman Court,\n1450s-1550s\" (PhD diss., Univ. of Chicago, 2016), 64-79. I thank Nahyan Fancy for referring me to this disserta-\ntion.\n23. For partial reconstructions based on surviving fragments, see Tafsir Abi 'Ali al-Jubba'i, ed. K. M. Nabha\n(Beirut: Där al-Kutub al-'Ilmiyya, 1428/2007); D. Gimaret, Une lecture mutazilite du Coran: Le Tafsir d'Abū\n'Ali al-Djubba'i (m. 303/915) partiellement reconstitué à partir de ces citateurs (Louvain: Peeters, 1995); R. W.\nGwynne, \"The Tafsir of Abu 'Ali al-Jubba': First Steps Toward a Reconstruction with Texts, Translation, Biographi-\ncal Introduction and Analytical Essay\" (PhD diss., Univ. of Washington, 1982). Gimaret's reconstruction is the most\ncomprehensive, drawing on the broadest range of sources. On the appropriation (and citation) of Mu'tazili tafsir\ntexts by Twelver Shi'a, see S. A. Mourad, \"The Survival of the Mu'tazila Tradition of Qur'anic Exegesis in Shi'i and\nSunni tafasir,\" JQS 12.1-2 (2010): 83-108, at 84-86; on the adoption of Mu'tazili theology by Twelver Shi'a, see\nH. Ansari and S. Schmidtke, \"The Twelver STT Reception of Mu'tazilism,\" in eidem, Studies in Medieval Islamic\nIntellectual Traditions (Atlanta: Lockwood Press, 2017), 293-309.\n24. K. M. Nabha's Mawsü'at tafasir al-mutazila is based mostly on fragments cited in the Quran commentaries\nof al-Ṭusī (d. 460/1067), al-Tabrisi (d. 548/1153), and al-Razi (d. 606/1210).\n25. C. Nallino, 'Ilm al-falak: Tarikhuhu 'ind al-'arab fi al-qurun al-wusta (Cairo: Maktabat al-Dar al-Arabiyya\nli-l-Kitab, 1413/1993), 105-6; 1. Hehmeyer, \"The Configuration of the Heavens in Islamic Astronomy,\" in Roads to\nParadise: Eschatology and Concepts of the Hereafter in Islam, ed. S. Günther and T. Lawson, 2 vols. (Leiden: Brill,\n2017), 1: 1083-98, at 1086. On possible Nestorian influence, see B. Radtke, \"Persian Cosmography, Early Tafsir,",
  "6": "856\nJournal of the American Oriental Society 142.4 (2022)\ncosmos among Muslims until more than a century after the death of the Prophet, 26 and that\na relationship between the pre-Islamic Arabian star lore of the rising and setting of asterisms\n(anwa') and knowledge of the lunar stations (manāzil al-qamar) is doubtful. 27 The quranic\ncosmography has been described as scientifically \"naïve,\"28 containing no reflection of the\nlate ancient debate between supporters of the biblical and Aristotelian-Ptolemaic models of\nthe universe, 29 but \"evidently already familiar in its rough outline to the ancient peoples\nof the Near East,\"30 featuring seven heavens and seven earths (Q 65:12), 31 above which is\nGod's throne, a solid edifice (e.g., Q 69:17). 32 There is some disagreement about the place of\n).32\nthe kursi (\"footstool,\" Q 2:255) in this arrangement, or indeed whether it is a discrete physi-\ncal structure at all. 33 There is also some dispute about the shape of the firmament according\nto the Quran-are the seven heavens flat or dome-shaped?34 but the firmament itself is a\nsolid structure, held up \"without pillars that you [can] see\" (bi-ghayri 'amadin tarawnahā,\nQ 13:2), 35 which prevent it from collapsing onto the earth, by God's leave (Q 22:65). 36\nand Nestorian Exegesis,\" in La science dans le monde iranien à l'époque islamique, ed. Ž. Vesel, H. Beikbaghban,\nand B. T. de Crussol des Espesse (Tehran: Institut Français de Recherche en Iran, 2004), 323-35, at 332.\n26. That is, until the translation of late ancient knowledge into Arabic; Nallino, 'Ilm al-falak, 137-38. Ahmad\nDallal states that for over a century after the rise of Islam, \"Arabs had no science\"; see his Islam, Science, and the\nChallenge of History (New Haven: Yale Univ. Press, 2010), 10; while there is also an assertion (Tabataba'i and\nMirsadri, \"Qur'anic Cosmology,\" 223) that the heavens (excluding particular celestial bodies) hardly feature in the\nextant pre-Islamic Arabic poetry.\n27. D. M. Varisco, art. Anwä', E13, online (accessed July 17, 2020); idem, \"The Origin of the Anwa' in Arab\nTradition,\" Studia Islamica 74 (1991): 5-28, at 13-22. The system of the anwa' is instead \"best understood as a\nsystem for divining rain,\" and therefore presupposes no degree of scientific interest (p. 22).\n28. Tabataba'i and Mirsadri, \"Qur'anic Cosmology,\" 211, 214. For an alternative view, see Abū Rayḥān\nal-Birūnī (d. 440/1048), Alberuni's India, tr. E. C. Sachau, 2 vols. (London: Kegan Paul, Trench, Trübner & Co.,\n1910), 1:263.\n29. Van Bladel, \"Heavenly Cords,\" 226. Tommaso Tesei, by contrast, holds (unpersuasively, in my view) that\nthe Quran refers to both of the competing models, \"Cosmological Notions,\" 31. He cites Angelika Neuwirth (art.\nCosmology, 445), who, like Edith Jachimowicz, mistakenly states the seven heavens of the Quran to be spherical.\nSee E. Jachimowicz, \"Islamic Cosmology,\" in Ancient Cosmologies, ed. C. Blacker and M. Loewe (London: Allen\nand Unwin, 1975), 143-55, at 148. Heinen foregrounds the distinction, pointing out that later commentators on the\nQuran sought to reconcile it with the Aristotelian-Ptolemaic cosmography by making precisely this move (interpret-\ning the seven heavens as spheres); A. Heinen, art. Sama', E12, 8: 1014-18, at 1015.\n30. M. Jarrar, art. Heaven and Sky, EQ, 2: 410-12, at 412. On this point, see J. P. Monferrer-Sala, \"Al-Bahr\nal-muḥit wara' al-samawat wa-al-ard: Jewish and Christian Cosmogonic Beliefs in Early Islam,\" Islam and Chris-\ntian-Muslim Relations 22 (2011): 147-60. See also J. Decharneux, \"Creation and Contemplation: The Cosmology\nof the Qur'an and Its Late Antique Background (PhD diss., Université libre de Bruxelles, 2021).\n31. But see Tabataba'i and Mirsadri, Qur'anic Cosmology,\" 211, where it is claimed (unpersuasively, in my\nview) that Q 65:12 does not attest to the seven earths.\n32. J. Elias, art. Throne of God, EQ, 5: 276-78, at 277.\n33. Cl. Huart-[J. Sadan], art. Kursi, E/2, 5: 509. Jamal Elias (prev. note) notes the early opinions on the kursi as\n\"God's knowledge,\" a view we will see repeated by the mutakallimün. On the kursi as the \"place of the two feet\"\n(mawdi' al-qadamayn), see Ibn Khuzayma (d. 311/923), Kitab al-Tawhid wa-ithbat sifat al-rabb, ed. \"A. al-Shahwän\n(Riyadh: Dar al-Rushd, 1408/1988), 248-49. For the quranic verses that attracted the most discussion, see appendix 1.\n34. For the flatness of the quranic firmament, see Janos, \"Qur'anic Cosmography,\" 216-17; Tabataba'i and\nMirsadri, \"Qur'anic Cosmology,\" 218-19.\n35. For the early difference of opinion on whether this meant \"without pillars that you [can] see,\" or \"without\npillars [at all],\" see al-Tabari, Jami' al-bayan 'an ta'wil ay al-Qur'an, ed. 'A. al-Turki et al., 26 vols. (Cairo: Hijr,\n1422/2001), 13: 408-11. Al-Ṭabari himself endorses the first position (p. 411). For the late antique background of\nthe quranic pillars, see J. Decharneux, \"Maintenir le ciel en l'air << sans colonnes visibles » et quelques autres motifs\nde la creatio continua selon le Coran en dialogue avec les homélies de Jacques de Saroug,\" Oriens Christianus 102\n(2019): 237-67, at 238-43. All quranic translations are my own.\n36. On the significance of the expression \"by God's leave (illa bi-idhnihi),\" see Decharneux, \"Maintenir le ciel\nen l'air,\" 243-50.",
  "7": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n857\nHeavenly ropes or cords (e.g., Q 40:37) run along the top of this edifice, allowing it to be\n\"traversed physically by people who arrive at them.\"37 Spiritual elites are thus permitted to\nascend heavenward. A plain-sense reading of the quranic text renders the earth as flat (e.g.,\nQ 88:20), 38 and the seven flat earths are (implicitly) piled atop one another like \"a stack of\nplates.\"39 All of these details were debated by Muslims, but it is important to distinguish later\nopinion from the content of the Quran itself. 40\nGiven the relatively late provenance of the extant sources, it is worth pausing to comment\non the development of traditionalist cosmography in the postquranic period. I propose that\nthis proceeded (no later than the first half of the second Islamic century) from two major\nimpulses. The first was the explication of quranic material on the subject. The Prophet may\nhave done this himself, and the same may be true of Ibn 'Abbas (d. 68/687) and his circle,\namong other early Muslims credited for their activities in tafsir. 41 Much cosmographical\nmaterial is also attributed to transmitters of the so-called Isra'īliyyat, 42 such as Ka'b al-Aḥbār\n(d. ca. 32/652) and Wahb b. Munabbih (d. 131/748). Ascribing definite cosmographical views\nto any of these early figures is, of course, fraught with difficulty given the problems of the\nsources. Nonetheless, based on a perusal of the tafsir of Muqātil b. Sulayman (d. 150/767),\nthe key features of traditionalist cosmography were evidently in circulation by the time of\nhis death in 150h, that is, no later than the first half of the second century, and I shall adduce\nMuqatil's tafsir as evidence of the early date of various features of this cosmography. 43 The\nsecond major impulse was the attempt to situate the Prophet's life in the context of a broader\nsacred history. The Sira of Ibn Ishaq (d. 150/767) is known to have originally consisted of\nthree parts, the first of which, al-Mubtada', addressed origins and the history of the prophets\nto the emergence of Islam. 44 As such, it is extremely likely to have included cosmographical\ntraditions. 45 Unfortunately, owing to the transmission of the Sīra, reconstructing this element\nof the text is likely to prove very challenging. 46\n37. Van Bladel, \"Heavenly Cords,\" 226.\n38. E.g., H. Toelle, art. Earth, EQ, 2: 2-5, at 2. Cf. H. al-Rawi, Shakl al-ard: Dirasa li-tatawwur al-fikra 'ind\nal-'arab (Baghdad: Matba'at al-Majma' al-'Ilmi al-'Iraqi, 1382/1962), 3, for the pre-Islamic Arabians referring to\nthe earth as basita \"outspread (or flat).\"\n39. M. Cook, Muhammad (Oxford: Oxford Univ. Press, 1986), 26.\n40. As emphasized by Tabataba'i and Mirsadri, \"Qur'anic Cosmology,\" 206.\n41. Nicolai Sinai seems to accept, following Harald Motzki, that the group usually regarded as Ibn 'Abbas's\nstudents engaged in tafsir. See his \"The Qur'anic Commentary of Muqatil b. Sulayman and the Evolution of Early\nTafsir Literature,\" in Tafsir and Islamic Intellectual History: Exploring the Boundaries of a Genre, ed. A. Gōrke and\nJ. Pink (New York: Oxford Univ. Press, 2014), 113-43, at 122, 129.\n42. On this term, see R. Tottoli, \"Origin and Use of the Term Isra'iliyyat in Muslim Literature,\" Arabica 46.2\n(1999): 193-210.\n43. I defer to Sinai, \"Qur'anic Commentary,\" 117: \"we can with some confidence accept the text's attribution to\nMuqatil and operate with a terminus ante quem of c. 152/770 (it may well be considerably earlier).\"\n44. S. Anthony, Muhammad and the Empires of Faith: The Making of the Prophet of Islam (Oakland: Univ.\nof California Press, 2020), 158-59. Ibn Ishaq's younger contemporary, Abän b. 'Uthman al-Ahmar (d. 140/757 or\n200/815), is known to have written a similar work, Kitab al-Mubtada' wa-l-mab'ath wa-l-maghazi wa-l-wafat wa-l-\nsaqifa wa-l-ridda; H. Modarressi, Tradition and Survival: A Bibliographical Survey of Early Shiite Literature, vol.\n1 (Oxford: Oneworld, 2003), 130.\n45. Gordon Newby does not include any such material in his attempt to reconstruct this part; G. Newby, The\nMaking of the Last Prophet: A Reconstruction of the Earliest Biography of Muhammad (Columbia: Univ. of South\nCarolina Press, 1989). However, as Franz Rosenthal notes, \"Ibn Ishaq's work on the Beginnings [...] can be\nassumed to be the source of much of the material reported by Tabari\"; al-Tabari, The History of al-Tabari, vol. 1:\nGeneral Introduction and From the Creation to the Flood, tr. F. Rosenthal (Albany: SUNY Press, 1989), 172 n. 26.\n46. For a list of the major recensions, see Anthony, Muhammad and the Empires of Faith, 160-65.",
  "8": "858\nJournal of the American Oriental Society 142.4 (2022)\nThe traditionalists drew on the quranic cosmography and supplemented it in various\nways. Their views are found in compilations of hadith, 47 works of theology, 48 and Quran\ncommentaries, 49 and are widely reported by geographers, historians, and encyclopaedists. 50\nTheir views are also found in specialized treatises dedicated to elaborating a \"tradition-\nbased\" cosmography, including the postclassical al-Hay'a al-saniyya of al-Suyūtī, \"the most\nimportant systematization of this worldview,\"51 based largely on much earlier material, from\nthe third and fourth Islamic centuries. 52 The popularity of this treatise suggests that the tra-\nditionalist cosmography enjoyed a high degree of stability, at least in its basic outlines, for\nmany centuries. The chief differences between the quranic and traditionalist systems are in\npoints of detail. For example, the traditionalists usually stipulate a distance of five hundred\nyears' travel between each of the seven heavens and the seven earths, a view that seems to be\n47. Since examples are too voluminous to list, I limit myself to pointing out that specific theological-cosmo-\ngraphical topics quickly came to form the subject of independent treatises, for example, the Kufan Muḥammad b.\n'Uthman b. Abi Shayba's (d. 297/910, not to be confused with the compiler of Musannaf Ibn Abi Shayba, d. 235/849)\nKitāb al-'Arsh, ed. M. al-Timĭmi (Riyadh: Maktabat al-Rushd, 1418/1998).\n48. E.g., al-Bukhārī (d. 256/870), Khalq afal al-'ibād wa-l-radd 'ala al-jahmiyya wa-ashab al-ta'til, ed.\nF. al-Fuhayd, 2 vols. (Riyadh: Där Atlas al-Khadra', 1425/2005), 2: 17; 'Uthmän b. Sa'id al-Därimi (d. 282/893),\nKitāb al-Radd 'ala al-jahmiyya, ed. G. Vitestam (Leiden: E.J. Brill, 1960), 8-12; Ibn Khuzayma, Kitāb al-Tawhid,\n248-49. For a general discussion, see 'Abd al-Qahir al-Baghdadi (d. 429/1038), al-Asma' wa-l-sifat, ed. A. M. 'A.\nal-Sharqawi et al., 3 vols. (Damascus: Där al-Taqwä, 1441/2020), 2: 486-98.\n49. See appendix 1.\n50. For geographical texts (advocating the Aristotelian-Ptolemaic viewpoint and sometimes documenting the\nalternatives), see, e.g., for the third/ninth century, Ibn Khurradadhbih (d. ca. 280/893), al-Masälik wa-l-mamālik\n(Beirut: Dār Şǎdir, n.d.), 4-5; for the fifth/eleventh century, Abu 'Abd Allah al-Bakri al-Andalusi (d. 487/1094),\nal-Masalik wa-l-mamālik, ed. S. Ghuräb, 2 vols. (Beirut: Där al-Gharb al-Islāmī, 1992), 1: 53-57; and for the sev-\nenth/thirteenth century, Yaqut al-Hamawi (d. 626/1229), Mu'jam al-buldan (Beirut: Där Şädir, 1995), 1: 16-24. See\nalso the discussion of the translation of late ancient works into Arabic in S. M. Ahmad, A History of Arab-Islamic\nGeography (9-16th Century A.D.) (Amman: Al al-Bayt University, 1416/1995), 9-17. On cosmography in his-\ntorical texts, see B. Radtke, Weltgeschichte und Weltbeschreibung im mittelalterlichen Islam (Beirut: Franz Steiner,\n1992). I thank Christian Lange for drawing my attention to this source. For examples, see al-Tabari, tr. Rosenthal,\n1: 217-49; Ibn Ṭähir al-Maqdisi (fl. fourth/tenth century), Kitab al-Bad' wa-l-tarikh, ed. C. Huart, 6 vols. (Cairo:\nMaktabat al-Thaqāfa al-Diniyya, n.d.), 1: 146-51, 2: 7-73. For cosmography in encyclopaedias, see al-Nuwayri\n(d. 733/1333), Nihayat al-arab fi funün al-adab, ed. M. Qumayha et al., 33 vols. (Beirut: Där al-Kutub al-'Ilmiyya,\n2004), 1: 21-64, 187-206; Ibn Fadl Allah al-'Umari (d. 749/1349), Masalik al-abṣār fi mamālik al-amṣār, ed. K.\nSalman al-Jubūrī et al., 27 vols. (Beirut: Dār al-Kutub al-'Ilmiyya, 2010), 1: 121-34.\n51. M. Riexinger, \"Al-Ghazali's 'Demarcation of Science': A Commonplace Apology in the Muslim Reception\nof Modern Science and Its Limitations,\" in Islam and Rationality: The Impact of al-Ghazali. Papers Collected on\nHis 900th Anniversary, vol. 2, ed. F. Griffel (Leiden: Brill, 2016), 283-309, at 285. Later citations of the text are\nubiquitous. David King (\"Review,\" 126) refers to al-Suyuti's treatise as espousing \"the most conservative attitudes\nconcerning the nature of the universe.\" He also suggests that the correct title of the work ought to be al-Hiy'a. On\nan early example of the \"Islamic cosmography\" genre, dated to the second half of the sixth/twelfth century, see\nB. Radtke, \"Die älteste islamische Kosmographie: Muḥammad-i Tüsis 'Ağa'ib ul-maḥlūgāt,\" Der Islam 64 (1987):\n278-88.\n52. Heinen (Islamic Cosmology, 38) highlights al-Suyuti's dependence on Abu al-Shaykh al-Isfahani\n(d. 369/979) in particular: al-Hay'a al-saniyya \"owes almost every fragment to him.\" Fortunately, it has been edited:\nKitāb al-'Azama, ed. R. al-Mubarakafūrī, 5 vols. (Riyadh: Dar al-'Aşima, n.d.). See also M. Salmasi and F. Negah-\nban, \"Abu al-Shaykh al-Isfahani,\" Encyclopaedia Islamica, online (accessed July 24, 2020). The earliest work with\nthe title Kitāb al-'Azama is attributed (Heinen, Islamic Cosmology, 48) to Ibn Abi al-Dunya (d. 281/894). Although\nsome cosmographical data can be found in Ibn Abi al-Dunya's Kitab al-Matar wa-l-ra'd wa-l-barq wa-l-rih (see\nF. al-Raqqi, ed., Mawsi'at Ibn Abi al-Dunya, 7 vols. (Riyadh: Där Atlas al-Khadra', 1433/2012), 5: 537-85), no\nwork by that title is listed as belonging to Ibn Abi al-Dunya by any of his premodern or modern biographers, how-\never, and the attribution seems to be based solely on the ascription in the Istanbul MS. I thank Arafat Razzaque for\ndiscussing this point with me.",
  "9": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n859\nof Jewish provenance. 53 Other hadith suggest lesser distances, and in the third century tradi-\ntionalist theologians made attempts to reconcile these divergences. 54 The throne also was a\nsubject particularly dear to the traditionalists' hearts. 55 It raised the question of the locus of\nGod, whom they insisted was above the heavens, in contradistinction to a range of theologi-\ncal opponents. The followers (the so-called Jahmiyya) of Jahm b. Şafwan (d. 128/745f.)-the\n\"first Muslim 'theologian' in the full and proper sense\"56-seem to have been the first to\ndoubt this, probably under non-Muslim influence. 57 Various hadith add further detail to our\nknowledge of the heavenly realm, including the existence of a cosmic animal (such as the\nfish, hūt) and sometimes transmogrified angels, who support the throne and keep the (flat)\nearth anchored in place, in some versions of the traditionalist account. 58 There was also occa-\nsional discussion of the Milky Way, no later than the third Islamic century (reporting much\nearlier material). 59 The earth was understood to be encircled by a mountain range, Qaf.60 The\n53. Muqatil b. Sulayman, Tafsir, ed. 'A. M. Shiḥāta, 5 vols. (Beirut: Mu'assasat al-Tarikh al-'Arabi, 1423/2002),\n1:213; 4: 389, 679. For an interpretation of the \"five hundred years\" hadith, see Heinen, Islamic Cosmology, 88-94.\nFor the Jewish provenance of this figure, see L. Ginzberg, The Legends of the Jews, tr. H. Szold, 7 vols. (Philadel-\nphia: The Jewish Publication Society of America, 1909-38), 1: 11; for the references, 5: 13. For the hadith itself, see,\ne.g., Musnad Ahmad b. Hanbal, ed. S. al-Arna'üt et al., 50 vols. (Beirut: Mu'assasat al-Risala, n.d.), 3: 292-93. The\neditor notes the (many) collections in which the hadith is found and points out the flaws in the relevant transmission\nchains. See also al-Isfahānī, Kitāb al-Azama, 3: 1047.\n54. For variants, where the distance between the heavens is given as seventy-one, seventy-two, or seventy-three\nyears, see, e.g., Sunan Abi Dawud, ed. S. al-Arna'üt, M. K. Qurahbalali, and 'A. H. Allah, 7 vols. (Damascus: Där\nal-Risala al-'Alamiyya, 1430/2009), 7: 105; Sunan al-Tirmidhi, ed. B. 'A. Ma'ruf, 6 vols. (Beirut: Dār al-Gharb\nal-Islāmi, 1996), 5: 348-49; al-Isfahānī, Kitāb al-Azama, 3: 1051. Reconciling the divergent reports, Ibn Khuzayma\n(Kitab al-Tawhid, 250) writes that \"the [pace of] travel varies; similarly, the pace of riding animals such as horses,\ncamels, mules and donkeys [...] also varies.\" See also L. Holtzman and M. Ovadia, \"On Divine Aboveness (al-\nFawqiyya): The Development of Rationalized Hadith-Based Argumentations in Islamic Theology,\" in Rationaliza-\ntion in Religions: Judaism, Christianity and Islam, ed. Y. Friedmann and C. Markschies (Berlin: De Gruyter, 2019),\n224-69, at 232-33. I thank Livnat Holtzman for a prepublication version of the article.\n55. E.g., al-Dǎrimi, Kitab al-Radd, 8-12 (also pp. 25-28 of introd.); al-Isfahānī, Kitāb al-'Azama, 2: 543-665.\n56. C. Schöck, \"Jahm b. Şafwan (d. 128/745-6) and the 'Jahmiyya' and Dirär b. 'Amr (d. 200/815),\" in\nSchmidtke, Oxford Handbook of Islamic Theology, 55-80, at 56.\n57. Al-Bukhārī, Khalq af al al-'ibād, 2: 17-18 (for Jahm's debate with one of the Sumaniyya, usually identified\nas Buddhists); Ibn 'Abd Rabbih (d. 328/940), al-'Iqd al-farid, ed. M. M. Qumayha, 9 vols. (Beirut: Där al-Kutub\nal-'Ilmiyya, n.d.), 2: 252 (for his debate on God's attributes with \"one of the Greeks\"). On the sources of Jahmi\ntheology, see Schöck, \"Jahm,\" 56-58; Y. Kazi, Maqālāt al-Jahm b. Safwan wa-atharuha fi al-firaq al-islamiyya, 2\nvols. (Riyadh: Adwa' al-Salaf, 1426/2005). I thank Yasir Kazi for kindly sending me a copy of his book, and for a\ndiscussion of Jahm's theology. On the Sumaniyya generally, see G. Monnot, art. Sumaniyya, E12, 9: 869-70.\n58. E.g., hadith al-awal (ibexes or mountain goats); see al-Därimi, Kitāb al-Radd, 19; Heinen, art. Sama'.\nFor a defense of the hadith, see Ibn Taymiyya (d. 728/1328), Majmu al-fatāwā, ed. 'A. b. M. b. Qasim, 35 vols.\n(Medina: Matba'at al-Malik Fahd, 1416h), 3: 192-93 (I thank Mohammad Abu Shareea for bringing this discussion\nto my attention); Muqatil b. Sulayman, Tafsir, 1: 213; al-Isfahānī, Kitāb al-'Azama, 3: 948-71 (on the bearers of\nthe throne). On different solutions to the problem of what rested below the earth (the details differ considerably),\nsee Muqatil b. Sulayman, Tafsir, 4: 403; Heinen, Islamic Cosmology, 140, 143-45. On the cosmic fish (hūt), see,\ne.g., al-Isfahānī, Kitāb al-'Azama, 4: 1393-418. Michael Cook (Muhammad, 26) remarks that \"the whole structure\nis said to have posed serious underpinning problems, to which colourful solutions were found.\" See also al-Ash'arī,\nMaqālāt al-islamiyyin wa-ikhtilaf al-musallin, ed. H. Ritter (Beirut: al-Ma'had al-Almānī li-l-Abḥāth al-Sharqiyya,\n1426/1980), 210-12.\n59. A. Eckart, \"Ibn Rahiq's Text on the Milky Way: Perception of the Milky Way in the Early Islamic Society,\"\nASP 29 (2019): 227-60; idem, \"Use of the Galaxy as a Tool for Spatial and Temporal Orientation during the Early\nIslamic Period and up to the 15th Century,\" ASP 31 (2021): 1-44.\n60. Muqatil b. Sulayman, Tafsir, 4: 109 (where the mountain is an emerald, giving the sky its \"green\" hue; see\nn. 148 on lawn, below). See also M. Streck and A. Miquel, art. Käf, E/2, 4: 400-402; al-Isfahani, Kitāb al-'Azama,\n4: 1484-92. Mount Qaf and other elements of the traditionalist cosmography were often said to be constituted of\nprecious or semi-precious stones.",
  "10": "860\nJournal of the American Oriental Society 142.4 (2022)\nsix subterranean earths were depicted either as worlds unto themselves or, not infrequently,\nas layers of hell. 61 Paradise was located immediately beneath God's throne. 62 The tradition-\nalist cosmography, broadly shared by the early Shi'a, 63 is in all of its various iterations thus\npregnant with meaning. To come close to God is literally to ascend, 64 and to defy him is to\nbe literally cast downward into hell. 65\nCarlo Nallino understood the presence of cosmographical traditionalism in the tafsir liter-\nature (among other genres) as evidence that early Muslims lacked even the most rudimentary\nscientific curiosity, but this is something of a stretch. 66 Because Nallino cites these views\nby way of the Mafatih al-ghayb of al-Rāzī-a theologian familiar with and sympathetic to\naspects of contemporaneous philosophers' understandings of the cosmos-it only goes to\nprove the point that cosmographical traditionalism could and did coexist alongside more\nHellenized perspectives. 67 The nature of this relationship requires further study. Heinen has\nspeculated that al-Suyuti's al-Hay'a al-saniyya may have \"strengthened the foundation of the\nsciences of the cosmos, since it frees them from being completely derived from the works\nof foreigners, or non-Muslims.\"68 On the other hand, he notes that the treatise \"may have\ndiscouraged a good number of prospective students of the sciences by offering them a hay'a\n[] truly in harmony with their religion.\"69\nThe traditionalists occasionally expressed their hostility toward the scientific cosmogra-\nphy. As knowledge of the contents of translated works radiated westward from Baghdad in\nthe third/ninth century, some in al-Andalus grumbled at the new-fangled ideas (kalām dispu-\ntation no less than Aristotelian-Ptolemaic cosmography). 70 Sa'id al-Andalusi (d. 462/1070)\nreports that Abū 'Ubayda Muslim b. Ahmad al-Balansi (d. 295/908), a man learned in the\nscience of the stars as well as law (figh) and hadith, was pilloried in verse for teaching\nthe roundness of the earth, among other related errors. 71 Another Iberian, the traditionalist\n61. Muqatil b. Sulayman, Tafsir, 4: 368; Jachimowicz, \"Islamic Cosmology,\" 147; al-Isfahānī, Kitāb al-Azama,\n4: 1378-92.\n62. C. Lange, Paradise and Hell in Islamic Traditions (New York: Cambridge Univ. Press, 2016), 131.\n63. See, e.g., Tafsir al-Qummi, ed. M. B. M. al-Abtahi et al., 3 vols. (Qom: Mu'assasat al-Imam al-Mahdi,\n1435h), 2: 616, 3: 1003; al-'Ayyashi (d. 320/932), al-Tafsir, 3 vols. (Qom: Mu'assasat al-Ba'tha, 1421h), 3: 113;\nal-Kulayni, al-Kafi, 8 vols. (Beirut: Manshūrät al-Fajr, 1428/2007), 8: 88-89. Additionally, there is a massive amount\nof relevant material (some of which is early) in Muḥammad Baqir al-Majlisi (d. 1110/1699), Biḥār al-anwar, 110\nvols. (Beirut: Där Ihya' al-Turath al-'Arabi, 1403/1983), vols. 54-63 (al-sama? wa-l-'alam). This material awaits\nfurther study.\n64. The über-traditionalist 'Uthman b. Sa'id al-Darimi proclaims, \"God is closer (agrab) to the top of a moun-\ntain than its foot (asfalihi).\" He also cites the early traditionalist 'Abd Allah b. al-Mubarak (d. 181/797) approvingly\nas saying, \"the top of a minaret is closer to God than its base.\" See Radd al-imam al-Darimi 'Uthman b. Sa'id\n'ala Bishr al-Marisi al-'anid, ed. M. H. al-Fiqī (Beirut: Där al-Kutub al-'Ilmiyya, n.d.), 100. For the views of Ibn\nal-Mubarak, see F. Salem, The Emergence of Early Sufi Piety and Sunni Scholasticism: \"Abdallah b. al-Mubarak\nand the Formation of Sunni Identity in the Second Islamic Century (Leiden: Brill, 2016), 30.\n65. Lange, Paradise and Hell, 42-43.\n66. Nallino, 'Ilm al-falak, 137-40.\n67. Ibid., 140. See, e.g., al-Razi, al-Mațalib al-'aliya min al-'ilm al-ilahi, ed. M. 'A. Shāhin, 9 vols. in 3 (Beirut:\nDār al-Kutub al-'Ilmiyya, 1420/1999), 3: 197-233.\n68. Heinen, Islamic Cosmology, 14.\n69. Ibid, 11.\n70. On early Iberian hostility to kalām, see M. Cook, \"Ibn Sa'di on Truth-Blindness,\" Jerusalem Studies in\nArabic and Islam 22 (2007): 169-78.\n71. Sa'id al-Andalusi, Kitāb Tabaqat al-umam, ed. L. Shaykhū (Cheikho) (Beirut: al-Matbaa al-Kathūlīkiyya,\n1912), 64-65); ed. and tr. S. I. Salem and A. Kumar, Science in the Medieval World: \"Book of the Categories of\nNations\", (Austin: Univ. of Texas Press, 1991), 60 (the editors make numerous mistakes in transliterating the names\nof jurists); D. A. King, \"The Enigmatic Orientation of the Great Mosque of Córdoba,\" Suhay! 16-17 (2018-19):\n33-111, at 80. See appendix 2 for a translation of the verse.",
  "11": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n861\ntheologian 'Abd Allah b. Muḥammad al-Qahṭānī (d. 383/993), denounces the same doctrine\nin his versified creed. 72 Without delving any deeper into the subject, it seems reasonable to\nconclude that the traditionalists did more than assert their own cosmography. At least some\nof the time they actively challenged the alternatives. 73\nII. COSMOGRAPHY IN EARLY KALĀM: FIRST CONTACT\nMuslim awareness of the Aristotelian-Ptolemaic cosmography predates the apogee of\nthe Translation Movement by several decades. The earliest opinions on the subject from\nmutakallimūn, preserved in later doxographies and other sources, already reflect familiarity\nwith Aristotle, as noted by Josef van Ess. 74 Hisham b. al-Hakam (d. 179/795f.), a disciple of\nthe Shi'i Imam Ja'far al-Sadiq (d. 148/765), played the leading role in introducing cosmo-\ngraphical questions to kalām; his lead was followed by younger contemporaries, including\nAbu al-Hudhayl al-'Allaf (d. 226/840f.) and al-Nazzam (d. 220/835 or 230/845). 75 Though it\nis not clear precisely when the distinction between the \"subtleties\" (daqiq, also latif, ghamiḍ)\nand \"main topics\" (jalil) of kalām emerged, cosmography belonged firmly to the former\ndomain and generated disagreement from the outset. 76 Cosmography was a standard feature\nof the discourse of the mutakallimūn, and the main lines of inquiry were already well estab-\nlished, before they received focused elaboration at the hands of theological systematizers\ntoward the end of the third/ninth century. Cosmographical discussion in this period occurs in\nthe context of questions of bodies, motion, and void (i.e., physics) and, to a lesser extent, in\nthe refutation of other religions. On all of these issues, dialogue and polemical exchange with\nnon-Muslims seem to have been the main driver of opinion. The relative paucity of material\non cosmography, moreover, suggests that it was rather incidental to larger, more narrowly\n\"theological\" debates.\n72. Nüniyyat al-Qahtani, ed. M. Ahmad (Jeddah: Maktabat al-Suwādī, 1410/1989), 28-29: \"The geometer\n(muhandis) has lied, and the munajjim is no different-they are both [false] claimants to God's knowledge; / The\nEarth is round, according to both-they coincide in this opinion; / The earth, according to those of [sound] intel-\nlect, is flat, in accordance with the truthful, clear testimony of the Quran.\" For a comparable example from the\nQuran commentary authored jointly by al-Suyuti and his teacher Jalal al-Din al-Mahalli (d. 864/1459), see Tafsir\nal-Jalālayn, ed. F. Qabawa (Beirut: Maktabat Lubnan, 2003), 592. In the next century, Ibn Hazm (d. 456/1064)\nwould defend the quranic basis of the roundness of the earth at length in al-Fisal fi al-milal wa-l-ahwa' wa-l-niḥal,\n5 vols. (Cairo: Maktabat al-Islam al-'Alamiyya, n.d.), 2: 78-84.\n73. This can also be reasonably inferred from the titles of works of Islamic cosmography listed by Heinen\n(Islamic Cosmology, 7-9), e.g., al-Hay'a al-shar'iyya, al-Hay'a al-islamiyya. The use of such terms as shar'iyya\nand islamiyya is deliberately oppositional; for this argument, see J. I. Smith, An Historical and Semantic Study of the\nTerm \"Islam\" as Seen in a Sequence of Qur'an Commentaries (Missoula, MT: Scholars Press, 1975). Traditional-\nist reluctance to engage with the science of the stars is evident in a number of places, e.g., the Hanbali theologian\nGhulam Khalil (d. 275/888) writes, \"Observe the stars only sparingly, [and solely] as an aid to determining the times\nof prayer\"; M. Jarrar, with S. Günther, ed. and tr., Doctrinal Instruction in Early Islam: The Book of the Explanation\nof the Sunna by Ghulam Khalil (d. 275/888) (Leiden: Brill, 2020), 179.\n74. J. van Ess, Theology and Society in the Second and Third Centuries of the Hijra: A History of Religious\nThought in Early Islam, vol. 1, tr. J. O'Kane (Leiden: Brill, 2017), 427-28; vol. 3, tr. G. Goldbloom (Leiden: Brill,\n2018), 256-57.\n75. Dhanani, Physical Theory, 8. David Bennett notes that Hisham \"seems to have been the first Islamic thinker\nto thoroughly integrate\" theology and physical theory; idem, art. Hisham b. al-Hakam, E13, online (accessed Sep-\ntember 7, 2020).\n76. On the significance of the distinction, see Dhanani, Physical Theory, 3-4; on the early history of these\ncategories, see J. Weaver, \"A Footnote to the Composition History of Maqālāt al-islamiyyin: The Internal Parallels\nin al-Ash'ari's Material on the Shia,\" Journal of Abbasid Studies 4.2 (2017): 142-86, at 147-48. For a critique of\nthe Mu'tazilis' comprehensiveness in theological discussion, see Abu al-Husayn al-Malati (d. 337/987), al-Tanbih\nwa-l-radd 'ala ahl al-ahwa wa-l-bida, ed. S. Dedering (Istanbul: Matba'at al-Dawla, 1936), 33.",
  "12": "862\nJournal of the American Oriental Society 142.4 (2022)\nAs the first theologian known to have entertained views on Greek cosmography, Hisham\nb. al-Hakam's profile emerges with the faintest of clarity in the sources. He is reported to\nhave refuted the opinion that the earth extends infinitely in all directions, which Aristotle\nattributes (with some variation) to Xenophanes of Colophon.77 The earth's suspension in\nplace raised important theological questions about God's role in the maintenance of the cos-\nmos, hence the sustained interest of mutakallimün in the subject. Hisham is claimed to have\ntaught that the earth rests on a body with a tendency to ascend (jism sa\"ad), which counter-\nacts the earth's tendency to fall, thus keeping the latter in place. 78 By seeking a rationalistic\nexplanation for the earth's suspension, as opposed to assuming it rests (e.g.) on the back of a\ncosmic fish, Hisham implicitly rejects the traditionalist cosmography. There is, however, no\nhint in the sources as to his views on the shape of the earth. Hisham is also reported to have\npersuaded a Zoroastrian priest (mūbadh) that there is nothing beyond the (finite) cosmos,\ni.e., that we would not be able to see anything or extend an outstretched hand beyond its bor-\nders. 79 We also know that he was associated with corporealism, famously advocating God as\nthe possessor of \"a body unlike bodies,\" located above the throne. 80 It is not clear, however,\nwhat bearing this had on his views on more strictly cosmographical questions.\nAmong Hisham's contemporaries, Abu al-Hudhayl and al-Nazzam entertained similar\nquestions, and the extant sources are equally reticent on their views. Abū al-Hudhayl seems\nto have been the first mutakallim to refute the claim that the earth plummets downward per-\npetually. 81 His argument closely recalls De Caelo: a stone dropped to the ground lands there.\nWere the earth indeed falling, the stone would never reach it. 82 Abu al-Hudhayl also con-\ntended that the earth is held in place by divine fiat, without the support of ascending bodies\nor anything else (an implicit rejection of cosmographical traditionalism). 83 We know some-\nwhat less about the views of al-Nazzam, whom the Mu'tazili biographical literature suggests\nwas both junior to and partly dependent on Hisham and Abu al-Hudhayl. 84 He is known to\nhave refuted the dualists on the infinitude of the cosmos, but it is not clear if he defended an\n77. Ibn 'Abd Rabbih, al-'Iqd al-farid, 2: 251; van Ess, Theology and Society, 1: 426; Aristotle, \"On the Heav-\nens,\" 1: 484 (Xenophanes's view is that the earth extends infinitely downward, obviating the need to explain its\nsuspension); Simplicius, On Aristotle On the Heavens 2.10-14, tr. 1. Mueller (London: Duckworth, 2005), 62-63;\nL. Elders, Aristotle's Cosmology: A Commentary on the De Caelo (Assen: VanGorcum, 1965), 249-50.\n78. Abu al-Qasim al-Ka'bi, Kitab al-Maqālāt wa-ma'ahu 'Uyün al-masa'il wa-l-jawabāt, ed. H. Hansu,\nR. Kurdi, and 'A. Kurdi (Amman: Där al-Fath, 1439/2018), 449-50; Yaqut, Mu'jam al-buldan, 1: 16. Al-Ka'bi\nreports this view via Ja'far b. Harb (d. 236/850); it is possible that his source for this is Kitab al-Radd 'ala ashāb\nal-taba'i' attributed to Ja'far by Ibn al-Nadīm (d. 380/990). See Fihrist al-Nadīm, ed. A. F. Sayyid, 2 vols. in 4 (Lon-\ndon: al-Furqan, 1430/2009), 1: 591. This view is mentioned without attribution to Hisham by al-Ash'ari; Maqālāt\nal-islamiyyin, 326.\n79. Ibn 'Abd Rabbih, al-'Iqd al-farid, 2: 251. On the question of extracosmic void, see Dhanani, Physical\nTheory, 73.\n80. Van Ess, Theology and Society, 1: 426; al-Ash'arī, Maqālāt al-islamiyyin, 207-8, 210.\n81. 'Abd al-Qahir al-Baghdadi, al-Farq bayn al-firaq wa-bayan al-firqa al-nājiya minhum, ed. M. I. al-Hasan\n(Cairo: Maktabat Ibn Sina, n.d.), 285 (where it is attributed to the materialist Dahriyya); contrast with idem, Kitāb\nUsul al-din (Istanbul: Där al-Funün, 1927), 60-61 (where it is attributed, as is usually the case, to the Sumaniyya);\nIbn Mattawayh (fl. first half of the fifth/eleventh century), al-Tadhkira fi aḥkām al-jawahir wa-l-a'räd, ed.\nD. Gimaret, 2 vols. (Cairo: IFAO, 2009), 1: 283 (where it is attributed to the dualists); van Ess, Theology and Soci-\nety, 3: 257 n. 3.\n82. Al-Qadi 'Abd al-Jabbar (d. 415/1025), Kitab Fadl al-i'tizal wa-tabaqat al-mutazila, ed. F. Sayyid (Tunis:\nal-Dār al-Tunisiyya li-l-Nashr, 1393/1974), 259; van Ess, Theology and Society, 3: 257.\n83. Al-Ka'bi, Kitāb al-Maqālāt, 449; al-Ash'arī, Maqālāt al-islāmiyyin, 326; van Ess, Theology and Society, 3:\n257-58; Yaqut, Mujam al-buldan, 1: 16.\n84. 'Abd al-Jabbar, Fadl al-i'tizal, 254 (Abu al-Hudhayl precedes him in looking into questions of natural\nphilosophy); J. van Ess, \"Theology and Science: The Case of Abu Ishaq an-Nazzam,\" in idem, Kleine Schriften, ed.",
  "13": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n863\nopinion on the shape of the earth. 85 Like his contemporaries, al-Nazzam's opinions reflect\nawareness of Aristotle, whose books he is improbably claimed to have memorized. 86 His stu-\ndent al-Jāḥiz (d. 255/868), who preserves most of the relevant material in Kitāb al-Ḥayawan,\nadvocates the earth's roundness in his al-Tarbi wa-l-tadwir, but reports nothing from his\nmaster on the issue. 87 According to some later sources, al-Nazzam explained the earth's\nimmobility (sukūn) as a function of the absence of a place for it to move in. 88 It is not until\nthe decades after his death that more systematic discussions of cosmography emerge.\nCollectively, the theological triumvirs Hisham, Abū al-Hudhayl, and al-Nazzam broached\nsome of the major cosmographical issues that would preoccupy subsequent generations of\nmutakallimūn. Most prominently, they entertained opinions on the cause of the earth's immo-\nbility and on the finitude of the cosmos, usually in opposition to various non-Muslim groups.\nNone is known to have addressed the earth's shape, or to have explicitly engaged with the\ntraditionalist cosmography, however. In the case of al-Nazzam, this may be a result of his\nextreme scepticism toward hadith and other transmitted material, which he may have felt\nwere beneath his attention. 89 With respect to Abū al-Hudhayl and Hishām, the possible rea-\nsons for this apparent lack of engagement with traditionalism are less straightforward. The\nabsence may be simply a function of the paucity of source material. 90 Nevertheless, with\nthese foundations, the basis for more systematic exploration of cosmography in kalām was\nlaid.\nIII. THE BEGINNINGS OF SYSTEMATIZATION: THE LONG THIRD/NINTH CENTURY\nNo later than the middle of the third Islamic century, discussions of cosmography in\nkalam become less fragmentary, more systematic, and the relevant material is preserved in\ngreater abundance. For the first time, significantly, we have contemporaneous attestation of\ncosmographical doctrine, and explicit engagement with traditionalist viewpoints. The Shi'a,\nin their various manifestations, continue to play a prominent role in this period, which seems\nto owe much to their increasing adoption of Mu'tazili theology. Additionally, the importance\nH. Biesterfeldt, 3 vols. (Leiden: Brill, 2018), 2: 1147-69, at 1167 (for the suggestion that al-Nazzam took his rejec-\ntion of atomism from Hisham; on the rivalry between Abu al-Hudhayl and al-Nazzām, 2: 1152).\n85. Al-Khayyat (d. 299/911), Kitab al-Intisar wa-l-radd 'ala Ibn al-Rawandi al-mulḥid, ed. H. S. Nyberg\n(Cairo: Matba'at Där al-Kutub al-Mişriyya, 1344/1925), 32-33; J. van Ess, Theologie und Gesellschaft im 2. und 3.\nJahrhundert Hidschra: Eine Geschichte des religiösen Denkens im frühen Islam, 6 vols. (Berlin: Walter de Gruyter,\n1991-97): 6: 105-6; Ibn al-Malähimi, Kitāb al-Mu'tamad, 677. According to al-Näshi' al-Akbar (d. 293/906) in\nKitāb al-Awsat, the Zoroastrians are in fact divided on the question of the infinitude of the cosmos; J. van Ess, ed.,\nFrühe mutazilitische Häresiographie: Zwei Werke des Naši Akbar (gest. 293 H.) (Beirut: al-Ma'had al-Almānī\nli-l-Abhäth al-Sharqiyya, 1971), 74.\n86. Dhanani, Physical Theory, 188.\n87. Al-Jäḥiz, \"al-Tarbi wa-l-tadwir,\" in Rasa'il al-Jaḥiz, ed. 'A. M. Hārūn, 4 vols. (Beirut: Dār al-Jil,\n1411/1991), 3: 65.\n88. Ibn Mattawayh, al-Tadhkira, 1: 287; van Ess, Theologie und Gesellschaft, 6: 112; Ibn al-Malāḥimi, Kitāb\nal-Mu'tamad, 649.\n89. See the fragments of his Kitab al-Nakth edited by Josef van Ess: Das Kitāb an-Nakt des Nazzam und seine\nRezeption im Kitāb al-Futya des Gaḥiz: Eine Sammlung der Fragmente mit Übersetzung und Kommentar (Göt-\ntingen: Vandenhoeck und Ruprecht, 1972); R. el-Omari, \"Accommodation and Resistance: Classical Mu'tazilites\non Hadith,\" Journal of Near Eastern Studies 71 (2012): 231-56, at 235. The opposition between kalām and hadith\ntransmission was much less stark among the early Shi'a. See, e.g., H. Ansari and S. Schmidtke, \"The Shi'i Recep-\ntion of Mu'tazilism (II): Twelver Shi'is,\" in Schmidtke, Oxford Handbook of Islamic Theology, 196-214, at 197;\nT. Bayhom-Daou, Shaykh Mufid (Oxford: Oneworld, 2005), 91-93.\n90. For instance, Ibn al-Nadīm (ed. Sayyid, 1: 566) attributes a Kitab al-'Alam al-kabir to al-Nazzam, which\nmight conceivably have addressed these questions.",
  "14": "864\nJournal of the American Oriental Society 142.4 (2022)\nof teacher-disciple relationships to the transmission of cosmographical opinion becomes\never more prominent. By the end of the long third/ninth century, with the careers of major\nsystematizers such as the Basran Mu'tazilis Abū 'Ali al-Jubba'ī and his son Abū Hāshim\n(d. 321/933), and the chief of the Baghdad Mu'tazilis Abū al-Qasim al-Ka'bī, the discussion\nof cosmography attains a high degree of sophistication. 91\nThe earliest cosmographical discussion in kalam for which we are not dependent on frag-\nments and later doxographies comes from Kitāb al-Dalīl al-kabir of the Zaydi Imam al-Qāsim\nb. Ibrāhīm al-Rassi (d. 246/860). 92 Unlike Hishām, Abū al-Hudhayl, and al-Nazzām, al-Rassī\nspent most of his career in the cultural backwater of Medina, far removed from the cutting-\nedge developments of Baghdad and Basra. 93 He seems to have been relatively well informed\non the cosmographical opinions of various non-Muslim groups, however, most likely as the\nresult of a sojourn in Egypt, where he is known to have interacted with Jews and Chris-\ntians. Al-Rassi's cosmographical views emerge with a clarity atypical of earlier generations.\nHe explicitly rejects cosmographical traditionalism, condemning the proto-Sunnis (hashw\nhādhihi al-umma) for their belief that the earth rests on the back of a fish (hut). 94 He advo-\ncates the view that the earth is kept aloft by a mixture of void and air (hawa') beneath it, not-\ning and dismissing the alternatives that the earth is, variously, the foundation of the cosmos,\nthat it floats on a cosmic sea, that it seeks its \"natural place\" (as per Aristotle), and that there\nis only void beneath it, or only air. 95 Kitāb al-Dalil al-kabir contains nothing on the shape\nof the earth, but it is not unlikely that al-Rassī pondered this question, though extant kalām\nsources do not address the issue until later in the century. 96\nAl-Rassi's grandson and fellow Zaydi, Imam Yahya b. al-Husayn, known as al-Hādī ilā\nal-Haqq (d. 298/911), shared his disdain for the proto-Sunnis (i.e., mushabbiha), but rec-\nognized the footstool as a physical structure encompassing the heavens and the earth. 97 He\nreports the \"five hundred years\" hadith in order to promote a sense of God's manifest great-\nness in his readers' hearts. 98 In another treatise he observes that the seven heavens and earths\nare held in midair (fi al-hawa'), without physical support, by virtue of divine fiat, much like\nAbū al-Hudhayl.99 His views are subtly different from those of his grandfather, but reflect\ncomparable assimilation of Mu'tazili ideas and corresponding scorn for the proto-Sunnis.\n91. On the significance of this phase of Mu'tazili theology, see Dhanani, Physical Theory, 9.\n92. Al-Qasim b. Ibrāhīm, al-Dalil al-kabir fi al-radd 'ala al-zanadiqa wa-l-mulhidin wa-yalihi al-Radd 'alā\nal-mulḥid, ed. I. H. 'Abd Allah (Cairo: Dar al-Afaq al-'Arabiyya, 1420/2000), 45-47; van Ess, Theology and Soci-\nety, 3: 258 n. 7.\n93. W. Madelung, art. al-Rassĩ, E12, 8: 453-54.\n94. Al-Qasim b. Ibrāhīm, al-Dalil al-kabir, 46; on the meaning of the expression hashw, see A. S. Halkin, \"The\nHashwiyya,\" JAOS 54.1 (1934): 1-28. For al-Qasim's interpretation of the 'arsh and kursi, see his \"Tafsir al-'arsh\nwa-l-kursi,\" in Majmu kutub wa-rasa'il al-imām Qasim b. Ibrahim al-Rassi (169-246), ed. 'A. A. Jadaban, 2 vols.\n(Sanaa: Dar al-Hikma al-Yamaniyya, 1422/2001), 1: 655-85.\n95. Al-Qasim b. Ibrāhīm, al-Dalil al-kabir, 47.\n96. The authenticity of much of al-Qasim b. Ibrahim's corpus has been disputed as anachronistically reflect-\ning later, more obviously Mu'tazili perspectives. See H. Ansari, S. Schmidtke, and J. Thiele, \"Zaydi Theology in\nYemen,\" in Schmidtke, Oxford Handbook of Islamic Theology, 473-93, at 474 n. 3. However, as far as I know,\nnobody has questioned the attribution of al-Dalil al-kabir.\n97. \"Kitab Tafsir al-kursi,\" in Majmu kutub wa-rasa'il al-imam al-Hadi ila al-Haqq al-Qawim Yahya b.\nal-Husayn b. al-Qasim, ed. A. b. M. al-Shädhli (Saada: Markaz Ahl al-Bayt li-l-Diräsät al-Islamiyya, 1421h),\n205-8.\n98. Ibid., 208.\n99. \"Kitāb al-'Arsh wa-l-kursi,\" in ibid., 212. In this treatise Yahya b. al-Husayn equates the throne and foot-\nstool with God's essence.",
  "15": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n865\nAmong the Imami Shi'a, the mutakallim al-Hasan b. Mūsā al-Nawbakhti (d. bet.\n300/912 and 310/922) is known to have \"adopted several theses of the Mu'tazilī theological\nschool.\" 100 Unlike al-Rassī and al-Hādī ilā al-Haqq, however, he enjoyed privileged access\nto the cosmographical knowledge of late antiquity through his residence in Baghdad and\nhis association \"with a group of translators of Greek philosophical works.\" 101 His views on\nastronomy and astrology have been carefully reconstructed by Wilferd Madelung based on\nlater texts. 102 Because the relevant work has already been done, I shall mention only a few\nof the most pertinent cosmographical points. Al-Nawbakhti is known to have written against\nAbū 'Ali al-Jubba'i's critique of the science of the stars. 103 Notwithstanding this, however,\nal-Nawbakhti was decidedly opposed to Aristotle, the pagans of Harran, and other exponents\nof that branch of learning. He produced an early account of the divergent views on the sub-\nject among Muslims and non-Muslims that demonstrates extensive firsthand knowledge,\nincluding of Aristotle's De Caelo and its commentaries. 104 Al-Nawbakhti is not always con-\nsistent in naming some of the mutakallimūn associated with particular cosmographical opin-\nions. 105 He ascribes the opinion that the earth rests \"on the back of a fish [...] on the horn of\na bull [...] standing on the ground (thara)\" to a group among the proto-Sunnis (qawm min\nahl al-ḥadīth), without commenting on it. 106 Like Abu al-Hudhayl, al-Nawbakhti refutes the\nperpetual downward fall of the earth by appealing to the example of an object dropped to the\nground (a feather or a clod of mud). 107 Notwithstanding his very extensive exposure to late\nancient knowledge, however, he remained \"in outlook a Muslim kalām theologian, not a phi-\nlosopher,\" and shared \"the basic rationalist principles of the Mu'tazila.\" 108 His wide-ranging\ncriticisms of the astronomers and astrologers (Madelung's translations of munajjimūn and\naşḥāb al-aḥkām respectively) was to prove a valuable source for later theologians of dispa-\nrate tendencies, including the idiosyncratic Hanbali Ibn al-Jawzi (d. 597/1201). 109\nAbū 'Ali al-Jubba'ī, one of al-Nawbakhti's key interlocutors and a pioneering figure in the\n\"scholastic\" phase of Mu'tazilism, had much to say on cosmography, both as a mutakallim\nand in his capacity of Quran commentator (not to put too fine a point on the distinction). His\nrole as the leading figure of Basran Mu'tazilism in his generation-or even its architect, in\nsome accounts-likely explains the devotion to preserving his opinions by scholars of later\ngenerations. Though Abū 'Ali's importance to the school came to be eclipsed by his son Abū\nHashim, we are much better informed about the cosmographical opinions of the former. Abū\n'Ali is the first mutakallim known to have figuratively interpreted Q 18:86 (\"until he reached\nthe setting-place of the sun; he found it setting into a muddy spring\"), pointing out that the\n100. J. Weaver, art. al-Nawbakhti, al-Hasan b. Müsǎ, E13, online (accessed August 15, 2020).\n101. W. Madelung, \"Al-Hasan b. Müsä al-Nawbakhti on the Views of Astronomers and Astrologers,\" in Law\nand Tradition in Classical Islamic Thought: Studies in Honor of Professor Hossein Modarressi, ed. M. Cook et al.\n(New York: Palgrave Macmillan, 2013), 269-78, at 269.\n102. The most important source of these views, Kitāb al-Mu'tamad fi usul al-din of Ibn al-Malāḥimi, is now\navailable in a much expanded edition: H. Ansari and W. Madelung, ed., Tuhfat al-mutakallimin fi al-radd 'ala\nal-falāsifa (Tehran: Iranian Institute of Philosophy, 2008), 114-23 (for his refutation of the philosophers' views on\nheavenly motion).\n103. Madelung, \"Al-Hasan b. Müsä,\" 270.\n104. The account is reported at length in Ibn al-Malāḥimi, Kitāb al-Mu'tamad, 648-83.\n105. The opinion associated with Hisham b. al-Hakam on bodies with tendencies to ascend below the earth, for\nexample, is reported anonymously; ibid., 649.\n106. Ibid., 649-50.\n107. Madelung, \"Al-Hasan b. Müsä,\" 274.\n108. Ibid., 277.\n109. Ibn al-Jawzi, Talbis Iblis, ed. A. A. al-Ṭabba' (Beirut: Där al-Qalam, 1403h), e.g., 76.",
  "16": "866\nJournal of the American Oriental Society 142.4 (2022)\nsun does not literally set into a body of water, but only appears to from afar, 110 and may\nhave inaugurated this tradition of understanding the verse.!!! This interpretation contradicts\nboth the plain-sense meaning of the Quran and the widely reported hadith of the Companion\nAbū Dharr al-Ghifārī (d. 31/652) on the rising of the sun. 112 He is also known to have advo-\ncated the flatness of the earth against those learned in the science of the stars, apparently on\nquranic grounds. 113 Abū 'Alī also rejects the view that the sky is held up by pillars; were this\nthe case, he avers, they would have to be \"massive bodies (ajsāman ghilāzān) and would be\nvisible.\"114 He similarly eschews most of the standard kalām explanations for the immobility\nof the earth on the grounds that weight is not an accident but a quality (ma'na) pertaining to\nbodies themselves. 115 Abū 'Ali affirms the existence of seven earths (as per Q 65:12), 116 and\ndenies (in one report) that any distance, gaps (sg. khalal), or clefts (futūq) separate the sub-\nterranean levels from our own. 117 He also refuses to identify the seven heavens (samāwāt)\nof the Quran with the celestial spheres, whose motion he implicitly concedes. 118 Abū 'Alī\nthus proves to be critical of the traditionalist cosmography on some points, and is no less\nwilling to reject the Greek view on others. 119 He is independently minded and discards\npopular interpretations of the Quran, or hadith, when they seem to contradict his sense of\nwhat is rational, 120 His sense of rationality, however, cannot be equated with the views of the\nmunajjimūn, of whom he was, as we have seen, intensely critical.\nThe cosmographical views of Abū Hāshim al-Jubba'ī always occur alongside discussions\nof the opinions of his father, Abū 'Alī. On many issues, including cosmography, they fail\nto see eye to eye; they are even said to have anathematized one another (i.e., takfir). 121 The\ninformation on Abū Hāshim is somewhat contradictory. He is reported as advocating the\nroundness of the earth, as suspending judgment on the issue (while \"inclining\" to accept\n110. Tafsir Abi 'Ali al-Jubba'i, ed. K. M. Nabhā (Beirut: Dār al-Kutub al-'Ilmiyya, 1428/2007), 368; al-Jishumi,\nal-Tahdhib fi al-tafsir, ed. 'A. b. S. al-Salimi, 10 vols. (Cairo: Dār al-Kitab al-Misri, 1439h), 6: 4482.\n111. Compare the views of al-Jubba'T with those in al-Ṭabari, Jami' al-bayan, 15: 374-75. On the variant\nreadings of this verse, see 'A. al-Khatib, Mu'jam al-qira'at, 11 vols. (Damascus: Där Shams al-Din, 1422h), 5:\n290-91; A. M. 'Umar and 'A. S. Makram, Mu'jam al-qira'at al-qur'aniyya, 8 vols. (Kuwait City: Matba'at Jama'at\nal-Kuwayt, 1408/1988), 4: 9-10.\n112. The most common version of this hadith, on the prostration of the sun before God's throne, is found in\nnumerous compilations. In a variant reported via the Kufan Abu 'Abd Allah al-Hakam b. 'Utayba (d. 113/731f.), the\nsun is reported to set into a hot spring. For a thorough discussion of the transmission of the hadith and its variants,\nsee \"al-Şahiḥ wasf al-shams annahā 'tasjud taḥt al-'arsh' wa-laysa 'taghrib fi 'ayn hämiya\",\"https://islamqa.info/\namp/ar/answers/176375 (accessed August 16, 2020).\n113. Tafsir Abi 'Ali, ed. Nabha, 68; al-Jishumi, al-Tahdhīb, 1: 283; Abū Rashid al-Naysābūrī (d. 460/1068),\nKitāb al-Masa'il fi al-khilaf bayn al-başriyyin wa-l-baghdadiyyin, ed. M. Ziyada and R. al-Sayyid (Tripoli: Ma'had\nal-Inma' al-'Arabi, 1979), 100; al-Sharif al-Murtada (d. 436/1044), Amālī al-Murtada: Ghurar al-fawa'id wa-durar\nal-qala'id, ed. M. A. Ibrāhīm, 2 vols. (Cairo: Där Ihya' al-Kutub al-'Arabiyya, 1373/1954), 2: 187-88.\n114. Tafsir Abi 'Ali, ed. Nabhā, 332.\n115. Ibn Mattawayh, al-Tadhkira, 1: 284. I thank Mariam Shehata for discussing this particularly knotty pas-\nsage with me.\n116. Tafsir Abi 'Ali, ed. Nabha, 469.\n117. Al-Jishumi, al-Tahdhib, 10: 6981, contra the \"five hundred years\" hadith.\n118. Ibid., 8: 5859. For a refutation of this view, see, e.g., Ibn Taymiyya, al-Risala al-'arshiyya (Cairo: Idarat\nal-Ṭiba'a al-Muniriyya, 1925), 12.\n119. His general hostility to the Aristotelian-Ptolemaic view is claimed by al-Shaykh al-Mufid (d. 413/1032)\nin Awa'il al-maqālāt, ed. I. al-Anṣārī (Tehran: al-Mu'tamar al-'Alami li-Alfiyyat al-Shaykh al-Mufid, 1413h), 100.\n120. This approach is particularly evident in Abu 'Ali al-Jubba'i's Kitab al-Maqālāt (probably correctly attrib-\nuted to him), which is for the most part a polemic against the proto-Sunnis, e.g., pp. 246-57.\n121. Abū Hayyan al-Tawhidi (d. 414/1023), al-Başa'ir wa-l-dhakha'ir, ed. M. al-S. 'Uthman, 2 vols. (Beirut:\nDār al-Kutub al-'Ilmiyya, 2014), 2: 303; J. van Ess, The Flowering of Muslim Theology, tr. J. Marie Todd (Cam-\nbridge: Harvard Univ. Press, 2006), 9-10.",
  "17": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n867\nits roundness), and as accepting the equal possibility of it being either round or flat. 122 The\nview that the earth is comprised of two halves, one with the tendency to ascend and the other\nwith the tendency to fall (thus keeping the earth stationary), is also sometimes attributed to\nhim. 123\nThe chief systematizer of the Baghdad Mu'tazilis, Abū al-Qasim al-Ka'bī, disagreed with\nAbū 'Ali al-Jubba'ī on most questions of cosmography, and unlike Abū Hāshim is almost\nalways remembered to have unambiguously affirmed the earth's roundness. 124 There is no\nevidence, however, that any of these divergences were motivated by their competing doctri-\nnal affiliations. Al-Ka'bī agreed with the munajjimūn in believing the earth to be immobile at\nthe center of the cosmos, encompassed by the celestial spheres, but he shared this belief with\n\"many of the ahl al-tawhid [i.e., fellow Mu'tazilis],\" along with many of the \"ancients.\" 125\nThe extent of his agreement with the munajjimūn, however, seems to have been unique\namong theologians of his generation, including his view on the cause of the earth's suspen-\nsion (its place at the center of the spheres). 126 Al-Ka'bī, like Abū 'Alī, interprets Q 18:86\nfiguratively, arguing that the sun is much larger than the earth, so cannot set into any part\nof it. 127 He also denies the existence of intra- and extracosmic void, 128 and continues the\ntradition of his Mu'tazili forebears in refuting the infinitude of the cosmos. 129 He is reported\nto have frequented the teaching circle of Abū Muslim al-Isfahānī (d. 322/943), a fellow\nBaghdad Mu'tazili who similarly interpreted Q 18:86 figuratively and denied that the sky is\nheld up by pillars. 130\nThe rationalist theologians of the mid-third to early fourth/tenth century built on the foun-\ndations laid by the triumvirs and expanded the repertoire of cosmographical topics found\nin kalam discourse. Notwithstanding the dearth of early sources, this claim complements\nour existing knowledge of the period, and thus appears to be reasonable. The shape of the\nearth emerged as a point of controversy no later than the late third Islamic century, attract-\ning the attention of traditionalists and others. The issue generated disagreement among the\nMu'tazilis that cannot be explained in terms of school affiliation; here, too, the Basrans Abū\n'Ali and his son Abū Hāshim al-Jubba'ī adopted more or less opposing viewpoints on the\nquestion. Opinion on such topics, belonging to the domain of daqiq al-kalām, was a function\n122. See, respectively, Ibn Mattawayh, al-Tadhkira, 1: 284; al-Naysābūrī, al-Masa'il fi al-khilaf, 100; al-Jishumi,\nal-Tahdhib, 1: 284. For a discussion of the contradiction, see Ibn Mattawayh, al-Tadhkira, 1: 305; M. J. McDermott,\nThe Theology of al-Shaikh al-Mufid (d. 413/1022) (Beirut: Dar al-Machreq, 1978), 215. For a passage that seems to\nsuggest his agreement with his father, see al-Mufid, Awa'il al-maqālāt, 100.\n123. Ibid., 496-98, 527. In no other source have I come across this view attributed to a named theologian, e.g.,\nal-Ka'bi, Kitāb al-Maqālāt, 449.\n124. There is no reference to this question in al-Ka'bi's Maqālāt. See al-Jishumi, al-Tahdhib, 1: 284;\nal-Naysābūrī, al-Masa'il fi al-khilaf, 100; al-Mufid, Awa'il al-maqālāt, 100; R. el Omari, The Theology of Abu\nl-Qasim al-Balkhi/al-Ka'bi (d. 319/931) (Leiden: Brill, 2016), 86. Elsewhere, al-Ka'bī is claimed to have held\nthat the earth cannot be round; Tafsir Abī al-Qasim al-Ka'bi al-Balkhi, ed. K. M. Nabha (Beirut: Dār al-Kutub\nal-'Ilmiyya, 1428/2007), 110. This is a relatively late report and is probably mistaken.\n125. Al-Mufid, Awa'il al-maqālāt, 99.\n126. Ibid., 100. Al-Ka'bi is reported to have attended the circle of a certain Abu Aḥmad al-munajjim; this could\nconceivably have played a role in the shaping of his cosmographical views. See Ibn al-Murtada (d. 840/1437), Kitāb\nTabaqat al-mu'tazila, ed. H. Ritter and A. Dietrich (Beirut: Franz Steiner, 1961), 88.\n127. Tafsir Abi al-Qasim, ed. Nabhä, 260.\n128. El Omari, Theology of Abu l-Qasim, 85-86; Cf. Dhanani, Physical Theory, 73; al-Ka'bi, Maqālāt, 485.\n129. Al-Ka'bi, Maqālāt, 591-97.\n130. On the relationship between them, see Ibn al-Murtada, Tabaqat al-mutazila, 91. On Abu Muslim's inter-\npretation of Q 18:86 and view of pillars, see Tafsir Abi Muslim Muḥammad b. Bahr al-Asfahānī, ed. K. M. Nabhä\n(Beirut: Dār al-Kutub al-'Ilmiyya, 1428/2007), 181-82 and 160; al-Jishumi, al-Tahdhib, 6: 4482.",
  "18": "868\nJournal of the American Oriental Society 142.4 (2022)\nof individual inclination, exposure to late ancient learning, and other factors. Intimate famil-\niarity with the science of the stars, however, in no sense precluded hostility toward it, as is\nevident in the case of al-Nawbakhti-apparently the best-informed theologian on the subject.\nIn the course of the period, quranic hermeneutics came to figure prominently in kalām\ndiscussions of cosmography, perhaps for the first time. Most of the relevant material is found\nnot in works of theology proper, but in Quran commentaries authored by mutakallimūn. The\nrationalist theologians seem to have turned to authoring full-length works of tafsir late in\nthe third/ninth century, which forced them to confront cosmographical questions that might\notherwise have eluded them. A number of key quranic verses emerged as the focal points for\ndiscussion (appendix 1).\nThe trends witnessed in the work of Abū 'Ali al-Jubba'ī and al-Ka'bī, the chiefs of the\nBasran and Baghdad Mu'tazilis, continued into the next period of cosmographical discus-\nsion in kalam, which is marked by considerable continuity but is also notable for its depar-\ntures. The major development is the theological careers of Abu al-Hasan al-Ash'arī and Abū\nMansur al-Māturīdī. Neither seems to have been especially important during his lifetime, and\none cannot speak of Ash'ari or Maturidi \"schools\" until well after their deaths. 131 Neverthe-\nless, with their advent one can retrospectively speak of the beginnings of what would become\nclassical Sunni theology, with all that this entails for cosmographical doctrine.\nIV. THE ROAD TO CLASSICAL SUNNISM: THE NEXT GENERATION\nOf these eponyms of the two most prominent schools of Sunni kalām, the career of\nal-Ash'arī has the most significance for the development of cosmographical discourse in\nkalām. Notwithstanding his dramatic \"conversion,\" traditionally dated to the (significant)\nyear 300/912f., 132 al-Ash'arī \"retained much of the subject matter, rationalist methodology,\nand cosmology of the Mu'tazilis.\" 133 As such, his views on cosmography share obvious\nstructural similarities with theirs, and he addresses the points expected of a Mu'tazili theolo-\ngian of the period. Al-Ash'ari's most sustained treatment of the question is found, unsurpris-\ningly, in his Maqālāt al-islamiyyin, and important material is also reported from him in Ibn\nFūrak's Mujarrad. 134 It is generally agreed that Maqālāt al-islamiyyin was written in stages,\nsome predating al-Ash'ari's conversion. 135 The question of the book's sources remains more\ncontroversial; James Weaver argues for the dependence of al-Ash'arī on al-Ka'bī, while van\nEss suggests that they both relied on a common source. 136 Reading their respective accounts\nof cosmography alongside each other, important differences in structure give weight to van\n131. On the emergence of the Ash'ari school, see J. Thiele, \"Between Cordoba and Nisǎbür: The Emergence and\nConsolidation of Ash'arism (Fourth-Fifth/Tenth-Eleventh Century),\" in Schmidtke, Oxford Handbook of Islamic\nTheology, 225-41. Thiele (p. 229) locates its consolidation in the careers of al-Baqillānī (d. 403/1013), Ibn Fürak\n(d. 406/1015f.), and Abu Ishaq al-Isfara ini (d. 418/1027). On the emergence of a Maturidi school and its early\nrelationship with the Ash'aris, see Rudolph, Al-Maturidi, 319-23.\n132. M. Watt, art. al-Ash'arī, Abu 'l-Hasan, E12, 1: 694-95, at 694. The date may represent an attempt to\nenhance the claims made by Ibn 'Asäkir (d. 571/1176), among others, that al-Ash'arī was the reviver (mujaddid) of\nthe third Islamic century and belonged to the salaf (both of which claims would be undermined if his conversion\npostdated the turn of the century); Ibn 'Asäkir, Tabyin kadhib al-muftari fi mã musiba ila al-imām Abī al-Hasan\nal-Ash'arī, ed. M. Z. al-Kawthari (Damascus: Där al-Fikr, 1399h), 52-54, 142-48.\n133. Ragep, \"Islamic Culture,\" 55.\n134. Al-Ash'arī, Maqālāt al-islamiyyin, 326; Ibn Fürak, Mujarrad maqālāt al-shaykh Abi al-Hasan al-Ash'arī,\ned. D. Gimaret (Beirut: Dar al-Machreq, 1987), 275, 277-78.\n135. Weaver, \"Footnote,\" 144.\n136. Ibid., 157.",
  "19": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n869\nEss's thesis. 137 Al-Ash'arī's presentation of the competing views of the mutakallimūn on the\nsubject is dispassionate, and it is unclear which of the four opinions he reports is regarded\nas the correct one. Ibn Furāk provides the necessary information. He notes that al-Ash'arī\nheld that \"there is no reason for the suspension of the earth [in place] other than God's\nvolition (ikhtiyar).\" 138 Of the four solutions documented in Maqālāt al-islamiyyin, this cor-\nresponds most closely to the view, attributed to Abu al-Hudhayl, that the earth does not\nrest on a body. 139 Al-Ash'arī explicitly rejects, in good occasionalist fashion, all alternative\ncausal accounts of the earth's immobility, whether produced by advocates of taba'i' (the\nfour elemental qualities) 140 or tawallud (Mu'tazilis): \"God, the most exalted, is the one who\nholds the earth [in place], preserves, and oversees it, [the one who] renders the mobile bod-\nies thereon immobile, by his will.\"141 Similarly, in al-Ash'ari's Risāla ilā ahl al-thaghr it is\nGod alone who prevents the firmament from collapsing onto the earth (echoing Q 22:65). 142\nAl-Ash'arī repudiated all claims about the inherent \"nature\" of bodies, whether it was\nthe supposed tendency of fire to rise or of stones to fall, and, like Hisham b. al-Hakam, he\ndenied that one could stretch a hand beyond the cosmos. 143 The view that the earth is hurtling\ndownward, attributed by Ibn Fürak to the materialists (Dahriyya), is rejected by al-Ash'arī,\nas is the (more unusual) opinion that it floats upward, also ascribed to them. The opinion\nthat the earth is comprised of parts whose properties counteract each other (the fourth solu-\ntion presented in Maqālāt al-islamiyyin) is also refuted, as is the claim that it rests on a body\nthat is re-created every moment for this purpose (solution three): God instead re-creates the\naccident of motionlessness (fi'l al-sukun) in it every instant. 144 The bottom surface (al-safiḥa\nal-sufla) of the earth cannot be described as either immobile or moving, al-Ash'arī points out,\nseemingly because it cannot be described as having a place (makan). 145 To summarize his\ncontributions to the debate, al-Ash'arī takes the cosmographical framework of the Mu'tazilis\nas his point of departure, while rejecting most of the solutions they proposed to its most\nenduring problems, e.g., the cause of the earth's immobility. His occasionalist commitments\nare the cause of these divergences. At no point in his extant work does al-Ash'arī explicitly\nreference traditionalist cosmography, though by denying that the earth rests on a body, he\nimplicitly rejects one important element of it.\nThe case of al-Māturīdī is somewhat different, notwithstanding his well-known disagree-\nments with al-Ka'bī. He does not demonstrate an interest in the cosmographical questions\nthat exercised al-Ash'arī and his peers. This is most likely because al-Māturīdī's theology\nlacks a comparable genealogical connection to the Mu'tazilis, and so mostly reflects different\n137. In a comparison of al-Ash'ari, Maqālāt al-islamiyyin, 326, with al-Ka'bi, Kitāb al-Maqālāt, 449-50,\nal-Ash'arī places his solutions to the question of the earth's immobility and suspension in a different order than\nal-Ka'bi, in the sequence (using al-Ka'bi's presentation) 1, 4, 2, 3. Unlike al-Ka'bi, he does not mention the notion\nthat the earth rests at the center of the spheres. Al-Ash'arī directs readers interested in more information on the\ncosmographical views of the ancients to his (lost) Maqālāt al-mulḥidin, which is not listed by Ibn al-Nadim (ed.\nSayyid, 1: 649).\n138. Ibn Fürak, Mujarrad, 275.\n139. Al-Ash'ari, Maqālāt al-islamiyyin, 326.\n140. On the proponents of taba'i, see G. Schwarb, \"Early Kalam and the Medical Tradition,\" in Philosophy\nand Medicine in the Formative Period of Islam, ed. P. Adamson and P. E. Pormann (London: The Warburg Institute,\n2017), 104-69, at 105, passim. I thank one of the anonymous reviewers for bringing this paper to my attention.\n141. Ibn Fürak, Mujarrad, 275.\n142. Al-Ash'arī, Risāla ila ahl al-thaghr, ed. 'A. Sh. M. al-Junaydi (Medina: Maktabat al-'Ulum wa-l-Hikam,\n1422/2002), 155.\n143. Ibn Fürak, Mujarrad, 277.\n144. Ibid.\n145. Ibid, 278.",
  "20": "870\nJournal of the American Oriental Society 142.4 (2022)\nconcerns, characteristic of eastern Hanafism. His one (fleeting) reference to cosmographical\ndebate in a kalām context is in Kitāb al-Tawhid, where the earth's perpetual falling is attrib-\nuted to the Sumaniyya. 146\nOwing to the preservation of al-Māturīdī's Quran commentary, we know much more about\nhis cosmographical views than those of al-Ash'arī. In nearly all of the key verses where\none might expect to find his commentary on the relevant verses to be inflected by kalām\ndebates, al-Māturīdī either endorses traditionalist positions explicitly or reports them without\ncomment. He seems to be unaware of Mu'tazili views on these points, or at the very least\nrefrains from discussing them. In his tafsir of Q 18:86-as we have seen, a site of Mu'tazili\ncosmographical intervention since at least the time of Abū 'Ali al-Jubba'i-al-Māturīdī lim-\nits himself to mentioning variae lectiones. 147 In his exegesis of Q 50:1 he acknowledges\nthe world-encompassing mountain range (made of green or red ruby), but suggests that this\ncannot be the correct interpretation as \"the [pagan] Arabs knew nothing of Mt. Qaf or its\ngreatness.\" 148 God would not swear an oath, presumably, by anything unfamiliar to the origi-\nnal, mostly pagan audience of the quranic revelation. Al-Maturīdī's reading of Q 65:12 is\nrevealing of his general approach to the subject. He notes three interpretations for the seven\nearths: that they are layered one above the other like the heavens (as per the traditionalist\nview); that these \"earths\" are in fact seven continents (jaza'ir); 149 and that the six earths are\nlocated somewhere beyond the lowest heaven (al-sama' al-dunya, Q 67:5). Refusing to com-\nmit himself to any of these options, al-Māturīdī writes, \"We have no need to know the nature,\nmodality, or number of [the earths], because there is no legal ruling (hukm) attached thereto,\nand God knows best.\" 150 This attitude clearly diverges sharply from the approach of the\nMu'tazilis, who had no qualms about entertaining such conjectures. Al-Māturīdī only affirms\nfigurative interpretations of cosmographical data when the proper understanding of God's\nattributes is at stake, as in the case of the throne and the footstool. 151 He does mention the\npossibility that the firmament is not held up by pillars, but this view is also reported by the\ncontemporaneous al-Tabarī, and has no necessary connection to the mutakallimūn as such. 152\nOne case that confirms the impression that cosmographical perspective was, among the\nmutakallimūn, more a matter of individual inclination than doctrinal or sectarian affiliation,\nis Ibn al-Ikhshid (d. 326/938). According to Jean-Claude Vadet, his theology was \"more\npietistic and more popular, more in accordance with his Shāfiī ideas and his knowledge\nof ḥadīth and of tafsir\" than was commonly the case for his Mu'tazili peers. 153 He treats\n146. Al-Māturīdī, Kitab al-Tawhid, ed. B. Topaloğlu and M. Aruçi (Istanbul: Maktabat al-Irshad, 2001), 221.\n147. Al-Māturīdī, Ta'wilat al-Qur'an, ed. A. Vanioğlu and B. Topaloğlu, 18 vols. (Istanbul: Där al-Mizan,\n2007), 9: 99.\n148. Ibid., 14: 85. He notes that the greenness of the ruby (väqūta) gives the sky its greenish hue. On the\ngreenness of the sky and Mt. Qaf, see A. Morabia, art. Lawn, E12, 5: 698-707, at 700, 706 respectively. Morabia\nremarks that Mt. Qaf is made of \"green emerald,\" i.e., zumurrud. On rubies generally, see al-Birūnī, al-Jamahir\nfi al-jawahir, ed. Y. al-Hädi (Tehran: Maktab Nashr al-Turäth al-Makhtüt, 1416/1995), 107-55. For al-Biruni's\ncritique of Mt. Qaf (made of emerald), which he dismisses as mere superstition (khurafat), see pp. 269-70. He\nclaims the \"Shumaniyya\" (closer to the Sanskrit śrmana than the normal Sumaniyya, reflecting his knowledge of\nthat language) to be the source of this notion (pp. 270-71), because of their comparable belief in Mt. Meru, \"a lofty\nmountain situated under the north pole, whose four sides are comprised of rubies of various colors.\" See also idem,\nAlberuni's India, 1: 243-50 (p. 249 for Mt. Qaf, \"as it is called by our common people\").\n149. For the related notion of the seven earths as climes (aqālīm), see Jachimowicz, \"Islamic Cosmology,\" 147.\n150. Al-Māturīdī, Ta'wilät al-Qur'an, 15: 244.\n151. Ibid., 2: 157, 7: 132.\n152. Ibid., 7: 380. For al-Ṭabari, see above.\n153. J.-C. Vadet, art. Ibn al-Ikhshid, E/2, 3: 807.",
  "21": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n871\nQ 18:86 accordingly: the sun \"actually sets into a muddy spring, in accordance with the\nplain-sense meaning (zahir) of the Quran.\"154\nThus, by the early fourth/tenth century, key patterns of cosmographical thinking (in the\ncontext of schools of kalām) had emerged that would have a decisive bearing on subsequent\ndevelopments. Following his conversion, al-Ash'arī committed himself to occasionalism—\nwhich would endure as a distinctive feature of Ash'ari theology-while retaining an interest\nin the kalām questions and methods of his Mu'tazili teachers, including those pertaining to\ncosmography. Al-Māturīdī's vision of the cosmos was, on the other hand, much more closely\nrelated to that of al-Tabarī than to that of the Mu'tazila, and he was not exercised by the\nsame set of questions. Even among the Mu'tazilis, formative exposure to the traditionalist\ndisciplines (most importantly, hadith) could produce a corresponding inclination, as we have\nseen with Ibn al-Ikhshīd. Overall, among these three theologians of clearly divergent view-\npoints, theological affiliation is not an accurate index of cosmographical opinion. Similar\nconclusions may apply outside the Muslim community for this period: the Jewish mutakal-\nlim Dawūd al-Muqammaş (d. ca. 325/937), whom most scholars regard to have been deeply\ninfluenced by the Mu'tazilis, claims that the earth is discoid and the sky dome-shaped, in\ngood Talmudic fashion. 155\nV. THE BAGHDAD EPICENTER: COSMOGRAPHY IN THE EARLY CLASSICAL\nTHEOLOGICAL SCHOOLS\nIn his study of the formation of the Sunni schools of law to the end of the fourth/tenth\ncentury, Christopher Melchert observes that the jurists of Baghdad were \"usually leading\nthe way, [or] almost always at least keeping pace.\" 156 Wolfhart Heinrichs has also remarked\nthat this period witnessed Islamdom's intellectual coming-of-age across the disciplines gen-\nerally. 157 Because of its role as the preeminent center of patronage, Muslim-non-Muslim\nencounter, and translation into Arabic, Buyid Baghdad played an oversize role in the his-\ntory of kalām in this period. The city was characterized by \"frequent polemical encounters\nbetween members of the various groups.\" 158 It figures prominently in the early history of the\nclassical theological schools, with all that this entails for the development of cosmographical\nopinion. In this period the theological dissection of this material becomes more sophisticated\nas the classical theological schools crystallize; some mutakallimūn, such as al-Balkhi and\nal-Shaykh al-Mufid, demonstrate a clear sympathy for the perspectives of the munajjimūn.\nNone of the most basic points of cosmography was settled in theological discourse, however,\nand the disagreement does not clearly reflect school affiliation. Even by the close of the fifth/\neleventh century, one cannot speak of clear patterns of opinion among the theologians writ-\n154. Tafsir Abi al-Qasim, ed. Nabhä, 260; al-Jishumi, al-Tahdhib, 6: 4483. Al-Jishumi adds that this is the opin-\nion of \"most of the Quran commentators\" (as opposed to the theologians).\n155. Al-Muqammas, Twenty Chapters, ed. and tr. S. Stroumsa (Provo: Brigham Young Univ. Press, 2016),\nxxiii-xxiv, 114-15 respectively (Stroumsa argues that Mu'tazili influence on the Jews postdates al-Muqammas.\nwhile recognizing that his treatise is produced in the conventional kalām style). On the Talmudic vision of the\ncosmos, see J. Brown, New Heavens and a New Earth: The Jewish Reception of Copernican Thought (New York:\nOxford Univ. Press, 2013), 27-41.\n156. C. Melchert, The Formation of the Sunni Schools of Law: 9th-10th Centuries C.E. (Leiden: Brill, 1997),\n200.\n157. W. P. Heinrichs, \"On the Figurative (majaz) in Muslim Interpretation and Legal Hermeneutics,\" in Inter-\npreting Scriptures in Judaism, Christianity and Islam: Overlapping Inquiries, ed. M. Z. Cohen and A. Berlin\n(Cambridge: Cambridge Univ. Press, 2016), 249-65, at 250; H. A. Abdulsater, Shi'i Doctrine, Mu'tazili Theology:\nAl-Sharif al-Murtada and Imami Discourse (Edinburgh: Edinburgh Univ. Press, 2017), 16.\n158. T. Bayhom-Daou, Shaykh Mufid, 28.",
  "22": "872\nJournal of the American Oriental Society 142.4 (2022)\ning on the subject; one can only note the failure of the Aristotelian-Ptolemaic model to have\nsuccessfully displaced any of the alternatives.\nBefore his death, al-Ash'arī migrated from his native Basra to Baghdad, as did his stu-\ndent Ibn Mujahid al-Başrī (d. 370/980f.). 159 Another Basran, al-Ju'al b. 'Alī, better known\nas Abū 'Abd Allah al-Başrī (d. 369/980), the chief Bahshami of his generation, made the\nsame journey. 160 Abū 'Abd Allah, a student of Abū Hāshim al-Jubba'ī, who counted al-qāḍī\n'Abd al-Jabbar and the vizier Ibn 'Abbād 161 (d. 385/995) among his own students, was a\nmajor figure in the early history of the school. 162 Because of these migrations, the signi-\nfiers \"Basran\" and \"Baghdad\" (i.e., of the Mu'tazilis) lost their geographical meaning; in\na manner of speaking, they transitioned from \"regional\" to \"classical\" schools of theology.\nSimilarly, among the Twelver Shi'a, Ibn Bābawayh (d. 380/991) established his reputation as\nstar theologian of the community in Baghdad, before returning eastward. The career of his\nstudent al-Shaykh al-Mufid, a resident of the city, marked a major turning point in the his-\ntory of Twelver theology. Though there would be further eastward migration, especially by\nthe Ash'aris (for whom Nishapur became a major center), Baghdad retained its importance\nwell into the fifth/eleventh century. This has a significant bearing on the transmission of\ncosmographical doctrine.\nIn Baghdad al-Ash'ari's student, Abu al-Hasan al-Bahilī (d. ca. 370/980f.), taught the\nmajor theologians of the next generation of the school: al-Baqillānī, Ibn Fürak, and Abū\nIsḥāq al-Isfarā īnī. 163 Of the three, al-Baqillānī's oeuvre is the best preserved. He is conver-\nsant in the views of the munajjimūn and refutes their claim that the stars influence sublunar\nevents, 164 but does not adopt a position on any of the major cosmographical questions. Of\nal-Isfara ini's corpus, we possess only fragments. 165 Beyond his description of al-Ash'art's\nviews in Mujarrad, Ibn Fürak's comments on cosmography are fairly limited. The Quran\ncommentary attributed to him-approximately one-third of the original, beginning with\nQ 23, is extant is a curious work, written in question-and-answer format and inconsistent\nin its engagement of theological points. 166 Ibn Fürak echoes al-Ash'ari's affirmation of the\nexclusive character of divine agency: \"The earth is immobile by virtue of God's holding it in\nplace, and none can support heavy things in place without pillars other than him.\" He does\ndistinguish between the heavens and the celestial spheres (aflāk), rather than rejecting the\nlatter outright, suggesting a certain deference to the views of the astronomers. 167 Ibn Fūrak\nmentions \"the world-encompassing mountain\" as one of several interpretations of Q 50:1,\n159. Ibn 'Asǎkir, Tabyin, 177.\n160. Al-Khatib al-Baghdadi, Tarikh madinat al-salām, ed. B. 'A. Ma'ruf, 17 vols. (Beirut: Dār al-Gharb\nal-Islāmī, 1422/2001), 8: 626-27; G. Schwarb, art. Abu 'Abdallah al-Başrī, E/3, online (accessed September 10,\n2020). The Bahshamis are the followers of Abu Hashim al-Jubba'T, whose views proved more influential on subse-\nquent Mu'tazilis than those of his father, Abū 'Ali.\n161. Abu al-Muzaffar al-Isfarayini (d. 471/1078), notes that the Bahshamis dominate contemporaneous\nMu'tazilism owing to the lasting influence of al-Sahib b. 'Abbad; al-Isfarayini, al-Tabsir fi al-din wa-tamyiz al-firqa\nal-najiya 'an al-firaq al-halikin, ed. M. al-Khalifa (Beirut: Där Ibn Hazm, 1429/2008), 279.\n162. 'Abd al-Jabbar, Kitāb Fadl al-i'tizal, 325. There is no cosmographical material in the extant fragments of\nIbn 'Abbad's writings.\n163. Ibn 'Asakir, Tabyin, 178.\n164. Al-Baqillānī, Kitāb al-Tamhid, ed. R. J. McCarthy (Beirut: al-Maktaba al-Sharqiyya, 1957), 48-52.\n165. On his biography, see A. Brodersen, art. Abu Ishaq al-Isfarayīnī, E13, online (accessed September 18,\n2020).\n166. On this point, see M. Nguyen, \"Exegetes of Nishapur: A Preliminary Survey of Qur'anic Works by Ibn\nHabib, Ibn Fürak, and 'Abd al-Qahir al-Baghdadi,\" JOS 20.2 (2018): 47-73, at 59-60.\n167. Ibn Fürak, Tafsir al-Qur'an al-mansub li-Abi Bakr Muhammad b. al-Hasan b. Fürak, ed. M. al-Sulaymani\net al., 3 vols. (Cairo: Council of Muslim Elders, 1441/2020), 1: 451.",
  "23": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n873\npoints to Q 65:12 as the only quranic evidence for the existence of seven earths, and men-\ntions the possibility that Q 68:1 refers to the cosmic fish that bears the earths aloft. 168 Over-\nall, his position on cosmographical questions is thus difficult to characterize: he does not\novertly criticize traditionalist views, but distinguishes the heavens from the celestial spheres\nin a manner that suggests an attempt at harmonization.\nContemporaneously operating with these three in the polemically charged context of\nBaghdad, al-Shaykh al-Mufid is known to have met and exchanged views with al-Baqillānī\nand 'Abd al-Jabbar. 169 Al-Mufid has typically been understood to have made major con-\ntributions to the adoption of Mu'tazili theology in the Twelver school, paving the way for\n\"the greater rationalization of Imamism that took place at the hands of his pupils.\" 170 Like\nhis more traditionally inclined shaykh, Ibn Bābawayh, al-Mufid understood God's throne\nfiguratively. None of the dubious reports about the angelic bearers of the throne, he notes,\nis widely transmitted (i.e., they are aḥādī), and so do not constitute part of correct doc-\ntrine. 171 Al-Mufid defines the cosmos ('alam) in two places as \"the sky and the earth, what-\never they contain and whatever is between them.\"172 In his Awa'il al-maqālāt, he concurs\nwith al-Balkhi and the munajjimūn in believing the earth to be an immobile sphere at the\ncenter of the cosmos. This location at the center (fi al-markaz) is the cause of the earth's\nimmobility-contra al-Jubba'ī père et fils, as well as many other theologians. 173 Much like\nal-Balkhi in a previous generation, al-Mufid's views align very closely with the advocates of\nthe science of the stars, at least as far as narrow questions of cosmography are concerned. 174\nLike al-Balkhi-distinctively among the Baghdad Mu'tazilis-al-Mufid denies the existence\nof intracosmic void, against most of the mutakallimūn and the Ash'aris (i.e., mutakallimī\nal-ḥashwiyya wa-ahl al-jabr wa-l-tashbih). 175 This seemingly deliberate alignment with\nal-Balkhi, the chief of the Baghdad Mu'tazilis, is explained by al-Mufid's general sympathy\nfor the Baghdad school, which would shift in his students' generation. Al-Mufid's inclination\ntoward the cosmographical views of the munajjimūn was echoed by his student Abū al-Fath\nal-Karājikī (d. 449/1057), whose endorsement is, if anything, more full-throated. 176\nThe Buyid chief judge 'Abd al-Jabbar, who is reported to have taught both al-Mufid\nand his student al-Sharif al-Murtaḍā, played a key role in ensuring the triumph of the Bah-\nshami Mu'tazilis in his generation. His influence on the subsequent history of the school\nwas an enduring one. 'Abd al-Jabbar studied in Baghdad and elsewhere, but relocated to\nRayy to take up his judicial post, where he attracted further students (among whom, Ibn\n168. Ibid., 2: 384, 3: 70, 96, respectively.\n169. Bayhom-Daou, Shaykh Mufid, 23. Al-Mufid is also reported as a student of 'Abd al-Jabbar, M. T. Heems-\nkerk, art. 'Abd al-Jabbar b. Ahmad al-Hamadhānī, E13, online (accessed September 18, 2020).\n170. Bayhom-Daou, Shaykh Mufid, 29; see also Abdulsater, Shi'i Doctrine, Mu'tazili Theology, 2-7 (on the\nperennial question of \"influence\" and the incommensurability of Mu'tazilism and Imami Shi'ism).\n171. Al-Mufid, Tashiḥ i'tiqādāt al-imamiyya, ed. H. Dargahi (Tehran: al-Mu'tamar al-'Alami li-Alfiyyat al-\nShaykh al-Mufid, 1413h), 75-78. For Ibn Babawayh's views, see his Kitab al-I'tiqādāt (Qom: Mu'assasat al-Imam\nal-Hädi, 1389h), 100, 102-8; idem, al-Tawhid, ed. H. al-Husayni al-Ṭihrāni (Beirut: Dar al-Ma'rifa, 1387h), 250,\n317.\n172. Al-Mufid, Awa'il al-maqālāt, 99; idem, \"al-Nukat fi muqaddimat al-usul,\" in al-Nukat al-i'tiqadiyya, ed.\nM. R. al-Jalālī al-Husayni et al. (Tehran: Dar al-Mufid, 1431h), 30 (where the word order is slightly different).\n173. Al-Mufid, Awa'il al-maqālāt, 99-100.\n174. For a summary with translations, see McDermott, Theology of al-Shaikh al-Mufid, 213-15.\n175. Al-Mufid, Awa'il al-maqālāt, 100. On void, see A. M. Kandemir, \"The Hand Extending beyond the Cos-\nmos: Discussions on the Khala' [Void] between the Basran and Baghdad Schools of Mu'tazila,\" tr. A. Özkan,\nNazariyat 7 (2021): 1-35.\n176. Abu al-Fath al-Karājiki, Kanz al-fawa'id, ed. 'A. Ni'ma, 2 vols. (Beirut: Dar al-Adwa³, 1405/1985), 2:\n101-4.",
  "24": "874\nJournal of the American Oriental Society 142.4 (2022)\nMattawayh). 177 Cosmography hardly features in the extant volumes and fragments of his\nvoluminous al-Mughni fi abwāb al-tawhid wa-l-'adl, but may have been addressed in its lost\nparts. 178 Like previous Mu'tazilis, 'Abd al-Jabbar refutes the dualist belief in the infinitude\nof the cosmos. 179 In his Tanzih al-Qur'an 'an al-mata'in, an apologetic work written against\nthe text's critics, he maintains that the firmament is not held up by pillars and the sun does\nnot literally set into a body of water. 180 Al-Jishumi reports 'Abd al-Jabbar as suspending\njudgment on the shape of the earth, which suggests that he regarded the evidence for both\nsides of the argument as equipollent (takafu' al-adilla). 181 This period marked the almost\ncomplete assimilation of the heritage of late antiquity in textual form, a development power-\nfully evidenced by the career of the greatest of the philosophers, Ibn Sīnā (d. 428/1037). 182\nThe reluctance of the leading Bahshami to concede the most basic points of the Aristotelian-\nPtolemaic viewpoint is thus deeply revealing.\n'Abd al-Jabbar's student Ibn Mattawayh produced the most extensive extant account of\nkalām physics in al-Tadhkira fi aḥkām al-jawahir wa-l-a'rāḍ, which includes long passages\non cosmography (mostly in the context of discussions of motion). 183 Given its length, I can\nonly allude to some of the most salient points. Ibn Mattawayh affirms the immobility of the\nheavens and the earth, based on Q 35:41.184 He notes three views on the cause of the earth's\nimmobility, and refutes the notion that it is kept in place by the attraction or repulsion of the\nspheres; were these forces in operation, they would have the effect of a mighty wind (rīḥ\n\"asif), which we clearly do not witness. 185 Ibn Mattawayh argues that the firmament does not\nencompass the earth from all sides, contra al-Balkhi, for if the earth is below the firmament,\nthen it must always be beneath it wherever on the earth one is. Al-Ka'bi's mistaken view\nentails that if one dug deep enough into the earth, eventually the stars and heavens would\nbe visible beneath one's feet, and this is absurd. 186 Ibn Mattawayh condemns the masses\n('ämma) for their belief that the earth rests on the back of some animal (hayawan). This\nbelief is refuted on the grounds that if God could cause the earth to rest on a single object\nbearing its weight, he could likewise cause it to rest on nothing at all, keeping its aloft by his\n177. Heemskerk, art. 'Abd al-Jabbar; al-Jishumi, \"Sharh al-'Uyun,\" in Fadl al-itizal wa-tabaqat al-mu'tazila,\ned. F. Sayyid (Tunis: al-Dar al-Tunisiyya li-l-Nashr, 1393/1974), 389.\n178. I make this claim based on 'Abd al-Jabbar's interest in cosmography in his extant work, and on the fact that\ncertain cosmographical points had become established as staples of kalām prior to his career; thus, it is reasonable to\nassume that he addressed the issue somewhere in al-Mughni (ed. K. M. Nabha, 14 vols. in 10 [Beirut: Dar al-Kutub\nal-'Ilmiyya, 1433/2012]), intended as a comprehensive guide to Mu'tazili theology.\n179. 'Abd al-Jabbar, al-Mughni, 5: 28 (specifically, the Manicheans). 'Abd al-Jabbar borrows liberally from the\ndiscussion of their views by al-Nawbakhti.\n180. 'Abd al-Jabbar, Tanzih al-Qur'an 'an al-mata in (Cairo: al-Maktaba al-Azhariyya, 1329h), 179, 217\nrespectively. For his views on Q 18:86, see also al-Jishumi, al-Tahdhib, 6: 4482.\n181. Al-Jishumi, al-Tahdhib, 1: 284.\n182. For Ibn Sina's cosmographical views, which closely follow those of Aristotle, see, e.g., his al-Shifa', ed.\nG. Anawati et al., 10 vols. (Qom: Manshürät Maktabat Ayat Allah al-'Uzma al-Marashi al-Najafi, 1405h), 2: 58-63.\nSee also D. Janos, \"Moving the Orbs: Astronomy, Physics, and Metaphysics, and the Problem of Celestial Motion\nAccording to Ibn Sina,\" ASP 21 (2011): 165-214.\n183. Ibn Mattawayh, al-Tadhkira, 1: 283-88, 305-7; see also S. Schmidtke, An Anonymous Commentary on\nKitab al-Tadhkira by Ibn Mattawayh: Facsimile Edition of Mahdavi Codex 514 (6th/12th Century) (Tehran: Ira-\nnian Institute of Philosophy, 2006), 82a-85b. Cf. Ibn al-Murtada, Muqaddimat Kitāb al-Bahr al-zakhkhār al-jāmi\nli-madhāhib 'ulama' al-amşar, ed. 'A. b. 'A. al-Jarāfi (Sanaa: Dar al-Hikma al-Yamāniyya, 1409/1988), 103-4.\n184. Ibn Mattawayh, al-Tadhkira, 1: 283.\n185. Ibid., 286.\n186. Ibid., 287.",
  "25": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n875\nvolition alone. Were this not the case, something would be required to support the underlying\nobject ad infinitum, an obvious absurdity. 187\nAmong the Ash'aris of this generation, there was no reluctance whatever to critique the\nmunajjimūn. 'Abd al-Qahir al-Baghdādī, a student of al-Isfara ini (alongside whom he was\nburied), 188 condemns their views at length, deferring to largely traditionalist positions on\ncosmography. His exposition of the subject in Kitāb Usul al-din expands on the treatment in\nal-Ash'ari's Maqālāt al-islamiyyin, on which it is evidently based. 189 In the course of his sur-\nvey, al-Baghdādī mentions more obscure ancients, including Eudoxus of Cnidus (Qanādūs,\nd. 337 BCE) and Menelaus of Alexandria (Mīlāwūsh, d. 140 CE). 190 Muslims, Jews, and Chris-\ntians, al-Baghdādī informs us, are all agreed that the earth is immobile, with the exception\nof the occasional earthquake afflicting its inhabitants. On this point, they concur with such\nluminaries as Plato, Aristotle, Ptolemy, and Euclid. Other opinions include the notion that the\nearth spins on its axis while remaining in place (Eudoxus, and allegedly Menelaus), or the\nview that it is the earth that moves and the firmament that is fixed, contra the munajjimūn. 191\nFollowing al-Ash'arī, al-Baghdādī's main purpose in the discussion is to argue that the earth\nremains in place only by virtue of God's power: \"God [...] has suspended it [in place] nei-\nther by means of a body [on which it rests] nor by means of the air that encompasses it.\" 192\nIn a later chapter he foregrounds his cosmographical traditionalism, writing that the seven\nheavens are stationary plates (sg. tabaq) one above the other and the \"stars (kawākib) are all\nlocated in the lowermost heaven,\" against the astronomers, who claim that the firmament is\na sphere. 193 He insists that the heavens are both flat and immobile, and is even more strident\non these points in his heresiography, al-Farq bayn al-firaq. 194 In his recently published\nal-Asma' wa-l-sifat, al-Baghdādī similarly criticizes the munajjimūn for diverging from the\ncorrect view on \"the layout (sura) of the heavens, the stars, [and] the earth [...].\" 195\n187. Ibid.\n188. Ibn 'Asakir, Tabyin, 253-54.\n189. Comparing, e.g., al-Ash'ari, Maqālāt al-islamiyyin, 326 with al-Baghdadi, Kitāb Uşul al-din, 60-63.\n190. Al-Baghdadi is known to have been a competent mathematician, and translations of (at least some of)\nMenelaus's work into Arabic would quite possibly have been available to him, but his phrasing suggests that he\naccessed these views from a doxography (hukiya 'an; Kitāb Usül al-din, 61). On Arabic translations of Menelaus's\nworks, see Ibn al-Nadīm, ed. Sayyid, 2: 214. Ibn al-Nadim gives his name more accurately as Minäläwus. On\nal-Baghdadi as a mathematician, see, e.g., Ibn 'Asäkir, Tabyin, 254 (where he is described in glowing terms as\nal-mahir fi 'ilm al-hisab); Nguyen, \"Exegetes of Nishapur,\" 60.\n191. Al-Baghdadi, Kitāb Usül al-dīn, 61.\n192. Ibid. In al-Baghdadi's oeuvre it is unclear whether the denial that the earth rests on a body entails that there\nis nothing beneath it (against the traditionalists), or merely that it is God's power and not the influence of an adjacent\nbody that keeps the earth aloft.\n193. Ibid., 64-66. Kawkab could be used to refer to a planet or star interchangeably. In later periods it tended\nto mean star exclusively; Ibn Manzur (d. 711/1311f.), Lisan al-'arab, 15 vols. (Beirut: Där Şädir, n.d.), 1: 720-21.\n194. Al-Baghdadi, al-Farq bayn al-firaq, 285-86. This passage is very clearly evoked by the Quran commentator\nal-Qurtubi (d. 671/1273), who observes that Q 12:3 \"refutes those who claim the earth is round\"; al-Jami' li-aḥkām\nal-Qur'an, ed. 'A. b. 'Abd al-Muhsin al-Turki et al., 24 vols. (Beirut: Mu'assasat al-Risäla, 1427/2006), 12: 8-9.\nIbn Taymiyya (al-Risala al-'arshiyya, 12-13) is probably alluding to al-Baghdadi when he criticizes mutakallimün\nwho \"contradict the philosophers on the [issue of] the [heavenly] spheres with views that lack a basis in scripture\nor in reason, all the while thinking they champion religion thereby\"; see also Ibn al-Qayyim (d. 751/1350), Mifiāḥ\ndār al-sa'āda wa-manshur wilāyat al-'ilm wa-l-irāda, 2 vols. (Beirut: Dar al-Kutub al-'Ilmiyya, 1419/1998), 2: 212.\nFor a modern debate on this material, see M. Ṣāliḥ al-Ghursi, Manhaj al-asha'ira fi al-'aqida bayn al-haqa'iq wa-l-\nawhām (Konya: Ravza, 1429/2008), 153-55.\n195. Al-Baghdādī, al-Asma' wa-l-sifat, 3: 294.",
  "26": "876\nJournal of the American Oriental Society 142.4 (2022)\nLike 'Abd al-Qahir al-Baghdādī, the Twelver naqib al-ashraf (head of the Prophet's\ndescendants), 'ālim, and man of letters al-Sharif al-Murtaḍā was keen to refute astrology. 196\nCrucially, the astrologers' accurate predictions of eclipses, he insists, ought not to be taken\nas a sign of the broader validity of their claims. 197 As a student of al-Mufid (and leader of\nBaghdad's Twelver community after his death), 198 al-Murtaḍā unsurprisingly endorses the\nroundness of the earth (against Abū 'Alī al-Jubba'ī), and like his shaykh 'Abd al-Jabbar, reads\nQ 18:86 figuratively. 199 Hussein Abdulsater characterizes al-Murtaḍā as largely pursuing\nestablished trends within rationalist Shi'ism, with some departures, and as having engaged\nmuch more critically with the Mu'tazilism of the school of 'Abd al-Jabbar. 200 Unlike\nal-Mufid, however, he identified more closely with the views of the Basran than Baghdad\nMu'tazilis, but his disagreements with the former remain legion. 201\nAbū Rashid al-Naysābūrī was also a student of 'Abd al-Jabbar, whom he succeeded\nas the leading theologian of the Bahshami school. 202 Al-Naysābūrī had defected from the\nBaghdad wing of the Mu'tazilis, and so his account of the differences between them, Kitāb\nal-Masa'il fi al-khilaf, is an invaluable source. In it he reviews the debate on the shape of the\nearth, finally upholding its flatness against the claims of Aristotle's De Caelo and Ptolemy's\nAlmagest. 203 Al-Naysābūrī produces three main arguments to prove the earth is flat, in addi-\ntion to refuting several objections. If the earth were round, he writes, it would be equidistant\nat all points from the firmament, like a dot drawn at the center point of a circle. If this were\nthe case, one would not see the sun rise and set, nor would it appear higher and lower in the\nsky at various points during the day, increasing and decreasing in size, because it would not\nmove farther from or draw closer to the earth in the course of its daily cycle. 204 Furthermore,\nbodies of water would not remain in place on a round earth; there would be nothing to keep\nthem from falling into the surrounding air. Finally, the earth's roundness contradicts the\nstraightforward meaning of Q 79:30, according to which God spread out or \"flattened\" the\nearth (daḥāhā) following its creation. 205 While al-Naysābūrī does note that this verse can\nbe interpreted as referring to parts rather than to the whole of the earth (the view favored by\nal-Murtadā), he does not ultimately agree. 206 He does not express his opinion in a tone that\n196. Al-Murtada, Rasa'il al-Murtada, ed. A. al-Husayni and M. al-Raja'i, 4 vols. (Qom: Dar al-Qur'an al-Karim,\n1405h), 2: 301-12.\n197. Ibid, 311.\n198. Abdulsater, Shi'i Doctrine, Mu'tazili Theology, 19. For a survey of the theological differences between\nthem, see McDermott, Theology of al-Shaikh al-Mufid, 373-94; Abdulsater, Shi'i Doctrine, Mu'tazili Theology,\n213-14.\n199. Tafsir al-Sharif al-Murtada, ed. M. A. al-Müsawi et al., 3 vols. (Beirut: Markaz al-A'lami, n.d.), 1:\n311; idem, Amālī al-Murtada, 2: 187-88. There is some incidental traditionalist cosmographical material in Nahj\nal-balagha, compiled by his brother al-Sharif al-Radi (d. 406/1015). For a critical commentary on these points, see\nIbn Abi al-Hadid, Sharh Nahj al-balagha, ed. M. Ibrāhīm, 11 vols. (Baghdad: Där al-Kitāb al-'Arabi, 1428/2007),\n1:56 (where he refutes the \"five hundred years\" hadith, interprets the seven earths as climes, and denounces belief\nin the \"rock, the fish and the cow [i.e., bull]\" as superstitious).\n200. Abdulsater, Shi'i Doctrine, Mu'tazili Theology, 215.\n201. For examples of agreement, see ibid., e.g., 52-53, 77-78, 99-100; for disagreement, see, e.g., 111-13,\n213-16.\n202. Al-Jishumi, \"Sharḥ al-'Uyün,\" 382.\n203. Al-Naysābūrī, Kitab al-Masa'il fi al-khilaf, 100-104.\n204. Ibid., 100-101.\n205. Ibid., 101.\n206. The objection is that \"God intended [by this verse] only parts of the earth (ba'd al-ard); for the earth\ncontains flat expanses, and there is no reason not to restrict the scope [of this phrase] if some evidence requires it\";\nibid., 101; compare with al-Musawi et al., eds., Tafsir al-Sharif al-Murtadā, 1: 311.",
  "27": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n877\nis suggestive of certainty, writing that the earth's flatness is \"the position closest to the truth\n(aqrab),\" much as a jurist would say of a disputed point of law. 207\nBaghdad was to remain the \"intellectual center for kalām among the Imāmīs [...] until\nthe Saljuq invasion of the city in 447/1056.\" 208 Before this tumultuous end to the so-called\nShi'i century, Abū Ja'far Muḥammad b. Hasan al-Ṭūsī, shaykh al-ta'ifa, would emerge as the\nundisputed leader of the Baghdad community. Like most of the leading Twelver theologians\nof his generation, al-Ṭūsī had studied under al-Mufid as well as al-Murtaḍā. 209 He authored\nmajor works in the domains of fiqh, kalām, and hadith, though it is his Quran commen-\ntary (among his extant published titles) that shows the most engagement with cosmography.\nAl-Ṭūsi concurs with Abū 'Ali al-Jubba'ī that the firmament is not held up by pillars, 210 and\nlike him refuses to identify the quranic heavens (samāwāt) with the spheres of the astrono-\nmers, on the grounds that the former (like the earth) are immobile. 211 Al-Ṭūsī also affirms\nthe existence of the seven earths, but implies that six are uninhabited. 212 His tafsir bears the\nimpress of Abū 'Ali's, so it is perhaps no surprise to note that, like al-Murtaḍā, he inclined\nto Basran positions.\nThough Baghdad was to remain important as a hub of interaction between the various\ntheological schools, by the time of the Saljuq invasion of 447/1056, many of these had estab-\nlished their main intellectual centers elsewhere. This was particularly true of the Ash'aris,\nnow ensconced in Nishapur, and would soon be the case for the Twelver Shi'a. The aggres-\nsively anti-Shi'i stance of the Saljuqs radically constrained their opportunities to attract\npatronage. 213 The Maturidis remained an eastern concern at this point. I was able to find\nlittle cosmographical material in any of their extant published kalām texts of the period. Abū\nShakur al-Salimi's (d. after 460/1068) al-Tamhid fi bayan al-tawhid focuses its critique of the\nmunajjimūn on astrology, revealing nothing of al-Salimi's cosmographical commitments. 214\nSomewhat more promisingly, Baḥr al-kalām of Abū al-Mu'in al-Nasafi (d. 508/1114f.)\ndenounces the astronomers' belief that the lowermost of the heavens (al-sama' al-dunya)\ncontains only the moon among the celestial bodies. 215\nVI. CONCLUSIONS: ENTER AL-GHAZĀLI?\nIt is clear that the Aristotelian-Ptolemaic vision of the cosmos remained contested by\ntheologians of all stripes to the end of the fifth/eleventh century, though some (particu-\n207. Al-Naysābūrī, Kitab al-Masa'il fi al-khilaf, 104.\n208. Ansari and Schmidtke, \"Shi'i Reception of the Mu'tazila,\" 202.\n209. Ibid.\n210. Al-Ṭūsi, al-Tibyan fi tafsir al-Qur'an, ed. A. H. Q. al-'Amilī, 10 vols. (Beirut: Dār Ihya' al-Turāth\nal-'Arabi, n.d.), 6: 213.\n211. Ibid., 8: 437. Al-Ṭūsi therefore accepts the existence of the celestial spheres of the astronomers.\n212. Ibid., 10: 41.\n213. On Saljuq religious policy, see, e.g., O. Safi, The Politics of Knowledge in Premodern Islam: Negotiating\nIdeology and Religious Inquiry (Chapel Hill: Univ. of North Carolina Press, 2006), xxv-xxvi, 93-97.\n214. Al-Salimi regards the practice of astrology as blameworthy, but notes that as long as practitioners main-\ntain their belief in God as the determiner of all affairs, they are merely erroneous (rather than unbelieving). He\nnotes that astrology was permissible in the time of Enoch (Idris), but that this permissibility was abrogated in the\nMuḥammadan dispensation; idem, Et-Temhid fi beyani t-tevhid, ed. Ö. Türkmen (Istanbul: Türkiye Diyanet Vakfi\nYayınları, 2016), 85-88.\n215. His point is that, in accordance with traditionalist doctrine, the lowest heaven contains both the sun and\nmoon. See al-Nasafi, Bahr al-kalām, ed. M. al-S. al-Barsiji (Amman: Dar al-Fath, 1435/2014), 255. Cf. Rukn al-Din\nal-Ṭuraythithi (d. after 400/1010), Mutashäbih al-Qur'an, ed. 'A. al-Salimi (Cairo: al-Hay'a al-'Amma li-Dar al-\nKutub wa-l-Watha'iq al-Qawmiyya, 1436/2015), 978.",
  "28": "878\nJournal of the American Oriental Society 142.4 (2022)\nlarly al-Balkhi and those inclined to follow him) made generous concessions to it. Nor can\none speak of a ready embrace of the traditionalist cosmography among the mutakallimūn.\nAl-Jishūmi's Quran commentary, written toward the end of the period, makes the extent of\nthe Mu'tazili disagreement clear. Unfortunately, his own opinions are frustratingly hard to\npin down. 216 Among the Ash'aris, 'Abd al-Qahir al-Baghdādī comes closest to adopting the\ntraditionalist view of the cosmos, but owing to the paucity of the sources, it is impossible\nto state how far exactly this agreement extends. 217 Imam al-Haramayn (d. 478/1085) reiter-\nates the standard Ash'ari view on the immobility of the earth against some of the ancients,\nwithout further comment. 218\nThus, by the end of that century, the disagreement among mutakallimūn on cosmography\nwas far from being resolved, and such little nodes of common opinion as I have been able to\nfind do not fit readily into patterns of school affiliation. This is perhaps unsurprising given\ncosmography's location in daqiq al-kalām, beyond the domain of \"theology\" proper and so\nsubject to perennial dispute (at least in theory). Nevertheless, it seems clear that the practitio-\nners of scientific astronomy had not made tremendous headway in persuading the theological\nthought-leaders of Islamdom to accept even their premises, e.g., the roundness of the earth\nor the earth's location at the center of a system of concentric heavenly spheres. These con-\ncessions would eventually emerge among theologians, but not in the period under scrutiny.\nThough it can hardly be much more than conjecture, given the state of the field, I would\nlike to suggest in parting that al-Ghazālī made a significant contribution toward facilitating\nthe rehabilitation of the Aristotelian-Ptolemaic view (at least in its broadest outlines). 219\nJudging from the evidence of its citation history, the material on the cause of eclipses in his\nal-Mungidh and Tahāfut seems to have exercised broad influence. 220 If proven, al-Ghazālī\nwould seem to have had the same effect on rehabilitating Greek cosmography as he did\non logic. The two are interesting parallel cases, beginning on the margins of theological\ndiscourse before working their way into the disciplinary toolkit of postclassical religious\nlearned culture. 221 Mounting this argument in detail is evidently beyond the scope of this\npaper. It is clear, however, that even after the mutakallimūn had embraced the main fea-\ntures of the Aristotelian-Ptolemaic view, works of traditionalist cosmography continued to\n216. E.g., al-Jishumi, al-Tahdhib, 7: 4817-18 (for his distinguishing the falak from the sama without clearly\nadopting the notion of heavenly spheres); 9: 6547 (for his reporting the interpretation of Qaf as a mountain range\nof green emerald without criticism); 10: 7392 (for his discussion of Q 88:20 without defending an opinion on the\nshape of the earth).\n217. Al-Baghdadi's tafsir is partly extant in a unicum manuscript in Tashkent. I thank Martin Nguyen for dis-\ncussing his work on this text with me.\n218. I have not been able to find a reference to this discussion in Imam al-Haramayn al-Juwayni's Kitāb al-Irshad\nila qawați al-adilla fi usul al-i'tiqäd, ed. M. Y. Mūsä and 'A. 'A. 'Abd al-Hamid (Cairo: Maktabat al-Khānjī,\n1369/1950). However, the relevant text can be found in his student Abu al-Qasim al-Ansari's (d. 512/1118) Sharh\nal-Irshad, ed. K. al-'Adwānī, 3 vols. (Kuwait: Dār al-Diya', 1443/2022), 1: 404-7.\n219. On al-Ghazali's role and influence, see, e.g., A. Shihadeh, \"From al-Ghazali to al-Razi: 6th/12th Century\nDevelopments in Muslim Philosophical Theology,\" ASP 15.1 (2005): 141-79, at 149-50.\n220. For the passages in question, see al-Ghazali, The Incoherence of the Philosophers, tr. M. Marmura (Provo:\nBrigham Young Univ. Press, 2000), 6-7; idem, Al-Ghazali's Path to Sufism: His Deliverance from Error, al-Munq-\nidh min al-Dalal, tr. R. J. McCarthy (Louisville: Fons Vitae, 2000), 32-33. For a discussion of the influence of these\npassages in the modern period, see Riexinger, \"Al-Ghazali's \"Demarcation of Science\".\" I am currently collecting\ncitations of this material in premodern works.\n221. For a characterization of rationality in the postclassical curriculum, see J. Walbridge, God and Logic in\nIslam: The Caliphate of Reason (New York: Cambridge Univ. Press, 2011), 107-20. For an important contribution\nthat contests the common view that logic was, on the whole, warmly received by Sunni scholars after al-Ghazālī,\nsee M. Ali, \"A Statistical Portrait of the Resistance to Logic by Sunni Muslim Scholars Based on the Works of Jalāl\nal-Din al-Suyūtī (849-909/1448-1505),\" Islamic Law and Society 15 (2008): 250-67.",
  "29": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n879\nbe widely read, copied, and translated from Arabic. 222 The circulation of such literature in\nthe modern period deserves further comment; here I have essayed a preliminary sketch for\nthe early period, based on the existing published corpus, but much essential work remains\nto be done.\nAPPENDIX 1\nQuranic Verses That Attracted the Most Sustained Cosmographical Commentary\n2:22: [God] who has made the earth a bed [outspread] for you, 223 and the sky an edifice\n(bina'an);\n2:255: his footstool (kursiuhu) encompasses the heavens and the earth;\n9:129: and he [God] is the Lord of the great throne (al-'arsh al-'azīm);\n13:2-3: It is God who raised the heavens without pillars that you [can] see (bi-ghayri\n\"amadin tarawnahā); then he settled on the throne, and subjected the sun and the moon, each\nrunning [in their courses] until an appointed time [...] he spread the earth (madd al-ard) and\nplaced mountains and rivers therein;\n16:15: He [God] set mountains [deep] into the earth, lest it shake with you (an tamīda\nbikum;\n18:86: Until he [Dhu al-Qarnayn] reached the setting-place of the sun; he found it setting\ninto a muddy spring ('aynin hami'atin);\n21:33 He [God] created the night and the day, the moon and the sun, each coursing through\nthe sky (fi falakin yasbaḥün); 224\n35:41: God holds the heavens and the earth, lest they fall away (an tazūlā); 225 and if they\nfall away, none could hold them [in place] but God;\n50:1: Qaf\n65:12: It is God who created the seven heavens; and of the earth, the like thereof (wa-min\nal-ardi mithlahunn);\n68:1: Nun;226\n88:20: [Do they not look] at the earth, and how it is spread out (suțiḥat)?\n222. I thank Feray Coşkun for kindly sharing with me a draft of \"Celestial Phenomena, Nature and Human\nBeings in Ottoman Cosmographies\" (on translations into Ottoman Turkish). Indeed, books of \"Islamic cosmog-\nraphy were copied and read in the Ottoman Empire from the ninth/fifteenth to the thirteenth/nineteenth centuries\nonwards\"; F. Coşkun, \"An Ottoman Preacher's Perception of a Medieval Cosmography: Maḥmüd al-Hatib's Trans-\nlation of Kharidat al-'Ajaib wa Faridat al-Ghara'ib,\" Al-Masaq 23 (2011): 53-66, at 59.\n223. Al-Tabari renders this \"a carpet you can walk on, and a settling place for you to rest on.\" Jami' al-bayan,\n1: 387. To determine which are the most pertinent verses, I consulted M. Sh. al-Alüsi's (d. 1924) Mã dalla 'alayhi\nal-Qur'an mimmā ya'dud al-hay'a al-jadīda al-qawima al-burhan, ed. M. Z. al-Shawish (Beirut: al-Maktab\nal-Islāmī, 1997), which surveys all of the Quran's cosmographical verses in sequence, and was written to support\nCopernican (\"new\") astronomy. I have omitted reference to the heavenly ropes or cords (asbab), as these have\nalready received sufficient attention in the secondary literature; and I have given only the most pertinent part of the\nverse in many instances.\n224. For this and alternative interpretations, see al-Tabari, Jami' al-bayan, 16: 264-67.\n225. Ibid., 19: 390-92.\n226. Often understood to be a reference to the hut (fish on whose back the earth is spread), as has preceded.",
  "30": "880\nJournal of the American Oriental Society 142.4 (2022)\nAPPENDIX 2\nIbn 'Abd Rabbih's Poem against Abū 'Ubayda Muslim b. Ahmad al-Balansī\nIbn 'Abd Rabbih 227 criticizes al-Balansi on five points: his problematic theology (1.2); his\nallegiance to a mathematically determined qibla (1. 3); his advocacy of astrology (II. 4-5),\nand his belief in a spherical earth and heavens (11. 5-6). On all of these points, al-Balansi con-\ntradicts traditionalist doctrine. On the second charge, specifically, one should note that early\nMuslims relied on nonscientific means for determining the direction of the Ka'ba (along with\nprayer times, etc.). The adoption of other (mathematical) means, following the translation of\nlate ancient learning into Arabic, met with resistance in Iberia (and presumably elsewhere),\nas noted by David King. 228 Ibn 'Abd Rabbih's main argument against the roundness of the\nearth seems to be that lands separated by vast distances experience the same seasons at the\nsame time. Were the earth round, he suggests, this would not be the case.\nTranslation\nO Abū 'Ubayda! The one questioned for information // only recounts to whomever asks;\nYou follow only that which turns you aside from the community (jama'atina); // the Murji'i\nand Mu'tazili never attain [the truth];\nAs [with the] the original qibla, [which you have] substituted [with another], // declining\n[the original] and seeking no alternative [to your false one];\nYou allege that Mars or Venus bestow provision on us (varzuquna), // or even Mercury,\nJupiter, or Saturn!\nYou claim that all creation by an orb (falak) // is encompassed that determines [creation's]\nfate;\nAnd that the earth is round, encompassed by the firmament // from above and below, and\nthat it [the earth] is a point, for example;\nThe south's summer is the north's winter, // each taking turns [in alternating];\nDecember in Sanaa and Cordoba // is cold; in September, fires are kindled [to keep warm];\nThis is the proof [of the correctness of our opinion], and no other [view] deserves //\nadherence in thought or deed;\nJust as Ibn Mūsā 229 persists in his waywardness, // until he made easy things [difficult], like\nmountains;\n227. Ibn 'Abd Rabbih, Diwan Ibn 'Abd Rabbih, ed. M. R. al-Daya (Beirut: Mu'assasat al-Risǎla, 1399/1979),\n138-39. My translation draws on Shaykhu's edition of al-Andalusl's Kitāb Tabaqat al-umam and Ibn 'Abd Rab-\nbih's texts, and diverges from the translation of Salem and Kumar on a number of points (see n. 71 above). For Ibn\n'Abd Rabbih's biography, see I. J. Boullata, The Unique Necklace: al-'Iqd al-Farīd, vol. 1 (Reading: Garnet, 2006),\nxiv-xxii; A. P. Hámori, art. Ibn 'Abd Rabbih, E13, online (accessed July, 31, 2020). For his theological views, see\nal-'Igd al-farid, 2: 216-24, 232-51.\n228. D. A. King, \"The Enigmatic Orientation of the Great Mosque of Córdoba,\" Suhay! 16-17 (2018-19):\n33-111, at 58; idem, \"Folk Astronomy in the Service of Religion: The Case of Islam,\" in Astronomies and Cultures:\nPapers Derived from the Third \"Oxford\" International Symposium on Archaeoastronomy, St. Andrews, UK, Sep-\ntember 1990, ed. C. L. N. Ruggles and N. J. Saunders (Boulder: Univ. Press of Colorado, 1993), 124-38, at 131. In\nthis latter article, King does, however, note that \"Writers on folk astronomy [...] do not mention the mathematical\ntradition\" (p. 132), and (pp. 133-34) remarks that folk and scientific astronomy only rarely interacted, with impor-\ntant exceptions.\n229. Qasim b. Mūsǎ al-Katib, i.e., Ibn al-Afshin, another individual learned in the sciences of the ancients;\nal-Andalusi, Tabaqat al-umam, 65.",
  "31": "ANCHASSI: Against Ptolemy? Cosmography in Early Kalām\n881\nInform Mu'awiya, 230 who pays heed to their opinions, // that I have renounced their opinions\nand works! 231\nABBREVIATIONS\nASP\nArabic Sciences and Philosophy\nBSOAS Bulletin of the School of Oriental and African Studies\nΕΙ\nEQ\nIHIW\nJQS\nThe Encyclopaedia of Islam, 2nd ed. (12 vols., 1960-2006), 3rd ed. (online, 2007-)\nEncyclopaedia of the Qur'ān\nIntellectual History of the Islamic World\nJournal of Qur'anic Studies\n230. A Qurashi genealogist; ibid.\n231. I thank Tariq al-Timimi for his help with translating the final three lines."
}