{
  "1": [
    {
      "label": "section_header",
      "text": "I.16\nPRACTICES OF ZOROASTRIAN\nSCHOLARS BEFORE AND AFTER\nTHE ADVENT OF ISLAM\nGötz König\nI.16.1 Introduction\nZoroastrianism is the most important religion of pre-Islamic Iran (Widengren 1965; Boyce\n1975, 1979, 1982; Boyce and Grenet 1991; Stausberg 2002, 2004). Its history covers the last\n3000 years. Emerging probably in eastern Iran, Zoroastrianism reached western Iran in the\nAchaemenid period (6th-4th centuries BCE) and spread to Asia Minor in late antiquity. With\nthe rise of Islam, the Zoroastrian communities finally took refuge in eastern Persis (sou-\nthern Iran) and by migration in western India, especially Gujarat, as early as the late 3rd/9th\ncentury (West 1880, 1882a; Cereti 2007, 212-15). The Zoroastrian migration was described\nearly in the last century (Paymaster 1915; Hodivala 1920; Modi 1934; Unvala 1940, 56-7,\ncolophon M 50). More recent studies include Cereti and Sanjana (1991), Eduljee (1991) and\nWilliams (2009).\nThe Zoroastrian Middle Persian (Pahlavi) literature of the 1st millennium CE is built on the\nAvesta, which was for a long time orally transmitted and consists of two layers. The first layer\nis the so-called Zand (knowledge), Middle Persian translations of and commentaries on the\nAvestan texts, mostly from the Sasanian period (Cantera 2004). Second is the Pahlavi literature of\nthe 3rd-5th/9th-11th centuries, including religious literature of different genres, mostly written\nby high priests (West 1896-1904; Tavadia 1956; Klíma 1968, 1-67; Boyce 1968; De Menasce\n1975, 1983; Macuch 2009; Table 1.16.1).\nThese layers of Zoroastrian literature reflect different modes of religious thinking. While the\noldest layer is dominated by texts of ritual and meta-ritual nature, in the later layer, theological\ntexts prevail. The Zand has a kind of mediating position. This historical process of reflection has\nchanged not only the religious contents but also the intellectual style of the scholars. Two further\nfactors were of great importance for the development of Zoroastrian literature in the Islamic\nperiod: the emergence of a literate culture and the political integration of Iran into the caliphate.\nBecause of this integration, Zoroastrian priests had to learn to argue for their doctrines, espe-\ncially in the religious debates under Caliph al-Ma'mun (r. 198-218/813-833). This meant in\nparticular developing tools of logic (König 2020a). Although Greek philosophy was brought to\npre-Islamic Iran repeatedly, it is striking that the Zand shows almost no Greek influence. Only\nsome of the later Pahlavi literature uses philosophical terms and concepts that reflect Greek doc-\ntrines. This suggests that in the (late) 2nd/8th and 3rd/9th centuries some Zoroastrian priests\nDOI: 10.4324/9781315170718-18\n208",
      "bbox": {
        "l": 112.0,
        "b": 755.0,
        "r": 642.0,
        "t": 909.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 348.0,
        "b": 882.0,
        "r": 404.0,
        "t": 909.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 112.0,
        "b": 755.0,
        "r": 642.0,
        "t": 861.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 333.0,
        "b": 698.0,
        "r": 421.0,
        "t": 717.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 303.0,
        "b": 630.0,
        "r": 450.0,
        "t": 644.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 439.0,
        "r": 652.0,
        "t": 616.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 312.0,
        "r": 652.0,
        "t": 435.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 96.0,
        "r": 652.0,
        "t": 308.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 268.0,
        "t": 64.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 268.0,
        "t": 64.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 630.0,
        "b": 53.0,
        "r": 650.0,
        "t": 64.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "caption",
      "text": "Practices of Zoroastrian scholars\nTable I.16.1 Premodern Zoroastrian literature\nAvesta\nPahlavi Zand\nOld Avesta\nEastern Iran\n2nd/1st mill. BCE\nYounger Avesta\nWestern Iran (Persia)\n3rd-9th c. (?)\n9th(-14th) c.\nPahlavi literature\nengaged with Aristotelian and Neoplatonic philosophy in a manner that substantially changed\nthe deeper structure of Zoroastrianism.\nA major problem for evaluating the acquisition and transmission of philosophical, scientific\nand medical knowledge in Zoroastrian literature is the question when Zoroastrian teachings were\ncodified in written form. Much of the extant textual material comes from after the 5th/11th\ncentury. It might thus reflect partly the exposure of Zoroastrian scholars to practices and ideas of\nother scholarly communities active in Islamicate societies since the 2nd/8th century. Moreover, the\nunderstanding of pre-Islamic Iranian access to ancient Greek and Syriac texts is complicated by the\nrelatively widespread stories about the Sasanian recovery of knowledge destroyed centuries before\nby Alexander of Macedonia (r. 336-323 BCE), including the Avesta, and the scholarly activities\nof Syriac physicians in Gundishapur in western Iran. That is why this chapter does not proceed\nchronologically but is organized according to questions and problems faced in current research.\nI.16.2 Designations of Zoroastrian and non-Zoroastrian scholars and their\nfields of knowledge before the 5th/11th century\nThe Avesta knows a good number of terms that can be translated as 'ritual priest', the (judi-\ncial/religious) 'decider', the 'bearer of the (magical) word' or the 'religious teacher', espe-\ncially the Avestan aethra-pati and the Middle Persian herbed. Originally, herbeds meant ritual\ninstructors. After the Sasanian period, the word also applied to authors of Handarz (wis-\ndom literature). For example, the Avesta-editor Ādurbād Mänsarspandān (4th century) was\nequally called herbed, in this context translated as teacher. Despite the importance of the the\nconcept of knowledge in the Avesta (for the concept of knowledge in the Gāthās see Colpe\n2003) - the Avestan word zainti (cf. Pahlavi zand) means 'knowledge' - words for 'theologian'\nor 'philosopher', however, are absent. In Pahlavi literature, most non-Zoroastrian scholars\nare called teacher (kesh-dārān; see in particular Denkard 1973, 3: 8). Exceptions are Greek\nphilosophers (filasofa; Sundermann 1982, 14-38; König 2018), for whom a few sources also\nuse what is perhaps a calque of philo-sophos (danai-döst, friend of knowledge) and Iranian\nand Indian 'wise men' (dānāg):\nby the philosophers (filasofa) of Hröm [Rome] and the wise (dānāg) Indian men and\nother wise and knowing (danāg <ud> shnasag) men.\n(Denkard 4: 108)\nOther terms are frazanag (from fra-zan-) and šnasag. Compare the Avestan zainti, which becomes\nshnāsēnishn when translated into Pahlavi. A similar ancient Greek distinction between the phi-\nlosopher and the wise man appears in Diogenes Laertius (1487, 1: 4-5 and 12).\nTheir special field was seen as den dänagih, \"knowledge from/about the den (religion)\". Occa-\nsionally, they were also qualified according to their field of philosophy. Thus, a gōhr-shnasag is\n209",
      "bbox": {
        "l": 145.0,
        "b": 940.0,
        "r": 384.0,
        "t": 950.0
      }
    },
    {
      "label": "table",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 830.0,
        "r": 582.0,
        "t": 933.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 763.0,
        "r": 638.0,
        "t": 795.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 582.0,
        "r": 639.0,
        "t": 759.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 99.0,
        "b": 519.0,
        "r": 627.0,
        "t": 554.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 276.0,
        "r": 638.0,
        "t": 507.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 115.0,
        "b": 222.0,
        "r": 611.0,
        "t": 255.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 514.0,
        "b": 204.0,
        "r": 611.0,
        "t": 219.0
      }
    },
    {
      "label": "formula",
      "text": "",
      "bbox": {
        "l": 514.0,
        "b": 204.0,
        "r": 611.0,
        "t": 219.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 132.0,
        "r": 638.0,
        "t": 183.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 96.0,
        "r": 638.0,
        "t": 129.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 53.0,
        "r": 373.0,
        "t": 64.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 360.0,
        "b": 979.0,
        "r": 393.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "König\nan ontologist, while a chihr-shnasag is a philosopher of nature (for further categories, see Bailey\n1943, 86 no. 2; Shaki 1999, 177). While the danāg in the anonymous Judgments of the Spirit of\nWisdom (Dādestani Menog i Khrad; date unknown) acquires knowledge by an act of ritual gnosis,\nthe danāg in the introduction of Manushchihr's Religious Judgments (Dādestan ī dēnīg; [fl. around\n250 AY/881]; AY here and below means 'the year of Yazdegird' [d. 30/651], the last Sasanian\nking; it is one of the eras used in Islamicate societies, particularly by astrologers; it begins in\n10/632) knows and decides through reasoning (asn-khrad), ratio (cim) and the priestly family\ntradition. Denkard 3: 420 proves that the 'wise men' worked with philological arguments. Fur-\nthermore, the notion of knowledge usually has an ethical dimension, since the Zoroastrians in\nthat period believed that no deed can be regarded as good without knowledge. This can be seen\nin the gnomes (wazag) of the Handarz literature as collected in the Pahlavi Texts (manuscript MK)\nand in Denkard 6. According to Denkard 6.205, persons who will go to paradise are the wise, the\nfriend of the wise and the non-foe of the wise. Thus, the concept of the scholar is that of a wise\nor good priest (den-dastwar ī dānāg).\nI.16.3 Shifts and changes in Zoroastrian scholarship\nsince the 5th/11th century\nAs said in the introduction, two major problems for evaluating the acquisition and transmission\nof philosophical, scientific and medical knowledge in Zoroastrian literature concern the ques-\ntion of when Zoroastrian teachings were codified in written form and the relatively late dates of\nsuch writings in the forms extant today. In the following, I briefly summarize what we currently\nknow about these two issues.\nBefore the rise of Manichaeism, Iranian religious texts were mainly transmitted orally. It\nseems that the first codification of Zoroastrian, especially Avestan, texts did not take place before\nthe Sasanian period (early 3rd to the middle of the 1st/7th centuries; but see also Pausanias\n1918, 5: 27.5-6). However, the reports on the transmission of the Avesta and the Denkard seem\nto suggest that at least in the 6th century, and perhaps already in the 4th-century edition of the\nAvesta of Adurbad Mahraspand, the 'written text' became the model of a text per se (Denkard\n4; Denkard 3: 420).\nAfter the conversion of many people in the former Sasanian territories to Islam beginning\nslowly in the 2nd/8th century, Zoroastrian intellectual activities fared differently under diffe-\nrent Muslim dynasties. The Tahirids (r. 205-259/821-873) burned Zoroastrian books (Jackson\n1906, chapter 23). In 346/957-958, the Samanids (r. c. 203-395/c. 819-1005) promoted four\nZoroastrians to produce a historical narrative in New Persian prose, the Book of Kings (Shāhnāme,\nNöldeke 1920, 16). The Buyids (r. 320-447/932-1055), in particular 'Adud al-Dawla (r. 338-\n372/948-983), were also interested in the Zoroastrian past of Iran (Mottahedeh 2012, 153-60).\nOur knowledge about Zoroastrian intellectual activities, whether religious or philosophical\nand scientific, rests, on one hand, on surviving manuscripts and, on the other, on information\ncopied from earlier, now lost versions. The oldest-known Zoroastrian manuscripts stem from\nthe Mongol period and were produced by a family of eastern Iranian scribes in Gujarat. Its ear-\nliest representative consists of Avestan and Pahlavi material. A scribe named Rustam Mihrābān\nwrote it probably between 668-677/1269-1278 (Barr 1944; Cereti 2002, 214). This manuscript\nis known as K7. Its colophon gives as a date 637 parsig (K7b, fols. 107r-108r, esp. fol. 107r, 15;\ncf. Geldner 1886, vi-vii, xxxviii-xxxix). The oldest codices including only Pahlavi literature\nwere written in India in the 720s/1320s by the scribe Mihrābān Kaykhusrō from Dizūg in Sistan,\ntoday eastern Iran (on his location, see colophon I of the manuscript K5, Unvala 1940,128-9\nand Kotwal and Hintze 2008, 15; in general, see West 1896-1904, 113; Dresden 1967; Cereti\n210",
      "bbox": {
        "l": 101.0,
        "b": 701.0,
        "r": 653.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 191.0,
        "b": 638.0,
        "r": 561.0,
        "t": 673.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 542.0,
        "r": 652.0,
        "t": 626.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 414.0,
        "r": 652.0,
        "t": 536.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 288.0,
        "r": 652.0,
        "t": 410.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 89.0,
        "r": 652.0,
        "t": 285.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 367.0,
        "b": 53.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "4": [
    {
      "label": "section_header",
      "text": "Practices of Zoroastrian scholars\n2007, 211-21; König 2019; those codices are called MK and K20/K20b, Christensen 1931).\nMihrābān Kaykhusrō also wrote several exegetical Avestan manuscripts (Mills 1893; Sanjana\n1896; Christensen 1937-1939; Christensen 1941-1942; Barr 1944). He often worked from\nmanuscripts copied by his great-great-uncle Rustam Mihrābān mentioned earlier. Both scribes\nhad access to different Iranian traditions (Katrak 1941, 245-6; on Mihrābān's colophons, see\nWestergaard 1852-1854, 3 no.1 and 11 no.1; Sanjana 1896, XXX-XXXV; Hodivala 1920,\n118-33; Tavadia 1933, column 569; Tavadia 1944, 317ff). One tradition is linked to the sou-\nthern Iranian region around Kazerun and Shiraz in the 5th/11th and 6th/12th centuries. The\nother tradition points to northeastern Iran around Nishapur between 494/1100 and 648/1250.\nThus, their works prove that long before 882/1478, when the first collection of texts was\nbrought from Iran to India by messengers (rivayat), contacts existed between Sistan and Uca at\nthe Indus in the Punjab (Unvala 1922; Dhabhar 1932; Vitalone 1987; Hodivala 1920, 276-349;\nWest 1896-1904, 82). Such early contacts are also confirmed by other material. At the begin-\nning of the 5th/11th century, for instance, another key figure in the transmission of Avestan and\nPahlavi literature, the priestly scribe Mähwindad ī Naremähän i Wahrām ī Mihrābān, worked\nwith material he had apparently received from partners in India. His networks covered a large\nterritory, since in 410/1020 he also produced a copy of the Denkard from a manuscript he had\nfound in Baghdad (Andreas 1882, 72-3; Geldner 1896-1904, 14; Christensen 1936; Unvala\n1940, 152). Although we possess only this kind of scattered information about Zoroastrian\nstudies of ancient and contemporary religious and secular knowledge, the Rewayats indicate\nthat even in the 10th/16th century, Zoroastrian communities were still intellectually active in\nKhorasan, Kerman and Sistan.\nImportant intellectual activities among Zoroastrian priests took also place in India, mainly\nGujarat. Between 551/1157 and 631/1234, an eminent priest called Neryōsang was active\n(Geldner 1886, xxxiii-xxxiv; Geldner 1896-1904, 50; Damesteter 1892, CXII-CXIII; Eduljee\n1991, 62; other examples: Anquetil 1771, 1.2: 74; West 1871, x [9th/15th century]; Cereti and\nSanjana 1991 [7th/13th century]; Tavadia 1944, 304; Boyce 1979, 168-9 [5th-6th/11th-12th\ncenturies]). Nēryōsang and members of his family seem to have produced Pazand transcriptions\nof Pahlavi texts (Tavadia 1956, 14). It is debatable whether Pazand, the vocalized writing of Pahl-\navi in Avestan characters, was invented by Něryōsang. In contrast to manuscripts produced in\nIndia, Pazand writings are only sporadically used in Iranian manuscripts. For the first time, those\nZoroastrians also translated exegetical Avesta texts and Pahlavi literature into Sanskrit opening\ntherewith new intellectual opportunities (Bharucha 1906-1933). This is proved by a note in the\nParis manuscript P11 (= Suppl. Pers. 28/Blochet IX), a Sanskrit Yasna, which is a copy of the\nmanuscript J3 (on Neryōsang's Yasna manuscripts and translations see Geldner 1886, xxxiii-iv;\nBoyce 1979, 168; Humbach 2003, 2: 199–202).\nThus, between the 5th/11th and the early 8th/14th centuries, Zoroastrian scholarship in\nIranian languages other than New Persian is characterized by two features. First, scholarly\npriests were no longer active as authors (see the following discussion) but, rather, as philolo-\ngists and copyists. Second, a network of Zoroastrian scholars and communities continued to\nexist in Baghdad (Iraq), Kazerun (Fars), Nishapur (Khorasan), Dizūg (Sistan), Uca (Punjab)\nand Gujarat.\nA new feature emerged in the same period. Pahlavi texts were translated into New Persian in\nversified form. In 676/1278, Zartusht Bahram finished his Book of Zarathustra (Zartusht-Nama),\nwhich was ordered by a high priest (mobed ī mobedan; Eastwick 1843, 477-522; Spiegel 1860,\n2: 181-2; Rosenberg 1959). In his Book of Arda Wiraz (Arda Wiraz Namag) Zartusht Bahram\nmentions his father Bahram Pazhdu, a scribe (dabīr), writer (adīb) or perhaps physician (Amuzgār\n1989, 524), priest (hirbed), astronomer and poet in Pahlavi and New Persian (Amüzgar 1989,\n211",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 558.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 306.0,
        "r": 638.0,
        "t": 554.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 197.0,
        "r": 638.0,
        "t": 302.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 194.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 355.0,
        "b": 51.0,
        "r": 371.0,
        "t": 65.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 360.0,
        "b": 979.0,
        "r": 393.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "König\n524-5). 330 verses of his poem Springtimes (Bahariyat) praising Nōruz, the Zoroastrian kings and\nZartusht, have survived in only one manuscript, finished in 626 AY/1257.\n1.16.4 The authors of the Pahlavi literature (3rd/8th-8th/14th centuries)\nAnother problem when constructing a history of knowledge in Iranian languages is the wide-\nspread absence of dates in their sources. In Pahlavi literature, the focus of this section, only a few\ndates are transmitted. The most important of them is found in one of the letters written by the\nspiritual leader (rad) of Pars and Kerman, Manushchihr, to his brother Zädsparam, the priest of\nthe community of Sirgan (southeastern Iran) and to the whole Zoroastrian community of Iran,\ndated 250 AY/881 (see West 1882b, III: 21). Manüshchihr criticizes his brother's shortening\nof the purification ritual, which is required in case of contact with corpses. It is assumed that\nZādsparam's innovation was stimulated by his interest in anatomy and physiology (Sohn 1996).\nZādsparam's Selected Scripts (Wizīdagihā ī Zadspram) prove his empirical interests, his scientific\nwork and his knowledge of Greek scientific texts. He mentions a lost zoological book Taxonomy\n(Tohmag-ōshmurishnih; Sohn 1996, 3.57) and seems to have been familiar with texts by Aristotle\n(384-322 BCE) and Hippocrates (d. c. 370 BCE), among them Aristotle's Historia Animalium (Aris-\ntotle 1979). The heading of Zädsparam's chapters 29 and 30, called On the Structure of Human\nBeings (abar passāzishni mardōman), may reflect Hippocrates' On the Nature of Man (Sohn 1996,\n32). The date 881 AY/1513 is the key for the dating of many other Pahlavi works.\nThe Greater Bundahishn 35a is an important account of the genealogy of the priestly\nfamilies of Iran (Anklesaria 1956). Made allegedly on the basis of some version of the Book\nof Kings (Khwadayih-namag), which has a very difficult and highly contested transmission\nhistory (Hämeen-Anttila 2018; Chapters 1.1 and 1.2), the genealogical lines recorded there\nlead back into the Achaemenid period. The claims made for pre-Sasanian times are not at all\ntrustworthy, and the reliability of the Sasanian information is also contested (Hämeen-Anttila\n2018). Farrbay, a cleric and editor of the Greater Bundahishn, lists about 20 priestly ancestors\nfor himself (Anklesaria 1956, 35a6 and a1). The text also mentions contemporaneous schol-\nars. Even if we cannot date each single author, on the basis of Greater Bundahishn 35a and by\nmeans of further information we are able at least to compile a chronological-genealogical\ntable (Table 1.16.2).\nThe table gives the names of nearly all known Pahlavi authors. It shows that most of the\nauthors are related to each other and belong to the highest clergy. This genealogical and social\ndensity probably aimed to minimize doctrinal differences. However, it also enabled doctrinal\nchanges 'from above'. A central figure of such a change in Zoroastrian theology after 800 CE\nwas Adurfarrbay i Farrokhzādān. He is seen as the most important authority by modern Parsis\n(or Parsees), because he wrote two very important books: part or all of the Denkard and 147\nquestions of the Riwayats. A brief note in the Madayānī Gizistag Abālish proves his participation\nin the interreligious discussions in Baghdad, stating that Caliph al-Ma'mun:\nordered that all his [Muslim] wise men (dānāgān) and the [wise men] of the Jews and of\nthe Christians should come to him and should dispute with [the Zoroastrian apostate]\nAbālish [from the Arabic Abā Laith according to Schaeder 1972, 287, no. 2; see also De\nMenasce 1975, 544; Tafażżoli 1982, 58]. And because of the amir ī mūmenin's (\"leader\nof the believers\") command [also] Adurfarrbay i Farrokhzādān - he was the 'leader of\nthe good believers' (hudēnan pešobay), the qadi, the vizier and Māmūn (sic) himself\nwere in conversation with Abālish.\n(Chacha 1936, 0.5-6)\n212",
      "bbox": {
        "l": 102.0,
        "b": 917.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 122.0,
        "b": 867.0,
        "r": 629.0,
        "t": 883.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 587.0,
        "r": 652.0,
        "t": 854.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 390.0,
        "r": 652.0,
        "t": 584.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 245.0,
        "r": 652.0,
        "t": 386.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 128.0,
        "b": 98.0,
        "r": 626.0,
        "t": 218.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 498.0,
        "b": 78.0,
        "r": 623.0,
        "t": 92.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 367.0,
        "b": 53.0,
        "r": 385.0,
        "t": 65.0
      }
    }
  ],
  "6": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "Practices of Zoroastrian scholars\nTable 1.16.2 Zoroastrian scholars/priests between the late 2nd/8th and the early 5th/11th centuries\nZurwāndād\nFarrbay i\nAshawahisht\neditor of the GrBd\nAdurbād i *Jawandan\nteacher (?) of\nRōshn <ī Ādurfarrbay>\ndied before the middle\nof the 3rd/9th century;\nauthor of a \"book\" (*niß5.)\nManushchihr i\nJuwānjamān\nPärs ud Kirman rad; wrote\nthree epistles (260/881),\nDädestäni denig\n*Fray-srōsh <i\nAshawahisht (?)>\nAshawahisht i\nFray-Srōsh <\nAshawahisht (?)>\n(contemporary of Farrbay)\nAdurfarrbay ī\nFarrokhzādān\ntime of al-Ma'mun;\nfirst hudenän peshōbay\n(\"leader of the good\nbelievers\"); author and\neditor of the Denkard\nand of other books\nZartusht i Adurfarrbay\nhudenän pëshōbay;\naround 232/847\nWähramshād\nhudēnan peshobay (?)\nJuwanjam i Shābuhrān\n(or i Währamshād)\nhudenän pëshbay\nAshawahisht <i J.>\n(probably hudenän pëshbay)\nEmēdi Ashawahishtän\nhudēnān pëshōbay (?);\nwrote a Riwayat\nAdurbād i Emēdān\nhudēnan pëshōbay;\neditor of the Denkard\nIsfandyar i\nĀdurbād i Emēd\nkilled in Baghdad\n324/936; Mowbed of Iran\nZādsparam i J.\nHerbed in Sirgān;\nwrote the texts of\nthe Wizidagiha and\nother (lost) works\nFarrokhmard\ni Wahrāmān\ncompiled the Madayan\ni Hazar Dädestän\nFarrbay/Friy-Srōsh\ni Wahrāmān\nmowbedän möwbed;\nwrote a Riwayat (4\nPursishn, 419/1028\nThe analysis of Denkard 3 points to an impact of Greek, especially Aristotelian and Neoplatonic\nphilosophy (Josephson 2012, 541-52; Shaki 1970, 1973, 1998, 1999, 2003; König 2016, 2018,\n2020b). In my view, the original structure of Adurfarrbay's edition, the most important work of\nPahlavi literature, is based on the Neoplatonic doctrine of emanation. Further analysis shows that\nthe Zoroastrian position is formulated to demarcate it from the Islamic, Christian, Jewish, Ma-\nnichaean and materialistic positions. Through these discussions, logical means and philosophical\nconcepts were developed and tested (König 2020a).\nAdurfarrbay's work was continued by later Zoroastrian writers but especially by Mardānfar-\nrokh (3rd/9th century?), the son of Ohrmazddad, author of the Doubt-Dispelling Explanation\n(Shkand Gumānīg Wizar), a key text for religious history in early Abbasid time (Sundermann\n2001, 325; Schaeder 1925, 200-1, no. 3). Active after the death of Adurfarrbay and of his son\n213",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 937.0,
        "r": 607.0,
        "t": 950.0
      }
    },
    {
      "label": "table",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 291.0,
        "r": 637.0,
        "t": 931.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 149.0,
        "r": 639.0,
        "t": 272.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 77.0,
        "r": 638.0,
        "t": 147.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 354.0,
        "b": 53.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "7": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 360.0,
        "b": 979.0,
        "r": 393.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "König\nRōshn, Mardānfarrokh refers several times to the work of Rōshn (de Menasce 1945, 10.50-8).\nWest (1885, 169 no. 4) identifies this Rōshn with the commentator Rōshn, who is mentioned\nfor example in Shayest-ne-shayest and Pahlavi Videvdad. He is mentioned 10 times in Pahlavi\nVīdēvdād (Cantera 2004, 208), where at one time he is in dispute with Abarag, the last com-\nmentator from the school of Adurfarrbay-Narsē (Adurfarrbay-Narsē, Sōshans, Abarag). He pays\nspecial attention to those passages of the Denkard that are composed by Adurfarrbay and of\nAdurbād i Jäwandān (or Adurbād i Jawandad or Ādarpadiiäwandą; see de Menasce 1945; 4.106-7,\n9.1-3, 10.50-8, 1.38). Adurbād i Jäwandan was probably the teacher (bun-spas, West 1885, 162;\nde Menasce 1945, 109) of Adurfarrbay (de Menasce 1945, 9.1-3) and perhaps also the author of\nthe lost books Denkard 1 and 2 (West 1885, 138-9, no. 9). It seems that Mardanfarrokh did not\nbelong to the very dense and close circle of Persian high priests. Early wanderings (de Menasce\n1945, 1.36-7, 10.43-49; compare the wanderings of the sage (danag) in Menog i Khrad 1.34-60)\nled him, as he says, \"to the borders of many countries and seas\" (de Menasce 1945, 1.37; see\nalso 10.47). Perhaps a Manichaean with intimate knowledge of Manichaeism (a sharp polemic\nagainst Mani [\"Mānāe\"] is found in Shkand Gumānīg Wizār 1.59-60), at this time he found his\n\"salvation\" (de Menasce 1945, 1.54, 10.58) especially in Zoroastrian scriptures but above all in\nthe texts of Adurbād i Jawandan and Adurfarrbay i Farrokhzādān. His intellectually important\nbook, which was widespread in copies in Pazand and in a Sanskrit translation in India was \"not\nmade and arranged for the wise and experienced men, but for pupils and novices\" (de Menasce\n1945, 1.40). Parts of Mardanfarrokh's text also survived in an older Pahlavi version (West 1885,\nxxviii; de Menasce 1945, 159; see also Jâmâsp-Âsânâ and West 1887, xxvii, xxxvii-xxxviii;\nCereti 2014). Mardanfarrokh completed what began in Adurfarrbay's work. Denkard 3 and\nShkand Gumānīg Wizar are connected in two important points, the development of polemical/\ndemarcating ideas that are the results of reflection and discussion on non-Zoroastrian positions\nbased on logical arguments and the development of a philosophical terminology and system.\nI.16.5 What can we know about Zoroastrian scholarship\nbefore the 3rd/9th century?\nIt is difficult, if not impossible, to provide trustworthy information about the centuries prece-\nding Adurfarrbay, because we need to rely on material of uncertain dates. One such source is\nthe previously mentioned Shkand Gumanīg Wizar. It indicates that Adurfarrbay's (supposed)\nteacher, Adurbād i Jawandān, had already worked with some philosophical concepts known\nfrom Denkard 3. Another source attributed some of the terms in the transmission report Den-\nkard 4 to Aristotelian influence. The latter was written in the time of Khōsraw I (on the age\nof the text manuscript B 322.4ff., see Bartholomae 1920, 9, no. 2 and Cantera 2004, 106; for\nthe text see Zaehner 1955, 7-9, 31-4 and Cantera 2004, 110-11). Aristotelian influence is also\napparent in the terms nerōg ī mēnōyig/paydagihēnīdārīh gētīyig (Sanjana 1874-1928, 4.25,\nmanuscript B 323, 11-14), which seem to combine the Zoroastrian distinction of menōg/getīg\n\"non-material\"/\"material\" with the potential/actual distinction.\nThe relation of the two recensions of the Bundahishn, that is the Greater Bundahishn (Iranian\nBundahishn) and the Indian Bundahishn, is methodologically important. Those parts of the Greater\nBundahishn, which stem from the priestly editor Farrbay (see the earlier discussion), share phil-\nosophical elements known from Denkard 3. In the Indian Bundahishn, however, these elements\nare missing. That gives rise to the assumption that parts of the transmitted Pahlavi materials were\nreworked according to the categories of Adurfarrbay's 'philosophical theology'. Hence, it is likely\nthat at least some important Pahlavi texts are neither simply \"final versions of texts which evolved\nin oral transmission over long periods of time\" (Kreyenbroek 2002, 42-3) nor the late product\n214",
      "bbox": {
        "l": 101.0,
        "b": 503.0,
        "r": 653.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 177.0,
        "b": 440.0,
        "r": 576.0,
        "t": 474.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 234.0,
        "r": 652.0,
        "t": 428.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 652.0,
        "t": 230.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 367.0,
        "b": 53.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "Practices of Zoroastrian scholars\nof a long and continuous tradition of Greek philosophy in Zoroastrianism (Shaki's position in\n1999, 176 and 2003, 323). It rather seems that a faction of the Zoroastrian clergy of the late\n2nd/8th and 3rd/9th centuries tried to reformulate Zoroastrian theology while in contact with\nthe flourishing intellectual life of that period. This perspective receives support by the remarkable\nfact that there are no philosophical elements in the pre-Islamic parts of the whole Zand (Pahlavi\nVidevdad; Herbedestan/Nerangestan), nor do we find them in those parts that are probably later\n(Pahlavi Yasna, Pahlavi Zand-e Khorde Avesta). But for a different view on the dating of those two\nparts see Skjærvo (2008). The older parts of the Zand and of the juridical and ritualistic literature\nintegrate commentaries of the priests (Madayānī Hazar Dādestan; Shayest-nē-shayest, Zand i Fragard\nī Juddewdad; König 2010a). A nice (but little known) dispute between two scholars, Gōgushasp\nand Mēdyōmāh, on the meaning of Avestan phrases, is found in Wizirgard ī dēnīg 24. Since Tav-\nadia (1930), efforts have been made to distinguish different schools. However, the time frame of\nthese schools is still controversial. Gignoux (1995) and Secunda (2012) prefer a post-Sasanian date.\nCantera (2004, 207-20) prefers a Sasanian dating; according to Tavadia (1930, 28-9, 1956, 41-4),\nthe commentators could belong to both periods. In any case, none of the translations of and\ncommentaries on the Avesta of these schools resembles the (philosophical) school of Adurfarrbay.\nThe wisdom literature (Handarz) is also more or less unaffected by philosophical elements.\nIt consists of a series of texts ascribed to authors, who lived in different centuries: Ādurbad\nī Māraspandān and his teacher Mihr-Ohrmazd (4th century); Khusrōy i Kawādān (Khōsraw\nAnōshiravān; r. 531-579) and his minister Wuzurg-Mihr (6th century); Adurfarrbay Far-\nrokhzādān (early 3rd/9th century). The concept of reason or wisdom (khrad) is a key term in\nDenkard 3 and is also discussed in Pahlavi Text 17 (König 2010b, 116-18). Future comparison\nwith the concept's use and understanding in the older text Handarz by Wehzad Farrokh Pērōz\n(late Sasanid period?) may illuminate the development of the Zoroastrian 'philosophical the-\nology'. In comparison, the Sasanian Brih-Nask (Denkard 8: 9.1) focuses its handarz on the term\nasn <ud>srud khrad \"non-empirical and empirical reasoning\". An eminent figure from the early\n5th century was Ādurbād i Zardushtān (Cantera 2004, 217). His text on the relation of the mate-\nrial and nonmaterial written for King Yazdegird i Shābuhragan (r. 399-421) has survived (de\nMenasce 1973, 3.137), along with his and Bakhtäfrid's (1st half 6th century) Gnomes (Wazagiha).\nBakhtafrīd took part in the struggle against the Mazdakites (Zand i Wahman Yasn 2.2.; see Can-\ntera 2004, 218-20). His colleagues are partly mentioned on seals, in the Pahlavi translation and\nin Shayest-ne-shayest, which is a part of the Denkard (Cereti 1995, 175-6). Bakhtäfrīd is quoted\nin Denkard 6: A4 (Shayest-ne-shayest 20.11), 6: E22a and Denkard 3: 117. In addition, he is also\nknown from juridical texts (Macuch 1993, 8.66, 75; Tavadia 1930, 8.10). The range of his works\nresembles that of Ādurfarrbay's works from the 3rd/9th century. Even if we cannot be sure that\nAristotelian and/or Neoplatonic thoughts were adopted by Zoroastrian priests of the middle\nand late Sasanian period, this similarity indicates that at least Ādurfarrbay's 'intellectual stature',\ndefined by a scholarly work of one and the same priest in the fields of 'philosophical theology',\nHandarz and juridical literature, has had older parallels.\nBibliography\nSources\nAfifi, R. ed. 1964. Arda Viraf Nama-ye Manzum e Zartusht Bahram e Pazhdo [The Book of Arda Viraf in\nverse by Zartusht Bahram Pazhdo]. Mashhad: Mashhad University Press.\nAndreas, F. C. ed. 1882. The Book of the Mainyo-i-Khard, also an Old Fragment of the Bundehesh. Kiel: Lipsius\nand Tischer.\n215",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 665.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 251.0,
        "r": 638.0,
        "t": 662.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 317.0,
        "b": 193.0,
        "r": 409.0,
        "t": 211.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 337.0,
        "b": 161.0,
        "r": 389.0,
        "t": 174.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 120.0,
        "r": 638.0,
        "t": 148.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 92.0,
        "r": 638.0,
        "t": 119.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 354.0,
        "b": 52.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 360.0,
        "b": 980.0,
        "r": 393.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "König\nAnklesaria, B. T. 1956. Zand-Akäsih. Iranian or Greater Bundahišn. Transliteration and Translation in English.\nBombay: Bunyad-i Farhang-i Iran.\nAnklesaria, E. T. D. ed. 1908. The Búndahishn. Being a Facsimile of the TD Manuscript No. 2 Brought from\nPersia by Dastur Tirandaz and Now Preserved in the Late Ervad Tahmuras' Library. Bombay: K. R. Cama\nOriental Institute.\nAnquetil Duperron, A. H. tr. 1771. Zend-Avesta: Ouvrage de Zoroastre I-II. 3 vols. Paris: N. M. Tilliard.\nAristotle. tr. Peck, A. L. 1979. Historia animalium. Vol. 1 (Loeb Classical Library 437). Cambridge, MA:\nHarvard University Press.\nBarr, K. 1944. \"Preface,\" in Selections from Codices K7 and K25 (Vispered and Frahang I Pahlavik) and Tracings\nof the Avesta Codex K1 (Codices Avestici et Pahlavici Bibliothecae Universitatis Hafniensis XII). Copenhagen:\nNordisk Forlag.\nBharucha, E. D., ed. 1906-1933. Collected Sanskrit Writings of the Parsis: Old Translations of Avesta and Pahl-\navi-Pazend Books as well as Other Original Compositions; with Various Readings and Notes. 6 vols. Bombay:\nThe Trustees of the Parsee Punchayet Funds and Properties.\nBurnouf, E. 1833. Commentaire sur le Yaçna l'un des livres lithurgiques des Parses. Paris: s.n.\nCereti, C. G. 1995. The Zandi Wahman Yasn. A Zoroastrian Apocalypse. Rome: Istituto italiano per il Medio\ned Estremo Oriente.\nCereti, C. G. and Sanjana, M. Sh. 1991. An 18th Century Account of Parsi History. The Qesse-ye Zartoštian-e\nHendustan. Naples: Istituto universitario orientale, Dipartimento di Studi asiatici.\nChacha, H. F. 1936. Gajastak Abalish. Pahlavi Text with Transliteration, English Translation, Notes and Glossary.\nBombay: The Trustees Parsi Punchayet Funds and Properties.\nChristensen, A. 1931. The Pahlavi Codices K20 & K20b. Containing Ardagh Viraz-Nämagh, Bundahishn, etc.\nFacsimile (Codices Avestici et Pahlavici Bibliothecae Universitatis Hafniensis 1). Copenhagen: University\nLibrary.\nChristensen, A., ed. 1936. The Pahlavi Codex K 43. First part. Containing a Fragment of the Great Bundahishn,\nthe Dadhastanī Menōghekhradh, some Parts of the Denkard, and the Vahman Yasht (Codices Avestici et Pahlavici\nBibliothecae Universitatis Hafniensis 5). Copenhagen: Levin-Munksgaard.\nChristensen, A., ed. 1937-1939. The Avesta Codex K5. Containing the Yasna with Its Pahlavi Translation and\nCommentary. 3 Parts. With an Introduction by K. Barr. Facsimile (Codices Avestici et Pahlavici Bibliothecae\nUniversitatis Hafniensis 7-9). Copenhagen: University Library.\nChristensen, A. 1941-1942. The Avesta codices K 3a, K 3b and K 1, containing portions of the Venidad with\nits Pahlavi translation and commentary. 2, Containing the facsimile of K 1 (Vendidad chapters 9.1-22.26 and\nthe colophon) (Codices Avestici et Pahlavici Bibliothecae Universitatis Hafniensis 11). Copenhagen: University\nLibrary.\nDamesteter, J., tr. 1892-1893. Le Zend-Avesta. Traduction nouvelle avec commentaire historique et philologique.\n3 vols. Paris: Musée Guimet.\nde Menasce, J. 1945. Une apologétique mazdéenne du 9. siecle. Škand-Gumānīk vičar. La solution décisive des\ndoutes. Texte Pazend-pehlevi transcrit, traduit et commenté. Fribourg: Libraire de l'Université Fribourg en\nSuisse.\nDhabhar, E. B. N. 1932. The Persian Rivayats of Hormazyar Framarz and Others. Their version with Introduction\nand Notes. Bombay: K. R. Cama Oriental Institute.\nDiogenes Laertius. tr. Arretini, F. 1487. Francisci Arretini ad Pium Pont. Maximum in Diogenes Epistolas Proe-\nmium. Florence: Antonius Francisci Venetus.\nDresden, M. J. 1966. Denkart. A Pahlavi Text. Facsimile Edition of the Manuscript B of the K. R. Cama Oriental\nInstitute Bombay. Wiesbaden: Harrassowitz.\nEastwick, E. B. 1843. \"Zarthusht-Namah [The Book of Zarthusht],\" in Wilson, J., ed. The Parsi Religion.\nBombay: American Mission Press, 477-522.\nEduljee, H. E. 1991. Kisseh-i Sanjan [The Story of Sanjan]. Bombay: K. R. Cama Oriental Institute.\nGeldner, K. Fr. 1886-1896. Avesta. The Sacred Books of the Parsis. Part I: Yasna (1886); Part II: Vispered and\nKhorda Avesta (1889); Part III: Vendidad (1896). Stuttgart: Kohlhammer.\nHippocrates. 1931. \"On the Nature of Man,\" in Jones W. H. S., tr. Hippocrates (Loeb Classical Library, No.\n150). Cambridge, MA: Harvard University Press, 4: 1-41.\nJamasp, D. H. 1907. Vendidad. Avesta Text with Pahlavi Translation and Commentary, and Glossarial Index.\nWith the Assistance of M. M. Gandevia. Vol. 1: The Texts. Bombay: Government Central Book\nDepot.\nJamaspasa, K. J. 1902. Arda Viraf Nameh. The Original Pahlavi Text with an Introduction, Notes, Gujarati Trans-\nlation, and Persian Version of Zartosht Behram in Verse. Bombay: Education Society's Steam Press.\n216",
      "bbox": {
        "l": 360.0,
        "b": 980.0,
        "r": 393.0,
        "t": 993.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 922.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 878.0,
        "r": 651.0,
        "t": 919.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 862.0,
        "r": 635.0,
        "t": 875.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 832.0,
        "r": 651.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 787.0,
        "r": 651.0,
        "t": 830.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 741.0,
        "r": 652.0,
        "t": 785.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 727.0,
        "r": 557.0,
        "t": 740.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 697.0,
        "r": 651.0,
        "t": 725.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 667.0,
        "r": 652.0,
        "t": 694.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 637.0,
        "r": 651.0,
        "t": 664.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 593.0,
        "r": 652.0,
        "t": 635.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 547.0,
        "r": 652.0,
        "t": 590.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 502.0,
        "r": 652.0,
        "t": 545.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 442.0,
        "r": 652.0,
        "t": 500.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 412.0,
        "r": 651.0,
        "t": 440.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 368.0,
        "r": 652.0,
        "t": 410.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 337.0,
        "r": 652.0,
        "t": 365.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 307.0,
        "r": 652.0,
        "t": 334.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 277.0,
        "r": 651.0,
        "t": 305.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 247.0,
        "r": 652.0,
        "t": 275.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 232.0,
        "r": 623.0,
        "t": 245.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 202.0,
        "r": 652.0,
        "t": 229.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 172.0,
        "r": 651.0,
        "t": 199.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 99.0,
        "b": 127.0,
        "r": 651.0,
        "t": 170.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 99.0,
        "b": 97.0,
        "r": 651.0,
        "t": 124.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 367.0,
        "b": 52.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "10": [
    {
      "label": "section_header",
      "text": "Practices of Zoroastrian scholars\nJâmâsp-Âsânâ, H. J. and West, E. W. 1887. Shikand-Gumáník Vijár. The Pazand-Sanskrit Text Together with a\nFragment of the Pahlavi. Bombay: Government Central Book Depot.\nJamasp-Asana, J. M. 1897. The Pahlavi Texts. With an Introduction by B. G. Anklesaria and a Preface by\nM. Nawabi. Bombay: Fort Printing Press.\nKotwal, F. M. and Hintze, A. 2008. The Khorda Avesta and Yast Codex E1. Facsimile edition. Wiesbaden:\nHarrassowitz.\nMacuch, M. 1993. Rechtskasuistik und Gerichtspraxis zu Beginn des siebenten Jahrhunderts in Iran. Die Rechts-\nsammlung des Farrohmard i Wahrämän. Wiesbaden: Harrassowitz.\nde Menasce, J. 1973. Le troisième livre du Denkart. Traduit du pehlevi. Paris: Librairie C. Klincksieck.\nMills, L. H. 1893. The Ancient Manuscript of the Yasna with its Pahlavi Translation (A.D. 1323), Generally\nQuoted as J2 (Bodleian Library/Oxford). Oxford: Clarendon Press.\nModi, J. J. 1934. Qisseh-i Zartúshtian-i Hindustan va Bayan-i Atash Behrâm-i Naosari [The Story of the Zoro-\nastrians of India and of the Behram Fire in Navsari]. Bombay: Fort Printing Press.\nPausanias. tr. Jones, W. H. S and Ormerod, H. A. 1918. Pausanias' Description of Greece. 4 vols. Cambridge,\nMA: Harvard University Press.\nPaymaster, R. B. 1915. Kisse-i Sanjân [The Story of Sanjan]. Bombay: Frot Printing Press.\nRosenberg, E. 1959. The Book of Zoroaster Zarātusht Näma by Zartusht Bahram Son of Pajdú. Tehran: Com-\nmissionnaires de l'Académie Impériale des Sciences.\nSanjana, P. 1874-1928. The Dinkard. The Original Pahlavi Text; the Same Transliterated in Zend Characters;\nTranslations of the Text in the Gujarati and English Languages; a Commentary and a Glossary of Select Terms.\nVols. I-XIX. Bombay: Kegan Paul, Trench, Trübner & Co.\nSanjana, P. 1896. The Karnámé i Artakhshir í Pápakán, being the Oldest Surviving Records of the Zoroastrian\nEmperor Ardashir Bábakán, the Founder of the Sâsânian Dynasty in Iran. The Original Pahlavi Text edited for\nthe first time with a Transliteration in Roman Characters, Translations into the English and Gujerati Languages,\nwith Explanatory and Philological Notes, an Introduction, and Appendix. Bombay: Duftur Ashkara and the\nEducation Society's Steam Press.\nShaked, Sh. 1979. The Wisdom of the Sasanian Sages. (Denkard VI) by Aturpat-i Emetan. Boulder: Westview\nPress.\nTavadia, J. C. 1930. Šayast-ne-šayast. A Pahlavi Text on Religious Customs, Edited, Transliterated and Translated\nwith Introduction and Notes. Hamburg: de Gruyter & Co.\nUnvala, E. M. R. 1922. Dáráb Hormazyar's Rivayat [Darab Hormazyar's Text Collection]. With an intro-\nduction by J. J. Modi. 2 vols. Bombay: British India Press.\nUnvala, J. M. 1940. Collection of Colophons of Manuscripts Bearing on Zoroastrianism in some Libraries of Europe.\nBombay: The Trustees of the Funds and Properties of the Parsi Punchayet.\nWest, E. W. 1871. The Book of the Mainyō-i-Khard or the Spirit of Wisdom. The Pazand and Sanskrit Texts as\nArranged in the Fifteenth Century by Neriosengh Dhaval. Edited in Roman Characters from Various Manuscripts,\nwith an English Translation, an Introduction, Notes, a Glossary of the Pazand Text, with Sanskrit, Persian and\nPahlavi Equivalents, and a Sketch of Pazand Grammar. Stuttgart and London: C. Grüninger.\nWest, E. W. 1880. \"The Pahlavi Inscriptions at Kanheri,\" India Antiquary 9: 265-8.\nWest, E. W. 1882a. \"An Engraved Stone with Pahlavi Inscription from Baghdad,\" India Antiquary 11: 223-6.\nWest, E. W. 1882b. Pahlavi Texts. Part 2: The Dädistan-i Dinik and the Epistles of Mänüśkihar (Sacred Books\nof the East 18). Oxford: Oxford University Press.\nWest, E. W. 1885. Pahlavi Texts. Part 3: Dina-i Mainög-i Khirad, Sikand-Gümanik Vigar, Sad Dar. (Sacred\nBooks of the East 24). Oxford: Oxford University Press.\nWestergaard, N. L. 1852-1854. Zendavesta or the Religious Books of the Zoroastrians. Vol. 1: The Zend Texts.\nCopenhagen: Berling Brothers.\nResearch literature\nĀmūzgār, Ž. 1989. \"Bahram Paždū,\" in elr, 3: 524-5.\nBailey, H. W. 1943. Zoroastrian Problems in the Ninth-Century Books. Oxford: Clarendon Press.\nBartholomae, C. 1915. Die Zendhandschriften der K. Hof- und Staatsbibliothek in München. Munich:\nAkademie-Verlag.\nBartholomae, C. 1920. Zur Kenntnis der mitteliranischen Mundarten III. Heidelberg: Akademie-Verlag.\nBoyce, M. 1968. \"Middle Persian Literature,\" in Handbuch der Orientalistik 4.2.1. Leiden: Brill, 31-66.\nBoyce, M. 1975. A History of Zoroastrianism. Vol. 1: The Early Period. Leiden: Brill.\n217",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 87.0,
        "b": 922.0,
        "r": 638.0,
        "t": 951.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 87.0,
        "b": 892.0,
        "r": 638.0,
        "t": 920.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 864.0,
        "r": 637.0,
        "t": 890.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 832.0,
        "r": 637.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 817.0,
        "r": 599.0,
        "t": 830.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 787.0,
        "r": 638.0,
        "t": 815.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 757.0,
        "r": 638.0,
        "t": 785.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 727.0,
        "r": 638.0,
        "t": 755.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 711.0,
        "r": 556.0,
        "t": 725.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 682.0,
        "r": 638.0,
        "t": 710.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 637.0,
        "r": 638.0,
        "t": 680.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 562.0,
        "r": 638.0,
        "t": 635.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 534.0,
        "r": 638.0,
        "t": 560.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 502.0,
        "r": 638.0,
        "t": 530.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 472.0,
        "r": 638.0,
        "t": 500.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 442.0,
        "r": 638.0,
        "t": 469.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 381.0,
        "r": 638.0,
        "t": 440.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 367.0,
        "r": 518.0,
        "t": 380.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 352.0,
        "r": 638.0,
        "t": 365.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 322.0,
        "r": 638.0,
        "t": 351.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 292.0,
        "r": 638.0,
        "t": 320.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 262.0,
        "r": 637.0,
        "t": 290.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 298.0,
        "b": 213.0,
        "r": 428.0,
        "t": 227.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 187.0,
        "r": 367.0,
        "t": 202.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 172.0,
        "r": 574.0,
        "t": 185.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 172.0,
        "r": 574.0,
        "t": 185.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 143.0,
        "r": 637.0,
        "t": 170.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 143.0,
        "r": 637.0,
        "t": 170.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 127.0,
        "r": 608.0,
        "t": 140.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 112.0,
        "r": 616.0,
        "t": 126.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 97.0,
        "r": 517.0,
        "t": 110.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 354.0,
        "b": 53.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 360.0,
        "b": 979.0,
        "r": 393.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "König\nBoyce, M. 1979. Zoroastrians. Their Religious Beliefs and Practices. London: Routledge and Kegan Paul.\nBoyce, M. 1982. A History of Zoroastrianism. Vol. 2: Under the Achaemenians. Leiden: Brill.\nBoyce, M. and Grenet, F. 1991. A History of Zoroastrianism. Vol. 3: Zoroastrianism under Macedonian and\nRoman Rule. Leiden: Brill.\nBrowne, E. G. 1902. A Literary History of Persia. Vol. 1: From the Earliest Times Until Firdousí. Cambridge:\nT. F. Unwin.\nCantera, A. 2004. Studien zur Pahlavi-Übersetzung des Avesta. Wiesbaden: Harrassowitz.\nCantera, A. and de Vaan, M. 2005. \"Remarks on the Colophon of the Avestan Manuscripts Pt4 and Mf4,\"\nStudia Iranica 34: 31-42.\nCereti, C. G. 2001. La Letteratura Pahlavi. Introduzione ai testi con riferimento alla storia degli studi e alla tradizione\nmanoscritta. Milano: Mimesis.\nCereti, C. G. 2004. \"Sul codice M51 di Monaco [On the Codex M51 of Monaco],\" in Cereti, C. G. et al.,\neds. Varia Iranica. Rome: Istituto Italiano per l'Africa e l'Oriente, 119-30.\nCereti, C. G. 2007. \"Some Primary Sources on the Early History of the Parsis in India,\" in Vahman, F.\nand Pedersen, C. V., eds. Religious Texts in Iranian Languages. Symposium Held in Copenhagen May 2002.\nCopenhagen: The Royal Danish Academy of Sciences and Letters, 211-21.\nCereti, C. G. 2014. \"Škand Gumānīg Wizar,\" in elr, online edition. www.iranicaonline.org/articles/\nshkand-gumanig-wizar (Accessed 01 Aug 2019).\nColpe, C. 2003. \"Wissen und Erkennen in den Gathas,\" in Colpe, C., ed. Iranier - Aramãer - Hebräer -\nHellenen. Iranische Religionen und ihre Westbeziehungen. Einzelstudien und Versuch einer Zusammenschau.\nTübingen: Mohr Siebeck, 272-80.\nde Menasce, J. 1975. \"Zoroastrian Literature after the Muslim Conquest,\" in Frye, R. N., ed. The Cambridge\nHistory of Iran. Vol. 4: The Period from the Arab Invasion to the Saljuks. Cambridge: Cambridge University\nPress, 543-65.\nde Menasce, J. 1983. \"Zoroastrian Pahlavi Writings.\" In Yarshatar, E., ed. The Cambridge History of Iran.\nVol. 3.2: The Seleucid, Parthian and Sasanid Periods. Cambridge: Cambridge University Press, 1166-95.\nDresden, M. J. 1967. \"Pahlavi Manuscripts,\" in Sir J. J. Zarthoshti Madressa Centenary Volume. Bombay: The\nTrustees of the Parsi Punchayet Funds and Properties, 74-83.\nGeldner, K. F. 1896-1904. \"Awestaliteratur,\" in Geiger, W. and Kuhn, E., eds. Grundriss der Iranischen Phi-\nlologie, 2.1. Strassburg: K. J. Trübner, 1-53.\nGignoux, P. 1995. \"La controverse dans le mazdéisme tardif,\" in Le Boulluec, A., ed. La controverse religioeuse\net ses forms. Paris: Cerf, 127-49.\nHämeen-Anttila, J. 2018. Khwadaynamag. The Middle Persian Book of Kings. Leiden: Brill.\nHodivala, S. K. 1920. Studies in Parsi History. Bombay: S. K. Hodivala.\nHumbach, H. 2003. \"Neriosangh and His Sanskrit Translations of Avesta Texts,\" in Cereti, C. G. and Vajif-\ndar, F., eds. Ataš-e dorun. The Fire Within. Jamshid Soroush Soroushian Memorial Volume 2. Bloomington,\nIN: Authorhouse, 199-212.\nJackson, A. V. W. 1906. Persia, Past and Present. London: MacMillan Company.\nJosephson, J. 2012. \"The Evolution and Transmission of the Third Book of the Denkard,\" in Cantera, A.,\ned. The Transmission of the Avesta. Wiesbaden: Harrassowitz, 541-52.\nKatrak, J. C. 1941. Oriental Treasures Being a Condensed Tabular Descriptive Statement of Over a Thousand\nManuscripts and of Their Colophons Written in Iranian and Indian Languages and Lying in Private Libraries of\nParsis in Different Centres of Gujarat. Bombay: J. C. Katrak.\nKlíma, O. 1968. \"Avesta. Ancient Persian Inscriptions. Middle Persian Literature,\" in Rypka, J., ed. History\nof Iranian Literature. Dordrecht: Reidel, 1-67.\nKönig, G. 2010a. \"Der Pahlavi-Text Zandī Fragard i Juddevdad,\" in Macuch, M., Weber, D. and Dur-\nkin-Meisterernst, D., eds. Ancient and Middle Iranian Studies. Proceedings of the 6th European Conference of\nIranian Studies, Held in Vienna, 18-22 September 2007. Wiesbaden: Harrassowitz, 115-32.\nKönig, G. 2010b. \"Didaktisches Erzählen in der neupersischen zoroastrischen Literatur,\" in Günthart, R.\nand Forster, R., eds. Didaktisches Erzählen. Formen Literarischer Belehrung in Orient und Okzident (Interd-\nisziplinäre Tagung Berlin 9./10. Oktober 2009). Frankfurt a. M.: Peter Lang Verlag, 109-32.\nKönig, G. 2014. \"Die Pahlawi-Literatur des 9./10. Jh. und ihre frühe Kodex-Überlieferung (II),\" Estudios\nde Iran y Turan 1: 43-74.\nKönig, G. 2016. \"A Re-thinking of Mansour Shaki's Contributions to the Philosophical Writings in Pahl-\navi,\" Quarterly Journal of Language and Inscription. Dedicated to Professor Mansour Shaki 1: 4-26.\nKönig, G. 2018. \"The Pahlavi Literature of the 9th Century and Greek Philosophy,\" Iran and the Caucasus:\n8-37.\n218",
      "bbox": {
        "l": 360.0,
        "b": 979.0,
        "r": 393.0,
        "t": 993.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 937.0,
        "r": 627.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 922.0,
        "r": 566.0,
        "t": 935.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 893.0,
        "r": 651.0,
        "t": 920.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 864.0,
        "r": 652.0,
        "t": 890.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 847.0,
        "r": 551.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 817.0,
        "r": 651.0,
        "t": 845.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 787.0,
        "r": 651.0,
        "t": 815.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 757.0,
        "r": 651.0,
        "t": 785.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 712.0,
        "r": 651.0,
        "t": 755.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 682.0,
        "r": 650.0,
        "t": 710.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 637.0,
        "r": 652.0,
        "t": 680.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 593.0,
        "r": 652.0,
        "t": 635.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 562.0,
        "r": 651.0,
        "t": 590.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 532.0,
        "r": 651.0,
        "t": 560.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 502.0,
        "r": 651.0,
        "t": 530.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 472.0,
        "r": 652.0,
        "t": 500.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 457.0,
        "r": 560.0,
        "t": 470.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 441.0,
        "r": 467.0,
        "t": 454.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 398.0,
        "r": 651.0,
        "t": 440.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 100.0,
        "b": 382.0,
        "r": 510.0,
        "t": 395.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 99.0,
        "b": 352.0,
        "r": 652.0,
        "t": 380.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 307.0,
        "r": 653.0,
        "t": 350.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 277.0,
        "r": 651.0,
        "t": 305.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 232.0,
        "r": 653.0,
        "t": 275.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 187.0,
        "r": 652.0,
        "t": 230.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 157.0,
        "r": 652.0,
        "t": 185.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 127.0,
        "r": 652.0,
        "t": 155.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 98.0,
        "r": 651.0,
        "t": 125.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 367.0,
        "b": 53.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "Practices of Zoroastrian scholars\nKönig, G. 2019. \"Die Pahlavi-Literatur des 9./10. Jh. und ihre frühe Kodex-Überlieferung (I),\" in Hintze,\nA., Durkin-Meisterernst, D. and Naumann, C., eds. A Thousand Judgements. Festschrift Maria Macuch.\nWiesbaden: Harrassowitz, 263-86.\nKönig, G. 2020a. \"Training in Thinking. Religious Criticism and the Use of Logic in Zoroastrian Theol-\nogy,\" Ruani, F. and Timuş, M., eds. Quand les dualistes polémiquaient Zoroastriens et Manichéens, Actes du\ncolloque international, 12-13 juin 2015, Collège de France. Leuven: Peeters Publishers.\nKönig, G. 2020b. \"On the question of neo-Platonic elements in the Zoroastrian literature of the 9th\ncentury,\" in Weltecke, D. and Echevarría Arsuaga, A., eds. Religious Plurality and Interreligious Contacts in\nthe Middle Ages. (Workshop Religious Plurality and Interreligious Contacts in the Middle Ages.\" Ein\ngemeinsames Spanisch-Deutsches Arbeitsgespräch der Herzog-August-Bibliothek Wolfenbüttel und\nder Fundación de Salas, 30.11.-02.12. 2015) (Wolfenbütteler Forschungen 161). Wiesbaden: Harras-\nsowitz, 65-80.\nKreyenbroek, P. 2002. \"Millennialism in the Zoroastrian Tradition,\" in Amanat, A. and Bernhardsson, M.,\neds. Imaging the End: Visions of Apocalypse from the Ancient Middle East to Modern America. London: I. B.\nTauris, 33-55, 339-44.\nMacuch, M. 2009. \"Pahlavi Literature,\" in Emmerick, R. E. and Macuch, M., eds. The Literature of Pre-Islamic\nIran. Companion Volume 1 to A History of Persian Literature. London: I. B. Tauris, 116-96.\nMottahedeh, R. P. 2012. \"The Idea of Iran in the Buyid Dominions,\" in Herzig, E. and Stewart, S., eds.\nEarly Islamic Iran (Idea of Iran 5). London: I. B. Tauris, 153–60.\nNöldeke, T. 1920. Das iranische Nationalepos. Berlin: de Gruyter.\nNyberg, H. S. 1974. A Manual of Pahlavi. Part 2: Ideograms, Glossary, Abbreviations, Index, Grammatical Survey,\nCorrigenda to Part 1. Wiesbaden: Harrassowitz.\nSchaeder, H. H. 1925. \"Die islamische Lehre vom Vollkommenen Menschen, ihre Herkunft und ihre\ndichterische Gestaltung,\" ZDMG 79: 192-268.\nSchaeder, H. H. 1972. Iranische Beiträge I. Halle 1930. Reprint Hildesheim: Olms.\nSecunda, S. 2012. \"On the Age of the Zoroastrian Authorities of the Zand,\" Iranica Antiqua 47: 317-49.\nShaki, M. 1970. \"Some Basic Tenets of the Eclectic Metaphysics of the Denkart,\" Archiv Orientálni 38:\n277-312.\nShaki, M. 1973. \"A Few Philosophical and Cosmological Chapters of the Denkart,\" Archiv Orientálni 41:\n133-64.\nShaki, M. 1975. \"Two Middle Persian Philosophical Terms LYSTK' and M'TK,\" in Gignoux, P. ed. Iran\nancien: Actes du XXIXe Congrès international. Paris: L'Asiathèque, 52-7.\nShaki, M. 1981. \"The Denkard Account of the History of the Zoroastrian Scriptures,\" Archiv Orientálni\n49: 114-25.\nShaki, M. 1998. \"Elements,\" in elr, 8: 357-60.\nShaki, M. 1999. \"Falsafa I. Pre-Islamic Philosophy,\" in elr, 9: 176-82.\nShaki, M. 2003. \"Greek Influence on Persian Thought,\" in elr, 11: 321-6.\nSkjærvo, P. O. 2008. \"Review of Alberto Cantera, Studien zur Pahlavi-Übersetzung des Avesta. Wies-\nbaden: Harrassowitz, 2004 (Iranica 7),\" Kratylos 53: 1-20.\nSohn, P. 1996. Die Medizin des Zädsparam. Anatomie, Physiologie und Psychologie in den Wizīdagihä i Zäd-\nsparam, einer zoroastrisch-mittelperischen Anthologie aus dem frühislamischen Iran des neunten Jahrhunderts.\nWiesbaden: Harrassowitz.\nSpiegel, F. von 1856-1860. Einleitung in die traditionellen Schriften der Parsen. 2 Teile. Wien: Verlag W. Engel-\nmann (Leipzig).\nStausberg, M. 2002. Die Religion Zarathushtras. Geschichte - Gegenwart - Rituale. Vols. 1 and 2. Stuttgart:\nKohlhammer.\nStausberg, M. 2004. Die Religion Zarathushtras. Geschichte-Gegenwart-Rituale. Vol. 3. Stuttgart: Kohlhammer.\nSundermann, W. 1982. \"Soziale Typenbegriffe altgriechischen Ursprungs in der altiranischen Überlief-\nerung,\" in Welskopf, E. Ch., ed. Soziale Typenbegriffe im alten Griechenland VII. Berlin: Akademie-Verlag,\n14-38.\nSundermann, W. 2001. \"Das Manichäerkapitel des Škand Gumānīg Wizār in der Darstellung und Deutung\nJean de Menasces,\" in van Oort, J. et al., eds. Augustine and Manichaeism in the Latin West. Leiden: Brill,\n325-37.\nTafażżoli, A. 1373/1994. Zaban-i Pahlawi adabiyat wa dastür-i än. Tehran: Tihran Nashr-i Mu'in.\nTafażżoli, A. 1982. \"Abališ,\" in elr, 1: 58.\nTavadia, J. C. 1933. Review \"Christensen, A., The Pahlavi Codices K20 & K20b [...].\" Orientalistische\nLiteraturzeitung 8-9: coll. 567-9.\n219",
      "bbox": {
        "l": 277.0,
        "b": 979.0,
        "r": 449.0,
        "t": 994.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 908.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 862.0,
        "r": 638.0,
        "t": 905.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 774.0,
        "r": 638.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 728.0,
        "r": 638.0,
        "t": 770.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 697.0,
        "r": 639.0,
        "t": 725.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 667.0,
        "r": 637.0,
        "t": 695.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 652.0,
        "r": 421.0,
        "t": 665.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 622.0,
        "r": 637.0,
        "t": 650.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 592.0,
        "r": 638.0,
        "t": 620.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 577.0,
        "r": 515.0,
        "t": 590.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 562.0,
        "r": 628.0,
        "t": 575.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 533.0,
        "r": 638.0,
        "t": 559.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 504.0,
        "r": 638.0,
        "t": 530.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 472.0,
        "r": 638.0,
        "t": 500.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 443.0,
        "r": 638.0,
        "t": 470.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 428.0,
        "r": 331.0,
        "t": 440.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 412.0,
        "r": 450.0,
        "t": 425.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 398.0,
        "r": 474.0,
        "t": 410.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 367.0,
        "r": 638.0,
        "t": 395.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 323.0,
        "r": 638.0,
        "t": 365.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 292.0,
        "r": 638.0,
        "t": 320.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 264.0,
        "r": 637.0,
        "t": 290.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 247.0,
        "r": 638.0,
        "t": 260.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 203.0,
        "r": 638.0,
        "t": 260.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 158.0,
        "r": 638.0,
        "t": 200.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 142.0,
        "r": 584.0,
        "t": 155.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 127.0,
        "r": 302.0,
        "t": 140.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 97.0,
        "r": 638.0,
        "t": 125.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 354.0,
        "b": 53.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "13": [
    {
      "label": "section_header",
      "text": "König\nTavadia, J. C. 1944. \"Zur Pflege des iranischen Schrifttums im Mittelalter,\" ZDMG 98: 294-339.\nTavadia, J. C. 1956. Die mittelpersische Sprache und Literatur der Zarathustrier. Leipzig: Harrassowitz.\nVitalone, M. 1987. The Persian Revayats. A Bibliographic Reconnaissance. Napoli: Istituto universitario orien-\ntale, Dipartimento di studi asiatici.\nWest, E. W. 1896-1904. \"Pahlavi Literature,\" in Geiger, W. and Kuhn, E., eds. Grundriss der Iranischen\nPhilologie, II.3. Strassburg: K. J. Trübner, 75-129.\nWidengren, G. 1965. Die Religionen Irans. Stuttgart: Kohlhammer.\nWilliams, A. 2009. The Zoroastrian Myth of Migration from Iran and Settlement in the Indian Diaspora. Text,\nTranslation and Analysis of the 16th Century Qesse-ye Sanjan 'The Story of Sanjan'. Leiden: Brill.\nZaehner, R. C. 1955. Zurvan. A Zoroastrian Dilemma. Oxford: Clarendon Press.\n220",
      "bbox": {
        "l": 360.0,
        "b": 979.0,
        "r": 393.0,
        "t": 994.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 937.0,
        "r": 606.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 922.0,
        "r": 604.0,
        "t": 935.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 892.0,
        "r": 652.0,
        "t": 920.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 862.0,
        "r": 652.0,
        "t": 890.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 847.0,
        "r": 446.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 817.0,
        "r": 652.0,
        "t": 845.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 802.0,
        "r": 516.0,
        "t": 815.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 366.0,
        "b": 53.0,
        "r": 386.0,
        "t": 64.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 740,
      "h": 1046
    },
    "2": {
      "w": 740,
      "h": 1046
    },
    "3": {
      "w": 740,
      "h": 1046
    },
    "4": {
      "w": 740,
      "h": 1046
    },
    "5": {
      "w": 740,
      "h": 1046
    },
    "6": {
      "w": 740,
      "h": 1046
    },
    "7": {
      "w": 740,
      "h": 1046
    },
    "8": {
      "w": 740,
      "h": 1046
    },
    "9": {
      "w": 740,
      "h": 1046
    },
    "10": {
      "w": 740,
      "h": 1046
    },
    "11": {
      "w": 740,
      "h": 1046
    },
    "12": {
      "w": 740,
      "h": 1046
    },
    "13": {
      "w": 740,
      "h": 1046
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}