{
  "1": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 681.0,
        "r": 326.5,
        "t": 718.5
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n1\r\n TITLE: World Map of al-Wardi\r\nDATE: AH 691 (1291/1292)-AH 749 (1348/1349)\r\nAUTHOR: Ibn al-Wardi\r\nDESCRIPTION: The world map of the Islamic Atlas tradition is picked up and\r\nelaborated in copies of Ibn al-Wardi’s (d. 861/1457) Kharidat al-qajapib wa faridat al￾gharapib [The unbored pearl of wonders and the precious gem of marvels], a unique\r\npocket-book encyclopedia tradition that incorporated qajapib [wonder] lore. In addition\r\nto a world map, Ibn al-Wardi’s manuscripts also include qibla maps (way-finding\r\ndiagrams and instruments for pin-pointing the direction to Mecca for the purpose of\r\nprayer) and an inset map of Qazvin and other cities. This is a contested series of maps\r\nbecause there is no clear consensus on Ibn al-Wardi being the original author. Multiple\r\ncopies of this manuscript, ranging in date from the 15th century to the 19th century, are\r\nfound in virtually every Islamic manuscript collection no matter how small or\r\ninsignificant. Judging by the plethora of pocket-book-size copies that still abound, the\r\nKharidat al-qajapib must have been a best seller in the late medieval and early modern\r\nIslamic world.\r\n The first of these maps is contained in a genealogical scroll titled Zübdetü’t-tevarih\r\n[Cream of Histories] by Seyyid Loqman ibn Hüseyin ibn el-’Asuri el-Urmevi. The scroll\r\nwas started during the reign of Süleyman I (1520-66) and was taken over by Loqman in\r\n1569 when he officially became the court historiographer. The map is in the first part of\r\nthe roll (64.7 x 41.3 cm); the author who started the roll is not known. The work is also\r\ncalled the Silsilename [Book of Genealogy], and there are at least three manuscripts\r\nproduced between 1583 and 1588. On this particular map, unlike the other world maps\r\nattributed to al-Wardi, the northern and southern extremities of the oikumene [known\r\ninhabited world] are flatten out, the countries show boundary lines, and the Nile River is\r\nvery detailed. It is curious, judging by the date of production that the oikumene is still\r\nmedieval in construct. While obviously these maps were produced after the European\r\n“early medieval” period, they still reflect the medieval worldview of the Arab\r\ncartographers.\r\n The Kharidat al-qajapib wa faridat al-gharapib is written in Turkish with large naskhi\r\nscript in black ink on 90 leaves of delicate finished (aharlı) paper. Within are 55\r\nminiatures depicting subjects in the text, some of them one to a page and some two. On\r\npages 1b–2a two round medallions carry an inscription stating the work’s subject and\r\nsaying that it was prepared for the Treasury of Sultan Murad III (r. AH 982–1003 / AD\r\n1574–95). The work, which was written by the court panegyrist (Şehnameci) Sayyid\r\nLoqman Aşuri, consists of two main sections. The first begins with the universe and the\r\nsigns of the zodiac and continues with stories taken from the Torah, the New Testament,\r\nand the Qur’an that tell of the lives of prophets and those who rendered service to the\r\nfaith. These are illustrated with paintings. The first part ends with genealogical trees of\r\nthe Prophet Muhammad, the Four Orthodox Caliphs, and the sultans and high officials\r\nof Muslim dynasties such as the Umayyads, the ‘Abbasids, the early Islamic period, the\r\nGhaznawids, the Ilkhanids, the Seljuqs and the Timurids. The second part opens with\r\nSultan Osman, the founder of the Ottoman dynasty, and goes up to Sultan Murad III,\r\nwith 12 portraits of Ottoman sultans. It ends with descriptions of the political events of\r\nthese sultans’ reigns.\r\n This work was made for the Treasury of Sultan Murad III, and the quality of its\r\npaintings, its binding and its calligraphy make it one of the greatest works of Ottoman\r\nart created for a sultan.",
      "bbox": {
        "l": 92.0,
        "b": 709.5,
        "r": 128.0,
        "t": 718.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 133.0,
        "b": 707.0,
        "r": 238.5,
        "t": 718.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 128.5,
        "b": 694.0,
        "r": 326.0,
        "t": 705.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 696.0,
        "r": 125.5,
        "t": 704.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 682.5,
        "r": 144.0,
        "t": 691.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 149.0,
        "b": 682.0,
        "r": 206.5,
        "t": 691.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 508.0,
        "r": 523.0,
        "t": 678.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 335.5,
        "r": 523.0,
        "t": 506.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 122.0,
        "r": 523.0,
        "t": 333.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 82.5,
        "r": 522.5,
        "t": 119.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 303.5,
        "b": 37.0,
        "r": 308.5,
        "t": 47.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 731.5,
        "r": 521.5,
        "t": 740.5
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n2\r\n Abū Ḥafs Zayn al-Dīn ʻUmar ibn al-Muẓaffar Ibn al-Wardī (Arabic: عمر ابن مظفر\r\nابن ‎الوردي(, known as Ibn al-Wardi, was an Arab historian AH 691 (1291/1292)-AH 749\r\n(1348/1349). Ibn al-Wardi’s book, Kharîdat al-'Ajâ'ib wa farîdat al-gharâib (Arabic : خريدة\r\nعجائبال وفريدة الغرائب] (The Pearl of Wonders and the Uniqueness of Strange Things],\r\nwas accompanied with a colored world map and a picture of Ka’bah. This work sums\r\nthe geographical knowledge of the Arabic world of the time, referring to climate, terrain,\r\nfauna and flora, population, way of living, existing states and their governments in\r\nindividual regions of the world. The author also speaks about Slavs and their lifestyle\r\nand mentions al-Mahdiyya as the residence of the Fatimid dynasty. Therefore, the book\r\nis older than the city of Kairo (founded in 969 C. E.). Al-Wardi makes reference in his\r\nwork to the book by al-Mas’udi (#212).\r\n A contemporary copy of an illustrated cosmography, and perhaps the earliest to\r\nsurvive of the great geographer Ibn al-Wardi includes a double-page color map of the\r\nworld, an illustration of the Ka‘ba [the holiest place in Islam, a large cube-shaped\r\nbuilding inside the al-Masjid al-Haram mosque in Mecca], as well as a diagram of the\r\nstrategic game of chess, with an explanation of the chess pieces and their moves. In\r\naddition to a compendium of place names, seas and mountains, the author has also\r\nincluded a description of the flora and fauna of the places he describes. Throughout the\r\nwork, the author refers to various historians and geographers, such as al-Mas‘udi (d.\r\ncirca 956 AD, #212), Ibn al-Adhim (d. 1262), and Ibn Hawqal (died end of the tenth\r\ncentury, #213). The original work is said to have been completed around the year 1419\r\nAD, as stated on the earliest known copy which is dated 1479 AD (cited in R. Sellheim,\r\nArabische Handschriften: Materialen zur Arabischen Literaturgeschichte, Wiesbaden, 1976-87,\r\nVol. I, pp. 184), where the author is given as Abu Hafs ‘Umar ibn Muhmmad ibn al￾Wardi, and a manuscript from 1487 AD, where the author is given as Siraj al-Din Abu l￾Hafs ‘Umar Ibn Muzaffar Ibn Muhammad ibn ‘Umar Ibn Abi l-Fawaris Ibn al-Wardi,\r\nwho was active in Aleppo, and died circa 1457 AD. The paper of the present manuscript\r\ncan be clearly located to Spain no later than the middle of the 15th century.\r\n The work has also been attributed to an earlier author, Zayn al-Din Abu Hafs\r\n‘Umar Ibn al-Muzaffar Ibn al-Wardi, who died in 1348 AD, but according to the 1479\r\nand 1487 copies of the Kharidat, this author would pre-date the original work. The type\r\nof paper used here, which is a style associated with 14th and 15th century Spain, and the\r\nstyle of calligraphy which points to a 14th century hand, suggest this copy was produced\r\nduring the 14th or 15th century, and may thus indicate the earlier authorship.\r\n Though the identity of the author is still uncertain, at the very least the physical\r\nevidence of our copy would indicate either that it is a very early edition of the later Ibn\r\nal-Wardi, perhaps copied within a few years of the original, or that it is an edition of the\r\nearlier author, completed within less than a century of his death.\r\n Islamic sacred geography differs from the Ptolemaic tradition in that it does not\r\nemploy cartographic grids, or longitude and latitude scales; as a rule, these used Mecca\r\nand the Ka‘ba as the center of the world. The tradition is generally associated with 10th\r\ncentury scholars such as al-Balkhi, al-Istakhri, al-Muqaddasi, Ibn Hawqal, and the ninth\r\ncentury geographer Ibn Khurdadhbeh (d. 912 AD) who devised the earliest known\r\ngeographical work using the Ka‘ba as the center of the world in his Kitab al-Masalik wa’l￾Mamalik. These geographical works neglected to include coordinates or to employ\r\nmathematical geography in the maps, and bear great similarity to the simpler-produced\r\nmaps of medieval Europe.",
      "bbox": {
        "l": 89.0,
        "b": 574.0,
        "r": 523.0,
        "t": 718.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 348.5,
        "r": 523.0,
        "t": 572.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 268.5,
        "r": 522.5,
        "t": 346.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 216.0,
        "r": 522.5,
        "t": 266.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 96.0,
        "r": 522.5,
        "t": 213.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 302.5,
        "b": 37.5,
        "r": 309.0,
        "t": 47.5
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 731.0,
        "r": 521.5,
        "t": 740.5
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n3\r\n Between the 12th and 16th centuries, the study of Islamic geography often\r\nextended to include cosmology, cosmogony, astrology and similar subjects, rather than\r\nthe production of purely geographical works that were characteristic of earlier periods.\r\nThese cosmological works seem to have been produced for the average lay reader as\r\norganized compendia of world knowledge, rather than critical scientific works, and\r\nrelied heavily on earlier sources. The text and map in the manuscript suggest a medieval\r\nprecursor; old place names and archaic descriptions occur frequently. The map towards\r\nthe beginning, seen on ff. 3v-4r, shows a circular world divided into Europe, Africa and\r\nAsia. Its sense of proportion is highly schematic, and the location of certain places is\r\nrather unusual, but al-Andalus [Spain], Qustantaniyyah [Constantinople] and the River\r\nNile are all approximately where one might expect. The world is shown surrounded by\r\nwater, with an outer boundary of mountains, seen here as the polychrome outer border.\r\nIn addition to the extensive chapter on geography, the Kharidat al-`Aja’ib contains a\r\nchapter on the types of birds and other animals that exist in the places that the author\r\nhas described. The inclusion of a small section explaining the game of chess, including a\r\ndetailed drawing, has not been recorded in other copies of Ibn al-Wardi’s cosmography.\r\nThe large circular diagram with the Ka`ba at its center, shown on f. 64r, shows the\r\ndirection of prayer to qiblah [Mecca] from different countries, seen here in 35 sectors. The\r\nsectors are associated with the north, south, east and west walls of the Ka`ba. The region\r\nbetween North Africa and Syria is associated with the northwest wall of the Ka`ba, with\r\na qiblah from east to south. The region between Iraq and Afghanistan is connected with\r\nthe northeast wall of the Ka`ba and has a qiblah from south to west. India, Tibet and\r\nChina are associated with the Black Stone in the eastern corner of the Ka`ba, with a qiblah\r\npointing slightly northwest. A fourth region, the Yemen, the Hadramawt, Aden and\r\nSocotra are linked with the southern corner of the Ka`ba, with a qiblah pointing north.\r\n A later ownership inscription on the inside of the back doublure is dated 1090/\r\n1679. Several inscriptions on the inside of the front doublure exist in a later maghribi\r\nhand; one of these refers to one unidentified individual by the name of Ibn al-Ma’mun.\r\nThe final page bears a partial reference to the owner or scribe of the manuscript, whose\r\nname appears to be al-Qawariqi.\r\n In addition to the two dated copies mentioned earlier, further copies of the\r\nKharidat al-`Aja’ib include one in the Vatican Library dating to the 18th century, one of a\r\nsimilar date (1778 AD) in the National Library of the Czech Republic, as well as one in\r\nthe Library of Congress, which is undated. There are also several examples in the\r\nChester Beatty Library, dating from the 16th to the 18th centuries; and several examples\r\nare cited in C. Brockelmann, Geschichte der Arabischen Literatur, Vol. II, Leiden, 1938, pp.\r\n162-163.\r\n The following excerpts are taken out of a work older then 968 when Cairo\r\nbecame the capital. Others are his stories taken from Mas’udi (without mentioning his\r\nname) in which the Zenj warriors ride on cattle. His first chapter is almost entirely based\r\non Yaqut’s geography. As a result, those trying to date his work start from c. 900 to\r\n1456. The later mentions 1789 or 1778... are the dates of the manuscripts found. One\r\nmore date that is mentioned often 1349 in which Ibn al-Wardi died of plague. This,\r\nhowever, was another Ibn al-Wardi, but the complete name is in both cases the same. In\r\nrecent works from about 2000 on the Ibn al-Wardi concerned is often called pseudo Ibn al\r\nWardi.\r\nBarbara; this land is situated on the sea shore; opposite Yemen, neighboring Nubie, it\r\nis densely populated, one can see there a mountain called Canouni, with seven\r\npeaks, stretching for 40 miles into the sea, on one of its peaks, there is a small town",
      "bbox": {
        "l": 89.5,
        "b": 389.0,
        "r": 523.0,
        "t": 718.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 322.0,
        "r": 522.5,
        "t": 386.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 232.0,
        "r": 522.5,
        "t": 320.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 112.5,
        "r": 522.5,
        "t": 228.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 116.5,
        "b": 74.0,
        "r": 495.5,
        "t": 108.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 302.5,
        "b": 37.0,
        "r": 309.0,
        "t": 47.0
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 743.0,
        "r": 360.0,
        "t": 753.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 491.0,
        "b": 730.0,
        "r": 525.0,
        "t": 740.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n4\r\ncalled Haouina. The people of Barbara eat frogs, and go to the sea to fish.\r\n The land of the Zinji lies opposite to that of Sind; between the two intervenes the\r\nbreadth of the Sea of Persia. The inhabitants are the blackest of the negro race. They\r\nworship idols, are brave, hardy and fight in battle riding oxen, as their country\r\nsupplies neither horses, mules, nor camels. Massoudi says; I’ve seen their oxen kneel\r\nlike camels, to be laden, and they travel fast with their burdens, Their inhabitations\r\nextend from the extremity of the gulph (Gardafui) to the low land of gold (Sofala ‘t il\r\nDhab.) This country is extensive, and abounds in gold, grain, and the treasures of\r\nnature, and their towns are populous. Each town lying adjacent to a branch of a river.\r\nSnow is not know among them, nor rain, which is commonly the case with the\r\ngreater part of the country of the blacks. They have no ships, but traders come in\r\nvessels from Uman, to buy their children, whom they sell in different countries.\r\n The Zinji are extremely numerous, through deficient in the means of carrying on\r\nwar. It is said that their king goes forth to battle with three thousand followers,\r\nridding on oxen. The Nile is divided above their country, at the mountain of\r\nMuksim. Most of the natives sharpen their teeth, and polish them to a point. They\r\ntraffic in elephants’ teeth, panthers skins and silk. They have islands in the sea, from\r\nwhich they collect cowries to adorn their persons, and they use them in traffic one\r\nwith another, at an established rate. Adjoining to these lies the land of the Dum-a￾dum. It is situated on the Nile, bordering on the Zinji. The inhabitants are infidels,\r\nand the tartars among the blacks, consisting of savage tribes of freebooters, who\r\ncontinually take captive and plunder every thing that falls in their way. In their\r\ncountry the river divides; one branch going towards Egypt, and the other to the\r\ncountry of the Zinji. Sofala ‘t il Dhab adjoins the eastern border of the Zinji. It is an\r\nextensive district, and mines of iron are found in it, which the people of the country\r\nwork and sell to the traders from India, who give a high price for it, on account of it\r\nbeing harder and of better temper than that which they obtain in their own country,\r\nand they purify it and make it into steel, which admits to a durable edge. The natives\r\nthemselves also make swords of it, and other offensive weapons. The most\r\nremarkable produce of this country is its quantity of native gold that is found, in\r\npieces of two or three Meskalla weight; in spite of which, the natives generally adorn\r\ntheir persons with ornaments of brass. They are neighbors to the country of\r\nOuacouac (Wak-Wak).\r\n Yemen; this land is situated opposite the ones of Barbara and the Zindges, from\r\nwhich it is separated by the sea.. .. ..\r\n Aden, nice town, where the ships of India and China come, one finds there all\r\nthe products of the eastern countries, brought there from different places, silk, arms,\r\nkaimoukt (kind of leader) , musk, aoud (aloes wood), several aromatics, ivory, ebony,\r\nclothes of grass, estimated higher is value then those of silk, lead, pearls, precious\r\nstones, the zoubad (civet) and amber. In the north there is a mountain who goes from\r\none sea to the other, leaving two wholes through which the boats can pass, this town\r\n(Aden) is 4 days away from the Zendges.\r\n Hind, this big country extending north to south, is partly situated opposite the\r\nAfrican coast, there where the Zindges live; it is the country of Mehradge, the title of\r\nthe king.. ..\r\n Concerning the lands in the southern hemisphere; they start with the lands of the\r\nSudan or the Blacks, which extends up to the extremity of the Mogreb or Africa,\r\ntowards the big sea, there are many deserts there where there is nobody.\r\n Nubia, stretches from Egypt up to these deserts.\r\n Badgia, this is a small country between Habascha, Nubia, and the deserts.\r\n Habascha; is along the sea of Kolzoum; stretching till the land of the Zindges and\r\nthe deserts.\r\n The Zindges; their country is the biggest of the countries the Blacks live in, at one",
      "bbox": {
        "l": 116.5,
        "b": 708.0,
        "r": 440.5,
        "t": 718.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 116.5,
        "b": 576.0,
        "r": 498.0,
        "t": 705.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 116.5,
        "b": 323.0,
        "r": 497.0,
        "t": 574.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 298.5,
        "r": 497.0,
        "t": 320.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 214.0,
        "r": 497.0,
        "t": 296.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 177.0,
        "r": 496.5,
        "t": 212.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 116.5,
        "b": 142.0,
        "r": 496.5,
        "t": 176.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 134.5,
        "b": 129.5,
        "r": 347.5,
        "t": 139.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 135.0,
        "b": 118.0,
        "r": 461.0,
        "t": 128.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 94.5,
        "r": 497.0,
        "t": 115.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 135.0,
        "b": 82.0,
        "r": 496.5,
        "t": 91.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 303.0,
        "b": 36.0,
        "r": 310.0,
        "t": 46.5
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 743.0,
        "r": 360.5,
        "t": 753.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 730.0,
        "r": 525.0,
        "t": 740.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n5\r\nside it touches Abyssinie.\r\n The island of Camar or the island of the Moon, very long and very large, one says\r\n4 months walking east to west; there is a town called Han, where the king resides.\r\nThat island produces nardgil or coconuts, sugarcane, one makes there clothes of\r\ngrass, as beautiful as from silk, one builds boats of 60 elbows long, that carry 200\r\nmen.\r\n The islands in the sea of Zinges, or of Zanguebar.\r\n There you do not see anymore the pole star, or the big bear, and the waves are big\r\nas mountains.\r\n1. The island Mohtaraka.\r\n2. The island of Dhoudha\r\n3. The island of Mamoura, this is an archipelago.\r\n4. The island of Sakfar.",
      "bbox": {
        "l": 117.0,
        "b": 708.5,
        "r": 230.5,
        "t": 717.5
      }
    },
    {
      "label": "text",
      "text": "He calls the area south of the sources of the Nile: Rub'a al-Kharab, one of the richest\r\nregions in the world.\r\n He describes Zanzibar as peopled by idolaters who boasted no code of writing\r\n(meaning no revealed religion) but were accustomed to being harangued (meaning\r\nthey get speeches) by leaders of society in the marked places.\r\n He declares that all Zendjs are pagan, bad and cruel. He makes them the darkest\r\nof the Negroes.\r\n One finds at Sofala a big amount of gold, in very pure nuggets and each nugget\r\n(tibra) can be 2 to 3 mithcals.\r\n There are cannibals on the isle of Saksar in the sea of the Zanj. (Saksar comes\r\nfrom Persian Sag-Sar: dogheads). He places a mythical serpent in the sea of the Zanj.\r\nThe Wakwak of the land of the Zendjs is big fertile and prospers. They do not know\r\nthe cold or the rain .",
      "bbox": {
        "l": 117.0,
        "b": 648.5,
        "r": 498.0,
        "t": 706.0
      }
    },
    {
      "label": "text",
      "text": "Scattered throughout collections of medieval and early modern Arabic, Persian,\r\nand Turkish manuscripts are thousands of cartographic images of the world and various\r\nregions. The sheer number of these extant maps tells us that from the 13th century\r\nonward, when copies of these map manuscripts began to proliferate, the world was a\r\nmuch-depicted place. It loomed large in the medieval Muslim imagination. It was\r\npondered, discussed, and copied with minor and major variations again and again, and\r\nall with what seems to be a peculiar idiosyncrasy to modern eyes. The cartographers did\r\nnot strive for mimesis [imitation of the real world]. They did not show irregular\r\ncoastlines even though some of the geographers whose work includes these maps\r\nopenly acknowledge that the landmasses and their coastlines are uneven. They present\r\ninstead a deliberately schematic layout of the world and the regions under Islamic\r\ncontrol.\r\n These images employ a language of stylized forms that make them hard to\r\nrecognize as maps. Scholars of Islamic science and geography often ignore and belittle\r\nthese maps on the grounds that they are not mimetically accurate representations of the\r\nworld. What these scholars miss, according to the historian Karen Pinto, is that these\r\nschematic, geometric, and often symmetrical images of the world are iconographic\r\nrepresentations, carte-ideographs of how medieval Muslim cartographic artists and their\r\npatrons perceived their world and chose to represent and disseminate this perception.\r\n Each map consists of a set of geometric configurations. Though some are more\r\ngeometric than others, most lines are straight or arced, rivers are wide parallel lines, and\r\nlakes are often perfect circles. Towns are sometimes squares, circles, or four-pointed\r\nstars or, if they are stopping places on a straight route, resemble small tents or perhaps",
      "bbox": {
        "l": 126.0,
        "b": 636.0,
        "r": 345.0,
        "t": 646.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 612.0,
        "r": 498.0,
        "t": 633.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 599.5,
        "r": 256.0,
        "t": 609.5
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 599.5,
        "r": 256.0,
        "t": 609.5
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 588.0,
        "r": 258.0,
        "t": 597.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 588.0,
        "r": 258.0,
        "t": 597.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 575.5,
        "r": 360.0,
        "t": 585.5
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 575.5,
        "r": 360.0,
        "t": 585.5
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 564.0,
        "r": 246.5,
        "t": 573.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 144.0,
        "b": 564.0,
        "r": 246.5,
        "t": 573.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 116.5,
        "b": 527.5,
        "r": 498.0,
        "t": 549.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 491.0,
        "r": 497.5,
        "t": 525.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 467.0,
        "r": 498.0,
        "t": 489.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 444.0,
        "r": 497.5,
        "t": 465.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 419.0,
        "r": 497.5,
        "t": 441.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 394.5,
        "r": 498.0,
        "t": 416.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 222.5,
        "r": 525.0,
        "t": 379.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 129.5,
        "r": 523.5,
        "t": 219.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 76.5,
        "r": 523.0,
        "t": 127.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 303.0,
        "b": 36.0,
        "r": 309.5,
        "t": 46.0
      }
    }
  ],
  "6": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.5,
        "t": 753.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 491.0,
        "b": 730.0,
        "r": 524.0,
        "t": 740.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n6\r\ndoors to caravansaries. Thus much of the drafting is ruled with either a straight or a\r\ncurved edge. The only exceptions are mountains, which are drawn as a collection of\r\npeaks or perhaps piles of rocks, though even here the base, which probably represents\r\nthe position of the range on the map, is a straight line or a regular curve.\r\n According to Karen Pinto due to their divine nature, the seas figure in the\r\nmedieval Islamic maps as perfect and smooth shapes without irregular coastlines. Each\r\ncan be argued to have symbolic emanations of their own. The Mediterranean equals a\r\nsandal-imprint, possibly that of the Prophet Muhammad, at the close-up regional scale.\r\nAt the level of the world it morphs from the form of a footprint into a teardrop. On the\r\nopposite end is the Indian Ocean in a hook-shaped form that resembles that of an eye\r\ntooth at the regional level and a hook-ended arm at the world level. These two make up\r\nthe arms that stretch out into (or, depending on your perspective, out of) the Encircling\r\nOcean. In the middle of the Asian land mass the Caspian and Aral Seas glimmer like a\r\npair of blue or sometimes green eyes, depending on the color code for the seas that\r\nvaries from map to map. Collectively they create a refracted set of splintered arms and\r\neyes surrounded by the quixotic Encircling Ocean of good and evil that connects\r\ncosmographically to the nine spheres beyond, which end in the ultimate overarching\r\nrealm of God that encircles all.\r\n Again according to Pinto this interpretation of the seas in the KMMS maps\r\nrepresents a stylized vision of the world that, on the basis of the longevity of the KMMS\r\nmapping tradition, held sway for at least eight centuries. From the depiction of the seas\r\nin KMMS world maps we can assert that they can be read as an amorphous fluid mass of\r\nthe divine amidst traces of the diabolic. This analysis of the seas in the Islamic\r\ncartographic imagination reaffirms that cosmogony establishes a timeless space that\r\ntranscends history and geography.\r\n According to Vincent Virga the Arabs originally had only one art form: poetry.\r\nAlong with this gift for using symbolism and for expressing the essence of experience -\r\nboth Eratosthenes and Ptolemy also wrote poems - the Muslims became enthralled by\r\nIndia's mathematics, its \"Arabic\" numerals with zero as a number (not as the Babylonian\r\nplaceholder), and its astrological tables. They absorbed Egyptian geometry and\r\nPythagorean theories of mathematical structure as the form of things. And while\r\ndeveloping their own singular astrology, they founded algebra. Since geography\r\ninstigated the study of celestial regions, and geometry helped measure the earth, the\r\nIslamic cartographers expressed their belief in the sacred order of nature and in the\r\nintellectual and spiritual wonder that arose from bridging the gap between the earth and\r\nthe sky, each a metaphysical truth.\r\n Everything in Islam, the youngest of the three Middle Eastern religions after\r\nJudaism and Christianity, arises from its holy book, Muhammad's Qu’ran. He placed his\r\nbook with the Jewish Old Testament and the four Christian Gospels, believing it was the\r\nthird message from God. Copying the Qu’ran made calligraphy the highest visual art\r\nform. Like Judaism, Islam decried imagery. However, by employing their poetic\r\ntraditions, calligraphic sophistication, and fascination with mathematics, Islamic\r\ncartographers invented a visual language able to interpret the complete and holy law\r\nrevealed to Muhammad. In Islam, mathematics was not bound to the world of “matter.”\r\nIt was related more to the world of life forms, and beyond them to the archetypal world.\r\nThus Muslim cartographers described the sacredness of space with qualitative\r\ngeometry. Their mapmaking, a form of writing, reflected the wisdom of the “Grand",
      "bbox": {
        "l": 89.5,
        "b": 667.5,
        "r": 523.5,
        "t": 717.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 482.0,
        "r": 523.0,
        "t": 664.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 388.5,
        "r": 523.0,
        "t": 479.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 243.0,
        "r": 523.0,
        "t": 385.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 96.5,
        "r": 523.0,
        "t": 240.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 303.0,
        "b": 36.0,
        "r": 309.0,
        "t": 46.5
      }
    }
  ],
  "7": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 743.0,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 491.0,
        "b": 730.0,
        "r": 523.0,
        "t": 740.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n7\r\nArchitect of the Universe.” Working in two languages, Arabic and geometry, they\r\nproved their adage: “Writing is spiritual geometry.”\r\n The world map attributed to Ibn al-Wardi, written in Arabic and geometry,\r\nrepresents the many exponents of the school of Balkhi (d. 934, or the KMMS tradition).\r\nFound in a 1481 Turkish manuscript of al-WardI’s Enumeration of Wonders, the map\r\ncould be five hundred years older. Oriented South, it shows the known world as a\r\nsphere surrounded by the Encircling Sea, which is enclosed by mountains. They may\r\nrepresent the Islamic creation myth's mountains intended as a rampart against the\r\nDemonic Powers, and the means to unify earth with heaven. Mecca, the focal point of all\r\nspatial references, is near the center of the Arabian Peninsula, which is embraced by the\r\nPersian Gulf and the Red Sea in the shape of a crescent moon to signify the unity of the\r\ncelestial and terrestrial worlds, a unity of conjoined sacredness. It posits a middle reality\r\nbetween sensory perception and divine perception. Like a prayer, it is an expression of a\r\nmode of being. The earth is an event lived by the soul. It is “Map as Prayer”.\r\n Little of northern Europe is shown on the lower right, but Turkish\r\nConstantinople is a red crescent \"wall\" or barrier against the “people of the cross.” The\r\nscar left on the Islamic psyche by the Byzantine Empire’s defeat of the Arabs at\r\nConstantinople in 717 seems to pulsate on the imaginal earth’s surface; for had the Arabs\r\nnot been stopped there, they probably would have gone on to conquer the weaker West\r\nand to end the dominance of Christianity. At the top of the map, Africa is extended the\r\nlength of the Indian Ocean, but unlike on Ptolemy’s map, here the continent does not\r\nenclose the ocean. The Arabs revered Ptolemy, but their own observations led them to\r\ndiscard many errors in his Geographia.\r\n Arab sailors also had close contact with China. Hugging the southern coast of\r\nAsia, these navigators knew there was a water route there, and it may have been they or\r\nthe Chinese who had sighted the landmass “down there,” which Ptolemy converted into\r\nAfrica’s extension. The Nile, drawn in red on The Enumeration of Wonders, takes a right￾angle turn, possibly reflecting the river’s great bend.\r\n When the various Arabic geographers referred to their maps, they always made\r\nthem subordinate to an accompanying detailed text with precise coordinate tables. The\r\ntext mediated between the scientific and the archetypal.\r\n Al-WardI's map gives the essence of place without any indication of distances. It\r\nshows that the things of this world belong to the realm of forms, which are but a mirror\r\nimage of their celestial origins. Believing every form possessed an inner meaning, al￾Wardi and the other Islamic cartographers re-imagined outward dimensions to express\r\nthe symbolic nature of the world.\r\n Yet even with the initial influence of Ptolemy, the individuality of Islamic\r\nmapping affirms the words of the Arabic scholar A. 1. Sabra: “Greek science was not\r\nthrust upon Muslim society any more than it was later upon Renaissance Europe. What\r\nthe Muslims of the eighth and ninth centuries did was to seek out, take hold of, and\r\nfinally make their own a legacy which appeared to them laden with a variety of practical\r\nand spiritual benefits.” From the eighth to the 12th centuries, they held the intellectual\r\nsupremacy throughout the Mediterranean world. In an enormously creative act, the\r\nIslamic people absorbed the rudiments of philosophy, medicine, and other scientific\r\nlore, including cartography, from Hellenized Persia, as well as from Syria, Egypt, and\r\nAsia Minor.",
      "bbox": {
        "l": 89.5,
        "b": 693.5,
        "r": 523.0,
        "t": 718.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 535.0,
        "r": 523.0,
        "t": 691.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 415.5,
        "r": 523.0,
        "t": 533.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 349.0,
        "r": 523.0,
        "t": 412.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 309.5,
        "r": 523.0,
        "t": 346.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 243.0,
        "r": 523.0,
        "t": 306.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 112.5,
        "r": 523.0,
        "t": 241.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 302.5,
        "b": 36.5,
        "r": 309.0,
        "t": 46.5
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 743.0,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n8\r\nLOCATIONS: Topkapi Sarayi Müzesi Kütüphanesi, A.3599, Istanbul\r\n British Library, MS. Or. 1525, fols. 8v-9r, London\r\n Library of Congress, Washington D.C.\r\nREFERENCE:\r\nBrentjes, S., “Cartography in Islamic Societies”, 36pp.\r\n*Harley, J. B., The History of Cartography, Volume Two, p. 220, Figure 11.14 and Plate 8.\r\n*Lelewel, J. Geographie de Moyen Age.\r\n*Miller, K., Mappae arabicae, Fig. 13, p.136.\r\nPinto, K., “Capturing Imagination: The Buja and Medieval Islamic Mappa Mundi”, Views from the\r\nEdge: Essays in Honor of Richard W. Bulliet, pp. 154-183.\r\n*Pinto, K., Medieval Islamic Maps, pp. 11, 56, 60, 154, 168, 197-98, 201.\r\n*Pinto, Karen, “Interpretation, Intention, and Impact, Andalusi Arab and Norman Sicilian\r\nExamples of Islamo-Christian Cartographic Translation”, Knowledge in Translation, 2018, Chap. 2.\r\n*Pinto, Karen, “In God’s Eyes: The Sacrality of the Seas in the Islamic Cartographic Vision”,\r\nEspacio Tiempo y Forma 5.\r\n*Virga, V., Cartographia, Mapping Civilizations, pp. 26-28, Plate 23.",
      "bbox": {
        "l": 490.5,
        "b": 731.5,
        "r": 521.5,
        "t": 740.5
      }
    },
    {
      "label": "text",
      "text": "*illustrated\nAs can be seen from the many examples displayed below, the al-Wardi world map was\r\ncopied profusely for many years throughout the Muslim world, including Turkey.",
      "bbox": {
        "l": 170.5,
        "b": 680.0,
        "r": 432.5,
        "t": 718.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 669.5,
        "r": 159.0,
        "t": 679.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 654.0,
        "r": 325.0,
        "t": 665.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 643.0,
        "r": 470.0,
        "t": 653.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 594.5,
        "r": 520.5,
        "t": 617.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 535.0,
        "r": 522.5,
        "t": 581.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 535.0,
        "r": 522.5,
        "t": 555.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 522.5,
        "r": 375.5,
        "t": 533.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 498.5,
        "r": 139.0,
        "t": 508.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 460.0,
        "r": 522.5,
        "t": 484.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 302.5,
        "b": 38.5,
        "r": 309.0,
        "t": 47.5
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 417.0,
        "r": 526.0,
        "t": 721.0
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n9\r\nCzech National Library, MS XVIII G57, ff. 3v-4r, 1778, 18 x 13.5 cm",
      "bbox": {
        "l": 151.0,
        "b": 388.5,
        "r": 460.5,
        "t": 401.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 153.0,
        "r": 306.5,
        "t": 375.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 314.0,
        "b": 171.5,
        "r": 553.5,
        "t": 374.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 302.5,
        "b": 38.5,
        "r": 309.0,
        "t": 47.5
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 491.0,
        "b": 730.5,
        "r": 522.0,
        "t": 741.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 117.5,
        "r": 523.0,
        "t": 708.0
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n10\nTopkapi Sarayi Müzesi Kütüphanesi, A.3599, Istanbul\r\noriented with East at the top",
      "bbox": {
        "l": 184.5,
        "b": 78.5,
        "r": 428.0,
        "t": 103.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 36.5,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 730.0,
        "r": 523.5,
        "t": 740.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n11\r\nThis terrestrial map is in the form of a circle and placed within an equilateral octagon.\r\nThe octagonal shape might reasonably be a reference to the Celestial Throne supported\r\nby eight angels mentioned between the 13th and the 18th verses in the 69th chapter of the\r\nQur’an, namely Sura al-Haqqah. Both the line of text following the inner border of the\r\noctagon and the body of text outside it were composed in Turkish while the notations\r\naround and inside the disk were made in Arabic. The map is not oriented to the south as\r\nit is typical in the Islamicate tradition but to the east, an orientation generally attributed\r\nto maps made for Christian patrons. Though rare, the disk’s eastern orientation is not\r\nunique and not necessarily first. A slightly later world map produced in 1570 in the\r\nanonymous Arabic treatise titled Kitab al-Bad‘ wa al-Tarih [Book 1 of the Beginning and\r\nHistory], for instance, shares the same unusual orientation.\r\nThe four cardinal points are indicated outside the green outmost band. This band\r\nresembling a ring forming segmented worm is identified between the names of the\r\ncardinal points as the mythical mountain of Qaf (Jabal-i Kaf). Inside the ring of the\r\nmythical mountain, there is another band, that of the Encompassing Sea (Derya-y\r\nMuħit). The map was also prepared in a mixed style of medieval Arabic world maps. Its\r\nschematic and extremely abstract general outlook approximates it to the maps of the\r\ntenth century Balhi school named after Abu Zayd al-Balkhi (d. 322 AH/934 CE, #214.2).\r\nAt the same time, like both the famous circular world map attributed to the twelfth\r\ncentury Moroccan geographer al-Idrisi (#219) in yet another anonymous work, Kitab\r\nGara’ib al-funun wa mulaħ al-‘uyun [Book of Curiosities of the Sciences and Marvels for\r\nthe Eyes], and the rectangular world map in the same work, this terrestrial map in the\r\nincludes the ‘Mountain of the Moon’. Here it is represented with a canopy-like figure in\r\nthe southeast end almost touching the boundaries of the zone of Darkness (Zulmat). It\r\nalso makes reference to the mythical and apocalyptical tribes of Gog and Magog, albeit in\r\nthe northern end in contrast to the northeastern placement we find in other maps.\r\nIt is in fact these two zones, reserved for the tribes of Gog and Magog (Yajuj\r\nMajuj) in the north and for Darkness (Zulmat) in the south that make the map’s\r\nrepresentation of the world clearly distinct. Curiously, these two clearly delineated\r\nareas, the one in fiery red, the other in pitch black, also correspond to the North and\r\nSouth Poles. They are the uninhabitable “frigid” zones in the ancient Greek geographical\r\nconception of the world introduced by Parmenides (5th century BCE) and developed by\r\nAristotle (d. 322 BCE).\r\nOffering the most advanced information on geography was not the purpose\r\nbehind the production of this terrestrial disk. In an article on the possible mnemonic\r\nfunction of medieval Islamic maps, Emilie Savage-Smith warns the reader that “maps\r\nmust be judged on their own terms, within the aesthetic context in which they were\r\nproduced and in relation to their purpose which ...was as an aid to memory and a means\r\nof imposing order on new and complex material and not as a visual model of physical\r\nreality” (Emilie Savage-Smith, 2003, 109). She argues that the basic geometrical design of the\r\nregional maps in the Balkhi style, where the contemporaneous advancements in\r\nmapmaking were not used intentionally—and not out of ignorance— could serve\r\nperfectly as “mnemonic aids” and as “route finders accompanying the itinerary lists in\r\nthe text itself ” (Emilie Savage-Smith, 2003, 116-17).",
      "bbox": {
        "l": 89.5,
        "b": 574.0,
        "r": 523.0,
        "t": 718.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 375.5,
        "r": 523.0,
        "t": 572.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 282.5,
        "r": 523.0,
        "t": 372.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 136.5,
        "r": 523.0,
        "t": 280.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 35.5,
        "r": 312.0,
        "t": 46.5
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 310.5,
        "r": 503.0,
        "t": 721.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n12\nOf course, when this map was created, a large portion of the earth was already explored\r\nand the Ottoman elite and seamen were not ignorant of it. Indeed, in 1513, more than\r\nfifty years before the production of the this map, Piri Reis had presented his copy of the\r\nworld map including Christopher Colombus’ discoveries in America to Suleyman’s\r\nfather, Selim I (r. 1520-1520), in Egypt. Later, in 932 AH/1525-26 CE, Piri Reis presented\r\nhis book on the Mediterranean coastline, Kitab-Baħriye, to Sultan Suleyman (see #322). The\r\npresence of the royal copy of Kitab-Baħriye and of the maps prepared by Piri Reis and\r\nothers in the royal collection permits us to think that in addition to the scholarly elite\r\nwith knowledge of geography, at least map artists, navy commanders, the Ottoman\r\nruler, and the closest members of his court members of his court were aware of the\r\nadvancement of technology in sea travel and map making in the early 1560s, when this\r\nmap was being prepared. Offering the most advanced information on geography was\r\nnot the purpose behind the production of this terrestrial disk. As it appears that the\r\ncartographer did not take the Ottomanized world map of the 15th century cluster as his\r\nmain reference, either.\r\nThis map orginates from the Ottoman Imperial Scroll, or Tomar-i Humayun (TSK,\r\nA. 3599). Fethullah Celebi, or ‘Arif, began the preliminary works on the Scroll and",
      "bbox": {
        "l": 89.0,
        "b": 104.0,
        "r": 523.0,
        "t": 300.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 75.5,
        "r": 522.5,
        "t": 100.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "13": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 740.5
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n13\r\nAbdullatif Shirvani, or Eflatun, executed the first half of the document in roughly the\r\nlast decade of Sultan Suleyman’s reign (1520- 1566 CE). To date, this scroll with a width\r\nof 80 cm and a length of about 31m remains as one of the most impressive artifacts in the\r\nTopkapi Palace Museum library. And it was meant to impress the viewer. Its large size\r\nis only part of the reason. Its real impact comes from the geometrical aesthetics of its\r\norganization in the first half of the document.",
      "bbox": {
        "l": 89.0,
        "b": 641.0,
        "r": 523.0,
        "t": 718.5
      }
    },
    {
      "label": "section_header",
      "text": "References:\r\nEdson, E. & Savage-Smith, Emily, Medieval Views of the Cosmos: Picturing the Universe in\r\nthe Christian and Islamic Middle Ages (Oxford: University of Oxford, 2004).\r\nImaz, Fatma Sinem Ery, “Where Geography, Myth, and Politics Meet: An Interpretation\r\nof the Terrestrial Disk of the Ottoman Imperial Scroll”, 16th International Congress of\r\nTurkish Art. October 3-5, 2019, Ankara: Proceedings, vol. 16.\r\nPinto, Karen C., Medieval Islamic Maps, An Exploration\r\nSavage-Smith, Emily, “Memory and Maps” in Culture and Memory in Medieval Islam:\r\nEssays in Honour of Wilferd Madelung, ed. Farhad Daftary and Josef W. Meri (London: I.B.\r\nTauris & Co Ltd, 2003).\r\nKMMS world map in the style of Ibn al-Wardi with the Beja site indicated by a green circle. In\r\nthis map the Beja are neatly boxed and constrained with Abyssinia (al-Habasha), Nubia (al￾Nuba), and a space giving the name of the river Nile (al-Nil) under the upper arm below which\r\nthe boxes are nestled. 867(1462). Diameter 28.9 cm.\r\nTopkapt Saray Museum, Istanbul. Ahmer 3012, fols. 2b-3a.",
      "bbox": {
        "l": 89.5,
        "b": 616.0,
        "r": 147.5,
        "t": 626.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 587.5,
        "r": 522.0,
        "t": 612.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 548.0,
        "r": 522.5,
        "t": 586.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 535.0,
        "r": 368.5,
        "t": 546.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 495.0,
        "r": 522.5,
        "t": 533.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 157.5,
        "r": 526.0,
        "t": 491.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 95.5,
        "b": 96.5,
        "r": 515.5,
        "t": 148.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 174.0,
        "b": 83.5,
        "r": 438.0,
        "t": 95.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "14": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 740.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 248.5,
        "r": 528.0,
        "t": 708.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n14\nThese world maps express an Islamic cosmic reality in two languages-Arabic and geometry",
      "bbox": {
        "l": 105.5,
        "b": 238.5,
        "r": 507.5,
        "t": 250.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.5,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "15": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 204.0,
        "r": 527.0,
        "t": 652.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n15\nAn example of Jabal Qaf from an Ibn al-Wardi manuscript, 16th century,\r\nBritish Library, Ms. Or. ADD 9590, fols. 3b-4a\r\nThis is one of the most striking examples of the emerald green mountains of Jabal Qai that are\r\nshown ringing the world.",
      "bbox": {
        "l": 99.5,
        "b": 126.5,
        "r": 513.0,
        "t": 179.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 99.5,
        "b": 127.0,
        "r": 513.0,
        "t": 152.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "16": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 93.5,
        "b": 211.5,
        "r": 509.5,
        "t": 657.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n16\nIbn al-Wardi world map, 1001 A.D.\r\n(16.5 cm diameter) Topkapi Sarayi Müzesi Kütüphanesi, A.3599, Istanbul,\r\nBritish Library MS. Or. 1525, fols. 8v-9r\r\noriented with South at the top",
      "bbox": {
        "l": 140.0,
        "b": 142.5,
        "r": 472.0,
        "t": 194.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.0,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "17": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 302.0,
        "r": 527.5,
        "t": 720.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n17\nAn Ottoman copy of Ibn al-Wardi’s Kharidat al-‘aja’ib, 17th century, 9.7 cm diameter\r\nTopkapi Saray Museum, Bagdat 179, fol. 52b Instanbul\r\nThe “Lands of the Beja” (Ard al-Bujiya) are marked with a double-ringed circle (marked by a\r\ngreen circle) and is flipped and faces South instead of North.",
      "bbox": {
        "l": 101.0,
        "b": 215.5,
        "r": 511.0,
        "t": 267.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 215.5,
        "r": 511.0,
        "t": 241.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.0,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "18": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 377.5,
        "r": 539.0,
        "t": 720.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n18\nUmar bin Muzaffar Ibn al-Wardi. Kharidat al-'Aja'ib wa Faridat al-Ghara'ib. [The Pearl of\r\nWonders and the Uniqueness of Things Strange]. Late 17th century.\r\nOriented with the South at the top, it shows the known world as a sphere surrounded by the\r\nEncircling Sea, which is enclosed by mountains. Mecca, shown unusually in graphic form, the\r\nfocal point of all spatial references, is near the center of the Arabian Peninsula, which is embraced\r\nby the Persian Gulf and the Red Sea in the shape of a crescent moon to signify the unity of the\r\ncelestial and terrestrial worlds, a unity of conjoined sacredness. Turkish Constantinople is a red\r\ncrescent “wall” or barrier against the “people of the cross”. At the top, Africa is extended the\r\nlength of the Indian Ocean, but unlike Ptolemy’s map, here the continent does not enclose the\r\nocean. The Nile, drawn in red, takes a right-angle turn, possibly reflecting the river’s great bend.\r\nAt the center of the map are the two holiest cities of Islam: Mecca and Medina. The map shows\r\nChina and India in the north and the \"Christian sects and the states of Byzantium\" in the south.\r\nThe outer circles represent the seas. The manuscript is a cosmology, not meant to be accurate\r\ngeographically, but only to present the reader with a systematic overview of the existing\r\nknowledge about the world at the time.\r\nLibrary of Congress",
      "bbox": {
        "l": 104.0,
        "b": 338.0,
        "r": 510.5,
        "t": 363.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 164.0,
        "r": 521.5,
        "t": 337.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 261.5,
        "b": 152.0,
        "r": 350.0,
        "t": 164.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "19": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "section_header",
      "text": "World Map of al-Wardi\r\n#214.1\r\n19\r\n Re-oriented with North at the top this image is from “The world geography by al-Wardi”,\r\naccompanied with a colored world map and a picture of Ka’aba. It summarizes the geographical\r\nknowledge of the Arabic world of the time, referring to climate, terrain, fauna and flora,\r\npopulation, way of living, existing states and their governments in individual regions of the\r\nworld. The author also speaks about Slavs and their lifestyles and mentions al-Mahdiyya as the\r\nresidence of the Fatimid dynasty.",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 431.0,
        "r": 523.5,
        "t": 721.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 95.5,
        "b": 351.5,
        "r": 517.0,
        "t": 430.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.5,
        "b": 38.5,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "20": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 88.5,
        "b": 322.0,
        "r": 528.0,
        "t": 721.0
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n20\nIbn al-Wardi world map based on the KMMS model, late 17th century, 14.4 cm diameter\r\nLeiden University Libraries, Cod. Or. 158, fols. 3b-4a.",
      "bbox": {
        "l": 110.0,
        "b": 255.5,
        "r": 502.0,
        "t": 281.0
      }
    },
    {
      "label": "text",
      "text": "Encasing this entire image is the broad band of the Encircling Ocean, encompassing the\r\nPacific and Atlantic Oceans. In a single flourishing sweep, it reinforces the idea that our\r\nworld is an island marooned in a vast sea struggling to keep the waters at bay, it is the\r\nring that encircles, contains and connects the traces of liquid divinity imparted by God’s\r\nthrone to the earthly seas. It is the most liminal of seas, representing the boundary of\r\nman and his land and ships and the realm of God on the other end, nine heavenly circles\r\naway. Edged in later medieval variations of the KMMS world map by the Jabal Qaf\r\n[Mountains of Qaf] that the Hoopoe bird of Farid al-Din ʿAttar’s Conference of the Birds\r\n[Mantiq al-tayr] expresses as the ultimate aim of fana – the dying away of self – beyond\r\nwhich one can be closer to God and really live.",
      "bbox": {
        "l": 89.0,
        "b": 110.0,
        "r": 523.5,
        "t": 241.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "21": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 491.0,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 163.5,
        "b": 434.5,
        "r": 449.5,
        "t": 719.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\n#2141\nLondon, British Library, MS Or. 4637, ff. 3v-4r",
      "bbox": {
        "l": 169.0,
        "b": 425.5,
        "r": 445.5,
        "t": 438.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 164.0,
        "b": 139.5,
        "r": 447.0,
        "t": 421.0
      }
    },
    {
      "label": "caption",
      "text": "21",
      "bbox": {
        "l": 190.0,
        "b": 141.5,
        "r": 417.5,
        "t": 154.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "22": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n22",
      "bbox": {
        "l": 253.5,
        "b": 745.5,
        "r": 359.0,
        "t": 756.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 324.5,
        "r": 527.0,
        "t": 721.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 50.0
      }
    }
  ],
  "23": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 80.5,
        "b": 258.5,
        "r": 518.0,
        "t": 595.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n23\nIbn al-Wardi. Fragmenta libri Margarita mirabilium. Prooemium, caput secundum, tertium,\r\nquartum et quintem continens. E Codice Upsaliensi ed., lat. vertit, var. lect. e Cod. Suchteleniano\r\najecit C.J. Tornberg. Uppsala, 1835-39. 2 in 1 vol. W. fold. watercolored worldmap with gold.",
      "bbox": {
        "l": 90.0,
        "b": 188.5,
        "r": 521.5,
        "t": 227.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "24": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 743.0,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 198.0,
        "b": 427.5,
        "r": 416.0,
        "t": 720.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n24\n'Umar Bin Al-Muzaffar Abu Al-Hafs Bin Al-Wardi (D. 1457 AD?):\r\nKharidat Al-'Aja'ib Wa Faridat Al-Ghara'ib\r\nOttoman Provinces, 17th century\r\nAn important cosmography composed for the Mamluk na'ib of Aleppo Shahin, Arabic\r\nmanuscript on paper, 178ff. plus 4 fly-leaves, each folio with 21ll. of black naskh, titles in red,\r\ncatchwords, with map of the world centered on the Jezirah, diagram of the Ka’ba,\r\n9½ x 6¾ in. (24.2 x 17 cm.)",
      "bbox": {
        "l": 100.0,
        "b": 325.5,
        "r": 511.5,
        "t": 416.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 100.0,
        "b": 325.5,
        "r": 512.0,
        "t": 376.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 299.5,
        "b": 38.5,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "25": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n25",
      "bbox": {
        "l": 253.5,
        "b": 743.0,
        "r": 359.0,
        "t": 755.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 289.0,
        "r": 527.5,
        "t": 721.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 312.0,
        "t": 48.5
      }
    }
  ],
  "26": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n26",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 755.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 425.0,
        "r": 524.5,
        "t": 721.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 225.5,
        "b": 101.0,
        "r": 457.5,
        "t": 403.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 49.0
      }
    }
  ],
  "27": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 300.5,
        "r": 527.0,
        "t": 695.0
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n27\nIbn-Hatib ul-Rumi was yet another Arab geographer, who wrote a manuscript on\r\ngeography entitled Navadir el-Gara’ibve Mavarid a‘Aca’ib [Marvellous Things of Creation and\r\nWondrous Things in Existence]. This manuscript includes a typical Islamic world map,\r\nwhere the emphasis is on the Islamic countries. As customary the map has south at the\r\ntop. It is a Turkish translation dated AH 970 (1562/63 CE) of the work of the Arab\r\ngeographer Umar ibn al-Wardi, whose original text is dated 850 AH (1446 CE).\r\n The map is a very typical Islamic representation of the world. The large sea\r\nshown on the left is a combination of the Persian Gulf, Arabian Sea, Indian Ocean and\r\nthe Pacific Ocean with four floating unnamed islands. That on the right is the\r\nMediterranean, with the downward branching Black Sea. The two gold-colored circles at\r\nbottom left are the Caspian and the Khwarazm [Aral] Seas. To their right the city of\r\nBaghdad is shown inside a golden circle, located between the Rivers Dejleh and Farat",
      "bbox": {
        "l": 89.0,
        "b": 176.5,
        "r": 522.5,
        "t": 254.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 96.0,
        "r": 522.5,
        "t": 174.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "28": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.0,
        "b": 742.5,
        "r": 359.0,
        "t": 754.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 740.5
      }
    },
    {
      "label": "text",
      "text": "World Map of al-Wardi\r\n#214.1\r\n28\r\n[Tigris and Euphrates]. The large river at the top is the Nile, which is fed from the\r\nMountains of the Moon and passing through a lake reaches the Mediterranean.\r\nSize: 17.5 x 25 cm\r\nLocation: British Library – London, Or. MS 13201 ff 2b/3a",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 740.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 693.0,
        "r": 522.5,
        "t": 718.5
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 667.0,
        "r": 372.0,
        "t": 692.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 682.5,
        "r": 114.0,
        "t": 691.5
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 117.0,
        "b": 682.0,
        "r": 175.5,
        "t": 691.5
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 667.5,
        "r": 372.0,
        "t": 679.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 138.5,
        "b": 667.5,
        "r": 372.0,
        "t": 679.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 669.5,
        "r": 136.5,
        "t": 678.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 274.5,
        "r": 475.0,
        "t": 641.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "29": [
    {
      "label": "page_header",
      "text": "#2141\n\nWorld Map of al-Wardi\n\n29",
      "bbox": {
        "l": 253.5,
        "b": 745.5,
        "r": 359.0,
        "t": 757.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 354.0,
        "r": 497.0,
        "t": 720.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 50.5
      }
    }
  ],
  "30": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 320.0,
        "r": 528.5,
        "t": 721.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n30\nFrom a Turkish Translation of al-Wardi",
      "bbox": {
        "l": 217.5,
        "b": 269.0,
        "r": 395.0,
        "t": 280.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "31": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 88.5,
        "b": 376.0,
        "r": 526.0,
        "t": 721.5
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n31\nFrom a Turkish Translation of al-Wardi",
      "bbox": {
        "l": 217.0,
        "b": 335.5,
        "r": 395.0,
        "t": 347.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "32": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 325.5,
        "r": 528.0,
        "t": 721.0
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n32\nFrom a Turkish Translation of al-Wardi",
      "bbox": {
        "l": 217.0,
        "b": 295.5,
        "r": 395.0,
        "t": 307.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "33": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 173.0,
        "b": 452.0,
        "r": 443.5,
        "t": 721.0
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\r\n#214.1\r\n33\r\n From Tarih-i Hind-i Garb Turkey 1650",
      "bbox": {
        "l": 218.5,
        "b": 441.0,
        "r": 393.5,
        "t": 453.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 209.5,
        "b": 179.0,
        "r": 441.0,
        "t": 429.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "34": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n34",
      "bbox": {
        "l": 253.5,
        "b": 745.0,
        "r": 359.0,
        "t": 756.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 359.5,
        "r": 524.5,
        "t": 721.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 50.0
      }
    }
  ],
  "35": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n35",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 309.0,
        "r": 530.0,
        "t": 721.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 311.5,
        "t": 47.5
      }
    }
  ],
  "36": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 491.0,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 367.0,
        "r": 527.5,
        "t": 721.0
      }
    },
    {
      "label": "caption",
      "text": "World Map of al-Wardi\n#2141",
      "bbox": {
        "l": 295.5,
        "b": 338.0,
        "r": 317.0,
        "t": 347.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "37": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n37",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 490.5,
        "b": 732.0,
        "r": 521.5,
        "t": 741.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 107.5,
        "b": 406.0,
        "r": 508.0,
        "t": 721.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 158.0,
        "b": 82.5,
        "r": 458.0,
        "t": 397.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "38": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n38",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 754.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 170.0,
        "b": 447.5,
        "r": 445.5,
        "t": 721.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 169.5,
        "b": 164.0,
        "r": 446.0,
        "t": 439.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "39": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n39",
      "bbox": {
        "l": 253.5,
        "b": 745.5,
        "r": 359.0,
        "t": 756.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 176.0,
        "b": 458.0,
        "r": 440.0,
        "t": 720.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 49.5
      }
    }
  ],
  "40": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141",
      "bbox": {
        "l": 253.5,
        "b": 742.5,
        "r": 359.0,
        "t": 755.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 295.0,
        "r": 509.0,
        "t": 721.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.0,
        "r": 312.0,
        "t": 47.5
      }
    }
  ],
  "41": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n4l",
      "bbox": {
        "l": 253.5,
        "b": 745.5,
        "r": 359.0,
        "t": 756.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.5,
        "b": 306.5,
        "r": 527.0,
        "t": 721.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 299.5,
        "b": 38.0,
        "r": 312.0,
        "t": 50.5
      }
    }
  ],
  "42": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n42",
      "bbox": {
        "l": 253.5,
        "b": 743.5,
        "r": 359.0,
        "t": 756.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 374.5,
        "r": 527.5,
        "t": 721.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 299.5,
        "b": 38.0,
        "r": 312.0,
        "t": 49.5
      }
    }
  ],
  "43": [
    {
      "label": "page_header",
      "text": "World Map of al-Wardi\n\n#2141\n\n4B",
      "bbox": {
        "l": 253.5,
        "b": 745.0,
        "r": 359.0,
        "t": 756.5
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 90.0,
        "b": 433.5,
        "r": 516.0,
        "t": 720.5
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 300.0,
        "b": 38.5,
        "r": 312.0,
        "t": 49.5
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 612.0,
      "h": 792.0
    },
    "2": {
      "w": 612.0,
      "h": 792.0
    },
    "3": {
      "w": 612.0,
      "h": 792.0
    },
    "4": {
      "w": 612.0,
      "h": 792.0
    },
    "5": {
      "w": 612.0,
      "h": 792.0
    },
    "6": {
      "w": 612.0,
      "h": 792.0
    },
    "7": {
      "w": 612.0,
      "h": 792.0
    },
    "8": {
      "w": 612.0,
      "h": 792.0
    },
    "9": {
      "w": 612.0,
      "h": 792.0
    },
    "10": {
      "w": 612.0,
      "h": 792.0
    },
    "11": {
      "w": 612.0,
      "h": 792.0
    },
    "12": {
      "w": 612.0,
      "h": 792.0
    },
    "13": {
      "w": 612.0,
      "h": 792.0
    },
    "14": {
      "w": 612.0,
      "h": 792.0
    },
    "15": {
      "w": 612.0,
      "h": 792.0
    },
    "16": {
      "w": 612.0,
      "h": 792.0
    },
    "17": {
      "w": 612.0,
      "h": 792.0
    },
    "18": {
      "w": 612.0,
      "h": 792.0
    },
    "19": {
      "w": 612.0,
      "h": 792.0
    },
    "20": {
      "w": 612.0,
      "h": 792.0
    },
    "21": {
      "w": 612.0,
      "h": 792.0
    },
    "22": {
      "w": 612.0,
      "h": 792.0
    },
    "23": {
      "w": 612.0,
      "h": 792.0
    },
    "24": {
      "w": 612.0,
      "h": 792.0
    },
    "25": {
      "w": 612.0,
      "h": 792.0
    },
    "26": {
      "w": 612.0,
      "h": 792.0
    },
    "27": {
      "w": 612.0,
      "h": 792.0
    },
    "28": {
      "w": 612.0,
      "h": 792.0
    },
    "29": {
      "w": 612.0,
      "h": 792.0
    },
    "30": {
      "w": 612.0,
      "h": 792.0
    },
    "31": {
      "w": 612.0,
      "h": 792.0
    },
    "32": {
      "w": 612.0,
      "h": 792.0
    },
    "33": {
      "w": 612.0,
      "h": 792.0
    },
    "34": {
      "w": 612.0,
      "h": 792.0
    },
    "35": {
      "w": 612.0,
      "h": 792.0
    },
    "36": {
      "w": 612.0,
      "h": 792.0
    },
    "37": {
      "w": 612.0,
      "h": 792.0
    },
    "38": {
      "w": 612.0,
      "h": 792.0
    },
    "39": {
      "w": 612.0,
      "h": 792.0
    },
    "40": {
      "w": 612.0,
      "h": 792.0
    },
    "41": {
      "w": 612.0,
      "h": 792.0
    },
    "42": {
      "w": 612.0,
      "h": 792.0
    },
    "43": {
      "w": 612.0,
      "h": 792.0
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}