{
  "1": [
    {
      "label": "section_header",
      "text": "1.13",
      "bbox": {
        "l": 348.0,
        "b": 881.0,
        "r": 402.0,
        "t": 908.0
      }
    },
    {
      "label": "section_header",
      "text": "GEOGRAPHY AND MAPMAKING UNTIL 700/1300",
      "bbox": {
        "l": 105.0,
        "b": 794.0,
        "r": 648.0,
        "t": 861.0
      }
    },
    {
      "label": "text",
      "text": "Michael Bonner",
      "bbox": {
        "l": 315.0,
        "b": 741.0,
        "r": 438.0,
        "t": 757.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 315.0,
        "b": 741.0,
        "r": 438.0,
        "t": 757.0
      }
    },
    {
      "label": "text",
      "text": "Geography and cartography together constituted an area of high achievement for the Islamicate world. They did not, however, enjoy fall scientific status in the manner of, say, geometry and astronomy; for instance, they did not appear in the classification of the sciences by the philo- sopher al-Farabi (d. 339/950-1). Of course, geography was not the only discipline with such ambivalent status; history in particular offers parallels (Rosenthal 1968, 30-53). All the same, Islamicate geography achieved a striking “style” and “look” of its own, with the visual beauty of its maps, the refinement of its texts, its love of precise observation and its far-ranging curiosity. It also presented an original blend of what we might call, in our modern terms, the Islamic sciences and humanities, raising interesting questions about each of these.",
      "bbox": {
        "l": 101.0,
        "b": 484.0,
        "r": 652.0,
        "t": 644.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.1 Origins",
      "bbox": {
        "l": 321.0,
        "b": 439.0,
        "r": 431.0,
        "t": 455.0
      }
    },
    {
      "label": "text",
      "text": "It would be difficult to say, at least in a brief summary, how the Arabs of the pre-Islamic era re- presented the physical world to themselves. To begin with, their most precious cultural resource, their poetry, required a vast knowledge of Arabian topography and place-names, from both poets and audiences. Beginning in the late 20s-early 30s/630s, however, the great conquests and the ensuing exodus from Arabia had the effect of blurring, ifnot erasing this knowledge. The Arabic philologists of the Umayyad and early Abbasid eras accordingly compiled massive amounts of information about Arabian toponyms, and much of this later found its way into the geograph- ical literature (Kramers 1954a, 84). However, our fullest information in this area comes fom the Quran. Here the earth is flat, with the sky raised over it as a “guarded roof” (sagf mabfz, 21:32) and the mountains serving to keep it stable (13:3, 15:19, 50:7, 79:30, etc:). God has also fashioned the sky into seven heavens (samdwit, 2:29, 41:12, etc.) or roads or tracts (tard’ig, 23:17). On the whole, this Qur’nic cosmology accords with archaic Near Eastern mythology and tradition. In the following centuries, it received amplification in badith (Prophetical Tradi- tion) and in taftr (scriptural exegesis). However, it remained mostly separate from the literature described here as ‘geographical, despite attempts at reconciling the two (Ibn al-Fagih 1885, 3; Mugaddast 1877, 10-19)",
      "bbox": {
        "l": 101.0,
        "b": 142.0,
        "r": 652.0,
        "t": 428.0
      }
    },
    {
      "label": "text",
      "text": "‘This geographical literature began in circumstances that remain obscure to us for several reasons, including the fact that none of it is extant from before the later 2nd/8th century, as is the case for Arabic literature more generally. We do have references to mapping during the",
      "bbox": {
        "l": 101.0,
        "b": 88.0,
        "r": 652.0,
        "t": 140.0
      }
    },
    {
      "label": "key_value",
      "text": "DOI: 10.4324/9781315170718-15",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 268.0,
        "t": 65.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 268.0,
        "t": 64.0
      }
    },
    {
      "label": "page_footer",
      "text": "16",
      "bbox": {
        "l": 632.0,
        "b": 54.0,
        "r": 650.0,
        "t": 64.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "Geography and mapmaking until 700/1300",
      "bbox": {
        "l": 250.0,
        "b": 979.0,
        "r": 477.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Umayyad and early Abbasid eras, apparently for practical purposes. We know, for example, about maps of Daylam (Ibn al-Fagih 1885, 283) and Bukhara (Tabari 2010, 2:1199), commis- sioned by the Umayyad governor al-Hajjaj (d. 95/714), and a map of the swamps of lower Iraq (Baldhuri 1866, 371; Tibbetts 1992a, 90) commissioned by the Abbasid Caliph al-Mangir (r. 136-158/754-775). All in all, however, two things stand out about this literature’s early history. ‘The first is its composite nature: it emerged from a variety of activities corresponding to a variety of needs. The second is that it began with acts of translation, not only from Greek but also fom Sanskrit, Middle Persian (Pahlavi) and Syriac",
      "bbox": {
        "l": 88.0,
        "b": 810.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "‘The first important encounter was with India. It appears that several Indians learned in astro~ nomy, astrology and cosmography visited the court of Caliph al-Mansir (r. 136-158/754-775), known for his interest in astrology. As a result, we have some of the earliest translations (or adap- tations) of foreign works into Arabic (Gutas 1998[CB],! 24-5). The Sanskrit word siddhanta, appearing in the titles of several astronomical works, entered Arabic as sindhind. Although the Ara bic works in this tradition are now lost, Indian ideas retained a place in Islamicate geography and, afterward, in its Latin counterpart. These include the notion of a “cupola of the earth,” summit or center of the known and inhabited hemisphere of the world, located at a place in central India equally distant from the northern, southern, eastern and western limits of this hemisphere.",
      "bbox": {
        "l": 89.0,
        "b": 647.0,
        "r": 638.0,
        "t": 806.0
      }
    },
    {
      "label": "text",
      "text": "As the translators churned out more and more scientific texts, Arabic speakers interested in astronomy, astrology, geography and mapmaking shifted their attention to the Greek he- ritage in these fields, which Claudius Ptolemy of Alexandria (¢. 100-170) came to represent practically all by himself. Ptolemy's Megalé Syntaxis was translated early on into Arabic, as al-Majisi (from which came its later Latin title, Almagest). In this astronomical work, Ptolemy had devoted a section to the division of the earth into “climes” (“inclinations,” Greek klimata, sing. klima), which divided the northern hemisphere into zones by latitude. Arabic scholars now appropriated this term as iglim, pl. agatim, and made ita vital element of their own under standing of these matters. It is unclear, however, ifthe translators of the 3rd/9th and 4th/10th centuries ever produced an Arabic version of Ptolemy's work Geography, devoted entirely to this field of knowledge. Ibn Khurradadhbih (4. 299/91 1-2) claimed to have translated it, and translations were attributed to later scholars. In the end, however, it seems that if an Arabic translation of Ptolemy's Geogmphy did ever exist, it arrived later than the events about to be described here.",
      "bbox": {
        "l": 88.0,
        "b": 399.0,
        "r": 638.0,
        "t": 644.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.2 al-Khwarazmi and mathematical geography",
      "bbox": {
        "l": 184.0,
        "b": 350.0,
        "r": 543.0,
        "t": 367.0
      }
    },
    {
      "label": "text",
      "text": "‘What appears to be a mere gap in the vast library of Arabic scientific translations acquires more importance when we turn to a foundational moment for Islamicate geography, the appearance of the Image of the Earth (Strat al-ard) by al-Khwarazmi ({d. c. 235/850:] see Nallino 1944; Kramers 1954a, 192-5; Krachkovskit 1957, 91-2; Hopkins 1990; Tibbetts 1992a; Brentjes 2007). An astrologer with broad interests, Khwarazmi here embarked on a project best described as Ptol maic. Its Arabic title, which means, as indicated earlier, “image, representation of the eart formed (calqued) after the Greek gedgraphia, which means exactly the same thing. Both works consist of tables, and al-Khwarazmi has taken over large amounts of data from his predecessor.",
      "bbox": {
        "l": 88.0,
        "b": 198.0,
        "r": 639.0,
        "t": 339.0
      }
    },
    {
      "label": "text",
      "text": "How did al-Khwarazmi get access to Ptolemy's Geography? It is unlikely that he knew Greek himself, although perhaps someone could have translated for him on the spot. Since the Geagra- phy had been known previously to Syriac authors (Krachkovskil 1957, 20), including Bardesanes (4. c. 222), an anonymous translator (mid-Sth century), and Jacob of Edessa (d. 89/708), Syriac could quite plausibly have served as an intermediary (Chapter .2). In any case, while al-Khwarazmi replicated many of his predecessor's values for latitude and longitude, he changed many others,",
      "bbox": {
        "l": 88.0,
        "b": 89.0,
        "r": 638.0,
        "t": 195.0
      }
    },
    {
      "label": "page_footer",
      "text": "167",
      "bbox": {
        "l": 354.0,
        "b": 53.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "Bonner",
      "bbox": {
        "l": 356.0,
        "b": 982.0,
        "r": 396.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 982.0,
        "r": 396.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "while rearranging the material’s order and headings. He also added data relating to places that did not exist in Ptolemy's time and substituted Arabic toponyms for now-obsolete Greek ones.",
      "bbox": {
        "l": 102.0,
        "b": 917.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "‘Then where did al-Khwarazmi obtain his information, whenever he did not take it directly from Ptolemy? And on what basis did he “correct” many of Ptolemy's values? We have no evi- dence suggesting that he dispatched teams of collaborators to hundreds of locations throughout the world. Accordingly, the likely answer is that al-Khwarazmi tweaked Ptolemy's data on the basis of information from more recent sources, not all of them (or even most of them) necessarily ‘mathematical or astronomical at all.",
      "bbox": {
        "l": 101.0,
        "b": 809.0,
        "r": 652.0,
        "t": 914.0
      }
    },
    {
      "label": "text",
      "text": "‘Tables of longitude and latitude were of little practical use at that time, although scholars would continue to compile them for centuries to come. Quite a few modern researchers have maintained, however, that al-Khwarazmi’s project included drawing a world map, meant to fit within the dimensions of his book. Another idea, often proposed though not universally accepted, is that al-Khwarazmi was contributing here toward a large-scale world map, using coordinates of latitude and longitude, for Caliph al-Ma'min (r. 189-218/813-833). Such a project is indeed mentioned in some sources. In further support of this notion, it appears that Khwarazmi participated in the “House of Wisdom” (bayt al-bikma) in Baghdad, which many modern scholars have described as a research and/or teaching center supported by the caliphal court (Chapter IIL.1). However, problems arise. The Image of the Earth (of which only one ‘manuscript has survived) does not mention any cartographical project, big or small. A few later sources do refer to a “Ma'miinian image [or map]” (sira ma’miiniyya), but these accounts seem inaccurate or ill informed, especially that of al-Mas‘idi ({d. 345/956]; 1894, 33), who appa- rently does not understand the Ptolemaic climes and who follows the Persian system of kishvars (regions) in his own work. Similarly, a bayt al-hikma may have existed in Baghdad as early as the reign of Caliph al-Mangir, but its nature and role are more obscure to us today than they were several decades ago; in any case, it seems to have been more involved with Iranian learning than with Greek (Balty-Guesdon 1992; Gutas 1998, 53-60 [CB]; Richter-Bernburg 2016). Most significantly, difficulties arise regarding the process of mapmaking itself. Possibly because he did not have a complete translation of Ptolemy's Geography, al-Khwarazmi apparently did not con- sult the chapter on projections and therefore did not address the problem of how to represent the earth's spherical surface upon the flat surface of a map. Alll this makes it less likely that the ‘Ma'minian world map was based on mathematical coordinates; there is reason to think instead that it used the Persian system of kishvars. Looking ahead, we have a partial explanation here for why Islamicate cartography never dealt fully with the problem of projection (Tibbetts 1992a, 94-5), with the exception of al-Birini (362-4. after 444/973-d. after 1053) and possibly a few other scholars before 70/1300. Al-Khwarazmis work in this area continued among later scholars including the astronomer al-Battini (244-317/858-929), who developed further tables for geographical coordinates, and the enigmatic Subrab ({1st half 4th/10th century]; see Miquel 1967-88, 1: 79-80), who did the same while providing explicit instructions for preparing a map.",
      "bbox": {
        "l": 101.0,
        "b": 270.0,
        "r": 652.0,
        "t": 806.0
      }
    },
    {
      "label": "text",
      "text": "‘Most geographers considered the sphere of the earth as divided into two halves, only one of them known or even knowable. They divided the known half of the earth once more in half, with the northern part, or quadrant, constituting the inhabited world. They then farther divided this northern quadrant with equally spaced latitudinal lines, reaching from the equator to the pole; the area between each two of these constituted one of the seven climes. Work also continued on questions going back to the Hellenistic geographers, including how to calculate the distance of a single degree of latitude. Meanwhile, fom the beginning of Islam, scholars faced the problem of determining the direction of Mecca (the gibla) from any point in the world; their solutions, both approximate and accurate, constituted a great achievement for Islamicate geography over many centuries (King 1999[CB]; King and Lorch 1992[CB]; Chapter VI.3).",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 652.0,
        "t": 266.0
      }
    },
    {
      "label": "page_footer",
      "text": "168",
      "bbox": {
        "l": 366.0,
        "b": 51.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "Geography and mapmaking until 700/1300",
      "bbox": {
        "l": 250.0,
        "b": 979.0,
        "r": 476.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.3. Ibn Khurradadhbih and administrative geography",
      "bbox": {
        "l": 161.0,
        "b": 933.0,
        "r": 565.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Islamicate geography received input early on not only from Indian and Greek but also from Persian learning. Especially important was an Iranian tradition of representing the world as divided into seven kishvurs, with one kishvar located centrally and the other six grouped around it. Isamic-era writers in this tradition referred to the central kishvar as Irinshahr, the “domain of Iran,” including not only modern-day tran but also Iraq and some other places. This scheme appeared often in Islamicate geography, in effect as an alternative to the Ptolemaic system. However, since Arabic writers rendered Persian kishvur with the same term that they used for the Ptolemaic “clime,” namely iglim, and since they assigned a total of seven units or regions to each system, confusion often prevailed",
      "bbox": {
        "l": 89.0,
        "b": 762.0,
        "r": 638.0,
        "t": 921.0
      }
    },
    {
      "label": "text",
      "text": "Until now our story has connected scientific work with centers of political power. It has also involved a process of translation relating, though only in part, to those same centers of power. It has also been associated with the drawing of maps. Meanwhile, other things were happening in the vast area of the caliphate or Islamic Empire. In particular, armies, bureaucrats, merchants, seckers of religious merit and knowledge, criminals and other groups were on the move, often over long distances. This movement of so many people over so many routes created all sorts of material, organizational and intellectual needs.",
      "bbox": {
        "l": 89.0,
        "b": 636.0,
        "r": 639.0,
        "t": 759.0
      }
    },
    {
      "label": "text",
      "text": "Here again the caliphal government took the lead, through its chancery and bureaucracy. The ‘management of long-distance communications led to the creation (or continuing) of a postal and intelligence bureau (dfwin al-barid; Silverstein 2007). Heading this for a time in the mid-3rd/9th century was Ibn Khurradadhbih, a professional bureaucrat of Persian descent, whose Routes and Realms (al-Masaik wal-mamalik) can be considered, along with al-Khwarazmi’s Image of the Earth, as one of the foundations of Islamicate geography. Although Ibn Khurradidhbih includes smat- terings of Greek and Persian geography in his text, and even claims to have translated Ptolemy himself, he proceeds independently of astronomical and mathematical geography. Instead, and true to its title, Routes and Realms has a framework constituted by its wide-ranging itineraries. It indicates distances with stages (what a traveler can cover in a day), and with units of measurement such as the Persian farsakh (six kilometers) and the mil or “Arab mile” (somewhat longer than the English mile). It seems obvious — although it is never stated outright — that these itineraries result from compilations by the divin al-barid and its predecessors. At times Ibn Khurradadhbih adds landmarks for help in identifying place-names. He also gives fiscal information, less useful for travelers but much appreciated by later historians. At the same time, he cites poetry connected with particular places. He tells about wonders such as Sicilian volcanoes and the riches of Visi- gothic Spain, once seized by the Muslim conquerors. He also relays the purported accounts of travelers, such as the expedition of Sallim the Interpreter, sent by an Abbasid caliph to the land of Yajaj and Majaj (Gog and Magog) in the (otherwise legendary) northeastern corner of the world. The overall result, while enjoyable for readers, lacks coherence, as some later geographers would point out. Meanwhile, Ibn Khurradadhbih makes no use whatsoever of maps. But he used schemes or diagrams, for instance for representing various giblas (King 1999).",
      "bbox": {
        "l": 88.0,
        "b": 240.0,
        "r": 638.0,
        "t": 633.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.4 Geography under the unitary caliphate and its immediate successors",
      "bbox": {
        "l": 108.0,
        "b": 188.0,
        "r": 618.0,
        "t": 204.0
      }
    },
    {
      "label": "text",
      "text": "‘Two characteristics of Ibn Khurradidhbih’s work proved essential for the next phase of geo- graphical literature, The first was the participation of the imperial bureaucracy in compiling and disseminating useful knowledge. The second was the cultivation of a fine literary style, together with the display — indeed, the flaunting — of one’s knowledge of many topics, including, but not restricted to, matters relating to imperial administration. These traits distinguished the adib,",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 176.0
      }
    },
    {
      "label": "page_footer",
      "text": "169",
      "bbox": {
        "l": 354.0,
        "b": 53.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "Bonner",
      "bbox": {
        "l": 356.0,
        "b": 982.0,
        "r": 396.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 982.0,
        "r": 396.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "or cultivated littéateur, while the relevant cultural domain was that of adab, which referred, on cone hand, to polite, refined behavior and conduct and, on the other hand, to literary works that conveyed those values and showed readers how to acquire them.",
      "bbox": {
        "l": 102.0,
        "b": 899.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "In the following decades, several authors followed Ibn Khurradadhbih’s example. These included al-Jayhant (d. after 367/978), a vizier (chief administrator) for the principate of the Samanids in Transoxania (today Turkmenistan and Uzbekistan) in the early 4th/10th century, and the author of a book bearing the same title as Ibn Khurradadhbih’s, Routes and Realms. We do not have this work, although many fragments have survived through direct or indirect quo- tation. It seems clear, in any case, that Jayhani followed Ibn Khurradadhbih in his use of official archives and his emphasis on adab.",
      "bbox": {
        "l": 102.0,
        "b": 774.0,
        "r": 652.0,
        "t": 896.0
      }
    },
    {
      "label": "text",
      "text": "Somewhat earlier we have al-Ya‘gibi (d. after 292/905), one of the most interesting writers in this entire literature. Ya'gibi worked in government service in various places, including the frontier region of Armenia. With his astute understanding of high politics, he comes across as a historian first and foremost. His surviving works on history and geography effectively treat the latter as the handmaiden of the former; geographical knowledge constitutes a prerequisite for the study of history. In style and presentation, Ya'qabi is direct and unornamented. Even if he subscribes to the values of adab, he does not foreground them.",
      "bbox": {
        "l": 101.0,
        "b": 648.0,
        "r": 652.0,
        "t": 770.0
      }
    },
    {
      "label": "text",
      "text": "We find a comparable trajectory in Mas'idi, mentioned earlier. Iraqi by birth, Mas‘idi trave- led far and wide (although not as far and wide as he claimed) and acquired a great stock of expe- riential knowledge, together with an impressive erudition derived from books. Like Ya'qibi, ‘Mas‘iidi made history his primary concern. He differed from Ya‘qibi, however, in being unen- cumbered by government service, and in his cultivation of the literary and educational values of adab. Indeed, Mas‘idi imitated the prose style of the immortal al-Jahiz (d. 255/868), more suc~ cessfully than anyone before or since. This “literarization” of the material, political and ethical worlds had already reached a peak in two geographers active around the turn of the 4th/10th century, Ibn al-Fagih al-Hamadhani and Ibn Rusta, both of western Iranian origin.",
      "bbox": {
        "l": 101.0,
        "b": 485.0,
        "r": 652.0,
        "t": 644.0
      }
    },
    {
      "label": "text",
      "text": "Qudima ibn Ja'far is known to us as a loyal servant of the empire active in Baghdad in the earlier 4th/10th century and as the author ofthe Book of the Land-tax and the Secretary's Art (Kitab al-khardj wa-sina‘at al-kitaba). Geography constitutes only one of the disciplines forming the basis of this broad-ranging work. The Book of the Land-tax also differs from its predecessors in the presentation of its material. For instance, it isolates the itineraries within a chapter of their own. Yet it rightly belongs within our sequence of geographical works for several reasons, beginning with its treatment of the frontiers. In Qudma’s day, the unitary caliphate was fast becoming a fiction, as it lost control of its territories while successor states arose everywhere to supplant it ‘This fact underlies Qudama’s chapter on the frontiers of Islam (thughitr al-Isam), where he coun- terintuitively portrays an Islamic world where unity prevails, not only in culture and religion but also, and above all, in political and administrative matters. This unity expresses itself through engagement with the frontiers of Islam throughout the known world,",
      "bbox": {
        "l": 102.0,
        "b": 269.0,
        "r": 652.0,
        "t": 482.0
      }
    },
    {
      "label": "text",
      "text": "‘Another reason for including Qudima within the geographical literature is his awareness of its three main components, “hard” science, bureaucratic administration and adab. Qudama shows ample respect for the Ptolemaic tradition, and not surprisingly, he emphasizes the importance of administration. However, even though he advocates the cultivation of a fine Arabic style, he opposes the privileging of the values of adab characteristic of many of his contemporaries, and he “rejects any attempt to subordinate the geographical discipline to the literary goals of a cultural elite” (Heck 2002, 96).",
      "bbox": {
        "l": 101.0,
        "b": 144.0,
        "r": 653.0,
        "t": 266.0
      }
    },
    {
      "label": "text",
      "text": "‘We have seen both similarities and contrasts among the geographical writers active during the decades after al-Khwarazmi and Ibn Khurradadhbih. Some modern researchers group these into a putative ‘Iraqi school but this seems to serve mainly for the purpose of contrasting them",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 652.0,
        "t": 140.0
      }
    },
    {
      "label": "page_footer",
      "text": "170",
      "bbox": {
        "l": 367.0,
        "b": 52.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "6": [
    {
      "label": "page_header",
      "text": "Geography and mapmaking until 700/1300",
      "bbox": {
        "l": 250.0,
        "b": 979.0,
        "r": 477.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "with the ‘Balkhi school, which we will take up next. One thing that does unite them, however, is their neglect of cartography, as they knew about maps but did not use them.",
      "bbox": {
        "l": 88.0,
        "b": 917.0,
        "r": 638.0,
        "t": 951.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.5 The ‘Balkhi School”",
      "bbox": {
        "l": 268.0,
        "b": 875.0,
        "r": 458.0,
        "t": 889.0
      }
    },
    {
      "label": "text",
      "text": "‘Modern scholarship has identified a ‘Balkhi school, active throughout most of the 4th/10th cen- tury but including only three members, with a sort of honorary membership usually extended to a fourth. However, not only is this ‘Balkhi school’ a concept of modern scholarship, but the relations among these authors, especially the first three, are enigmatic. Perceptive scholars such as al-Idrist (A. after 560/1164-5) and Yaqiit al-Riimi (d. 626/129) showed perplexity over what these three took from one another and whether they were not really just one or two individuals. ‘A solution came in 1871, when M. J. de Goeje (1836-1906) showed that these were indeed three distinct authors; that the geographical work of the first of them, Balkhi, was no longer extant; and that the other two composed distinct, although related, books. Afterward, scholars went on to associate this “Balkhi schoo!’ with a collective project that they called ‘the atlas of Islam’ (Kramers 1932; Krachkovskif 1957, 194-219; Miquel 1967-88, 1:267-330; Miller 1986 1.1.17, 5:109; Hopkins 1990, 312-15; Tibbetts 1992b)",
      "bbox": {
        "l": 88.0,
        "b": 648.0,
        "r": 639.0,
        "t": 860.0
      }
    },
    {
      "label": "text",
      "text": "‘The founding figure was the courtier and littérateur Abii Zayd al-Balkhi (d. 322/934), who composed a Book of the Image of the Earth (Kitab Sirat al-ard). This began with a map of the world and then presented twenty maps of provinces or “climes” with accompanying text. Balkhi’s work was taken up afterward by al-Istakhei (d. after 340/951), who traveled extensively and composed a Book of Routes and Realms (Kitab al-masalik wal-mamalik,), revising Balkhi’s maps while adding new text. We know little else about the connection between these two, since Balkhi’s maps and text became absorbed into Israkhr’s or simply disappeared. Then in 331/943, a young man known as Ibn Hawgal departed from Baghdad, intending to map and describe as many of the regions of the world as he could. Some time later, he met Istakhri (Ibn Hawgal 1938, 329-30). ‘The encounter is often said to have taken place in Sind, since Ibn Hawgal describes it in his chapter on that province, but this is incorrect, since Ibn Hawgal almost certainly never went there (Miquel 1967-88, 1:299-300).",
      "bbox": {
        "l": 89.0,
        "b": 432.0,
        "r": 638.0,
        "t": 644.0
      }
    },
    {
      "label": "text",
      "text": "According to Ibn Hawgal, after they had shown each other some of their maps, Istakhri asked the younger man to correct and continue his own work. Ibn Hawgal agreed, but after doing this for a while, he decided to take over Igakhri’s work on his own account and rewrite the text, redraw the maps and publish it all under his own name. In the wake of this apparent act of plagiarism we have, first of all, a book called Routes and Realms ascribed entirely to Istakhei, and then we have Ibn Hawqal’s work which exists in two main recensions, the first called Routes and Realms, and the second Image of the Earth. In both recensions, Ibn Hawqal incorporates Isgakhe’s text while adding new material of his own. In other words, while the younger writer has devoured his predecessor whole, the predecessor's work has also survived, separately and unscathed,",
      "bbox": {
        "l": 89.0,
        "b": 253.0,
        "r": 638.0,
        "t": 428.0
      }
    },
    {
      "label": "text",
      "text": "‘The ‘Balkhi School’ is also usually considered to include the great work by Ibn Hawgal’s younger contemporary al-Mugaddasi (2nd half 4th/10th century), ‘The Best Division for Know- ledge of the Climes (Absan al-tagasim li-ma‘ifat al-agatim). Mugaddast knew about Balkhi and, apparently, about Istakhri (De Goeje 1871, 47-8). However, even though he and Ibn Hawgal were engaged in similar projects, they show no awareness of one another, whether out of igno- ance or jealousy.",
      "bbox": {
        "l": 89.0,
        "b": 143.0,
        "r": 638.0,
        "t": 248.0
      }
    },
    {
      "label": "text",
      "text": "Like other Islamicate geographers, the ‘Balkhi’ authors show respect for the Ptolemaic tra~ dition. In practice, however, they follow different principles, especially by using the iglim as an organizing principle not in its Ptolemaic sense, but in a sense more akin to the Persian kishvur.",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 140.0
      }
    },
    {
      "label": "page_footer",
      "text": "m1",
      "bbox": {
        "l": 355.0,
        "b": 53.0,
        "r": 371.0,
        "t": 65.0
      }
    }
  ],
  "7": [
    {
      "label": "page_header",
      "text": "Bonner",
      "bbox": {
        "l": 355.0,
        "b": 982.0,
        "r": 396.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 355.0,
        "b": 982.0,
        "r": 396.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "‘Asa result, iglim for them means something like province. Accordingly, the question of where to draw the lines, how to delineate an iglim, ranks high among their concerns. We may recall that this was a time of political fragmentation, as the Abbasid caliphs lost all their territories and most of their authority. For the ‘BalkhT'authors, the “climes” do not pertain to a caliphate (khilafa), or even to a juridically constructed Abode of Islam (dar al-Islam) but rather to a “Realm of Islam” (mamlakat al-Islam). Like the individual provinces, this realm is defined not only by religious and political criteria but also by cultural and economic ones. The work of the ‘Balkhi’ authors has accordingly been described as the high point of an Islamicate ‘human geography’ (Miquel 1967-88, 1: 267-330).",
      "bbox": {
        "l": 101.0,
        "b": 792.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Alll this may help us understand another difference between the ‘Balkhi’ authors and their predecessors. Beginning with Ibn Khurradadhbih, travelers’ itineraries are an essential feature of the geographical literature, extending through individual provinces all the way to the end of the Islamic world, and constituting the communications network of a great empire. At times, Ibn Khurradadhbih and his successors also look beyond the frontiers, relaying information about India, China, Byzantium and so forth. Now, however, while the ‘BalkhY authors pre~ sent itineraries as painstakingly detailed as their predecessors, they delineate them within the bounds of individual provinces (Figure 1.13.1). At the same time, with regard to their overall",
      "bbox": {
        "l": 101.0,
        "b": 647.0,
        "r": 653.0,
        "t": 788.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 208.0,
        "b": 168.0,
        "r": 544.0,
        "t": 609.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 1.13.1 Map of the Maghrib, from al-Igzakhris Book of Routes and Kingdoms; MS Gotha, Research. Library, orient. A 1521, fol. 13a,",
      "bbox": {
        "l": 101.0,
        "b": 124.0,
        "r": 652.0,
        "t": 151.0
      }
    },
    {
      "label": "text",
      "text": "Source: © Research Library, Gotha",
      "bbox": {
        "l": 102.0,
        "b": 98.0,
        "r": 281.0,
        "t": 112.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 98.0,
        "r": 281.0,
        "t": 112.0
      }
    },
    {
      "label": "page_footer",
      "text": "172",
      "bbox": {
        "l": 367.0,
        "b": 54.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "8": [
    {
      "label": "page_header",
      "text": "Geography and mapmaking until 700/1300",
      "bbox": {
        "l": 250.0,
        "b": 979.0,
        "r": 477.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "coverage, the “Balkhi’ authors limit themselves (at least in principle) to the treatment of the Islamic world: a restriction which results logically fom their deployment of the concepts of iglm and mamlakat al-Islam. For similar reasons, the frontier regions — where Islam comes up against other polities and civilizations — have less importance for them than for, say, Ibn Khurradidhbih or Qudima",
      "bbox": {
        "l": 89.0,
        "b": 864.0,
        "r": 639.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "With the exception of their eponymous founder, the ‘Balkhi’ authors are neither bureau- crats nor courtiers. They do share a need for autonomy, even privacy, in areas including their personal life, where they come across as solitary figures. In their religious life, Ibn Hawgal and perhaps Mugaddast have Ism2'ili associations, which they mainly keep to themselves. For their professional activities, they conduct commerce, mostly on their own account. They show expertise in fiscal administration, commerce, agriculture, architecture, theology, law and just about everything else. What unites them above all is their critical acumen and power of observation. They articulate and follow research methods of remarkable sophistication; among the earlier (nonmathematical) geographers, it is al-Ya' with them. 7 who most has this in common",
      "bbox": {
        "l": 88.0,
        "b": 686.0,
        "r": 638.0,
        "t": 860.0
      }
    },
    {
      "label": "text",
      "text": "Finally, a defining and original characteristic of the ‘Balkhi school is its use of maps. We do not know what models Balkhi himself used for these, but it seems that in his work the maps held pride of place while the text provided commentary. In Istakhei, however, the text can fanction without the maps? The same applies to Ibn Hawgal, while Mugaddast’s maps may even seem superfluous at times. In later centuries, however, the maps came to enjoy more popularity than the texts and acquired complex transmission histories of their own. Some modern scholars have maintained that these “Balkhi school’ maps appeared in two distinctive varieties, the ‘Istakhei’ and the ‘Ibn Hawyal’ types. However, this division is difficult to trace, especially in its earlier stages, since the earliest complete (or nearly complete) set of ‘Balkhi school’ maps that we have, accompanying an Ibn Hawgal manuscript, dates from around a century after the author's lifetime, while most extant examples date from considerably later than that. All the ‘Balkhi school’ maps have distinctive features in common, including a lack of indications of latitude and longitude, and a predilection for simple geometrical shapes and straight lines. They show the inhabited world enclosed by the Encircling Sea (al-babr al-mubit) or Ocean, with two large inlets extending inland from this sea, forming the Sea of the Romans (Mediterranean) and the Sea of the Persians (Indian Ocean, Arabian Sea, Persian Gulf, Red Sea). In the following centuries, these became shared features of most Islamicate world maps. Very recently, Karen Pinto (2016) has identified a symbolic vocabulary of meanings for these features and traits. She considers many historical sources for them and identifies Iranian, rather than Greco-Roman tradition, as their primary source. She also, less convincingly, deprives Balkhi and his ‘school’ of the creative role usually attributed to them in cartographical tradition",
      "bbox": {
        "l": 89.0,
        "b": 289.0,
        "r": 638.0,
        "t": 680.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.6 Geography after the unitary caliphate",
      "bbox": {
        "l": 205.0,
        "b": 233.0,
        "r": 521.0,
        "t": 250.0
      }
    },
    {
      "label": "text",
      "text": "All the literature discussed so far has been in the Arabic language. But now a major work in Persian finally arrives, the Regions of the World (Hudad al-‘alam) by an unknown author, dated to 272/982 (Minorsky 1937). This comprehensive and well-organized work probably has the (now-lost) Arabic-language Routes and Realms of Jayhani as a major source. It also makes exten sive use of Israkhri and perhaps Ibn Hawgal and lists no coordinates of longitude and latitude for its place-names. It accordingly has affinities with the ‘Balkhi school: On the other hand, it does not include maps, apparently even in its original form, although it does occasionally refer",
      "bbox": {
        "l": 88.0,
        "b": 98.0,
        "r": 638.0,
        "t": 221.0
      }
    },
    {
      "label": "page_footer",
      "text": "3",
      "bbox": {
        "l": 354.0,
        "b": 52.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "Bonner",
      "bbox": {
        "l": 355.0,
        "b": 982.0,
        "r": 396.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "to a single map (sirat), apparently of the world (Tibbetts 1992c, 138-9). In style and tone, it is direct and unornamented.",
      "bbox": {
        "l": 101.0,
        "b": 920.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "In 2002, the Bodleian Library of Oxford acquired an Arabic manuscript by an unknown author titled The Book of Curiosities of the Sciences and Marvels for the Eyes (Kitab ghardib al-funiin wa-mulab al-‘uyiin). Online access was provided and in 2014 a fall, illustrated edition and translation appeared (Rapoport and Savage-Smith 2014). Both manuscript and modern edi- tion are indeed “marvels for the eyes.” The editors date the composition of the work to the early to mid-Sth/11th century, with Fatimid Egypt the likely place of origin. The manuscript itself was copied, according to the editors, probably around the turn of the 7th/13th century. While the text corresponds to the time in question (before 42/1050), the maps are almost certainly different from the originals, although it is difficult to say how much so since here, as with the ‘Balkhi’ maps, we have no direct knowledge of the first century or so of their existence. One of the world maps resembles the famous round map associated with al-Idrid. ‘The manuscript also includes a rectangular world map and maps of three great seas, five rivers and various formations in the Mediterranean (Figure 1.13.2), the area of greatest interest to the author and his readers.",
      "bbox": {
        "l": 101.0,
        "b": 667.0,
        "r": 652.0,
        "t": 914.0
      }
    },
    {
      "label": "text",
      "text": "‘The Book of Curisities differs from the geographical literature discussed so far, in being divided into two parts (magalas), the first on the heavens and their influence and the second on the earth. In the second part, the author claims to follow Ptolemy's Geography, but he actually proceeds somewhat, although not entirely, in the manner of the ‘Balkhi’ authors; the geo- graphical authors on whom he relies most are Mas‘idi and Ibn Hawgal. The work concludes with a section on wonders (‘ib). The Book of Curiosities is of high interest for many reasons, including its context of courtly patronage under the Isma'Tli Shi‘ caliphate of the Fatimids, at a time when their old rivals, the Abbasids of Baghdad, no longer enjoyed much authority or even autonomy.",
      "bbox": {
        "l": 101.0,
        "b": 503.0,
        "r": 652.0,
        "t": 662.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 163.0,
        "b": 158.0,
        "r": 588.0,
        "t": 446.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 113.2 Map of the Mediterranean Sea, from the Book of Curiosities written by an anonymous author from Fatimid Egypt; MS Oxford, Bodleian Library, Ar. 90 c.,fols 30b-31a.",
      "bbox": {
        "l": 102.0,
        "b": 112.0,
        "r": 652.0,
        "t": 140.0
      }
    },
    {
      "label": "text",
      "text": "‘Soure: © Bodleian Libraries, University of Oxford, Oxford",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 412.0,
        "t": 101.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 412.0,
        "t": 101.0
      }
    },
    {
      "label": "page_footer",
      "text": "174",
      "bbox": {
        "l": 367.0,
        "b": 54.0,
        "r": 385.0,
        "t": 65.0
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "Geography and mapmaking until 700/1300",
      "bbox": {
        "l": 250.0,
        "b": 979.0,
        "r": 477.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.7 al-Birdini",
      "bbox": {
        "l": 303.0,
        "b": 936.0,
        "r": 423.0,
        "t": 949.0
      }
    },
    {
      "label": "text",
      "text": "‘We have seen that a number of scholars after al-Khwarazmi continued to work on mathema- tical and astronomical geography, while their administratively — and humanistically — oriented colleagues received more attention. Now, however, at least from our perspective, mathematical geography recovers the spotlight with al-Birdni, who spent much of his career in the service of the Ghaznavids, in the easternmost regions of the Islamicate world. Biriini made a supreme contribution to ‘human geography’ with his book on India (Biriini 2000). On the more strictly ‘mathematical side, like his predecessor Ibn Yanus (4. 399/1009), Birdini combined geographical coordinates with tables of stellar coordinates. His Handbook for al-Mas‘ad (al-Qaniin al-mas‘idi) provided the best tables of latitude and longitude available at the time, covering an unprece- dented total of 600 places. In doing this, Birdini addressed the old problem of the measurement of a single degree of latitude (Tibbetts 1992c, 141-2). As is well known, he arrived at a remark- ably accurate figure for the circumference of the earth. He criticized the theory of projections that he attributed to Marinus of Tyre (c. 70-130) and Ptolemy of Alexandria and proposed instead the method that we know now as the equidistant azimuthal projection. In this projection, all points on a map are at proportionally correct distances from the center point; they are also at the correct direction (or azimuth) from the center point. This method was taken up afterward by Gerard Mercator (1512-1594) and other cartographers of the early modern era and remains prominent in contemporary mapmaking.",
      "bbox": {
        "l": 88.0,
        "b": 600.0,
        "r": 638.0,
        "t": 922.0
      }
    },
    {
      "label": "text",
      "text": "‘These advances had relatively little effect on Islamicate cartography overall, with one major exception. Until this time most geographers had thought that at the southern end of the world, the landmass that we now call Africa extended eastward as far as China, where it met the rounding Sea. The resulting confusion between “Ethiopia” and “India” pervaded medieval Euro- pean travel literature. Birdini proved that this was wrong and, in his Book of Instruction in Astrology (Kitab al-Tafhim li-sind‘at al-tanjim), included a sketch map of the inhabited world that became influential and widely used.",
      "bbox": {
        "l": 89.0,
        "b": 474.0,
        "r": 638.0,
        "t": 597.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.8 al-Idrisi",
      "bbox": {
        "l": 306.0,
        "b": 423.0,
        "r": 420.0,
        "t": 436.0
      }
    },
    {
      "label": "text",
      "text": "(One cartographer and geographer who did not follow Birini in this last matter was one of the ‘most remarkable figures in the entire tradition, al-Idrisi. A scholar of noble descent from Ceuta, Morocco, al-Idtisi received an invitation to the court of the Norman king Roger II of Sicily (t. 1130-1154), which had been conquered from the Muslims over half a century previously. ‘There, he became involved in a project of constructing a large-scale world map that, in its surviving versions, is closely related to the world map accompanying the Fatimid-era Book of Curiosities (Rapoport and Savage-Smith 2014, 31). Al-Idrisi also undertook the composition of a book combining maps with texts. In his introduction, he relates how it all began:",
      "bbox": {
        "l": 88.0,
        "b": 267.0,
        "r": 639.0,
        "t": 408.0
      }
    },
    {
      "label": "text",
      "text": "[King Roger] ordered that a disk should be prepared for him of pure silver and divided into massive, bulky sections. ... He ordered the workers to engrave upon it the like- nesses of the seven climes with their countries, regions, shores, rural areas, gulf, seas, and watercourses . .. inhabited and uninhabited places . . . well-trodden routes and distances. . .. He also ordered them to compose a book [to which he] added a description of . . . the countries and lands, with regard to their people, places, locations, likenesses, seas, mountains, distances, crops and revenues; the types of their buildings and the characteristics of the [economic] activities performed there; the industries according with them; the merchandise carried to and from them; the marvels",
      "bbox": {
        "l": 115.0,
        "b": 87.0,
        "r": 612.0,
        "t": 246.0
      }
    },
    {
      "label": "page_footer",
      "text": "5",
      "bbox": {
        "l": 354.0,
        "b": 53.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "Bonner",
      "bbox": {
        "l": 355.0,
        "b": 982.0,
        "r": 396.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 355.0,
        "b": 982.0,
        "r": 396.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "associated with them; and [their] relation to the seven climes, all the while keeping account of their inhabitants’ condition, appearance, mores, costume and speech. [King Roger] ordered that this book should be named The Book of Pleasant Journeys into Far- away Lands (Kitab nuzhat al-mushtag ft khtirag al-afag). This took place in the first ten days of January, corresponding to Shawwal of the year 548. Here I execute his order and command.",
      "bbox": {
        "l": 128.0,
        "b": 848.0,
        "r": 624.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "(al-tdvist 1970, 1: 6-7)",
      "bbox": {
        "l": 493.0,
        "b": 827.0,
        "r": 623.0,
        "t": 842.0
      }
    },
    {
      "label": "text",
      "text": "Al-Idris prudently attributes everything to his royal patron, but more important, we see a con- vergence between ‘human geography’ of the ‘Balkhi’ type and the mathematical-astronomical geography of Ptolemy and al-Khwarazmi. Later in his introduction, al-Idrisi says that he began by drawing the usual seven latitudinal lines across the inhabited world and then drew ten lon- gitudinal lines, thus achieving a grid with seventy rectangular units. He then provided each of these with a detailed map and description. This procedure allowed al-Idtis to combine the two dominant modes of Islamic cartography within a single format. Claiming to follow Ptolemy, al-Idrisi gave coordinates of latitude and longitude. At the same time, and most remarkably, he provided a summa of Arabic geographical learning up to his time while concomitantly pursuing empirical knowledge wherever he could find it and from anyone who would provide it to him, not only in the Mediterranean environment (Figure 1.13.3) but all the way to the northern coast of Europe, where at some time he apparently went himself.",
      "bbox": {
        "l": 101.0,
        "b": 593.0,
        "r": 652.0,
        "t": 806.0
      }
    },
    {
      "label": "text",
      "text": "Al-Idris also composed a shorter book titled The Gardens of Delight and the Diversion of Souls (Rau al-faraj wa-nuzhat al-muha)), possibly an abridgment of The Pleasure Excursion but more likely an independent work (Maqbul 1992, 157-8, 163-7). Consisting largely of itineraries and distances, The Gardens of Delight includes an additional clime (iglim) just south of the equator, which it considers together with the “usual” first clime. It includes 73 sectional maps, smaller, less detailed, and less unified in format than the maps of The Pleasure Excursion.",
      "bbox": {
        "l": 101.0,
        "b": 485.0,
        "r": 652.0,
        "t": 590.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 164.0,
        "b": 172.0,
        "r": 588.0,
        "t": 461.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 1.13.3 Map ofa part of the Mediterranean Sea and adjacent territory around Tunis, from al-Ideis’s ‘work The Book of Pleasant Joumeys into Faraway Lands (Kitab nuzhat al-mushtag ft tirdg al- fig); MS Oxford, Bodleian Library, Greaves 42, fols 1156-1 16a.",
      "bbox": {
        "l": 101.0,
        "b": 112.0,
        "r": 652.0,
        "t": 155.0
      }
    },
    {
      "label": "text",
      "text": "Soure: © The Bodleian Libraries, University of Oxford, Oxford",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 437.0,
        "t": 101.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 103.0,
        "b": 88.0,
        "r": 437.0,
        "t": 101.0
      }
    },
    {
      "label": "page_footer",
      "text": "176",
      "bbox": {
        "l": 367.0,
        "b": 54.0,
        "r": 385.0,
        "t": 65.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "Geography and mapmaking until 700/1300",
      "bbox": {
        "l": 250.0,
        "b": 979.0,
        "r": 477.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Because of his service for a European Christian prince, al-Idrisi had a problematic reputation in later Islamic scholarship. Nonetheless, he had considerable influence over later geographers and historians including the North Africans ‘Ali ibn Masi ibn Sa‘id al-Maghribi (d. 685/1286) and Ibn Khaldin (732-808/1332—1406), and, in the Timurid East, Hafiz-i Abra (d. 883/1430) ‘The round world map associated with al-Idrisi dates from after his lifetime and is now the best known image fom all of Islamic cartography.",
      "bbox": {
        "l": 88.0,
        "b": 845.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "1.13.9 Other developments",
      "bbox": {
        "l": 265.0,
        "b": 799.0,
        "r": 462.0,
        "t": 816.0
      }
    },
    {
      "label": "text",
      "text": "‘The term geographical may seem inappropriate when applied to all the maps and texts dis- cussed so far and those still remaining to be discussed. It certainly was not the term of choice for those authors and mapmakers themselves, for whom jughrifiyd meant about the same thing as sirat al-ard, image or map of the world. We still use it now, however, in part because of the lack of an alternative. Interestingly, when our geographical authors proclaimed their ambitions and projects, sometimes they did not identify their subject matter and discipline in a coherent or uniform way (e.g., Ibn Hawqal 1938, 3-4). Meanwhile, the broad category of geographical literature includes subgenres that we have not covered here, because of lack of space. These include the literature of travelers on land and sea that overlaps, notably, with the narratives of the ‘Balkhi’ authors. Another subgenre is that of “wonders of the worl which enjoyed popularity and became increasingly integrated into ‘mainstream’ geography, especially in the Wonders of Creation (‘Ajab al-makiiligat) of al-Qazwini (d. 682/1283). And finally, we have the encyclopedias of place-names, of which the greatest is the Dictionary of the Countries (Mu‘jam al-buldan) of Yaqitt al-Riimi (d. 626/1229). This reader-friendly work presents thousands of place names in alphabetical order, providing ample literary, historical and indeed, geographical information. Today it remains an indispensable tool for students and scholars, enduring testimony to the fascination, utility and enjoyment that this geo- graphical literature brings",
      "bbox": {
        "l": 88.0,
        "b": 466.0,
        "r": 638.0,
        "t": 787.0
      }
    },
    {
      "label": "section_header",
      "text": "Notes",
      "bbox": {
        "l": 342.0,
        "b": 419.0,
        "r": 383.0,
        "t": 433.0
      }
    },
    {
      "label": "list_item",
      "text": "1 Consolidated bibliography:",
      "bbox": {
        "l": 89.0,
        "b": 392.0,
        "r": 242.0,
        "t": 406.0
      }
    },
    {
      "label": "list_item",
      "text": "2 The first printed edition of Isakhei (Leiden, 1870) has no maps, since the editor had none available. The second edition (Cairo, 1961) does include maps.",
      "bbox": {
        "l": 88.0,
        "b": 363.0,
        "r": 638.0,
        "t": 392.0
      }
    },
    {
      "label": "section_header",
      "text": "Bibliography",
      "bbox": {
        "l": 317.0,
        "b": 312.0,
        "r": 409.0,
        "t": 330.0
      }
    },
    {
      "label": "section_header",
      "text": "Sources",
      "bbox": {
        "l": 337.0,
        "b": 281.0,
        "r": 389.0,
        "t": 293.0
      }
    },
    {
      "label": "text",
      "text": "al-Balidhusi, Ahmad ibn Yahya. ed. de Goeje, M. J. 1866. Kitab Furth al-buldin [The Book of the Conquest of the Countries}. Leiden: Bri.",
      "bbox": {
        "l": 88.0,
        "b": 240.0,
        "r": 638.0,
        "t": 267.0
      }
    },
    {
      "label": "text",
      "text": "al-Biring. tr. and ed. Sachau, E. 2000, Alheruni’ India. London: Routledge.",
      "bbox": {
        "l": 89.0,
        "b": 223.0,
        "r": 480.0,
        "t": 238.0
      }
    },
    {
      "label": "text",
      "text": "Ibn al-Faghh al-Hamadhani. 1885. “Kitab al-Buldin [The Book of the Countries)\" in BGA 5.",
      "bbox": {
        "l": 89.0,
        "b": 209.0,
        "r": 579.0,
        "t": 222.0
      }
    },
    {
      "label": "text",
      "text": "{bn Hawgal, Abu I-Qisim al-Nasibi. ed. Kramers, J. H. 1938, “Kitab Sirat alard [The Book of the Image of the Earth],” BGA 2 [English tr. by Bonner, M. forthcoming. Reading: Garnet}.",
      "bbox": {
        "l": 89.0,
        "b": 178.0,
        "r": 639.0,
        "t": 207.0
      }
    },
    {
      "label": "text",
      "text": "{bn Khurradadhbih, Aba I-Qisim. 1889. “Al-Masilik wa-l-mamalik [The Routes and the Realms},” in BGAS.",
      "bbox": {
        "l": 89.0,
        "b": 151.0,
        "r": 638.0,
        "t": 178.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 151.0,
        "r": 638.0,
        "t": 178.0
      }
    },
    {
      "label": "text",
      "text": "bn Rusta, Abi ‘AIT Abmad ibn ‘Umar. 1892. “al-A’lig al-nafisa [The Precious Gems],” BGA 7.",
      "bbox": {
        "l": 88.0,
        "b": 134.0,
        "r": 584.0,
        "t": 147.0
      }
    },
    {
      "label": "list_item",
      "text": "al-ldsisi, Abi ‘Abdallsh Muhammad. 1970-84. Opus geographicum [.. .] = Nuzhat al-mushtg ft khtinig al-afig [Geographical Work (...) = The Book of Pleasant Journeys into Faraway Lands), eds. Bombaci, A., et al, Leiden: Brill",
      "bbox": {
        "l": 89.0,
        "b": 91.0,
        "r": 638.0,
        "t": 132.0
      }
    },
    {
      "label": "page_footer",
      "text": "7",
      "bbox": {
        "l": 354.0,
        "b": 53.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "13": [
    {
      "label": "section_header",
      "text": "Bonner",
      "bbox": {
        "l": 356.0,
        "b": 983.0,
        "r": 396.0,
        "t": 993.0
      }
    },
    {
      "label": "list_item",
      "text": "al-ggakhei, AbG Ishig Ibrahim. 1870. Al-Masalie wa-L-mamalik [The Routes and the Realms), ed. M. J. de Goeje, M. |. BGA 1. [newly ed. by M. Hini. 1961. Cairo: Wizarat al-Thagafi]",
      "bbox": {
        "l": 101.0,
        "b": 921.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Masiidi. 1894, “Al-Tanbih wa-Lishraf [The Notification and the Verification,” BGA 8.",
      "bbox": {
        "l": 102.0,
        "b": 907.0,
        "r": 575.0,
        "t": 920.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Minorsky, V, ed. and tr. 1937. Hudid al-lam [The Regions of the World]. London: Luzac.",
      "bbox": {
        "l": 102.0,
        "b": 892.0,
        "r": 577.0,
        "t": 905.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Mugaddasi, Shams al-Din Aba ‘Abdallih Muhammad. 1877. “Ahsan al-tagisim fi ma'rifit al-agilim [The Best Divisions for Knowledge of the Regions,” in BGA 3 [Collins, B. A., tz. Reading: Garnet, 1994].",
      "bbox": {
        "l": 102.0,
        "b": 862.0,
        "r": 652.0,
        "t": 890.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Qazwini, Zakariyyl' ibn Muhammad. ed. Wiistenfeld, F 1849. ‘Aja%b al-mabdligat [The Wonders of the Created (Beings)]. Gattingen: Dieterichsche Buchhandlung,",
      "bbox": {
        "l": 102.0,
        "b": 832.0,
        "r": 651.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "Qudima ibn Jsfar. ed. al-Zubaydi, M. H. 1981. Kitab al-khanij wa-sind‘aral-ktaba [The Book of Taxes and the Art of Calligraphy]. Baghdad: Dir al-Rashid li rnashr.",
      "bbox": {
        "l": 102.0,
        "b": 802.0,
        "r": 651.0,
        "t": 830.0
      }
    },
    {
      "label": "list_item",
      "text": "Rapoport, ¥. and Savage-Smith, E., ts. and eds. 2014. An Eleventh-Century Egyptian Guide to the Universe: The Book of Curiosities. Leiden: Brill",
      "bbox": {
        "l": 101.0,
        "b": 772.0,
        "r": 652.0,
        "t": 800.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Tabari, Mubammad ibn Jari. eds. de Goeje, M. J. etal. 1879-1901. Tikh al-rusul wt Prophets and Kings). Leiden: Brill [Reprint: 2010], lak [History of",
      "bbox": {
        "l": 101.0,
        "b": 742.0,
        "r": 653.0,
        "t": 770.0
      }
    },
    {
      "label": "list_item",
      "text": "alUmasi, Shihab al-Din. 1924. Masdlikeal-abr ff mamalik al-amsar (The Ways of Discernment into the of the Capital Cities]. Cairo: Dar al-kutub al-misryys",
      "bbox": {
        "l": 101.0,
        "b": 712.0,
        "r": 651.0,
        "t": 740.0
      }
    },
    {
      "label": "list_item",
      "text": ", Ibn Abi Ya'qib ibn Wadib. 1892. “Kitab al-Buldin [The Book of the Countries],\" in BGA",
      "bbox": {
        "l": 102.0,
        "b": 683.0,
        "r": 651.0,
        "t": 710.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Yagat, Aba ‘Abdallah Yitqab al-Hamawi al-Ran ‘Beirut: Dar Sadir. 1955. Mujam al-huldin [Dictionary of the Countries)",
      "bbox": {
        "l": 101.0,
        "b": 652.0,
        "r": 651.0,
        "t": 680.0
      }
    },
    {
      "label": "section_header",
      "text": "Research literature",
      "bbox": {
        "l": 311.0,
        "b": 610.0,
        "r": 441.0,
        "t": 622.0
      }
    },
    {
      "label": "text",
      "text": "Balty-Guesdon, M.-G. 1992. “Le Bayt al-bikma de Bagdad,” Arabica 39: 131-50.",
      "bbox": {
        "l": 102.0,
        "b": 583.0,
        "r": 517.0,
        "t": 596.0
      }
    },
    {
      "label": "text",
      "text": "Brengjes, S. 2007. \"Khwarizmil” in Hockey et al, eds. [CB], 631-3.",
      "bbox": {
        "l": 102.0,
        "b": 568.0,
        "r": 453.0,
        "t": 581.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 568.0,
        "r": 453.0,
        "t": 581.0
      }
    },
    {
      "label": "list_item",
      "text": "De Goeje, M. J. 1871. “Die Istakhri-Balkhi Frage,” ZDMG 25: 41-58.",
      "bbox": {
        "l": 102.0,
        "b": 553.0,
        "r": 471.0,
        "t": 566.0
      }
    },
    {
      "label": "list_item",
      "text": "Heck, P 2002, The Construction of Knowledge in Islamic Civilization: Qudma b, Jafar and His Kitab al-Khar3j warsini‘at al-kitiba, Leiden: Brill",
      "bbox": {
        "l": 101.0,
        "b": 523.0,
        "r": 650.0,
        "t": 551.0
      }
    },
    {
      "label": "list_item",
      "text": "Hopkins, . E P. 1990. “Geographical and Navigational Literature\" in Young, M. J. L, etal. eds. Religion, ‘Learning and Science in the ‘Abbasid Period, Cambridge: Cambridge University Press, 301-27.",
      "bbox": {
        "l": 101.0,
        "b": 493.0,
        "r": 651.0,
        "t": 521.0
      }
    },
    {
      "label": "list_item",
      "text": "Kennedy, E. S. and Kennedy, M. H. 1987. Geographical Coordinates of Localities from Islamic Sources. Frankfurt am Main: Institue fir Geschichte der Arabisch-Islamischen Wissenschaft, Johann-Wolfgang- Goethe-Universitit.",
      "bbox": {
        "l": 102.0,
        "b": 449.0,
        "r": 652.0,
        "t": 491.0
      }
    },
    {
      "label": "list_item",
      "text": "Krachkovskif, 1. J 1957. Arabskaya geograficheskaya literatura. I=branniye sochineniya. Vol. 4. Moscow and Leningrad: Iedatelstvo Akademii Nauk SSSR.",
      "bbox": {
        "l": 102.0,
        "b": 418.0,
        "r": 651.0,
        "t": 446.0
      }
    },
    {
      "label": "list_item",
      "text": "Kramers, J. H. 1932. “La question Balhi-lggahei et I'atlas de Islam,\" Acta Orientalia 10: 9-30.",
      "bbox": {
        "l": 102.0,
        "b": 403.0,
        "r": 579.0,
        "t": 416.0
      }
    },
    {
      "label": "list_item",
      "text": "Kramers, JH. 1954a. “La littérature géographique classique des Musulmans”” in Analecta Oriental. Leiden: Brill, 172-204,",
      "bbox": {
        "l": 102.0,
        "b": 374.0,
        "r": 651.0,
        "t": 401.0
      }
    },
    {
      "label": "list_item",
      "text": "Kramers, . H. 1954b, “Al-Biruni’ Determination of Geographical Longitude by Measuring the Distances,” ‘Analecta Orientalia. Leiden: Brill, 205-22.",
      "bbox": {
        "l": 102.0,
        "b": 344.0,
        "r": 651.0,
        "t": 371.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Magbul Ahmad, S. 1992. “Cartography of al-Sharif al-Idrisi,” in GTISAS, 156-74.",
      "bbox": {
        "l": 101.0,
        "b": 328.0,
        "r": 533.0,
        "t": 341.0
      }
    },
    {
      "label": "list_item",
      "text": "Magbul Ahmad, S. 1995. A History of Arab-Lslamic Geography, 9th—16th Century AD. Mafraq: Al al-Bayt University",
      "bbox": {
        "l": 101.0,
        "b": 298.0,
        "r": 651.0,
        "t": 326.0
      }
    },
    {
      "label": "list_item",
      "text": "Magbul Ahmad, S. 1973-1978.“Djughrafiya” in EI-2, 4: 575-87.",
      "bbox": {
        "l": 102.0,
        "b": 283.0,
        "r": 445.0,
        "t": 296.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 283.0,
        "r": 445.0,
        "t": 296.0
      }
    },
    {
      "label": "list_item",
      "text": "Miller, K. 1986? [1926-1931]. Mappae arabicae. Arabische Welt und Linderkarten des 9-13 Jalrhunders ‘Wiesbaden: L. Reichert.",
      "bbox": {
        "l": 101.0,
        "b": 254.0,
        "r": 651.0,
        "t": 281.0
      }
    },
    {
      "label": "list_item",
      "text": "Miquel, A. 1967-1988. La géographie humaine du monde musulman jusqu’au milieu du 11° siéele. Paris: Mouton, EHESS,",
      "bbox": {
        "l": 101.0,
        "b": 226.0,
        "r": 651.0,
        "t": 251.0
      }
    },
    {
      "label": "list_item",
      "text": "Nallino, C. A. 1944, “A-Khuwirizmi e il suo rifacimento della Geografia di Tolomeo [al-Khwarizmi and His Rewriting of Prolemy’s Geography),” Raccolta di seit editieinediti. Rome: Istituto per ' Oriente, 5: 458-532.",
      "bbox": {
        "l": 101.0,
        "b": 180.0,
        "r": 651.0,
        "t": 221.0
      }
    },
    {
      "label": "list_item",
      "text": "Pinto, K. 2016. Medieval Islamic Maps: An Exploration. Chicago: University of Chicago Pres.",
      "bbox": {
        "l": 102.0,
        "b": 163.0,
        "r": 582.0,
        "t": 176.0
      }
    },
    {
      "label": "list_item",
      "text": "Richter-Bernburg, L. 2016. “Potemkin in Baghdad: The Abbasid ‘House of Wisdom’ as Constructed by. 1001 Inventions.” in Brentjes et al, eds. [CB], 121-32.",
      "bbox": {
        "l": 102.0,
        "b": 133.0,
        "r": 652.0,
        "t": 161.0
      }
    },
    {
      "label": "list_item",
      "text": "Rosenthal, E1968. A History of Muslim Historiography. Leiden: Brill,",
      "bbox": {
        "l": 102.0,
        "b": 118.0,
        "r": 455.0,
        "t": 131.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 118.0,
        "r": 455.0,
        "t": 131.0
      }
    },
    {
      "label": "list_item",
      "text": "Silverstein, A. 2007. Postal Systems in the Pre-Modern Islamic World. Cambridge: Cambridge University Press",
      "bbox": {
        "l": 102.0,
        "b": 91.0,
        "r": 651.0,
        "t": 116.0
      }
    },
    {
      "label": "page_footer",
      "text": "78",
      "bbox": {
        "l": 368.0,
        "b": 54.0,
        "r": 385.0,
        "t": 64.0
      }
    }
  ],
  "14": [
    {
      "label": "section_header",
      "text": "Geography and mapmaking until 700/1300",
      "bbox": {
        "l": 250.0,
        "b": 979.0,
        "r": 476.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "‘Tibbetts, G. 1992a, “The Beginnings of a Cartographic Tradition,” in 90-107.",
      "bbox": {
        "l": 88.0,
        "b": 937.0,
        "r": 550.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "‘Tibbetts, G. 1992b. “The Balkhi School of Geographers,” in GT",
      "bbox": {
        "l": 89.0,
        "b": 922.0,
        "r": 502.0,
        "t": 935.0
      }
    },
    {
      "label": "text",
      "text": "‘Tibbetts, G.1992c. “Later Cartographic Developments.” in GTIS",
      "bbox": {
        "l": 89.0,
        "b": 907.0,
        "r": 492.0,
        "t": 920.0
      }
    },
    {
      "label": "text",
      "text": "London:",
      "bbox": {
        "l": 107.0,
        "b": 879.0,
        "r": 152.0,
        "t": 890.0
      }
    },
    {
      "label": "page_footer",
      "text": "179",
      "bbox": {
        "l": 354.0,
        "b": 54.0,
        "r": 372.0,
        "t": 64.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 740,
      "h": 1046
    },
    "2": {
      "w": 740,
      "h": 1046
    },
    "3": {
      "w": 740,
      "h": 1046
    },
    "4": {
      "w": 740,
      "h": 1046
    },
    "5": {
      "w": 740,
      "h": 1046
    },
    "6": {
      "w": 740,
      "h": 1046
    },
    "7": {
      "w": 740,
      "h": 1046
    },
    "8": {
      "w": 740,
      "h": 1046
    },
    "9": {
      "w": 740,
      "h": 1046
    },
    "10": {
      "w": 740,
      "h": 1046
    },
    "11": {
      "w": 740,
      "h": 1046
    },
    "12": {
      "w": 740,
      "h": 1046
    },
    "13": {
      "w": 740,
      "h": 1046
    },
    "14": {
      "w": 740,
      "h": 1046
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}