{
  "1": "I.13\nGEOGRAPHY AND MAPMAKING\nUNTIL 700/1300\nMichael Bonner\nGeography and cartography together constituted an area of high achievement for the Islamicate\nworld. They did not, however, enjoy full scientific status in the manner of, say, geometry and\nastronomy; for instance, they did not appear in the classification of the sciences by the philo-\nsopher al-Fārābi (d. 339/950-1). Of course, geography was not the only discipline with such\nambivalent status; history in particular offers parallels (Rosenthal 1968, 30-53). All the same,\nIslamicate geography achieved a striking \"style\" and \"look\" of its own, with the visual beauty of\nits maps, the refinement of its texts, its love of precise observation and its far-ranging curiosity. It\nalso presented an original blend of what we might call, in our modern terms, the Islamic sciences\nand humanities, raising interesting questions about each of these.\nI.13.1\nOrigins\nIt would be difficult to say, at least in a brief summary, how the Arabs of the pre-Islamic era re-\npresented the physical world to themselves. To begin with, their most precious cultural resource,\ntheir poetry, required a vast knowledge of Arabian topography and place-names, from both poets\nand audiences. Beginning in the late 20s-early 30s/630s, however, the great conquests and the\nensuing exodus from Arabia had the effect of blurring, if not erasing this knowledge. The Arabic\nphilologists of the Umayyad and early Abbasid eras accordingly compiled massive amounts of\ninformation about Arabian toponyms, and much of this later found its way into the geograph-\nical literature (Kramers 1954a, 84). However, our fullest information in this area comes from\nthe Qur'an. Here the earth is flat, with the sky raised over it as a \"guarded roof\" (saqf mahfuz.\n21:32) and the mountains serving to keep it stable (13:3, 15:19, 50:7, 79:30, etc.). God has\nalso fashioned the sky into seven heavens (samāwāt, 2:29, 41:12, etc.) or roads or tracts (tara'iq,\n23:17). On the whole, this Qur'anic cosmology accords with archaic Near Eastern mythology\nand tradition. In the following centuries, it received amplification in ḥadīth (Prophetical Tradi-\ntion) and in tafsir (scriptural exegesis). However, it remained mostly separate from the literature\ndescribed here as 'geographical,' despite attempts at reconciling the two (Ibn al-Faqih 1885, 3;\nMuqaddasi 1877, 10-19).\nThis geographical literature began in circumstances that remain obscure to us for several\nreasons, including the fact that none of it is extant from before the later 2nd/8th century, as\nis the case for Arabic literature more generally. We do have references to mapping during the\nDOI: 10.4324/9781315170718-15\n166",
  "2": "Geography and mapmaking until 700/1300\nUmayyad and early Abbasid eras, apparently for practical purposes. We know, for example,\nabout maps of Daylam (Ibn al-Faqih 1885, 283) and Bukhara (Tabari 2010, 2:1199), commis-\nsioned by the Umayyad governor al-Hajjaj (d. 95/714), and a map of the swamps of lower Iraq\n(Baladhuri 1866, 371; Tibbetts 1992a, 90) commissioned by the Abbasid Caliph al-Mansur (r.\n136-158/754-775). All in all, however, two things stand out about this literature's early history.\nThe first is its composite nature: it emerged from a variety of activities corresponding to a variety\nof needs. The second is that it began with acts of translation, not only from Greek but also from\nSanskrit, Middle Persian (Pahlavi) and Syriac.\nThe first important encounter was with India. It appears that several Indians learned in astro-\nnomy, astrology and cosmography visited the court of Caliph al-Mansur (r. 136-158/754-775),\nknown for his interest in astrology. As a result, we have some of the earliest translations (or adap-\ntations) of foreign works into Arabic (Gutas 1998[CB], 24-5). The Sanskrit word siddhanta,\nappearing in the titles of several astronomical works, entered Arabic as sindhind. Although the Ara-\nbic works in this tradition are now lost, Indian ideas retained a place in Islamicate geography and,\nafterward, in its Latin counterpart. These include the notion of a \"cupola of the earth,\" a summit\nor center of the known and inhabited hemisphere of the world, located at a place in central India\nequally distant from the northern, southern, eastern and western limits of this hemisphere.\nAs the translators churned out more and more scientific texts, Arabic speakers interested\nin astronomy, astrology, geography and mapmaking shifted their attention to the Greek he-\nritage in these fields, which Claudius Ptolemy of Alexandria (c. 100-170) came to represent\npractically all by himself. Ptolemy's Megale Syntaxis was translated early on into Arabic, as\nal-Majisti (from which came its later Latin title, Almagest). In this astronomical work, Ptolemy\nhad devoted a section to the division of the earth into \"climes\" (\"inclinations,\" Greek klimata,\nsing. klima), which divided the northern hemisphere into zones by latitude. Arabic scholars\nnow appropriated this term as iqlim, pl. aqālīm, and made it a vital element of their own under-\nstanding of these matters. It is unclear, however, if the translators of the 3rd/9th and 4th/10th\ncenturies ever produced an Arabic version of Ptolemy's work Geography, devoted entirely to\nthis field of knowledge. Ibn Khurradädhbih (d. 299/911-2) claimed to have translated it, and\ntranslations were attributed to later scholars. In the end, however, it seems that if an Arabic\ntranslation of Ptolemy's Geography did ever exist, it arrived later than the events about to be\ndescribed here.\n1.13.2 al-Khwārazmi and mathematical geography\nWhat appears to be a mere gap in the vast library of Arabic scientific translations acquires more\nimportance when we turn to a foundational moment for Islamicate geography, the appearance of\nthe Image of the Earth (Surat al-ard) by al-Khwārazmi ([d. c. 235/850;] see Nallino 1944; Kramers\n1954a, 192-5; Krachkovskii 1957, 91-2; Hopkins 1990; Tibbetts 1992a; Brentjes 2007). An\nastrologer with broad interests, Khwārazmi here embarked on a project best described as Ptole-\nmaic. Its Arabic title, which means, as indicated earlier, \"image, representation of the earth,\" is\nformed (calqued) after the Greek geographia, which means exactly the same thing. Both works\nconsist of tables, and al-Khwārazmi has taken over large amounts of data from his predecessor.\nHow did al-Khwārazmi get access to Ptolemy's Geography? It is unlikely that he knew Greek\nhimself, although perhaps someone could have translated for him on the spot. Since the Geogra-\nphy had been known previously to Syriac authors (Krachkovskii 1957, 20), including Bardesanes\n(d. c. 222), an anonymous translator (mid-5th century), and Jacob of Edessa (d. 89/708), Syriac\ncould quite plausibly have served as an intermediary (Chapter 1.2). In any case, while al-Khwārazmi\nreplicated many of his predecessor's values for latitude and longitude, he changed many others,\n167",
  "3": "Bonner\nwhile rearranging the material's order and headings. He also added data relating to places that\ndid not exist in Ptolemy's time and substituted Arabic toponyms for now-obsolete Greek ones.\nThen where did al-Khwārazmi obtain his information, whenever he did not take it directly\nfrom Ptolemy? And on what basis did he \"correct\" many of Ptolemy's values? We have no evi-\ndence suggesting that he dispatched teams of collaborators to hundreds of locations throughout\nthe world. Accordingly, the likely answer is that al-Khwārazmi tweaked Ptolemy's data on the\nbasis of information from more recent sources, not all of them (or even most of them) necessarily\nmathematical or astronomical at all.\nTables of longitude and latitude were of little practical use at that time, although scholars\nwould continue to compile them for centuries to come. Quite a few modern researchers have\nmaintained, however, that al-Khwarazmi's project included drawing a world map, meant to\nfit within the dimensions of his book. Another idea, often proposed though not universally\naccepted, is that al-Khwārazmi was contributing here toward a large-scale world map, using\ncoordinates of latitude and longitude, for Caliph al-Ma'mun (r. 189-218/813-833). Such a\nproject is indeed mentioned in some sources. In further support of this notion, it appears that\nKhwārazmi participated in the \"House of Wisdom\" (bayt al-hikma) in Baghdad, which many\nmodern scholars have described as a research and/or teaching center supported by the caliphal\ncourt (Chapter III.1). However, problems arise. The Image of the Earth (of which only one\nmanuscript has survived) does not mention any cartographical project, big or small. A few later\nsources do refer to a \"Ma'munian image [or map]\" (sura ma'muniyya), but these accounts seem\ninaccurate or ill informed, especially that of al-Mas'udi ([d. 345/956]: 1894, 33), who appa-\nrently does not understand the Ptolemaic climes and who follows the Persian system of kishvars\n(regions) in his own work. Similarly, a bayt al-hikma may have existed in Baghdad as early as the\nreign of Caliph al-Mansur, but its nature and role are more obscure to us today than they were\nseveral decades ago; in any case, it seems to have been more involved with Iranian learning than\nwith Greek (Balty-Guesdon 1992; Gutas 1998, 53-60 [CB]; Richter-Bernburg 2016). Most\nsignificantly, difficulties arise regarding the process of mapmaking itself. Possibly because he did\nnot have a complete translation of Ptolemy's Geography, al-Khwarazmi apparently did not con-\nsult the chapter on projections and therefore did not address the problem of how to represent\nthe earth's spherical surface upon the flat surface of a map. All this makes it less likely that the\nMa'munian world map was based on mathematical coordinates; there is reason to think instead\nthat it used the Persian system of kishvars. Looking ahead, we have a partial explanation here for\nwhy Islamicate cartography never dealt fully with the problem of projection (Tibbetts 1992a,\n94-5), with the exception of al-Biruni (362-d. after 444/973-d. after 1053) and possibly a\nfew other scholars before 700/1300. Al-Khwarazmi's work in this area continued among later\nscholars including the astronomer al-Battānī (244-317/858-929), who developed further tables\nfor geographical coordinates, and the enigmatic Suhrab ([1st half 4th/10th century]; see Miquel\n1967-88, 1: 79–80), who did the same while providing explicit instructions for preparing a map.\nMost geographers considered the sphere of the earth as divided into two halves, only one\nof them known or even knowable. They divided the known half of the earth once more in\nhalf, with the northern part, or quadrant, constituting the inhabited world. They then further\ndivided this northern quadrant with equally spaced latitudinal lines, reaching from the equator\nto the pole; the area between each two of these constituted one of the seven climes. Work also\ncontinued on questions going back to the Hellenistic geographers, including how to calculate\nthe distance of a single degree of latitude. Meanwhile, from the beginning of Islam, scholars\nfaced the problem of determining the direction of Mecca (the qibla) from any point in the world;\ntheir solutions, both approximate and accurate, constituted a great achievement for Islamicate\ngeography over many centuries (King 1999[CB]; King and Lorch 1992[CB]; Chapter VI.3).\n168",
  "4": "Geography and mapmaking until 700/1300\nI.13.3 Ibn Khurradadhbih and administrative geography\nIslamicate geography received input early on not only from Indian and Greek but also from\nPersian learning. Especially important was an Iranian tradition of representing the world as\ndivided into seven kishvars, with one kishvar located centrally and the other six grouped around\nit. Islamic-era writers in this tradition referred to the central kishvar as Transhahr, the \"domain\nof Iran,\" including not only modern-day Iran but also Iraq and some other places. This scheme\nappeared often in Islamicate geography, in effect as an alternative to the Ptolemaic system.\nHowever, since Arabic writers rendered Persian kishvar with the same term that they used for\nthe Ptolemaic \"clime,\" namely iqlim, and since they assigned a total of seven units or regions to\neach system, confusion often prevailed.\nUntil now our story has connected scientific work with centers of political power. It has also\ninvolved a process of translation relating, though only in part, to those same centers of power.\nIt has also been associated with the drawing of maps. Meanwhile, other things were happening\nin the vast area of the caliphate or Islamic Empire. In particular, armies, bureaucrats, merchants,\nseekers of religious merit and knowledge, criminals and other groups were on the move, often\nover long distances. This movement of so many people over so many routes created all sorts of\nmaterial, organizational and intellectual needs.\nHere again the caliphal government took the lead, through its chancery and bureaucracy. The\nmanagement of long-distance communications led to the creation (or continuing) of a postal and\nintelligence bureau (diwan al-barīd; Silverstein 2007). Heading this for a time in the mid-3rd/9th\ncentury was Ibn Khurradadhbih, a professional bureaucrat of Persian descent, whose Routes and\nRealms (al-Masalik wal-mamalik) can be considered, along with al-Khwārazmi's Image of the Earth,\nas one of the foundations of Islamicate geography. Although Ibn Khurradadhbih includes smat-\nterings of Greek and Persian geography in his text, and even claims to have translated Ptolemy\nhimself, he proceeds independently of astronomical and mathematical geography. Instead, and\ntrue to its title, Routes and Realms has a framework constituted by its wide-ranging itineraries. It\nindicates distances with stages (what a traveler can cover in a day), and with units of measurement\nsuch as the Persian farsakh (six kilometers) and the mil or \"Arab mile\" (somewhat longer than the\nEnglish mile). It seems obvious - although it is never stated outright - that these itineraries result\nfrom compilations by the diwan al-barīd and its predecessors. At times Ibn Khurradadhbih adds\nlandmarks for help in identifying place-names. He also gives fiscal information, less useful for\ntravelers but much appreciated by later historians. At the same time, he cites poetry connected\nwith particular places. He tells about wonders such as Sicilian volcanoes and the riches of Visi-\ngothic Spain, once seized by the Muslim conquerors. He also relays the purported accounts of\ntravelers, such as the expedition of Sallam the Interpreter, sent by an Abbasid caliph to the land\nof Yajuj and Mājūj (Gog and Magog) in the (otherwise legendary) northeastern corner of the\nworld. The overall result, while enjoyable for readers, lacks coherence, as some later geographers\nwould point out. Meanwhile, Ibn Khurradādhbih makes no use whatsoever of maps. But he\nused schemes or diagrams, for instance for representing various qiblas (King 1999).\nI.13.4 Geography under the unitary caliphate and its immediate successors\nTwo characteristics of Ibn Khurradadhbih's work proved essential for the next phase of geo-\ngraphical literature. The first was the participation of the imperial bureaucracy in compiling and\ndisseminating useful knowledge. The second was the cultivation of a fine literary style, together\nwith the display - indeed, the flaunting - of one's knowledge of many topics, including, but\nnot restricted to, matters relating to imperial administration. These traits distinguished the adīb,\n169",
  "5": "Bonner\nor cultivated littérateur, while the relevant cultural domain was that of adab, which referred, on\none hand, to polite, refined behavior and conduct and, on the other hand, to literary works that\nconveyed those values and showed readers how to acquire them.\nIn the following decades, several authors followed Ibn Khurradadhbih's example. These\nincluded al-Jayhani (d. after 367/978), a vizier (chief administrator) for the principate of the\nSamanids in Transoxania (today Turkmenistan and Uzbekistan) in the early 4th/10th century,\nand the author of a book bearing the same title as Ibn Khurradadhbih's, Routes and Realms. We\ndo not have this work, although many fragments have survived through direct or indirect quo-\ntation. It seems clear, in any case, that Jayhānī followed Ibn Khurradadhbih in his use of official\narchives and his emphasis on adab.\nSomewhat earlier we have al-Ya'qubi (d. after 292/905), one of the most interesting writers\nin this entire literature. Ya'qubi worked in government service in various places, including the\nfrontier region of Armenia. With his astute understanding of high politics, he comes across as a\nhistorian first and foremost. His surviving works on history and geography effectively treat the\nlatter as the handmaiden of the former; geographical knowledge constitutes a prerequisite for\nthe study of history. In style and presentation, Ya'qubi is direct and unornamented. Even if he\nsubscribes to the values of adab, he does not foreground them.\nWe find a comparable trajectory in Mas'udi, mentioned earlier. Iraqi by birth, Mas'udi trave-\nled far and wide (although not as far and wide as he claimed) and acquired a great stock of expe-\nriential knowledge, together with an impressive erudition derived from books. Like Ya'qubi,\nMas'ūdī made history his primary concern. He differed from Ya'qubi, however, in being unen-\ncumbered by government service, and in his cultivation of the literary and educational values of\nadab. Indeed, Mas'udi imitated the prose style of the immortal al-Jaḥiz (d. 255/868), more suc-\ncessfully than anyone before or since. This \"literarization\" of the material, political and ethical\nworlds had already reached a peak in two geographers active around the turn of the 4th/10th\ncentury, Ibn al-Faqih al-Hamadhani and Ibn Rusta, both of western Iranian origin.\nQudāma ibn Ja'far is known to us as a loyal servant of the empire active in Baghdad in the\nearlier 4th/10th century and as the author of the Book of the Land-tax and the Secretary's Art (Kitab\nal-kharaj wa-sina'at al-kitaba). Geography constitutes only one of the disciplines forming the basis\nof this broad-ranging work. The Book of the Land-tax also differs from its predecessors in the\npresentation of its material. For instance, it isolates the itineraries within a chapter of their own.\nYet it rightly belongs within our sequence of geographical works for several reasons, beginning\nwith its treatment of the frontiers. In Qudama's day, the unitary caliphate was fast becoming a\nfiction, as it lost control of its territories while successor states arose everywhere to supplant it.\nThis fact underlies Qudama's chapter on the frontiers of Islam (thughur al-Islam), where he coun-\nterintuitively portrays an Islamic world where unity prevails, not only in culture and religion\nbut also, and above all, in political and administrative matters. This unity expresses itself through\nengagement with the frontiers of Islam throughout the known world.\nAnother reason for including Qudāma within the geographical literature is his awareness of\nits three main components, \"hard\" science, bureaucratic administration and adab. Qudāma shows\nample respect for the Ptolemaic tradition, and not surprisingly, he emphasizes the importance\nof administration. However, even though he advocates the cultivation of a fine Arabic style, he\nopposes the privileging of the values of adab characteristic of many of his contemporaries, and he\n\"rejects any attempt to subordinate the geographical discipline to the literary goals of a cultural\nelite\" (Heck 2002, 96).\nWe have seen both similarities and contrasts among the geographical writers active during\nthe decades after al-Khwārazmi and Ibn Khurradādhbih. Some modern researchers group these\ninto a putative 'Iraqi school,' but this seems to serve mainly for the purpose of contrasting them\n170",
  "6": "Geography and mapmaking until 700/1300\nwith the 'Balkhi school,' which we will take up next. One thing that does unite them, however,\nis their neglect of cartography, as they knew about maps but did not use them.\nI.13.5 The 'Balkhi School'\nModern scholarship has identified a 'Balkhi school,' active throughout most of the 4th/10th cen-\ntury but including only three members, with a sort of honorary membership usually extended\nto a fourth. However, not only is this 'Balkhi school' a concept of modern scholarship, but the\nrelations among these authors, especially the first three, are enigmatic. Perceptive scholars such\nas al-Idrisi (d. after 560/1164-5) and Yaqut al-Rumi (d. 626/1229) showed perplexity over what\nthese three took from one another and whether they were not really just one or two individuals.\nA solution came in 1871, when M. J. de Goeje (1836-1906) showed that these were indeed\nthree distinct authors; that the geographical work of the first of them, Balkhi, was no longer\nextant; and that the other two composed distinct, although related, books. Afterward, scholars\nwent on to associate this 'Balkhi school' with a collective project that they called 'the atlas of\nIslam' (Kramers 1932; Krachkovskii 1957, 194-219; Miquel 1967-88, 1:267-330; Miller 1986\n1.1.17, 5:109; Hopkins 1990, 312-15; Tibbetts 1992b).\nThe founding figure was the courtier and littérateur Abū Zayd al-Balkhi (d. 322/934), who\ncomposed a Book of the Image of the Earth (Kitab Surat al-ard). This began with a map of the world\nand then presented twenty maps of provinces or \"climes\" with accompanying text. Balkhi's work\nwas taken up afterward by al-Istakhri (d. after 340/951), who traveled extensively and composed\na Book of Routes and Realms (Kitab al-masalik wal-mamalik,), revising Balkhi's maps while adding\nnew text. We know little else about the connection between these two, since Balkhi's maps\nand text became absorbed into Istakhri's or simply disappeared. Then in 331/943, a young man\nknown as Ibn Hawqal departed from Baghdad, intending to map and describe as many of the\nregions of the world as he could. Some time later, he met Istakhri (Ibn Hawqal 1938, 329-30).\nThe encounter is often said to have taken place in Sind, since Ibn Hawqal describes it in his\nchapter on that province, but this is incorrect, since Ibn Hawqal almost certainly never went there\n(Miquel 1967-88, 1:299–300).\nAccording to Ibn Hawqal, after they had shown each other some of their maps, Istakhri asked\nthe younger man to correct and continue his own work. Ibn Hawqal agreed, but after doing\nthis for a while, he decided to take over Istakhri's work on his own account and rewrite the\ntext, redraw the maps and publish it all under his own name. In the wake of this apparent act\nof plagiarism we have, first of all, a book called Routes and Realms ascribed entirely to Işṭakhri,\nand then we have Ibn Hawqal's work which exists in two main recensions, the first called Routes\nand Realms, and the second Image of the Earth. In both recensions, Ibn Hawqal incorporates\nIşṭakhri's text while adding new material of his own. In other words, while the younger writer\nhas devoured his predecessor whole, the predecessor's work has also survived, separately and\nunscathed.\nThe 'Balkhi School' is also usually considered to include the great work by Ibn Hawqal's\nyounger contemporary al-Muqaddasi (2nd half 4th/10th century), The Best Division for Know-\nledge of the Climes (Ahsan al-taqasim li-ma'rifat al-aqalim). Muqaddasi knew about Balkhi and,\napparently, about Istakhri (De Goeje 1871, 47-8). However, even though he and Ibn Hawqal\nwere engaged in similar projects, they show no awareness of one another, whether out of igno-\nrance or jealousy.\nLike other Islamicate geographers, the 'Balkhi' authors show respect for the Ptolemaic tra-\ndition. In practice, however, they follow different principles, especially by using the iqlim as an\norganizing principle not in its Ptolemaic sense, but in a sense more akin to the Persian kishvar.\n171",
  "7": "Bonner\nAs a result, iqlim for them means something like province. Accordingly, the question of where to\ndraw the lines, how to delineate an iqlim, ranks high among their concerns. We may recall that\nthis was a time of political fragmentation, as the Abbasid caliphs lost all their territories and most\nof their authority. For the 'Balkhi' authors, the \"climes\" do not pertain to a caliphate (khilafa), or\neven to a juridically constructed Abode of Islam (dar al-Islam) but rather to a \"Realm of Islam\"\n(mamlakat al-Islam). Like the individual provinces, this realm is defined not only by religious\nand political criteria but also by cultural and economic ones. The work of the 'Balkhi' authors\nhas accordingly been described as the high point of an Islamicate 'human geography' (Miquel\n1967-88, 1: 267-330).\nAll this may help us understand another difference between the 'Balkhi' authors and their\npredecessors. Beginning with Ibn Khurradādhbih, travelers' itineraries are an essential feature\nof the geographical literature, extending through individual provinces all the way to the end of\nthe Islamic world, and constituting the communications network of a great empire. At times,\nIbn Khurradādhbih and his successors also look beyond the frontiers, relaying information\nabout India, China, Byzantium and so forth. Now, however, while the 'Balkhi' authors pre-\nsent itineraries as painstakingly detailed as their predecessors, they delineate them within the\nbounds of individual provinces (Figure 1.13.1). At the same time, with regard to their overall\nصورة المغرب\nداری بانه\nنخليه\nستون\nمسافر المرير\nفاس\nنامرت\nتروبله\nFigure 1.13.1 Map of the Maghrib, from al-Istakhri's Book of Routes and Kingdoms; MS Gotha, Research\nLibrary, orient. A 1521, fol. 13a.\nSource: Research Library, Gotha\n172",
  "8": "Geography and mapmaking until 700/1300\ncoverage, the 'Balkhi' authors limit themselves (at least in principle) to the treatment of the\nIslamic world: a restriction which results logically from their deployment of the concepts of\niqlim and mamlakat al-Islam. For similar reasons, the frontier regions where Islam comes\nup against other polities and civilizations - have less importance for them than for, say, Ibn\nKhurradadhbih or Qudama.\nWith the exception of their eponymous founder, the 'Balkhi' authors are neither bureau-\ncrats nor courtiers. They do share a need for autonomy, even privacy, in areas including their\npersonal life, where they come across as solitary figures. In their religious life, Ibn Hawqal and\nperhaps Muqaddasi have Ismaili associations, which they mainly keep to themselves. For\ntheir professional activities, they conduct commerce, mostly on their own account. They\nshow expertise in fiscal administration, commerce, agriculture, architecture, theology, law and\njust about everything else. What unites them above all is their critical acumen and power of\nobservation. They articulate and follow research methods of remarkable sophistication; among\nthe earlier (nonmathematical) geographers, it is al-Ya'qūbi who most has this in common\nwith them.\nFinally, a defining and original characteristic of the 'Balkhi school' is its use of maps. We do\nnot know what models Balkhi himself used for these, but it seems that in his work the maps\nheld pride of place while the text provided commentary. In Işṭakhri, however, the text can\nfunction without the maps. The same applies to Ibn Hawqal, while Muqaddasi's maps may\neven seem superfluous at times. In later centuries, however, the maps came to enjoy more\npopularity than the texts and acquired complex transmission histories of their own. Some\nmodern scholars have maintained that these 'Balkhi school' maps appeared in two distinctive\nvarieties, the 'Iṣṭakhri' and the 'Ibn Hawqal' types. However, this division is difficult to trace,\nespecially in its earlier stages, since the earliest complete (or nearly complete) set of 'Balkhi\nschool' maps that we have, accompanying an Ibn Hawqal manuscript, dates from around a\ncentury after the author's lifetime, while most extant examples date from considerably later\nthan that. All the 'Balkhi school' maps have distinctive features in common, including a lack\nof indications of latitude and longitude, and a predilection for simple geometrical shapes and\nstraight lines. They show the inhabited world enclosed by the Encircling Sea (al-baḥr al-mubit)\nor Ocean, with two large inlets extending inland from this sea, forming the Sea of the Romans\n(Mediterranean) and the Sea of the Persians (Indian Ocean, Arabian Sea, Persian Gulf, Red\nSea). In the following centuries, these became shared features of most Islamicate world maps.\nVery recently, Karen Pinto (2016) has identified a symbolic vocabulary of meanings for these\nfeatures and traits. She considers many historical sources for them and identifies Iranian,\nrather than Greco-Roman tradition, as their primary source. She also, less convincingly,\ndeprives Balkhi and his 'school' of the creative role usually attributed to them in cartographical\ntradition.\nI.13.6 Geography after the unitary caliphate\nAll the literature discussed so far has been in the Arabic language. But now a major work in\nPersian finally arrives, the Regions of the World (Hudud al-'alam) by an unknown author, dated\nto 272/982 (Minorsky 1937). This comprehensive and well-organized work probably has the\n(now-lost) Arabic-language Routes and Realms of Jayhānī as a major source. It also makes exten-\nsive use of Istakhri and perhaps Ibn Hawqal and lists no coordinates of longitude and latitude for\nits place-names. It accordingly has affinities with the 'Balkhi school.' On the other hand, it does\nnot include maps, apparently even in its original form, although it does occasionally refer\n173",
  "9": "Bonner\nto a single map (surat), apparently of the world (Tibbetts 1992c, 138-9). In style and tone, it is\ndirect and unornamented.\nIn 2002, the Bodleian Library of Oxford acquired an Arabic manuscript by an unknown\nauthor titled The Book of Curiosities of the Sciences and Marvels for the Eyes (Kitab ghara'ib al-funun\nwa-mulaḥ al-'uyun). Online access was provided and in 2014 a full, illustrated edition and\ntranslation appeared (Rapoport and Savage-Smith 2014). Both manuscript and modern edi-\ntion are indeed \"marvels for the eyes.\" The editors date the composition of the work to the\nearly to mid-5th/11th century, with Fatimid Egypt the likely place of origin. The manuscript\nitself was copied, according to the editors, probably around the turn of the 7th/13th century.\nWhile the text corresponds to the time in question (before 442/1050), the maps are almost\ncertainly different from the originals, although it is difficult to say how much so since here,\nas with the 'Balkhi' maps, we have no direct knowledge of the first century or so of their\nexistence. One of the world maps resembles the famous round map associated with al-Idrisi.\nThe manuscript also includes a rectangular world map and maps of three great seas, five rivers\nand various formations in the Mediterranean (Figure 1.13.2), the area of greatest interest to\nthe author and his readers.\nThe Book of Curiosities differs from the geographical literature discussed so far, in being\ndivided into two parts (maqalas), the first on the heavens and their influence and the second on\nthe earth. In the second part, the author claims to follow Ptolemy's Geography, but he actually\nproceeds somewhat, although not entirely, in the manner of the 'Balkhi' authors; the geo-\ngraphical authors on whom he relies most are Mas'udi and Ibn Hawqal. The work concludes\nwith a section on wonders (aja'ib). The Book of Curiosities is of high interest for many reasons,\nincluding its context of courtly patronage under the Ismaili Shi'i caliphate of the Fatimids, at\na time when their old rivals, the Abbasids of Baghdad, no longer enjoyed much authority or\neven autonomy.\nFigure 1.13.2 Map of the Mediterranean Sea, from the Book of Curiosities written by an anonymous author\nfrom Fatimid Egypt; MS Oxford, Bodleian Library, Ar. 90 c., fols 30b-31a.\nSource: Bodleian Libraries, University of Oxford, Oxford\n174",
  "10": "Geography and mapmaking until 700/1300\nI.13.7 al-Birūni\nWe have seen that a number of scholars after al-Khwārazmi continued to work on mathema-\ntical and astronomical geography, while their administratively - and humanistically-oriented\ncolleagues received more attention. Now, however, at least from our perspective, mathematical\ngeography recovers the spotlight with al-Birūni, who spent much of his career in the service\nof the Ghaznavids, in the easternmost regions of the Islamicate world. Birūnī made a supreme\ncontribution to 'human geography' with his book on India (Bīrūni 2000). On the more strictly\nmathematical side, like his predecessor Ibn Yunus (d. 399/1009), Biruni combined geographical\ncoordinates with tables of stellar coordinates. His Handbook for al-Mas'ud (al-Qanun al-mas'udi)\nprovided the best tables of latitude and longitude available at the time, covering an unprece-\ndented total of 600 places. In doing this, Birūnī addressed the old problem of the measurement\nof a single degree of latitude (Tibbetts 1992c, 141-2). As is well known, he arrived at a remark-\nably accurate figure for the circumference of the earth. He criticized the theory of projections\nthat he attributed to Marinus of Tyre (c. 70-130) and Ptolemy of Alexandria and proposed\ninstead the method that we know now as the equidistant azimuthal projection. In this projection,\nall points on a map are at proportionally correct distances from the center point; they are also at\nthe correct direction (or azimuth) from the center point. This method was taken up afterward\nby Gerard Mercator (1512-1594) and other cartographers of the early modern era and remains\nprominent in contemporary mapmaking.\nThese advances had relatively little effect on Islamicate cartography overall, with one major\nexception. Until this time most geographers had thought that at the southern end of the world,\nthe landmass that we now call Africa extended eastward as far as China, where it met the Sur-\nrounding Sea. The resulting confusion between \"Ethiopia\" and \"India\" pervaded medieval Euro-\npean travel literature. Birūni proved that this was wrong and, in his Book of Instruction in Astrology\n(Kitab al-Tafhim li-şina'at al-tanjim), included a sketch map of the inhabited world that became\ninfluential and widely used.\nI.13.8 al-Idrisi\nOne cartographer and geographer who did not follow Birūni in this last matter was one of the\nmost remarkable figures in the entire tradition, al-Idrīsi. A scholar of noble descent from Ceuta,\nMorocco, al-Idrisi received an invitation to the court of the Norman king Roger II of Sicily\n(r. 1130-1154), which had been conquered from the Muslims over half a century previously.\nThere, he became involved in a project of constructing a large-scale world map that, in its\nsurviving versions, is closely related to the world map accompanying the Fatimid-era Book of\nCuriosities (Rapoport and Savage-Smith 2014, 31). Al-Idrisi also undertook the composition of\na book combining maps with texts. In his introduction, he relates how it all began:\n[King Roger] ordered that a disk should be prepared for him of pure silver and divided\ninto massive, bulky sections.... He ordered the workers to engrave upon it the like-\nnesses of the seven climes with their countries, regions, shores, rural areas, gulfs, seas,\nand watercourses... inhabited and uninhabited places... well-trodden routes...\nand distances.... He also ordered them to compose a book [to which he] added a\ndescription of...the countries and lands, with regard to their people, places, locations,\nlikenesses, seas, mountains, distances, crops and revenues; the types of their buildings\nand the characteristics of the [economic] activities performed there; the industries\naccording with them; the merchandise carried to and from them; the marvels ...\n175",
  "11": "Bonner\nassociated with them; and [their] relation to the seven climes, all the while keeping\naccount of their inhabitants' condition, appearance, mores, costume and speech. [King\nRoger] ordered that this book should be named The Book of Pleasant Journeys into Far-\naway Lands (Kitāb nuzhat al-mushtaq fi khtiraq al-afaq). This took place in the first ten\ndays of January, corresponding to Shawwal of the year 548. Here I execute his order\nand command.\n(al-Idrīsī 1970, 1: 6-7)\nAl-Idrisi prudently attributes everything to his royal patron, but more important, we see a con-\nvergence between 'human geography' of the 'Balkhi' type and the mathematical-astronomical\ngeography of Ptolemy and al-Khwārazmi. Later in his introduction, al-Idrisi says that he began\nby drawing the usual seven latitudinal lines across the inhabited world and then drew ten lon-\ngitudinal lines, thus achieving a grid with seventy rectangular units. He then provided each of\nthese with a detailed map and description. This procedure allowed al-Idrisi to combine the two\ndominant modes of Islamic cartography within a single format. Claiming to follow Ptolemy,\nal-Idrisi gave coordinates of latitude and longitude. At the same time, and most remarkably, he\nprovided a summa of Arabic geographical learning up to his time while concomitantly pursuing\nempirical knowledge wherever he could find it and from anyone who would provide it to him,\nnot only in the Mediterranean environment (Figure 1.13.3) but all the way to the northern coast\nof Europe, where at some time he apparently went himself.\nAl-Idrisi also composed a shorter book titled The Gardens of Delight and the Diversion of Souls\n(Rawd al-faraj wa-nuzhat al-muhaj), possibly an abridgment of The Pleasure Excursion but more\nlikely an independent work (Maqbul 1992, 157-8, 163-7). Consisting largely of itineraries and\ndistances, The Gardens of Delight includes an additional clime (iqlim) just south of the equator,\nwhich it considers together with the \"usual\" first clime. It includes 73 sectional maps, smaller,\nless detailed, and less unified in format than the maps of The Pleasure Excursion.\nFigure 1.13.3 Map of a part of the Mediterranean Sea and adjacent territory around Tunis, from al-Idrisi's\nwork The Book of Pleasant Journeys into Faraway Lands (Kitab nuzhat al-mushtaq fi khtiraq al-\nafaq); MS Oxford, Bodleian Library, Greaves 42, fols 115b-116a.\nSource: The Bodleian Libraries, University of Oxford, Oxford\n176",
  "12": "Geography and mapmaking until 700/1300\nBecause of his service for a European Christian prince, al-Idrisi had a problematic reputation\nin later Islamic scholarship. Nonetheless, he had considerable influence over later geographers\nand historians including the North Africans 'Ali ibn Mūsā ibn Sa'id al-Maghribi (d. 685/1286)\nand Ibn Khaldun (732-808/1332-1406), and, in the Timurid East, Hafiz-i Abrū (d. 883/1430).\nThe round world map associated with al-Idrisi dates from after his lifetime and is now the best-\nknown image from all of Islamic cartography.\nI.13.9 Other developments\nThe term geographical may seem inappropriate when applied to all the maps and texts dis-\ncussed so far and those still remaining to be discussed. It certainly was not the term of choice\nfor those authors and mapmakers themselves, for whom jughrafiya meant about the same\nthing as sūrat al-ard, image or map of the world. We still use it now, however, in part because\nof the lack of an alternative. Interestingly, when our geographical authors proclaimed their\nambitions and projects, sometimes they did not identify their subject matter and discipline\nin a coherent or uniform way (e.g., Ibn Hawqal 1938, 3-4). Meanwhile, the broad category\nof geographical literature includes subgenres that we have not covered here, because of lack\nof space. These include the literature of travelers on land and sea that overlaps, notably, with\nthe narratives of the 'Balkhi' authors. Another subgenre is that of \"wonders of the world,\"\nwhich enjoyed popularity and became increasingly integrated into 'mainstream' geography,\nespecially in the Wonders of Creation ('Aja'ib al-makhluqāt) of al-Qazwini (d. 682/1283). And\nfinally, we have the encyclopedias of place-names, of which the greatest is the Dictionary of\nthe Countries (Mu'jam al-buldan) of Yaqut al-Rūmi (d. 626/1229). This reader-friendly work\npresents thousands of place names in alphabetical order, providing ample literary, historical\nand indeed, geographical information. Today it remains an indispensable tool for students\nand scholars, enduring testimony to the fascination, utility and enjoyment that this geo-\ngraphical literature brings.\n1 Consolidated bibliography.\nNotes\n2 The first printed edition of Istakhri (Leiden, 1870) has no maps, since the editor had none available. The\nsecond edition (Cairo, 1961) does include maps.\nBibliography\nSources\nal-Baladhuri, Aḥmad ibn Yahya. ed. de Goeje, M. J. 1866. Kitāb Futūḥ al-buldan [The Book of the Conquest\nof the Countries]. Leiden: Brill.\nal-Birūni. tr. and ed. Sachau, E. 2000. Alberuni's India. London: Routledge.\nIbn al-Faqih al-Hamadhani. 1885. \"Kitāb al-Buldan [The Book of the Countries],\" in BGA 5.\nIbn Hawqal, Abu l-Qasim al-Naşibi. ed. Kramers, J. H. 1938. \"Kitāb Şürat al-ard [The Book of the Image of\nthe Earth],\" BGA 2 [English tr. by Bonner, M. forthcoming. Reading: Garnet].\nIbn Khurradadhbih, Abu l-Qasim. 1889. \"Al-Masalik wa-l-mamalik [The Routes and the Realms],\" in\nBGA 6.\nIbn Rusta, Abū 'Ali Aḥmad ibn 'Umar. 1892. \"al-Alaq al-nafisa [The Precious Gems],\" BGA 7.\nal-Idrisi, Abū 'Abdallah Muḥammad. 1970-84. Opus geographicum [...]= Nuzhat al-mushtaq fikhtiraq al-äfäq\n[Geographical Work (...) = The Book of Pleasant Journeys into Faraway Lands], eds. Bombaci, A., et\nal. Leiden: Brill.\n177",
  "13": "Bonner\nal-Istakhri, Abū Ishaq Ibrāhīm. 1870. Al-Masalik wa-l-mamalik [The Routes and the Realms], ed. M. J. de\nGoeje, M. J. BGA 1. [newly ed. by M. Hini. 1961. Cairo: Wizarat al-Thaqāfa].\nal-Mas'ūdī. 1894. \"Al-Tanbih wa-l-ishraf [The Notification and the Verification],\" BGA 8.\nMinorsky, V., ed. and tr. 1937. Hudud al-'alam [The Regions of the World]. London: Luzac.\nal-Muqaddasi, Shams al-Din Abū 'Abdallah Muḥammad. 1877. \"Ahsan al-taqasim fi ma'rifat al-aqālīm [The\nBest Divisions for Knowledge of the Regions],\" in BGA 3 [Collins, B. A., tr. Reading: Garnet, 1994].\nal-Qazwini, Zakariyya' ibn Muḥammad. ed. Wüstenfeld, F. 1849. Ajaib al-makhluqat [The Wonders of the\nCreated (Beings)]. Göttingen: Dieterichsche Buchhandlung.\nQudāma ibn Ja'far. ed. al-Zubaydi, M. H. 1981. Kitab al-kharaj wa-sina'at al-kitaba [The Book of Taxes and\nthe Art of Calligraphy]. Baghdad: Dar al-Rashid li-l-nashr.\nRapoport, Y. and Savage-Smith, E., trs. and eds. 2014. An Eleventh-Century Egyptian Guide to the Universe:\nThe Book of Curiosities. Leiden: Brill.\nal-Tabarī, Muḥammad ibn Jarir. eds. de Goeje, M. J. et al. 1879-1901. Tarikh al-rusul wa-l-muluk [History of\nProphets and Kings]. Leiden: Brill [Reprint: 2010].\nal-'Umari, Shihab al-Din. 1924. Masalik al-absar fi mamalik al-amsar [The Ways of Discernment into the\nRealms of the Capital Cities]. Cairo: Dar al-kutub al-mişriyya.\nal-Ya'qubi, Ibn Abi Ya'qub ibn Wadiḥ. 1892. \"Kitāb al-Buldan [The Book of the Countries],\" in BGA\n7.\nYaqut, Abū 'Abdallah Ya'qub al-Hamawi al-Rūmi. 1955. Mu'jam al-buldan [Dictionary of the Countries].\nBeirut: Dār Şadir.\nResearch literature\nBalty-Guesdon, M.-G. 1992. \"Le Bayt al-hikma de Bagdad,\" Arabica 39: 131-50.\nBrentjes, S. 2007. \"Khwarizmi,\" in Hockey et al., eds. [CB], 631-3.\nDe Goeje, M. J. 1871. \"Die Istakhri-Balkhi Frage,\" ZDMG 25: 41-58.\nHeck, P. 2002. The Construction of Knowledge in Islamic Civilization: Qudama b. Ja'far and His Kitāb al-kharāj\nwa-sina'at al-kitaba. Leiden: Brill.\nHopkins, J. F. P. 1990. \"Geographical and Navigational Literature,\" in Young, M. J. L., et al., eds. Religion,\nLearning and Science in the 'Abbasid Period. Cambridge: Cambridge University Press, 301-27.\nKennedy, E. S. and Kennedy, M. H. 1987. Geographical Coordinates of Localities from Islamic Sources.\nFrankfurt am Main: Institut für Geschichte der Arabisch-Islamischen Wissenschaft, Johann-Wolfgang-\nGoethe-Universität.\nKrachkovskii, I. J. 1957. Arabskaya geograficheskaya literatura. Izbranniye sochineniya. Vol. 4. Moscow and\nLeningrad: Izdatel'stvo Akademii Nauk SSSR.\nKramers, J. H. 1932. \"La question Balhi-Isṭahri et l'atlas de l'Islam,\" Acta Orientalia 10: 9-30.\nKramers, J. H. 1954a. \"La littérature géographique classique des Musulmans,\" in Analecta Orientalia. Leiden:\nBrill, 172-204.\nKramers, J. H. 1954b. \"Al-Biruni's Determination of Geographical Longitude by Measuring the Distances,\"\nAnalecta Orientalia. Leiden: Brill, 205-22.\nMaqbul Ahmad, S. 1992. \"Cartography of al-Sharif al-Idrisi,\" in GTISAS, 156-74.\nMaqbul Ahmad, S. 1995. A History of Arab-Islamic Geography, 9th-16th Century AD. Mafraq: Al al-Bayt\nUniversity.\nMaqbul Ahmad, S. 1973-1978.\"Djughrāfiyā,\" in El-2, 4: 575-87.\nMiller, K. 19862 [1926-1931]. Mappae arabicae. Arabische Welt- und Länderkarten des 9-13 Jahrhunderts.\nWiesbaden: L. Reichert.\nMiquel, A. 1967-1988. La géographie humaine du monde musulman jusqu'au milieu du 11° siècle. Paris: Mouton,\nEHESS.\nNallino, C. A. 1944. \"Al-Khuwarizmi e il suo rifacimento della Geografia di Tolomeo [al-Khwarizmi and\nHis Rewriting of Ptolemy's Geography],\" Raccolta di scritti editi e inediti. Rome: Istituto per l'Oriente, 5:\n458-532.\nPinto, K. 2016. Medieval Islamic Maps: An Exploration. Chicago: University of Chicago Press.\nRichter-Bernburg, L. 2016. \"Potemkin in Baghdad: The Abbasid 'House of Wisdom' as Constructed by\n1001 Inventions,\" in Brentjes et al., eds. [CB], 121-32.\nRosenthal, F. 1968. A History of Muslim Historiography. Leiden: Brill.\nSilverstein, A. 2007. Postal Systems in the Pre-Modern Islamic World. Cambridge: Cambridge University\nPress.\n178",
  "14": "Geography and mapmaking until 700/1300\nTibbetts, G. 1992a. \"The Beginnings of a Cartographic Tradition,\" in GTISAS, 90-107.\nTibbetts, G. 1992b. \"The Balkhi School of Geographers,\" in GTISAS, 108-36.\nTibbetts, G.1992c. \"Later Cartographic Developments,\" in GTISAS, 137-55.\nZadeh, T. 2011. Mapping Frontiers Across Medieval Islam: Geography, Translation and the 'Abbasid Empire.\nLondon: Tauris.\n179"
}