{
  "1": [
    {
      "label": "section_header",
      "text": "1.6 THE ASTRAL SCIENCES THROUGH THE 7TH/13TH CENTURY",
      "bbox": {
        "l": 159.0,
        "b": 755.0,
        "r": 594.0,
        "t": 909.0
      }
    },
    {
      "label": "section_header",
      "text": "Attitudes, experts and practices",
      "bbox": {
        "l": 206.0,
        "b": 705.0,
        "r": 546.0,
        "t": 732.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 206.0,
        "b": 705.0,
        "r": 546.0,
        "t": 732.0
      }
    },
    {
      "label": "text",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 321.0,
        "b": 653.0,
        "r": 431.0,
        "t": 673.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 321.0,
        "b": 653.0,
        "r": 431.0,
        "t": 673.0
      }
    },
    {
      "label": "text",
      "text": "‘This chapter discusses knowledge about the heavens as a whole, by attempting, as far as possible, to discuss astronomy and astrology together. It acknowledges that in certain periods the distance between astronomy and astrology was greater than in others. The chapter begins with a discus- sion of the classification of the astral sciences and then moves on to debates, mostly about theo- ries and to a lesser extent about practices. It concludes with a section on mathematical practices. It thus pays attention to several themes that previous surveys of the astral sciences in Islamicate societies ignored or marginalized and abstains from repeating summaries of astronomical themes found in previous surveys (Rashed and Morelon 1996{CB];! Morrison 2013).",
      "bbox": {
        "l": 101.0,
        "b": 456.0,
        "r": 652.0,
        "t": 597.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.1 Introduction",
      "bbox": {
        "l": 306.0,
        "b": 406.0,
        "r": 445.0,
        "t": 420.0
      }
    },
    {
      "label": "text",
      "text": "Until recently, a more or less strict division between mathematical astronomy and predictive astrology was considered appropriate for the study of astral knowledge in all Islamicate societies after about 145/762. Saliba (1982; reprint 1994[CB], 66, 72), for example, suggested that the emergence of the science ofthe configuration [ofthe universe] (‘lm al-hay’a) was the result of scholars defending mathematical astronomy against attacks by religious scholars on astrology. The clearest expression of this trend is the separation of terminologies, concepts and practices in astronomy and astrology.",
      "bbox": {
        "l": 101.0,
        "b": 268.0,
        "r": 652.0,
        "t": 391.0
      }
    },
    {
      "label": "text",
      "text": "Aiming to avoid earlier overgeneralizations and essentializing judgments, Ragep (2009) iden- tified the motivations for practicing the astral sciences in Islamicate societies as practical, religious, philosophical and political. He argued that the rejection of astrology by various religious scholars was only one among the many reasons for the emergence of the science of the configuration [of the universe] and that this rejection took various forms. Moreover, according to my experiences in ‘manuscript libraries and with manuscript catalogues, numerous treatises presenting themselves as books on the science of configuration (‘lm al-hay’a) include chapters on astrological themes.",
      "bbox": {
        "l": 101.0,
        "b": 142.0,
        "r": 652.0,
        "t": 265.0
      }
    },
    {
      "label": "text",
      "text": "In this handbook, we are also making a serious effort to avoid such overgeneralizations and modern classifications. I have encouraged contributors to use the term asinal sciences and render the actors’ self-designation munajjimin as astral experts. Due to differences in opinion,",
      "bbox": {
        "l": 102.0,
        "b": 88.0,
        "r": 652.0,
        "t": 139.0
      }
    },
    {
      "label": "page_footer",
      "text": "DOI: 10.4324/9781315170718-8",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 263.0,
        "t": 64.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 263.0,
        "t": 64.0
      }
    },
    {
      "label": "page_footer",
      "text": "80",
      "bbox": {
        "l": 635.0,
        "b": 53.0,
        "r": 650.0,
        "t": 64.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "not everyone follows this approach; some continue differentiating between astronomers and astrologers according to themes, methods and problems. The decision to treat astral knowledge asa unit despite the numerous differences between practitioners, periods and regions is based on five points: (1) the absence of a specialized actor-related terminology separating astronomers from astrologers, (2) the presence of shared theoretical and mathematical components in the two domains, (3) the representation of practices and goals by historical actors, (4) the engagement in astrology of many scholars considered by modern historians of sciences primarily as astronomers and (5) the existence of many works treating the astral sciences as a whole.",
      "bbox": {
        "l": 89.0,
        "b": 809.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "One example will suffice to document such overlaps. Abii Sage al-Qabisi (mid~4th/10ch century) was a court astrologer of Emir Sayf al-Dawla (r. 333-356/945-967) in Aleppo. He studied Ptolemy's Almagest and probably other works on the mathematical sciences with another astrologer in his hometown of Mosul. Among his writings as a mature astral expert are a lost trea tise, apparently on questions concerning mathematical astronomy, called Doubts on the Almagest (Shukiik fi Maj), intended for testing people claiming astral expertise, a lost Book on the Rea~ id the Astronomical Handbooks (Kitab ‘lal al-27jat), the extant ‘Treatise on the Distances and (Heavenly) Bodies (Risala ft -ab'Zd wa-l-ajrdm), the extant Book on the Introduction in the Science of the Judgment of the Stars (Kitab al-Mudkhal ila sind‘at abkam al-nujim) and the extant Treatise on the ‘Testing of Those Who Call Themselves Astral Experts (Risala ft imtiban al-munajimin mimman huwa ‘muttasim bi-hadha L-ism). These books show that al-Qabisi was trained in all fields of the astral sciences and practiced them at the Hamdanid court. He insisted that the complete astral expert had to be solidly qualified in both species of the astral sciences; be able to solve all of their prob- ems “through his own intelligence,” not the mere repetition of texts or the use of an astrolabe; to be capable of rational demonstrations and proofs; and to be able to compile an astronomical handbook based on direct observations, not mere re-computations of data obtained from earlier scholars (Burnett 2002, 203-4; al-Qabisi 2004, 2-6). sons beh",
      "bbox": {
        "l": 89.0,
        "b": 503.0,
        "r": 639.0,
        "t": 806.0
      }
    },
    {
      "label": "text",
      "text": "‘The content, fields and texts of the predictive parts of the astral sciences in Islamicate societies have been expertly summarized in a recent article on astrology by Burnett (2007) in the third edition of the Encyclopaedia of Islam. Ragep (2009) published an analogous summary of some other parts of the astral sciences. The interested reader should consult both of them in conjunc tion with this chapter, although both articles contain several claims with which I disagree. A recent bibliographical survey of publications on the astral sciences in Islamicate societies until 1450 can be found on the website of the Ptolemaeus project at the Bavarian Academy of Science (https://ptolemaeus badw:de/astrobibl/section/G),",
      "bbox": {
        "l": 89.0,
        "b": 359.0,
        "r": 638.0,
        "t": 500.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.2 Classifications of the astral sciences",
      "bbox": {
        "l": 216.0,
        "b": 316.0,
        "r": 510.0,
        "t": 331.0
      }
    },
    {
      "label": "text",
      "text": "‘The purpose of this section is to shed some light on the contributions of philosophers to the astral sciences, to point to some of the fundamental differences between philosophers and some of the astral experts and to stress that the adoption of Aristotelian natural philosophy and epis- temology as the foundations of the astral sciences was neither a simple, straightforward process nor an uncontested commitment.",
      "bbox": {
        "l": 89.0,
        "b": 215.0,
        "r": 638.0,
        "t": 302.0
      }
    },
    {
      "label": "text",
      "text": "Chasifications of the astral sciences were manifold, contradictory and in continuous flux ‘Two main positions existed: (1) astral knowledge is one discipline with different species, and (2) astral knowledge belongs to two different sciences marked by different epistemological values. ‘The non-prognosticating parts were understood as forming a mathematical discipline, which wwe call today astronomy. The prognosticating parts, which we call astrology, were defined in two ways: (1) a second component of the astral sciences as a mathematical discipline and (2) a subdiscipline or branch of natural philosophy. The subsequent issue was how to define the",
      "bbox": {
        "l": 89.0,
        "b": 88.0,
        "r": 638.0,
        "t": 212.0
      }
    },
    {
      "label": "page_footer",
      "text": "al",
      "bbox": {
        "l": 357.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "3": [
    {
      "label": "section_header",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "relationship between the two species or sciences: Were both parts of equal standing, or were they in a hierarchical relationship, and if so, which one of the two should precede the other? A third question asked whether one or both should be based on an epistemically higher discipline from which their principles and foundational proofs had to be derived. If affirmed, the higher discipline was natural philosophy. A fourth issue concerned the reliability of methods and the soundness of theories.",
      "bbox": {
        "l": 102.0,
        "b": 846.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "‘The answers to the first two questions depended on views about the positions of the math- ematical sciences in the entire system of knowledge, the role of philosophy regarding revelation or religious law, and the classification of the philosophical disciplines. The answers to the third question usually depended on how scholars saw the role of Aristotelian epistemology as ela~ borated in the Posterior Analytics in the system of the sciences. The positions taken in regard to the fourth question reflected religious beliefs, experiences with predicted results and the social status of practitioners (Burnett 2002). Behind these questions addressed to the astral sciences more general debates lurked that had emerged in antiquity: What were the status, objects and methods of the three theoretical parts of philosophy (metaphysics, natural philosophy, the mathe- ‘matical sciences), their interrelations and the character of their results (conjectures or certain knowledge)? Among the ancient scholars who had grappled with these issues (Bowen 2007; Feke 2014, 2018), three were certainly known through translations of parts of their works: Geminus (¢. 70 cE), Hero (Ist century) and Ptolemy (c. 100-170). They reinterpreted the relationship and ranking between the three theoretical disciplines of philosophy in favor of the mathematical sciences, on the basis of the certainty of their proofs and hence the knowledge they engendered. It is, however, still unclear whether their opinions guided some of the debates briefly summarized in this section or inspired some of the deviating positions attributed to scholars mentioned below.",
      "bbox": {
        "l": 102.0,
        "b": 522.0,
        "r": 652.0,
        "t": 841.0
      }
    },
    {
      "label": "text",
      "text": "‘The works of al-Kindi (d. c. 256/870) and his associate Abii Ma'shar (171-272/787-886) marked out an important position. They agreed that contrary to common belief the science of the stars was not based on conjecture and guesswork but was firmly grounded on first principles. It worked with analogical reasoning and demonstrations on the basis of reliable observations and trustworthy experience (Abi Ma'shar 2019[CB], 1: 46-7, 54-69). Abii Ma'shar believed that this science consisted of two species. The first was the science of the universe. This was appa rently a mathematical science, since it contained the science of quality and quantity of the higher spheres, and because its arguments were derived from arithmetic, geometry and the science of measurement. The second, the science of the judgments of the stars, was the knowledge of the natures of the planets, the powers of their movements and their impacts on the sublunar world, Hence, it was not a mathematical science but connected to natural philosophy. These two spe~ cies were not on an equal footing, since the second species received its information from the first (Abii Ma'shar 2019, 52-5). On the other hand, Abii Ma'shar affirmed that aspects of the second species that are not obvious and clear are “inferred by means of clear analogies (rational arguments) from the science of the natures of things (physics)” (Aba Ma'shar 2019, 1: 55). At the same time, the science of the stars was universal, like medicine, but higher and nobler than this discipline, because its objects belonged to the celestial realm (Abii Ma'shar 2019, 1: 68-71) According to Adamson, Abii Ma‘shar defended this position through theological types of rea~ soning following a precedent set by al-Kindi (Adamson 2002, 249-51).",
      "bbox": {
        "l": 102.0,
        "b": 179.0,
        "r": 653.0,
        "t": 517.0
      }
    },
    {
      "label": "text",
      "text": "In the 4th/10th and 5th/1 Ith centuries, a number of authors with different intellectual affi- liations and standing wrote short texts on how to arrange, evaluate and define the various fields of knowledge. Most writers discussed the fields of knowledge as a whole. A few chose other approaches such as a classification by technical terminology or the practices of the people who engaged in such matters. Differences in goals and social contexts yielded differences in emphasis,",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 652.0,
        "t": 176.0
      }
    },
    {
      "label": "page_footer",
      "text": "82",
      "bbox": {
        "l": 370.0,
        "b": 51.0,
        "r": 383.0,
        "t": 63.0
      }
    }
  ],
  "4": [
    {
      "label": "section_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "style and evaluation. Al-Tawhidi (d. 414/1023), a secretary and litterateur, treated the astral sciences like the medical sciences, setting both up from the perspective of the practitioners and dividing both fields into two parts — knowledge (‘ilm) and action (‘amal). While the description of medicine leaves little doubt that the practitioner should be well versed in both parts, the dis- cussion of those who contemplate the stars is more equivocal. The beginning of the description implies that the practitioner applies himself to both parts, the first part being the conditions of the stars, the differences between their ways and stations, their rising and setting, and the second being the exploration of the judgments of the stars regarding future matters. But after the enumeration of these content elements it becomes clear that it would be best to deal only with the first part. Not only are the tasks of the second part more demanding and less certain in their implementation, but the gains are also poor and the impact on society more damaging than ignorance (which al-Tawhidi despised). Pursuing the first part leads directly to astonishment followed by an opening of the heart and an enlargement of the breast that reinforce belief in and veneration of God (al-Tawhidi 1963-1964, 267, Arabic PI. 2).",
      "bbox": {
        "l": 89.0,
        "b": 701.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "In the late 3rd/9th and early 4th/10th centuries (Callatay 2013, 301), a work ascribed to a group called the Brethren of Purity (Iklwiin al-safa’) began to take shape. This group alle- gedly consisted of well-educated religious scholars. Their affiliation within Islam remains puzz- ling, although numerous features of their encyclopedia of 51 or 52 individual treatises (Ikhwn al-Saff’ 1957[CB}) were believed to suggest an inclination toward several Shi denominations. Recently, De Vauls d’Arcy proposed a different interpretation arguing for al-Kindi’s student and later courtier Ahmad ibn al-Tayyib al-Sarakhsi (d. 286/899) as the sole author of this collection of treatises (https://journals.openedition.org/mideo/3397#lang=ar). Whoever authored the col- lection took several stances in the epistles concerning classification, only one of which can be mentioned here as an example. At the beginning of their Third Epistle: On Astronomy (al-Risala al-thalitha ft astruniamiya), they split the mathematical part of the science of stars into two species so that the whole discipline now encompassed three species: (1) the science of the configura- tion [of the universe] (‘lm al-hay’a), (2) the science of understanding astronomical handbooks, almanacs, calendars and (3) the science of judgments (Ikhwan al-Safi’ 2015, 25). Within the epistle they only treated the first and third parts, mentioning the second part only in four brief sentences (Ikhwan al-Safi’ 2015, 59).",
      "bbox": {
        "l": 89.0,
        "b": 413.0,
        "r": 639.0,
        "t": 698.0
      }
    },
    {
      "label": "text",
      "text": "‘The philosopher al-Farabi (d. 339/950-1) went in a different direction. He divided the sin gle science of the stars into two different sciences, placing the science of the judgments of the stars before the mathematical science of the stars (‘lm al-nujiim al-ta‘in; al-Farabi 1996[CB] 57). Their contents differed only in minor details from the views of his predecessors (al-Farabi 1996, 58-61)",
      "bbox": {
        "l": 89.0,
        "b": 324.0,
        "r": 638.0,
        "t": 410.0
      }
    },
    {
      "label": "text",
      "text": "Ibn Sind (d. 428/1037), himself a famous and highly influential philosopher, mixed Neo platonic and Aristotelian perspectives in his classifications of the sciences, including the astral sciences. His oeuvre is, however, too rich to summarize here. As an example, a brief summary from his early ‘Treatise on the Parts of the Rational Sciences (Risdla ft agsdm al-‘ulim al-‘agliyya) has to suffice. In this treatise, Ibn Sing presented his youthful understanding of the parts of Peripa- tetic philosophy as three theoretical sciences and three practical sciences. The astral sciences are discussed in the first two of the theoretical sciences: natural philosophy and the mathematical sciences. The second main part of the natural sciences encompasses knowledge about the main components of the universe such as the heavens, what they contain and the four elements, as established in Aristotle's On the Heavens (Ibn Sina 1298/1880, 75). Among the branches of the natural sciences, Ibn Sind lists first medicine, followed by the judgments of the stars (ibn Sind 1298/1880, 75). According to the Neoplatonic quadrivium, the science of the config- uration [of the universe] (‘lm al-hay’a) is the third of the fundamental mathematical sciences.",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 320.0
      }
    },
    {
      "label": "page_footer",
      "text": "3",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 338.0,
        "b": 979.0,
        "r": 414.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Its only subdiscipline concerns the compilation of astronomical handbooks and almanacs (Ibn Sind 1298/1880, 76). While the placement of the judgments of the stars by Ibn Sina has often been interpreted by modern historians as downgrading them, this is questionable. At least, it was not a new position when compared with the debates in the Hellenistic period about the question of whether Babylonian horoscopic astrology was a science and, if so, where it should be placed (Bowen 2007; Feke 2014, 297-8).",
      "bbox": {
        "l": 101.0,
        "b": 846.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "As seen in the brief survey of earlier classifications, even those scholars who considered the judgment of the stars as a species within one single science and equal in position and relevance to the configuration [of the universe], rarely saw the science of the judgments of the stars afield of mathe matical knowledge. The breaking apart of the two species and the equalization of medicine and the astral sciences as disciplines of equal rank and structural composition, while already consid ered by Abi Ma'shar, appear as classificatory principles only in the 4th/10th century.",
      "bbox": {
        "l": 101.0,
        "b": 737.0,
        "r": 652.0,
        "t": 842.0
      }
    },
    {
      "label": "text",
      "text": "In the late 6th/ 12th century, the influential religious and philosophical scholar Fakhr al-Din al-Raai (d. 606/1210) declared the judgment of the stars and other occult sciences to belong to the mathematical sciences (Melvin-Koushki 2017, 127). Under his impact and that of the Breth- ren of Purity, as well as Ibn Sing, the identification of the parts of the astral sciences shifted back and forth between natural philosophy and mathematics. This remained a constant feature of the debates in Islamicate societies until the 12th/18th century at the very least. A second significant feature of those debates consists in partitioning the astral sciences into an increasing number of disciplinary components, which were either portrayed as independent fields of knowledge or as subdisciplines. A third aspect is the relative instability of meaning and of relationships between such designations. Similarly, outside of treatises on classification, for instance in biographical dictionaries or historical chronicles, meanings and relationships between the content of subdis- Giplines remained unstable, as did the relationships to their practitioners.",
      "bbox": {
        "l": 101.0,
        "b": 521.0,
        "r": 652.0,
        "t": 735.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.3 Debates on astral theories and practices",
      "bbox": {
        "l": 215.0,
        "b": 476.0,
        "r": 538.0,
        "t": 493.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.3.1 Philosophical foundations",
      "bbox": {
        "l": 256.0,
        "b": 440.0,
        "r": 495.0,
        "t": 457.0
      }
    },
    {
      "label": "text",
      "text": "A good number of the many ancient Greek texts translated into Arabic during the 2nd/8th, 3rd/9th and 4th/10th centuries discussed the structure and properties of the universe. Among them were Plato’s (d. 348-347 ac) Timaios and Galen’s (129-216) commentary on it, Aris- totle’s (384-322 nce) On the Heavens and Alexander of Aphrodisias’s (late 2nd-early 3rd centu- ries) commentary, John Philoponuss (d. 574) and Aristotle's Meteorology and Theophrastus’ (c 371-287 ace) texts on weather phenomena (Lettinck 1999; Taub 2003). Combined with claims and arguments from Ptolemy's Almagest and Planetary Hypotheses, these translations provided the astral sciences in Islamicate societies with theoretical foundations that remained largely operative from the 3rd/9th until the 12th/18th century, although different authors occasionally ques- tioned and critically discussed various components.",
      "bbox": {
        "l": 101.0,
        "b": 251.0,
        "r": 652.0,
        "t": 428.0
      }
    },
    {
      "label": "text",
      "text": "Practitioners of the astral sciences believed that the universe was spherical and without void, that the earth was spherical and immobile in its center and that the universe was divided into an immutable part and a mutable part. The immutable part was filled by the fifth element ether. It began with the orbs supporting the moon and ended with the outermost sphere. The mutable part was the constantly changing world below the moon. It was composed of earth, as the heavi- est element, followed in ascending order by water, air and fire. The eternal bodies made up from ether, from the moon outward, moved uniformly and in a circle around a center, preferably the center of the universe. The bodies of the sublunar world were as a rule composed of different parts of the four elements and characterized by different degrees of the two qualities (hot, cold;",
      "bbox": {
        "l": 101.0,
        "b": 89.0,
        "r": 652.0,
        "t": 248.0
      }
    },
    {
      "label": "page_footer",
      "text": "84",
      "bbox": {
        "l": 369.0,
        "b": 52.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "6": [
    {
      "label": "section_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "wet, dry) of each element that formed part of the mixture. They resulted from different processes of generation and decay. Their so-called natural motion (a motion not caused by compulsion) went in a straight line to their natural place according to the heaviness of each body, depending on the mixture of the two heavy (earth, water) and the two light elements (air, fire) that com- posed it. Heavy bodies moved downward, while light bodies moved upward.",
      "bbox": {
        "l": 89.0,
        "b": 863.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "So far, there is no overarching study of the process that led to the adoption of those natural philosophical assumptions among experts in the mathematical sciences and, in particular, those who focused partly or entirely on the astral sciences. Based on existing research on specific texts and scholars, it seems likely that the scholars who were primarily responsible for the acceptance of this set of beliefs during the 3rd/9th century were philosophers like al-Kind, astrologers like ‘Aba Ma'shar and physicians like Hunayn ibn Ishaq (d. 260/873).",
      "bbox": {
        "l": 89.0,
        "b": 755.0,
        "r": 638.0,
        "t": 860.0
      }
    },
    {
      "label": "text",
      "text": "Al-Kindi addressed many questions concerning the universe, studying them from different perspectives. He was most interested in elucidating the connections between the celestial and terrestrial realms. He asked, for instance, how the planets can initiate transformations in the bodies of the sublunar world, if they consist of a different element, ether. How can they emit light and heat, like the element fire, when they consist of such a profoundly different element? ‘Why is it proper to attribute specific effects to each planet when all of them consist of one and the same element? As his fundamental position, al-Kindi declared that God is the cause for all that happens in the universe. However, God does not act directly but is the remote agent cause. In order to bring about change, the proximate agent causes are needed. These proximate agent causes are the planets. Al-Kindi established this position by using Aristotle’s theories of the four causes (material, agent, formal, final), the four qualities (hot, dry, cold, wet) and the four ele- ments (Adamson and Pormann 2012, 153-4). On how they achieve these changes, he offered three different lines of argumentation in different treatises apparently written in different periods of his life. According to the earliest one, planets cause sublunar processes due to the heat and friction that their movements create according to their speeds, sizes and distances. In another account, perhaps formulated late in his life, al-Kindi argued that changes happen because both planets and elements emit rays. In a third account, he attributed the planetary effects to math- ematical proportions and symbolic analogies (Adamson and Pormann 2012, 154-5, 162-4; Orthmann 2016, 730; Adamson 2020). The last treatise deals with weather forecasting, while the other two are cosmological and theological in orientation. These contradictory claims sug- gest that al-Kindi continued to reflect on the complex questions about the relationship between God, the celestial realm and the sublunar world, without achieving a coherent theory. But he did argue throughout that cosmological theories appropriated from ancient philosophy, in particular Aristotle, supported the fandamental Islamic beliefs in God’s role in the world (Adamson and Pormann 2012, 155-6).",
      "bbox": {
        "l": 89.0,
        "b": 305.0,
        "r": 639.0,
        "t": 752.0
      }
    },
    {
      "label": "text",
      "text": "‘Al-Kindi also shared some Platonic views, for example, that “the planets were rational, spiritual beings capable of intelligence and speech,” and hence the causes and administrators of everything in the sublunar world. Their activities followed the command of the Prime Creator who exercises through them control and providence over the sublunar world (Saliba 1994, 55; Adamson 2020). In the 4th/10th century al-Nawbakhti (d. c. 307/920) rejected such a position in a treatise specifically dedicated to this subject, Physical Arguments, Drawn from the Books of Aristotle, Negating Those Who Have Claimed ‘That the Heavenly Sphere is Living and Rational (Hwjaj tabiyya mustakbiraja min kutub Aristatalis fi -radd ‘ala man za‘ama anna I-falak bayy natiq).",
      "bbox": {
        "l": 89.0,
        "b": 161.0,
        "r": 641.0,
        "t": 302.0
      }
    },
    {
      "label": "text",
      "text": "Al-Kind?’s erstwhile opponent and later enthusiastic student Abii Ma'shar profited not only from his teacher’s knowledge of astral matters but also from his studies of Aristotelian and Neo- platonic philosophy. Like him he explained planetary effects on the sublunar world as resulting from their differences in motion. He insisted on the existence of a First Cause that operates those",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 639.0,
        "t": 158.0
      }
    },
    {
      "label": "page_footer",
      "text": "85",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 370.0,
        "t": 64.0
      }
    }
  ],
  "7": [
    {
      "label": "section_header",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "motions like a distant force and which he identified with God (Orthmann 2016, 730-1; Abi ‘Ma'shar 2019, 1: 12). The motions of the planets are the cause of the movement of the sublunar elements and allow their potentiality for change to actualize. This impact over a distance is only possible because the sublunar elements are inherently susceptible to it (Abii Ma'shar 2019, 1: 11) ‘Abii Ma'shar combined these basically Aristotelian ideas with Platonic concepts such as the form that is the defining feature of each thing and operates like an artisan, while the four sublunary elements are its tools. The most powerful ofall the planets is the sun (Abii Ma'shar 2019, 1: 12), While those and other concepts and claims serve to justify the reality and the scientific nature of the art of judgments (astrology), the cause and regulator of all planetary activities and effects is God alone.",
      "bbox": {
        "l": 102.0,
        "b": 774.0,
        "r": 653.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Some scholars also challenged the philosophical assumptions summarized above either in part or as a whole. Among them were Thabit ibn Qurra (d. 288/901), al-Biriini (362d. after 444/973-4. after 1053), ‘Umar al-Khayyam (439. 517/1048-c. 1123) and perhaps also al-Kiht (2nd half 4th/ 10th century) and al-Isfizai ((late 5Sth—early 6th/ 1 1th-early 12th centuries;] Rashed 2009, 696-9). These challenges may have emerged (at least partly) from some of the epistemo- logical views expressed by Hellenistic scholars, in particular Ptolemy. But there is not enough research to come to a definitive conclusion. Thabit ibn Qurra may have even questioned the entire physical doctrine of Aristotle (Rashed 2009, 676-7). But we cannot be certain because not enough of his treatises on these issues have survived. The surviving fragments indicate his rejection of Aristotle's theories of natural place, the nonexistence of the void, the definition of time as a measure of celestial movement and some of the properties of movement. He also seems to have been indecisive about the role of the Prime Mover in the movements of the spheres (Rashed 2009, 683-99). Al-Birdnt is well known for his rejection of several Aristotelian natural philosophical doctrines in his letters to Ibn Sind (al-Birini and Ibn Sind 1970). His letters express curiosity, challenge, criticism and dissatisfaction. But there are no studies yet of the philosophical positions he took in his later works. In general, this is also true for the overarching question of which philosophical positions astral experts held in different times and regions.",
      "bbox": {
        "l": 102.0,
        "b": 467.0,
        "r": 653.0,
        "t": 770.0
      }
    },
    {
      "label": "text",
      "text": "‘As a whole, however, according to our current knowledge, Aristotelian natural philoso phy formed a stable theoretical foundation on which the astral experts practiced their crafts whether mathematical or more speculative. Aristotelian doctrines were incorporated into manuals or synopses of astronomical matters, usually following the geometrical propositions, mostly taken from Euclid’s (3rd century sce) Elements. An example is Athir al-Din al-Abharis (4. between 660/1263 and 63/1265) Concise [Book] on the Science of the Configuration [of the Universe] (Mukbtasar fi ilm al-hay’a). He opened the second chapter with the simple acknowledg- ‘ment that natural philosophy provides the basis for astronomical knowledge:",
      "bbox": {
        "l": 102.0,
        "b": 323.0,
        "r": 654.0,
        "t": 464.0
      }
    },
    {
      "label": "text",
      "text": "thas been established in the natural sciences that the celestial bodies are equal in their parts and natures, that their figures are spherical, that they move in circular (forms), that there is no beginning in them for a straight inclination; that the place of the earth is in the middle of the world.",
      "bbox": {
        "l": 129.0,
        "b": 234.0,
        "r": 627.0,
        "t": 302.0
      }
    },
    {
      "label": "text",
      "text": "(MS Paris, Buk; Arabe 2515, fol. 5b, 10-13)",
      "bbox": {
        "l": 380.0,
        "b": 216.0,
        "r": 625.0,
        "t": 230.0
      }
    },
    {
      "label": "text",
      "text": "‘The above mentioned author/s of the Teatises of the Bretren of Purity (Rasa'l Ikhwan al-Safi?) treated natural philosophical doctrines as well-accepted underpinnings of the astral sciences. In their 3rd epistle titled Astronomy (asruniimiyd) they confirm that the impact of the stars on the sublunar world is due to the movements of the planetary orbs and the planets, that the theory of the four qualities applies to the zodiacal signs and that all celestial orbs are spherical and move in circular motions. They also likened the planets to spirits and the zodiacal signs to bodies (Ikhwn",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 654.0,
        "t": 194.0
      }
    },
    {
      "label": "page_footer",
      "text": "86",
      "bbox": {
        "l": 369.0,
        "b": 51.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "8": [
    {
      "label": "section_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "al-Safii'2015, 25, 31-2). They presupposed more specific beliefs about the material nature of the planets as round and luminous bodies and the orbs as spherical, transparent and hollowed-out bodies (Ikhwan al-Saf2015, 25-6)",
      "bbox": {
        "l": 89.0,
        "b": 899.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Despite the substantial difference in mathematical content and overall religious outlook, this epistle has several features in common with al-Birdin’s Book of Instruction on the Elements of the Art of Astrology (Kitab al-Tafhim li-awa'l sind‘ al-tanjim), dedicated in 420/1029 to Rayhana, a young woman probably from Khwarazm (al-Birdini 1934). Both are teaching texts, both illus- trate concepts and claims with diagrams, and both simplify the access to scholarly matters by using comparisons with things from everyday life. The sphere of the moon encloses the lightest element air “like the shell of an egg encloses its egg white”; the earth is compared to the yolk of the egg and the outermost, perpetually moving sphere is likened to a wheel (Ikhwan al-Safi? 2015, 26-7, 46)",
      "bbox": {
        "l": 89.0,
        "b": 737.0,
        "r": 638.0,
        "t": 896.0
      }
    },
    {
      "label": "text",
      "text": "Historians of astronomy often argue that natural philosophy played its most important role in the development of non-Ptolemaic planetary models (Chapter II.6). Aristotle and his followers ascribed the discussion of the “essence” (structure and properties) of the universe as a whole to natural philosophy and not to the astral sciences. Also, no text specifically devoted to the ‘meaning of natural philosophical teachings for the astral sciences is known to have been written by scholars of the early Abbasid caliphate. However, Morelon emphasized that several of their extant writings are concerned with this topic (Morelon 1999, 115). He showed, for example, for the treatise of the Bandi Masi (3rd/9th century) On the Solar Year (Kitab fi sanat al-shams) — falsely attributed to Thabit ibn Qurra (4. 288/901) — that it interweaves natural philosophy and ‘mathematical astronomy. An analogous point was made by Ragep in his discussion of al-Battan?s (244-317/858-929) description and criticisms of ancient and contemporary theories, observa tions and the philosophical groundings of celestial movements (Ragep 1996).",
      "bbox": {
        "l": 89.0,
        "b": 521.0,
        "r": 638.0,
        "t": 734.0
      }
    },
    {
      "label": "text",
      "text": "Independently from Morelon and Ragep, Orthmann, a historian of the Persianate world and the social impact of astrology, emphasized that models of the universe were questioned from philosophical, scientific and religious positions (Orthmann 2016). Major points concerned the structure and properties of the universe as a whole and its parts",
      "bbox": {
        "l": 89.0,
        "b": 449.0,
        "r": 638.0,
        "t": 518.0
      }
    },
    {
      "label": "text",
      "text": "One of those discussions concerned the existence of spheres beyond the sphere of the ecliptic (the path of the mean sun, ako called the sphere of the zodiac or the sphere of fixed stars), the eighth and perhaps outermost sphere. Following Aristotle, Ptolemy had declared the movements of the heavens to originate due to a Prime Mover situated in the sphere beyond the ecliptic. In the 3rd/9th century, the Bani Misi rejected the existence of such a ninth sphere in their Book on the Motions of the Celestial Spheres (Kitab Harakat al-aflak). The brothers explained the daily motion by the rotations of each single sphere from the moon to the fixed stars (Casulleras 2007, 1: 93). One of the them, Ahmad, reportedly delivered a geometrical proof against the existence of the ninth sphere (Casulleras 2007, 1: 93). In the following cen- turies, arguments for more spheres than eight were abo offered due to other observational results. An important issue was the precession of the equinoxes. According to Ptolemy this slow movement along the ecliptic of the two points of intersection between the ecliptic and the celestial equator was due to the slow eastward rotation of the sphere of the fixed stars around the ecliptic poles. Another phenomenon seemingly requiring additional external spheres was the apparently changing obliquity of the ecliptic (the angle of intersection between the ecliptic and the equatorial planes) which was explained by increasingly complex theories of trepidation (Ragep 1996). Identifying in the 4th/10th century the ancient divine Prime Mover or the First Cause with Allah, facilitated the model's spread beyond the circles of astral experts. Two cen- turies later, scholars engaged in planetary theory defined the ninth sphere as a fixed coordinate system (Ragep 1996, 286).",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 446.0
      }
    },
    {
      "label": "page_footer",
      "text": "7",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 370.0,
        "t": 64.0
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "‘The position of Mercury and Venus with regard to the sun was apparently first formulated as a question of symmetry. In a letter on weather forecasting, a subfield of the astral sciences, al-Kindi argued that four spheres existed on each side of the sun (al-Kindi 2000, 245-6). The upper spheres were those of Mars, Jupiter, Saturn and the fixed stars. The lower spheres consist, in addition to the sphere of the moon, of three single spheres for the following pairs: Venus and ‘Mercury; fire and air; water and earth. Al-Kindi believed that Mercury and Venus were equidis- tant from the sun and hence should be placed in a single sphere together (al-Kindi 2000, 245-6), His justification for putting water and earth, as well as fire and air, in single spheres reflects Aristotelian physics: water and earth are both cold and heavy, move downward to the center and do not form clearly ordered spheres, as earth rises above water in many places (continents and islands). They were often treated as forming a composite sphere. Similarly, air and fire are both hot and light, move upward and may not be separated from each other by a simple geometrical boundary (al-Kindi 2000, 245).",
      "bbox": {
        "l": 101.0,
        "b": 719.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Al-Kind?’s statements resemble opinions already held in antiquity. They were particularly prominent among Roman writers (Eastwood 2007, 36-7, 49). We do not know if other scholars in Islamicate societies subscribed to al-Kindi’s views. There are, however, some diagrams in Ara- bic and Persian texts that present at least the sublunar world in agreement with al-Kindi’s model ‘A comment by Nasir al-Din al-Tasi (597-672/ 1201-1274), in his Recension of the Almagest (Tabrir al-Majisti), also might point to a longer life of this view. He discussed earlier observations of the transits of Venus. Some of these are clearly spurious, but others are possibly correct. Using this evidence, he rejected the ideas that the two inferior planets are in the sphere of the sun and that the centers of their epicycles coincide with the center of the sun's body (Mozaffari 2016, 276, no. 40).",
      "bbox": {
        "l": 102.0,
        "b": 539.0,
        "r": 652.0,
        "t": 716.0
      }
    },
    {
      "label": "text",
      "text": "Al-Kind?’s placement of Mercury and Venus is a special form of one of the three opinions held by ancient and medieval scholars about where they move: both below the sun, both above the sun or Mercury below and Venus above the sun. According to Ptolemy, deciding this ques- tion with certainty was impossible due to a lack of observations, the difficulty of observing the occultation of a large body (the sun) by a much smaller body (a planet) and the long periods between the occurrence of such occultations (as is the case for Venus; Goldstein 1972, 43) Because of the accepted Aristotelian principle of the unchangeable celestial world, the observa tion of any dark spot on the solar surface would have been (mis)taken for the transit of one of the two inner planets (Goldstein 1972, 44).",
      "bbox": {
        "l": 102.0,
        "b": 377.0,
        "r": 652.0,
        "t": 536.0
      }
    },
    {
      "label": "text",
      "text": "Although the worlds below and above the moon were rigidly separated doctrinally, natural philosophy delivered the basis for analogical arguments about the impact of the planets on the sublunar world. The sun was recognized as causing the seasons and the change between day and night, the moon as connected to rain and other forms of humidity, and the planets as contri- buting their shares to the temperatures during the seasons (Abii Ma'shar 2019, 9, 225, 257, 259), Discussions about tides linked them primarily to lunar movements. In particular, Abii Ma'shar's substantial deliberations in the Great Introduction to Astrology were picked up repeatedly by writers about terrestrial matters (Abii Ma'shar 2019, 5, 19, 263-86).",
      "bbox": {
        "l": 101.0,
        "b": 233.0,
        "r": 652.0,
        "t": 374.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.3.2 Debates on astronomical problems",
      "bbox": {
        "l": 228.0,
        "b": 188.0,
        "r": 523.0,
        "t": 204.0
      }
    },
    {
      "label": "text",
      "text": "Important theoretical work began as early as the 3rd/9th century dealing with three big topics — the structure of the universe and the movement of the celestial bodies, the constructions of instruments and the solution of the three tasks related to the religious duties of Muslims (first visibility of the crescent after New Moon, prayer times and prayer directions). These themes were picked up time and again until the end of the period covered in this chapter (and beyond),",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 653.0,
        "t": 176.0
      }
    },
    {
      "label": "page_footer",
      "text": "88",
      "bbox": {
        "l": 369.0,
        "b": 51.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Here I focus on the first topic as it belongs in a narrower sense to the theoretical debates (for the other two topics see Chapters IV.2, IV.3, V.4, V2).",
      "bbox": {
        "l": 89.0,
        "b": 917.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Almost all issues of the first topic were related to studies of Ptolemy's Almagest. A set of them concerned the observed changes of the obliquity of the ecliptic, the equinoctial points and the solar eccentricity, the definition and the determination of the length of the solar year and the motion of the solar apogee. The most important works on those subjects were written in Baghdad, Ghazna and Toledo. Their authors evaluated observations, recomputed astronomical magnitudes and devised qualitative or quantitative geometrical models.",
      "bbox": {
        "l": 89.0,
        "b": 809.0,
        "r": 638.0,
        "t": 914.0
      }
    },
    {
      "label": "text",
      "text": "In the treatise On the Solar Year, the Banii Masi rejected Ptolemy's claim that the movements of the sun, the moon and the fixed stars were interconnected and hence his convention that the tropical year (the time in which the sun travels all the way around the ecliptic) could be taken as the standard year in astronomy and astrology. They argued for the sidereal year (the time of one revolution of the sun with regard to the fixed stars, in modern terms about 1 h 20 m longer than the tropical year), which they considered of the same length as the anomalistic solar year (che time of one revolution of the sun with regard to its apogee, in modern terms some 2 h 55 m shorter than the sidereal year). Their arguments went back and forth between natural philo- sophy, mathematical astronomy and observations. Their arguments made use of solar observations that the Bandi Miisi brothers had executed in Baghdad, together with what they perceived as the titical spirit of ancient Greek astronomy. They presented their own observations not merely as new observational results but as part of a history of observations, which included —as an impor- tant method —an explicit criticism of earlier observations by ancient scholars (Neugebauer 1962; Morelon 1994, 116; Chapter 11.7)",
      "bbox": {
        "l": 89.0,
        "b": 557.0,
        "r": 639.0,
        "t": 806.0
      }
    },
    {
      "label": "text",
      "text": "‘The observed variability of precession and the decrease of the value of the obliquity of the ecliptic motivated some scholars of the 3rd/9th or 4th/10th centuries to assume a periodicity of the two phenomena (Neugebauer 1962, 290). In a treatise called On the Motion of the Eighth Sphere extant only in Latin translation (Liber de motu de octaue sphere) — also attributed falsely to Thabit ibn Qurra — these issues are represented in the first known qualitative geometrical model (Neugebauer 1962, 291-9; for possible authors of the Arabic treatise see Sams6 1994, I: 15, 2020[CB], 585). The model resulted from and contributed to the continued discussion of what was called trepidation or the motion of accession and recession. The assumption, already formulated in late antiquity in Greek and Indian works but without geometrical models, was that the equinoctial points move forward and backward at a rate of 1°/80 years along an arc of 8°. In the ancient mathematical model, the longitude of a star will decrease during the forward ‘west-to-east movement (accession). During the backward east-to-west movement (recession) it will increase again until it reaches its original value.",
      "bbox": {
        "l": 89.0,
        "b": 324.0,
        "r": 639.0,
        "t": 554.0
      }
    },
    {
      "label": "text",
      "text": "‘Trepidation theory was significantly reinterpreted, although the beginnings are not well known (Ragep 1996, 283-8). Al-Battini (244-317/858-929) described the results of this pro- cess of reformulation in his astronomical handbook as a physical and cosmological interpretation of trepidation (Ragep 1996, 271). According to this interpretation, the stars oscillate because of a movement of the ecliptic orb. This movement is described as occurring in addition to the ‘west-east movement of the fixed stars (precession). Al-Battini criticized trepidation because there are several consequences resulting from this version which are in conflict with Aristotelian celestial physics (for a discussion, see Ragep 1996).",
      "bbox": {
        "l": 89.0,
        "b": 179.0,
        "r": 638.0,
        "t": 320.0
      }
    },
    {
      "label": "text",
      "text": "Despite the work done in the East, trepidation theory became truly influential only in al-Andalus and the Maghrib from the 5th/1ith to the 8th/14th century (Comes 2001; Sams6 1994, 1). According to the historical records, the theory was picked up from a treatise written in Baghdad and farther developed in the circle around Said al-Andaliis (419-462/1029-1070) in Toledo. A later member, Ibn al-Zargillu (d. 493/1100) proposed three different trepidation",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 637.0,
        "t": 176.0
      }
    },
    {
      "label": "page_footer",
      "text": "89",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 338.0,
        "b": 979.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "models in his Treatise on the Motion of the Fixed Stars (Magala ft barakat al-ighal wa-l-idbar). They substantially shaped the further development of astronomical theory and handbooks among his successors in the West. Samsé’s analysis of the three models brings to light the fact that Ibn al-Zargillu privileged ancient and Abbasid scholars over Andalusians, and his own recomputed data over observational data (for the details of the models and Sams6's analysis, see Sams6 2020, 592-610). In the 7th/13th and later centuries, observations undertaken in the Maghrib con- tradicted values given in Andalusian astronomical handbooks based on a trepidation model. As a result, trepidation models were first criticized and then fell out of use in the Maghrib. This change was supported by the values for the obliquity of the ecliptic and the precession of the equinoxes found in material arriving in the Maghrib from Ayyubid and Mamluk Egypt and Syria (Sams6 2020, 610-41)",
      "bbox": {
        "l": 101.0,
        "b": 755.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "Underlying many of the debates mentioned here and those going beyond the available scope of this chapter are two more general issues: (1) the relationship between observation, calculation and theoretical interpretation and (2) the necessity (or not) to engage critically with the practical and theoretical results of previous scholars back to antiquity. Time and again, scholars of the period under discussion formulated opinions on the merits as well as errors of previous results and their causes. In response, they offered new mathematical solutions, theoretical insights and verifications of observations, reinforcing the identity of the astral sciences and at times even changing their direction (see, e-g., Morelon 2009, 613-17)",
      "bbox": {
        "l": 102.0,
        "b": 611.0,
        "r": 652.0,
        "t": 752.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.3.3 _Is the science of the judgment of the stars a science?",
      "bbox": {
        "l": 170.0,
        "b": 569.0,
        "r": 583.0,
        "t": 585.0
      }
    },
    {
      "label": "text",
      "text": "‘The classification literature summarized earlier explained what kind of science astrology was — either mathematical or physical — and its status and rank. Other kinds of texts dealt with the larger question inherited from ancient scholars: whether it was a science at all, what characterized the true expert of the astral sciences and which people were acceptable practitioners as opposed to charlatans. Following Ptolemy, writers addressing these questions defended the scientific character of both species or fields of knowledge. They acknowledged epistemological differences between the mathematical and physical parts. The results of the mathematical parts were certain, due to infallible, rational proofs. But the conclusions of the physical part were at best conjectural, as they were drawn from observing the nature of planetary influences on the life on earth. In addition, some writers argued for the existence of possible knowledge (not only of necessary knowledge), as well as the creation of know- ledge through methods of analogy and comparison (Burnett 2002, 206-10). They promoted the application of tools from logic, the execution of careful, individual observations, and the reliance on long-term observational results from competent astral experts of the past (Burnett 2002, 212).",
      "bbox": {
        "l": 101.0,
        "b": 291.0,
        "r": 652.0,
        "t": 557.0
      }
    },
    {
      "label": "text",
      "text": "Kashyar ibn Labban (late 4th-early 5th/10th—11th centuries) formulated these positions in favor of a nondeterministic science, also subscribed to by al-Kindi, Abii Ma‘shar and al-Qabisi, as follows:",
      "bbox": {
        "l": 102.0,
        "b": 239.0,
        "r": 652.0,
        "t": 287.0
      }
    },
    {
      "label": "text",
      "text": "‘The first division of the science of the stars is that for which there is geometrical proof... . the second is the science that is grasped by experience . . . and analogy. ‘Most people reject the second science and claim that it concerns things that happen by accident and there is no demonstration in it. But we say that, so far as accidents are concerned, when it lasts long or occurs in most circumstances, then they have the force of demonstration.",
      "bbox": {
        "l": 128.0,
        "b": 112.0,
        "r": 624.0,
        "t": 215.0
      }
    },
    {
      "label": "text",
      "text": "(Burnett 2002, 202)",
      "bbox": {
        "l": 510.0,
        "b": 93.0,
        "r": 623.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "90",
      "bbox": {
        "l": 369.0,
        "b": 53.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "‘The questions formulated by al-Qubigi for testing astral experts who approached his princely patron leave no doubt that the scientific character of both parts of the astral sciences depended on the relationship between them. An expert on the science ofthe judgments of the stars had to have mastered the Alnagest, natural philosophy, instrumental techniques, geometry and arithmetic. In his refutation of ten kinds of criticisms against astrology, Abii Ma'shar explains that experts in mathematical astronomy are insufficiently trained if they do not know natural philosophy or practice the science of the judgments of the stars, because the latter is the fruit of astral knowledge (Burnett 2002, 209; al-Qabisi 2004, 6-7). This view on the connectedness of mathematical astronomy and astrology was still held in the early 9th/15th century, when either the Timurid prince Iskandar Sultin or possibly one of his court astrologers wrote in the preface to an other- wise lost scientific summa that the science of the configuration [of the universe] is the foundation of the noble science of the stars and the latter the fruit of all the parts of mathematical astronomy (Brentjes 2009, 465)",
      "bbox": {
        "l": 89.0,
        "b": 719.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.3.4 Methods for houses, rays and progressions",
      "bbox": {
        "l": 191.0,
        "b": 674.0,
        "r": 535.0,
        "t": 691.0
      }
    },
    {
      "label": "text",
      "text": "‘The most important discussions on astrological methods and their mathematical implementa tion took place in astronomical handbooks and specialized treatises (Kennedy and Krikorian 1972, 3-4; Casulleras and Hogendijk 2012). They concern three fundamental theories that historical actors considered interrelated: (1) the theory of houses, (2) the theory of aspects and @) the theory of rays. Houses (also translated as places; not to be confused with the domiciles of the planets) resulted from the division of the ecliptic circle or the zodiacal belt into 12 parts. ‘They could either have fixed or mobile limits, often defined by the projection of divisions from an auxiliary great circle like the equator onto the ecliptic (Kennedy 1996). Similarly, there were different views on how to determine the seven astrological aspects, significant points of rays allegedly cast by a planet, and predictions for any given date by progressions. Casulleras and Hogendijk have traced nine methods for projecting rays and identified six methods for predictions made by progression (Casulleras 2009; see Casulleras and Hogendijk 2012 for a survey of the older literature, editions and translations of primary sources and the details of the general themes, as well as their respective methods). They consider methods {also called systems) as different when their geometrical definitions are not mathematically equivalent (Casulleras and Hogendijk 2012, 37). Asa result, the computations employed can also differ. Some of the systems are mathematically interrelated, while others are indepen- dent. The applied mathematical practices are nontrivial and should thus be acknowledged as valuable contributions to the history of the mathematical sciences in Islamicate societies (see, for instance, Hogendijk 2015, 285)",
      "bbox": {
        "l": 89.0,
        "b": 305.0,
        "r": 639.0,
        "t": 662.0
      }
    },
    {
      "label": "text",
      "text": "‘The fact that the different methods were unevenly distributed and evaluated in different areas of the Islamicate world points to locally specific developments and perspectives (Casul- leras and Hogendijk 2012, 45, 73, 77-8, 82; Chapters V.3, V.4 and VI.2). The evaluation by practitioners concerned eight issues related to each other in different ways. The first four were the effectiveness, reliability and applicability of each of the methods for specific pla- netary and imagined celestial positions and the soundness of a method. These formed one complex. The relationship between methods and the possibility of extending a method to a more complex case reflect a second set of questions. The remaining two issues were the exact or approximate character of the computations and were related to a methodological problem also raised outside the astral sciences. This also applies to the question of which mistakes various authors had committed (Casulleras and Hogendijk 2012, 43, 45, 56-7, 59, 63-44, 70, 73, 81, 83, 91).",
      "bbox": {
        "l": 89.0,
        "b": 90.0,
        "r": 638.0,
        "t": 302.0
      }
    },
    {
      "label": "page_footer",
      "text": "91",
      "bbox": {
        "l": 357.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "13": [
    {
      "label": "page_header",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 338.0,
        "b": 979.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.4 Mathematical practices",
      "bbox": {
        "l": 272.0,
        "b": 933.0,
        "r": 481.0,
        "t": 949.0
      }
    },
    {
      "label": "text",
      "text": "‘The main mathematical skills people working on astral matters needed to possess began with the abilities to add, subtract, multiply, divide and extract roots in the sexagesimal system (a positional system with basis 60). They needed to know the relevant great and small circles, arcs and angles on the celestial and terrestrial spheres and how to do geometrical constructions with a rulerand a compass. They had to be able to transform verbal statements into plane or spherical diagrams and vice versa. In more advanced mathematics, they needed to handle proportions between numbers or geometrical magnitudes, work with trigonometric magnitudes and relations, trisect arcs or angles, to project elements of a spherical surface or a plane unto another plane and make a linear interpolation between two values. More rarely quadratic interpolations were used. Last, they had to be able to translate geometrical problems or procedures into arithmetical or algebraic ones and thus recognize equivalences between problems from different fields of the mathematical sciences, which allowed them to search for arithmetical or algebraic solutions (Chapters 1.5 and 1.7).",
      "bbox": {
        "l": 101.0,
        "b": 708.0,
        "r": 652.0,
        "t": 921.0
      }
    },
    {
      "label": "text",
      "text": "‘The more proficient experts among them knew how to make theoretical claims and prove them with methods taken from Arabic translations of Euclid’s Elements and the Data (Dedomena), Ptolemy's Almagest, the treatises on the sphere by Autolycus of Pitane (4. c. 250 sce), Theodosius (ate 2nd century #ce) and Menelaus (fl. 100), as well as new trigonometric tools derived from translations of Sanskrit astral texts and their further elaborations in the 3rd/9th and 4th/10th centuries (Chapters 1.5, 1.7, 1.8). They executed complicated calculations and complex geome- trical constructions. They were also able to check the methods applied by other practitioners and point out their mistakes and theoretical or practical shortcomings. Sometimes scathing remark of this kind permeate the works of several scholars of the astral sciences, among them al- and Ibn Mu‘adh (Casulleras 2004, 387).",
      "bbox": {
        "l": 101.0,
        "b": 528.0,
        "r": 652.0,
        "t": 705.0
      }
    },
    {
      "label": "text",
      "text": "‘An entire literary genre of this kind of critical engagement with the foundations and practices ofthe scholarly field developed in medicine, philosophy, some of the religious sciences (Chapters L11 and 1.12) and in the astral sciences.",
      "bbox": {
        "l": 102.0,
        "b": 474.0,
        "r": 652.0,
        "t": 525.0
      }
    },
    {
      "label": "text",
      "text": "Difficult mathematical problems and complex procedures to solve them were applied not only in those parts of the astral sciences that lacked astrological applications, but also in proce- dures needed for producing horoscopes, such as the projection or casting of rays, or the division of a chosen great circle for determining the houses with fixed or mobile limits (Hogendijk 1989, 2005; Casulleras and Hogendijk 2012; Casulleras 2020-2021). The mathematical proce- dures used for such higher-level astrological practices were the same that the experts used for calculations and constructions in the mathematical part of the astral sciences (astronomy). The same holds for proofs and demonstrations or the preference of exact solutions over approximate cones. Exact solutions occur primarily in discussions of theoretical problems of the astral sciences. Casulleras assumes that more complex formulations of theories and their procedures led to an increase in scholarly reputation, which in turn inspired the creation of more difficult theories involving efforts to find more sophisticated mathematical solutions (Casulleras 2004, 385-6)",
      "bbox": {
        "l": 102.0,
        "b": 258.0,
        "r": 652.0,
        "t": 471.0
      }
    },
    {
      "label": "text",
      "text": "Approximate methods, on the other hand, seem to have dominated the daily practice of horo- scope casting, computation of astronomical and astrological tables and the determination of prayer times and prayer directions. Arithmetical procedures that required only the use of tables seem to have been preferred over geometrical methods (Casulleras 2004, 388, 392-7; Casulleras and Hogendijk 2012, 76). Practicing astrologers could also work with astrolabes, which are effectively analog computers. Some specimens are known or described in texts that include special plates or plates with sets of lines for astrological tasks (Hogendijk 2005, 98-9; Casulleras 2013; Casulleras and Hogendijk 2012, 50-3, 55 et al.; see the latter for their reservations about the usability of some of those plates because of the agreement of the geometrical representation for several of the",
      "bbox": {
        "l": 101.0,
        "b": 96.0,
        "r": 653.0,
        "t": 255.0
      }
    },
    {
      "label": "page_footer",
      "text": "2",
      "bbox": {
        "l": 369.0,
        "b": 51.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "14": [
    {
      "label": "section_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "methods). The use of an armillary sphere, as well as a globe, was discussed by Jewish scholars at the court of Alfonso X of Castile ([r. 1252-1284]; Casulleras and Hogendijk 2012, 52).",
      "bbox": {
        "l": 89.0,
        "b": 917.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "1.6.5 Final remarks",
      "bbox": {
        "l": 290.0,
        "b": 876.0,
        "r": 436.0,
        "t": 889.0
      }
    },
    {
      "label": "text",
      "text": "‘This chapter has focused on themes that are only partly included in surveys of the history of astronomy in Islamicate societies. Astrology was excluded until very recently (Burnett 2007; Morrison 2013). A survey of the various complex and difficult mathematical methods used for predictions of the future still needs to be written. It is not possible to separate astrology from ‘mathematical astronomy on the grounds that it is not considered a science today. If we did this, ‘we would also have to abandon mathematical astronomy, since its natural philosophical founda tions and its models are also faulty and equally contradict reality as understood today. The themes presented here indicate the fruitfulness of studying the different parts of the astral sciences as a unified field of knowledge interrelated by epistemological and natural philosophical issues of great importance, a broad range of mathematical methods and sociocultural contexts.",
      "bbox": {
        "l": 88.0,
        "b": 683.0,
        "r": 639.0,
        "t": 860.0
      }
    },
    {
      "label": "section_header",
      "text": "Note",
      "bbox": {
        "l": 346.0,
        "b": 641.0,
        "r": 380.0,
        "t": 655.0
      }
    },
    {
      "label": "list_item",
      "text": "1 Consolidated bibliography:",
      "bbox": {
        "l": 89.0,
        "b": 615.0,
        "r": 251.0,
        "t": 628.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 615.0,
        "r": 251.0,
        "t": 628.0
      }
    },
    {
      "label": "section_header",
      "text": "Bibliography",
      "bbox": {
        "l": 317.0,
        "b": 569.0,
        "r": 410.0,
        "t": 586.0
      }
    },
    {
      "label": "section_header",
      "text": "Sources",
      "bbox": {
        "l": 337.0,
        "b": 537.0,
        "r": 389.0,
        "t": 549.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Birini, Abi I-Rayhan. tz Wright, R. R 1934. Kitab al-Tfhim liu gnd'atal-tanjin [The Book of Instruction inthe Elements ofthe Art of Astrology] (Written in Ghaznah, 1029 A.D). London: Luzac. Reproduced from Brish Museum MS. Or. 8349",
      "bbox": {
        "l": 88.0,
        "b": 480.0,
        "r": 639.0,
        "t": 524.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Birini and tba Sini. ed. Nasr, S. H. and Mohaghegh, M. 1970. Abasila us-Lajwiba [Questions and Answers). Tehran: Shirii-yi‘i-yi hunar w-firang.",
      "bbox": {
        "l": 89.0,
        "b": 449.0,
        "r": 638.0,
        "t": 478.0
      }
    },
    {
      "label": "list_item",
      "text": "Ikhvwin al-Safi’. ed. and tr. Ragep. EJ and Minsura, T. 2015. On Astronomia: An Arabic Critical Edition and English Translation of Epistle 3. Epistles ofthe Brethren of Purity. Oxford: Oxford University Press",
      "bbox": {
        "l": 89.0,
        "b": 420.0,
        "r": 638.0,
        "t": 448.0
      }
    },
    {
      "label": "list_item",
      "text": "a-Kindi.ed., tz and com. Bos, G. and Burnett, C. 2000. Scientific Heather Forecasting in the Middle Ages: The Writings of AI-Kindi. London and New York: Kegan Paul International",
      "bbox": {
        "l": 88.0,
        "b": 390.0,
        "r": 638.0,
        "t": 418.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Qabisi. eds. and trs. Burnett, C., Yamamoto, K. and Yano, M. 2003 l-Qabig (Alcabitin): The Introduction 10 Astrology Eiitions of the Arabic and Latin Tests and a English Translation. London and Trin: The War- burg Institute and Nino Aragno Editore",
      "bbox": {
        "l": 89.0,
        "b": 345.0,
        "r": 638.0,
        "t": 388.0
      }
    },
    {
      "label": "list_item",
      "text": "al-Tawhidi, Abi Hayyin, ed., tr. and ann, Bergé, M. 1963-1964. “Epitre sur les sciences (Rissla 6 uk) ADS Hayyin al-Tawhidi (310/922 @) ~ 414/1023). Introduction, Traduction, Glosaire Technique, Manascrt et Edition Critique,” Bullen d'études orienales 241-77, 279-83, 285-98, 300,",
      "bbox": {
        "l": 88.0,
        "b": 300.0,
        "r": 638.0,
        "t": 344.0
      }
    },
    {
      "label": "section_header",
      "text": "Manuscripts",
      "bbox": {
        "l": 319.0,
        "b": 250.0,
        "r": 407.0,
        "t": 267.0
      }
    },
    {
      "label": "key_value",
      "text": "MS London, BL, Or. 1992. MS New York, Pierpont Morgan Library, M. 788. MS Paris, BaF, Arabe 2515. (MS Paris, Bn, Supplément Ture 242.",
      "bbox": {
        "l": 88.0,
        "b": 182.0,
        "r": 352.0,
        "t": 240.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 228.0,
        "r": 233.0,
        "t": 240.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 211.0,
        "r": 352.0,
        "t": 225.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 198.0,
        "r": 233.0,
        "t": 211.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 182.0,
        "r": 285.0,
        "t": 195.0
      }
    },
    {
      "label": "section_header",
      "text": "Research literature",
      "bbox": {
        "l": 298.0,
        "b": 139.0,
        "r": 428.0,
        "t": 153.0
      }
    },
    {
      "label": "text",
      "text": "‘Adamson, P. 2002. “Abi Ma%iar,al-Kindi, and the Philosophical Defense of Astrology,” Recherches de Théol- cogie et Philosophie médiévales 69: 245-70.",
      "bbox": {
        "l": 88.0,
        "b": 98.0,
        "r": 638.0,
        "t": 126.0
      }
    },
    {
      "label": "page_footer",
      "text": "93",
      "bbox": {
        "l": 356.0,
        "b": 54.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "15": [
    {
      "label": "page_header",
      "text": "Sonja Brentjes",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "list_item",
      "text": "Adamson, P 2006. Al-Kindi. New York: Oxford University Pres",
      "bbox": {
        "l": 102.0,
        "b": 937.0,
        "r": 446.0,
        "t": 949.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Adamson, P2020. “al-Kindi,”in Zale, E. N., ed. Stanfond Enqulopeda of Philosophy. Spring 2020 Edition ‘hueps//plato stanford. eds /entries/al-kindi/#Cos.",
      "bbox": {
        "l": 102.0,
        "b": 907.0,
        "r": 651.0,
        "t": 934.0
      }
    },
    {
      "label": "list_item",
      "text": "Adamson, P and Pormann, P-E., us. 2012. The Philosophical Works of al-Kindi. Karachi: Oxford University Press.",
      "bbox": {
        "l": 102.0,
        "b": 877.0,
        "r": 652.0,
        "t": 905.0
      }
    },
    {
      "label": "list_item",
      "text": "Bevilacqua, A. 2018, The Republic of Arabic Lets: Islam and the European Enlightenment. Cambridge, MA: Belnap Pres.",
      "bbox": {
        "l": 101.0,
        "b": 847.0,
        "r": 651.0,
        "t": 874.0
      }
    },
    {
      "label": "list_item",
      "text": "Bowen, A. C. 2007. “The Demarcation of Physical Theory and Astronomy by Geminss and Ptok Perspectives on Science, 15.3: 327-",
      "bbox": {
        "l": 102.0,
        "b": 817.0,
        "r": 651.0,
        "t": 845.0
      }
    },
    {
      "label": "list_item",
      "text": "Brengjes, S 2009. “The Interplay of S in Dev, ‘A. ed. Science, Literature and Aesthetic. History of Scion, Philosophy and Culture in Indian Civilization. Vol. XV3. New Delhi: PHISPC, Centre for Saudis in Civilizations, 453-86.",
      "bbox": {
        "l": 102.0,
        "b": 772.0,
        "r": 651.0,
        "t": 814.0
      }
    },
    {
      "label": "list_item",
      "text": "Brengjes, S. 2010, Tiweles from Europe in the Ottoman and Safavid Empires, 16th—171h Centuries. Seeking, ‘Tansforming, Discarding Knowledge. London: Routledge, Variorum,",
      "bbox": {
        "l": 101.0,
        "b": 742.0,
        "r": 651.0,
        "t": 769.0
      }
    },
    {
      "label": "list_item",
      "text": "Burnett, Ch. 2002. “The Certitude of Astrology: The Scientific Methodology by al-Qs Ma’shar” Early Science and Medicine 7.3: 198-213, and Abi",
      "bbox": {
        "l": 102.0,
        "b": 712.0,
        "r": 651.0,
        "t": 739.0
      }
    },
    {
      "label": "list_item",
      "text": "Burnett, Ch. 2007. “Astrology” in EI-3, 2007-2: 165-75.",
      "bbox": {
        "l": 102.0,
        "b": 697.0,
        "r": 404.0,
        "t": 709.0
      }
    },
    {
      "label": "list_item",
      "text": "Calbia G. de. 2013. “Magia en al-Andalus: Rast! Fun al-Soft, Ruth al-hatim y Giyata-bakim (Pcais).” al-Qangara 34.2: 297-344.",
      "bbox": {
        "l": 102.0,
        "b": 667.0,
        "r": 651.0,
        "t": 694.0
      }
    },
    {
      "label": "list_item",
      "text": "Casullers, J. 2004, “Ibn Mudh on the Astrological Rays,\" Suhayl 4: 385-402.",
      "bbox": {
        "l": 102.0,
        "b": 652.0,
        "r": 512.0,
        "t": 665.0
      }
    },
    {
      "label": "list_item",
      "text": "Casulleras, J. 2007. “Bani Misi\" in Hockey etal, eds. [CB], 1: 92-4",
      "bbox": {
        "l": 102.0,
        "b": 637.0,
        "r": 468.0,
        "t": 650.0
      }
    },
    {
      "label": "list_item",
      "text": "Casillas, j. 2009. “Métodos para determinar a cas del horéscopo en la strologia medieval irabe [Methods for Determining the Houses of the Horoscopes in Medieval Arab Astrology)\" l-Qangara 30.1: 41-67.",
      "bbox": {
        "l": 102.0,
        "b": 607.0,
        "r": 652.0,
        "t": 635.0
      }
    },
    {
      "label": "list_item",
      "text": "CCasulleras, J. 2013. “The Instruments and the Exercise of Astrology in the Medieval Arabic Tradition,” Archives internationales dhistoire des sciences 63.170-1: 517-40.",
      "bbox": {
        "l": 102.0,
        "b": 577.0,
        "r": 651.0,
        "t": 605.0
      }
    },
    {
      "label": "list_item",
      "text": "Casulleras, J. 2020, “Horoscope,” in EL-3, 2020-1: 50-6.",
      "bbox": {
        "l": 102.0,
        "b": 562.0,
        "r": 397.0,
        "t": 575.0
      }
    },
    {
      "label": "list_item",
      "text": "Casullers, J. and Hogendik, J. P2012. “Progressions, Rays and Houses in Medieval amie Astrology: A Mathematical Classification,” Suhayl 11: 33-102.",
      "bbox": {
        "l": 102.0,
        "b": 532.0,
        "r": 652.0,
        "t": 560.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Comes, M. 2001, “Ibm al-Hilim’ Trepidation Model,” Suhayl 2: 291408",
      "bbox": {
        "l": 102.0,
        "b": 518.0,
        "r": 488.0,
        "t": 530.0
      }
    },
    {
      "label": "list_item",
      "text": "Easewood, B. S. 2007. Ordering the Heavens. Roman Astronomy and Cosmology in the Carlingian Renaissance (History of Science and Medicine Library 4). Leiden and Boston: Bri",
      "bbox": {
        "l": 102.0,
        "b": 487.0,
        "r": 652.0,
        "t": 514.0
      }
    },
    {
      "label": "list_item",
      "text": "Feke, J. 2014. “Meta-mathematical rhetoric: Hero and Ptolemy against the philosophers” Historia Mathe- ‘matic 41.3: 216-76.",
      "bbox": {
        "l": 102.0,
        "b": 457.0,
        "r": 651.0,
        "t": 485.0
      }
    },
    {
      "label": "list_item",
      "text": "Feke, |. 2018. Polemy’s Philosophy. Mathematics as a Way of Life. Princeton: Princeton University Press,",
      "bbox": {
        "l": 102.0,
        "b": 442.0,
        "r": 632.0,
        "t": 454.0
      }
    },
    {
      "label": "list_item",
      "text": "Goldstein, B. R. 1972. “Theory and Observation in Medieval Astrononsy” Lis 63.1: 39-47.",
      "bbox": {
        "l": 102.0,
        "b": 427.0,
        "r": 580.0,
        "t": 439.0
      }
    },
    {
      "label": "list_item",
      "text": "Hogendijk, J. 21989. “The Mathematical Structure of Two Islamic Astronomical Tables for ‘Casting the Rays'” Centaurus 32: 171-202.",
      "bbox": {
        "l": 102.0,
        "b": 397.0,
        "r": 651.0,
        "t": 424.0
      }
    },
    {
      "label": "list_item",
      "text": "Hogendijk, J.B 2005. “Applied Mathematics in Eleventh Century Al-Andalus: Ibn Mu‘sdh al-jaySini and ‘Astrological Houses and Aspects\" Centaurus 47: 87-114.",
      "bbox": {
        "l": 101.0,
        "b": 367.0,
        "r": 651.0,
        "t": 394.0
      }
    },
    {
      "label": "list_item",
      "text": "Hogendijk, J P.2015. “AL-Birdni on the Computation of Primary Progression (asyi),” in Burnett, C and Greenbaum, D. G., eds. From Mashiallh to Kepler: Theory and Practice in Medieval and Renaissance Astolegy. Lampeter: Sophia Centre Press, 279-308.",
      "bbox": {
        "l": 101.0,
        "b": 322.0,
        "r": 652.0,
        "t": 364.0
      }
    },
    {
      "label": "list_item",
      "text": "Kennedy, E. S. 1996. “The Astrological Houses as Defined by Medieval Islamic Astronomers,\" in Casul- Jeras and Sams6, eds. [CB], 2: 535-78 (Reprint: Astronomy and Astolegy inthe Medieval Islamic Wild Aldershot: Variorum, XIX),",
      "bbox": {
        "l": 101.0,
        "b": 277.0,
        "r": 652.0,
        "t": 320.0
      }
    },
    {
      "label": "list_item",
      "text": "Kennedy, E. S. and Krikorian, H. 1972. “The Astological Doctrine of “Projecting Rays\" Al-Abbath 25 3-25 (Reprint: Kennedy, ES eta. 1983. Studies in the klamic Exat Saences. Beirut: American Unie versity of Beirut, 372-84).",
      "bbox": {
        "l": 101.0,
        "b": 233.0,
        "r": 652.0,
        "t": 275.0
      }
    },
    {
      "label": "list_item",
      "text": "Lettinck, P, 1999, Aristotle’ Metorolgy and Lis Reception inthe Arab World: With an Edition and ‘Tanslaton of Ib Sur's Tease on Meteorological Phenomena and Ibn Baja’ Commentary on the Meteorology. Leiden: Bri",
      "bbox": {
        "l": 102.0,
        "b": 202.0,
        "r": 653.0,
        "t": 229.0
      }
    },
    {
      "label": "list_item",
      "text": "Melvin-Koushki, M. 2017, “Powers of One: The Mathematicalization of the Occult Sciences in the High Persianate Tradition,\" Intellectual History in the Ilamicate Wild 5: 127-99.",
      "bbox": {
        "l": 101.0,
        "b": 172.0,
        "r": 652.0,
        "t": 199.0
      }
    },
    {
      "label": "list_item",
      "text": "Morelon, R. 1994. “Tabic b. Quera and Arab Astronomy in the 9th Century 41: 111-39,",
      "bbox": {
        "l": 101.0,
        "b": 143.0,
        "r": 652.0,
        "t": 169.0
      }
    },
    {
      "label": "list_item",
      "text": "Morelon, R. 1999, “Astronomie physique et astonomie mathématique dans Vastronomie précopernici- enne,\" in Rashed, R. and Biard, J eds. Les dodrines dela sence dans Vamiguit& Iégedassique. Leuven: Peeters, 105-28.",
      "bbox": {
        "l": 101.0,
        "b": 98.0,
        "r": 652.0,
        "t": 140.0
      }
    },
    {
      "label": "page_footer",
      "text": "4",
      "bbox": {
        "l": 369.0,
        "b": 53.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "16": [
    {
      "label": "section_header",
      "text": "‘The astral sciences up to the 13th century",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "list_item",
      "text": "Morelon, R. 2009. “The Astronomy of Thibit ibn Qura”in Rashed, R., ed. Thabit in Qua. Scene and Philosophy in Ninth-Century Baghdad, Berlin and New York: Walter de Gruyter, 601-8.",
      "bbox": {
        "l": 88.0,
        "b": 922.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "Morrison, R. G. 2013. “Islamic Astronomy” in Lindberg, D. C_and Shank, M. H., eds. The Cambridge History of Scene. 6 vols. Vol. 2: Medieval Science. Cambridge: Cambridge University Press, 109-39.",
      "bbox": {
        "l": 88.0,
        "b": 892.0,
        "r": 638.0,
        "t": 920.0
      }
    },
    {
      "label": "list_item",
      "text": "Mozaffri, 8. M. 2016. “A Forgotten Solar Model,” Archive for History of Exact Sciences 70: 267-91",
      "bbox": {
        "l": 89.0,
        "b": 877.0,
        "r": 599.0,
        "t": 890.0
      }
    },
    {
      "label": "list_item",
      "text": "Neugebauer, O. 1962. “Thabit ben Qurra ‘On the Solar Year’ and ‘On the Motion of the Eighth Sphere” Proceedings ofthe American Philosophical Soity 106.3: 264-99.",
      "bbox": {
        "l": 88.0,
        "b": 847.0,
        "r": 637.0,
        "t": 875.0
      }
    },
    {
      "label": "list_item",
      "text": "Orthmann, E. 2016. tudolph et al, eds. [CB], 727-33.",
      "bbox": {
        "l": 89.0,
        "b": 832.0,
        "r": 576.0,
        "t": 845.0
      }
    },
    {
      "label": "list_item",
      "text": "Plotker, K.2007.“F in Hockey et al, eds, 1: 362-3.",
      "bbox": {
        "l": 89.0,
        "b": 817.0,
        "r": 574.0,
        "t": 830.0
      }
    },
    {
      "label": "list_item",
      "text": "Prolemacus Arabus et Latinus. “AstroBibl. 3. Middle Ages (500-1450). 3.3. Ilam/Arabic Woed,”https:// prolemacus.badwide/astrobibl/section/G",
      "bbox": {
        "l": 89.0,
        "b": 787.0,
        "r": 638.0,
        "t": 815.0
      }
    },
    {
      "label": "list_item",
      "text": "Ragep, E J. 1996. “al-Bateini, Cosmology; and the Early History of Trepidation in Islam,” in Casulleras and Sams6, eds., 1: 267-98.",
      "bbox": {
        "l": 89.0,
        "b": 757.0,
        "r": 638.0,
        "t": 785.0
      }
    },
    {
      "label": "list_item",
      "text": "Ragep, EJ. 2009. “Astronomy” in EI-3, 2009-1: 120-50.",
      "bbox": {
        "l": 89.0,
        "b": 742.0,
        "r": 390.0,
        "t": 755.0
      }
    },
    {
      "label": "list_item",
      "text": "Rashed, M. 2009, “Thabie iba Qurra, la Physigue d’Aristote et le meilleur des mondes,\"in Rashed, R., ed Thabit im Quy. Scene and Philosophy in Ninth-Century Baghdad. Berlin: Walter de Gruyter, 675-714",
      "bbox": {
        "l": 89.0,
        "b": 712.0,
        "r": 638.0,
        "t": 740.0
      }
    },
    {
      "label": "list_item",
      "text": "Russell, G. A, ed. 1994. The ‘Anbick\" Interest of the Natural Philosophers in Seventcnth Century England Leiden: Bell",
      "bbox": {
        "l": 89.0,
        "b": 683.0,
        "r": 638.0,
        "t": 710.0
      }
    },
    {
      "label": "list_item",
      "text": "Saliba, G. 1982. “Astronomy/ Astrology, ilamic\"in Stayer, RJ. ed. Diaionary ofthe Midile Ages. 13 vols Vol. 1. New York: Seribner, 616-24 (Reprint in Saliba 1994 [CB], 66-84)",
      "bbox": {
        "l": 88.0,
        "b": 652.0,
        "r": 638.0,
        "t": 680.0
      }
    },
    {
      "label": "list_item",
      "text": "Sams6, J. 1994. “Andalusian Astronomy: Its Main Characteristics and Influence in the Latin West” in Sami6, J, Blamic Astronomy and Medieval Span. Aldershot: Variorum,L",
      "bbox": {
        "l": 89.0,
        "b": 622.0,
        "r": 638.0,
        "t": 650.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Taub, L. 2003. Ancient Meteorology. New York: Routledge.",
      "bbox": {
        "l": 89.0,
        "b": 606.0,
        "r": 392.0,
        "t": 620.0
      }
    },
    {
      "label": "list_item",
      "text": "URL heeps://journals openedition.org/mideo/33972lang=ar",
      "bbox": {
        "l": 89.0,
        "b": 592.0,
        "r": 406.0,
        "t": 605.0
      }
    },
    {
      "label": "page_footer",
      "text": "95",
      "bbox": {
        "l": 356.0,
        "b": 54.0,
        "r": 370.0,
        "t": 64.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 740,
      "h": 1046
    },
    "2": {
      "w": 740,
      "h": 1046
    },
    "3": {
      "w": 740,
      "h": 1046
    },
    "4": {
      "w": 740,
      "h": 1046
    },
    "5": {
      "w": 740,
      "h": 1046
    },
    "6": {
      "w": 740,
      "h": 1046
    },
    "7": {
      "w": 740,
      "h": 1046
    },
    "8": {
      "w": 740,
      "h": 1046
    },
    "9": {
      "w": 740,
      "h": 1046
    },
    "10": {
      "w": 740,
      "h": 1046
    },
    "11": {
      "w": 740,
      "h": 1046
    },
    "12": {
      "w": 740,
      "h": 1046
    },
    "13": {
      "w": 740,
      "h": 1046
    },
    "14": {
      "w": 740,
      "h": 1046
    },
    "15": {
      "w": 740,
      "h": 1046
    },
    "16": {
      "w": 740,
      "h": 1046
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}