{
  "1": [
    {
      "label": "section_header",
      "text": "I.6\nTHE ASTRAL SCIENCES\nTHROUGH THE 7TH/13TH\nCENTURY\nAttitudes, experts and practices\nSonja Brentjes\nThis chapter discusses knowledge about the heavens as a whole, by attempting, as far as possible,\nto discuss astronomy and astrology together. It acknowledges that in certain periods the distance\nbetween astronomy and astrology was greater than in others. The chapter begins with a discus-\nsion of the classification of the astral sciences and then moves on to debates, mostly about theo-\nries and to a lesser extent about practices. It concludes with a section on mathematical practices.\nIt thus pays attention to several themes that previous surveys of the astral sciences in Islamicate\nsocieties ignored or marginalized and abstains from repeating summaries of astronomical themes\nfound in previous surveys (Rashed and Morelon 1996[CB]; Morrison 2013).\n1.6.1 Introduction\nUntil recently, a more or less strict division between mathematical astronomy and predictive\nastrology was considered appropriate for the study of astral knowledge in all Islamicate societies\nafter about 145/762. Saliba (1982; reprint 1994[CB], 66, 72), for example, suggested that the\nemergence of the science of the configuration [of the universe] (ilm al-hay'a) was the result of scholars\ndefending mathematical astronomy against attacks by religious scholars on astrology. The clearest\nexpression of this trend is the separation of terminologies, concepts and practices in astronomy\nand astrology.\nAiming to avoid earlier overgeneralizations and essentializing judgments, Ragep (2009) iden-\ntified the motivations for practicing the astral sciences in Islamicate societies as practical, religious,\nphilosophical and political. He argued that the rejection of astrology by various religious scholars\nwas only one among the many reasons for the emergence of the science of the configuration [of the\nuniverse] and that this rejection took various forms. Moreover, according to my experiences in\nmanuscript libraries and with manuscript catalogues, numerous treatises presenting themselves as\nbooks on the science of configuration (ilm al-hay'a) include chapters on astrological themes.\nIn this handbook, we are also making a serious effort to avoid such overgeneralizations\nand modern classifications. I have encouraged contributors to use the term astral sciences and\nrender the actors' self-designation munajjimin as astral experts. Due to differences in opinion,\nDOI: 10.4324/9781315170718-8\n80",
      "bbox": {
        "l": 159.0,
        "b": 755.0,
        "r": 594.0,
        "t": 909.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 206.0,
        "b": 705.0,
        "r": 546.0,
        "t": 732.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 206.0,
        "b": 705.0,
        "r": 546.0,
        "t": 732.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 321.0,
        "b": 653.0,
        "r": 431.0,
        "t": 673.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 321.0,
        "b": 653.0,
        "r": 431.0,
        "t": 673.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 456.0,
        "r": 652.0,
        "t": 597.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 306.0,
        "b": 406.0,
        "r": 445.0,
        "t": 420.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 268.0,
        "r": 652.0,
        "t": 391.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 142.0,
        "r": 652.0,
        "t": 265.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 88.0,
        "r": 652.0,
        "t": 139.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 263.0,
        "t": 64.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 53.0,
        "r": 263.0,
        "t": 64.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 635.0,
        "b": 53.0,
        "r": 650.0,
        "t": 64.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nnot everyone follows this approach; some continue differentiating between astronomers and\nastrologers according to themes, methods and problems. The decision to treat astral knowledge\nas a unit despite the numerous differences between practitioners, periods and regions is based\non five points: (1) the absence of a specialized actor-related terminology separating astronomers\nfrom astrologers, (2) the presence of shared theoretical and mathematical components in the two\ndomains, (3) the representation of practices and goals by historical actors, (4) the engagement in\nastrology of many scholars considered by modern historians of sciences primarily as astronomers\nand (5) the existence of many works treating the astral sciences as a whole.\nOne example will suffice to document such overlaps. Abū 1-Şaqr al-Qabişi (mid-4th/10th\ncentury) was a court astrologer of Emir Sayf al-Dawla (r. 333-356/945-967) in Aleppo. He\nstudied Ptolemy's Almagest and probably other works on the mathematical sciences with another\nastrologer in his hometown of Mosul. Among his writings as a mature astral expert are a lost trea-\ntise, apparently on questions concerning mathematical astronomy, called Doubts on the Almagest\n(Shukuk fil-Majisți), intended for testing people claiming astral expertise, a lost Book on the Rea-\nsons behind the Astronomical Handbooks (Kitāb ilal al-zījāt), the extant Treatise on the Distances and\n(Heavenly) Bodies (Risala fi l-ab'ad wa-l-ajram), the extant Book on the Introduction in the Science of\nthe Judgment of the Stars (Kitab al-Mudkhal ilā sina'at aḥkām al-nujum) and the extant Treatise on the\nTesting of Those Who Call Themselves Astral Experts (Risala fi imtihan al-munajjimin mimman huwa\nmuttasim bi-hadha l-ism). These books show that al-Qabişi was trained in all fields of the astral\nsciences and practiced them at the Hamdanid court. He insisted that the complete astral expert\nhad to be solidly qualified in both species of the astral sciences; be able to solve all of their prob-\nlems \"through his own intelligence,\" not the mere repetition of texts or the use of an astrolabe;\nto be capable of rational demonstrations and proofs; and to be able to compile an astronomical\nhandbook based on direct observations, not mere re-computations of data obtained from earlier\nscholars (Burnett 2002, 203-4; al-Qabīşi 2004, 2-6).\nThe content, fields and texts of the predictive parts of the astral sciences in Islamicate societies\nhave been expertly summarized in a recent article on astrology by Burnett (2007) in the third\nedition of the Encyclopaedia of Islam. Ragep (2009) published an analogous summary of some\nother parts of the astral sciences. The interested reader should consult both of them in conjunc-\ntion with this chapter, although both articles contain several claims with which I disagree. A\nrecent bibliographical survey of publications on the astral sciences in Islamicate societies until\n1450 can be found on the website of the Ptolemaeus project at the Bavarian Academy of Science\n(https://ptolemaeus.badw.de/astrobibl/section/G).\n1.6.2 Classifications of the astral sciences\nThe purpose of this section is to shed some light on the contributions of philosophers to the\nastral sciences, to point to some of the fundamental differences between philosophers and some\nof the astral experts and to stress that the adoption of Aristotelian natural philosophy and epis-\ntemology as the foundations of the astral sciences was neither a simple, straightforward process\nnor an uncontested commitment.\nClassifications of the astral sciences were manifold, contradictory and in continuous flux.\nTwo main positions existed: (1) astral knowledge is one discipline with different species, and (2)\nastral knowledge belongs to two different sciences marked by different epistemological values.\nThe non-prognosticating parts were understood as forming a mathematical discipline, which\nwe call today astronomy. The prognosticating parts, which we call astrology, were defined in\ntwo ways: (1) a second component of the astral sciences as a mathematical discipline and (2)\na subdiscipline or branch of natural philosophy. The subsequent issue was how to define the\n81",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 809.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 503.0,
        "r": 639.0,
        "t": 806.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 359.0,
        "r": 638.0,
        "t": 500.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 216.0,
        "b": 316.0,
        "r": 510.0,
        "t": 331.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 215.0,
        "r": 638.0,
        "t": 302.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 88.0,
        "r": 638.0,
        "t": 212.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 357.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "3": [
    {
      "label": "section_header",
      "text": "Sonja Brentjes\nrelationship between the two species or sciences: Were both parts of equal standing, or were\nthey in a hierarchical relationship, and if so, which one of the two should precede the other? A\nthird question asked whether one or both should be based on an epistemically higher discipline\nfrom which their principles and foundational proofs had to be derived. If affirmed, the higher\ndiscipline was natural philosophy. A fourth issue concerned the reliability of methods and the\nsoundness of theories.\nThe answers to the first two questions depended on views about the positions of the math-\nematical sciences in the entire system of knowledge, the role of philosophy regarding revelation\nor religious law, and the classification of the philosophical disciplines. The answers to the third\nquestion usually depended on how scholars saw the role of Aristotelian epistemology as ela-\nborated in the Posterior Analytics in the system of the sciences. The positions taken in regard to\nthe fourth question reflected religious beliefs, experiences with predicted results and the social\nstatus of practitioners (Burnett 2002). Behind these questions addressed to the astral sciences\nmore general debates lurked that had emerged in antiquity: What were the status, objects and\nmethods of the three theoretical parts of philosophy (metaphysics, natural philosophy, the mathe-\nmatical sciences), their interrelations and the character of their results (conjectures or certain\nknowledge)? Among the ancient scholars who had grappled with these issues (Bowen 2007;\nFeke 2014, 2018), three were certainly known through translations of parts of their works:\nGeminus (c. 70 BCE), Hero (1st century) and Ptolemy (c. 100-170). They reinterpreted the\nrelationship and ranking between the three theoretical disciplines of philosophy in favor of the\nmathematical sciences, on the basis of the certainty of their proofs and hence the knowledge\nthey engendered. It is, however, still unclear whether their opinions guided some of the debates\nbriefly summarized in this section or inspired some of the deviating positions attributed to\nscholars mentioned below.\nThe works of al-Kindi (d. c. 256/870) and his associate Abū Ma'shar (171-272/787-886)\nmarked out an important position. They agreed that contrary to common belief the science of\nthe stars was not based on conjecture and guesswork but was firmly grounded on first principles.\nIt worked with analogical reasoning and demonstrations on the basis of reliable observations and\ntrustworthy experience (Abū Ma'shar 2019[CB], 1: 46-7, 54-69). Abū Ma'shar believed that\nthis science consisted of two species. The first was the science of the universe. This was appa-\nrently a mathematical science, since it contained the science of quality and quantity of the higher\nspheres, and because its arguments were derived from arithmetic, geometry and the science of\nmeasurement. The second, the science of the judgments of the stars, was the knowledge of the\nnatures of the planets, the powers of their movements and their impacts on the sublunar world.\nHence, it was not a mathematical science but connected to natural philosophy. These two spe-\ncies were not on an equal footing, since the second species received its information from the\nfirst (Abū Ma'shar 2019, 52-5). On the other hand, Abū Ma'shar affirmed that aspects of the\nsecond species that are not obvious and clear are \"inferred by means of clear analogies (rational\narguments) from the science of the natures of things (physics)\" (Abū Ma'shar 2019, 1: 55). At\nthe same time, the science of the stars was universal, like medicine, but higher and nobler than\nthis discipline, because its objects belonged to the celestial realm (Abū Ma'shar 2019, 1: 68-71).\nAccording to Adamson, Abū Ma'shar defended this position through theological types of rea-\nsoning following a precedent set by al-Kindi (Adamson 2002, 249-51).\nIn the 4th/10th and 5th/11th centuries, a number of authors with different intellectual affi-\nliations and standing wrote short texts on how to arrange, evaluate and define the various fields\nof knowledge. Most writers discussed the fields of knowledge as a whole. A few chose other\napproaches such as a classification by technical terminology or the practices of the people who\nengaged in such matters. Differences in goals and social contexts yielded differences in emphasis,\n82",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 846.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 522.0,
        "r": 652.0,
        "t": 841.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 179.0,
        "r": 653.0,
        "t": 517.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 652.0,
        "t": 176.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 370.0,
        "b": 51.0,
        "r": 383.0,
        "t": 63.0
      }
    }
  ],
  "4": [
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nstyle and evaluation. Al-Tawhidi (d. 414/1023), a secretary and litterateur, treated the astral\nsciences like the medical sciences, setting both up from the perspective of the practitioners and\ndividing both fields into two parts - knowledge (ilm) and action ('amal). While the description\nof medicine leaves little doubt that the practitioner should be well versed in both parts, the dis-\ncussion of those who contemplate the stars is more equivocal. The beginning of the description\nimplies that the practitioner applies himself to both parts, the first part being the conditions\nof the stars, the differences between their ways and stations, their rising and setting, and the\nsecond being the exploration of the judgments of the stars regarding future matters. But after\nthe enumeration of these content elements it becomes clear that it would be best to deal only\nwith the first part. Not only are the tasks of the second part more demanding and less certain\nin their implementation, but the gains are also poor and the impact on society more damaging\nthan ignorance (which al-Tawhidi despised). Pursuing the first part leads directly to astonishment\nfollowed by an opening of the heart and an enlargement of the breast that reinforce belief in and\nveneration of God (al-Tawhidi 1963-1964, 267, Arabic Pl. 2).\nIn the late 3rd/9th and early 4th/10th centuries (Callatay 2013, 301), a work ascribed to\na group called the Brethren of Purity (Ikhwan al-safa) began to take shape. This group alle-\ngedly consisted of well-educated religious scholars. Their affiliation within Islam remains puzz-\nling, although numerous features of their encyclopedia of 51 or 52 individual treatises (Ikhwan\nal-Safa' 1957[CB]) were believed to suggest an inclination toward several Shi'i denominations.\nRecently, De Vaulx d'Arcy proposed a different interpretation arguing for al-Kindi's student and\nlater courtier Aḥmad ibn al-Tayyib al-Sarakhsī (d. 286/899) as the sole author of this collection of\ntreatises (https://journals.openedition.org/mideo/3397?lang=ar). Whoever authored the col-\nlection took several stances in the epistles concerning classification, only one of which can be\nmentioned here as an example. At the beginning of their Third Epistle: On Astronomy (al-Risala\nal-thalitha fi astrunumiya), they split the mathematical part of the science of stars into two species\nso that the whole discipline now encompassed three species: (1) the science of the configura-\ntion [of the universe] (ilm al-hay'a), (2) the science of understanding astronomical handbooks,\nalmanacs, calendars and (3) the science of judgments (Ikhwan al-Safa' 2015, 25). Within the\nepistle they only treated the first and third parts, mentioning the second part only in four brief\nsentences (Ikhwan al-Safa' 2015, 59).\nThe philosopher al-Fārābī (d. 339/950-1) went in a different direction. He divided the sin-\ngle science of the stars into two different sciences, placing the science of the judgments of the\nstars before the mathematical science of the stars (ilm al-nujum al-ta līmī; al-Fārābī 1996[CB],\n57). Their contents differed only in minor details from the views of his predecessors (al-Fārābī\n1996, 58-61).\nIbn Sīnā (d. 428/1037), himself a famous and highly influential philosopher, mixed Neo-\nplatonic and Aristotelian perspectives in his classifications of the sciences, including the astral\nsciences. His oeuvre is, however, too rich to summarize here. As an example, a brief summary\nfrom his early Treatise on the Parts of the Rational Sciences (Risala fi aqsam al-'ulum al-'aqliyya) has\nto suffice. In this treatise, Ibn Sina presented his youthful understanding of the parts of Peripa-\ntetic philosophy as three theoretical sciences and three practical sciences. The astral sciences are\ndiscussed in the first two of the theoretical sciences: natural philosophy and the mathematical\nsciences. The second main part of the natural sciences encompasses knowledge about the main\ncomponents of the universe such as the heavens, what they contain and the four elements,\nas established in Aristotle's On the Heavens (Ibn Sinä 1298/1880, 75). Among the branches\nof the natural sciences, Ibn Sīnā lists first medicine, followed by the judgments of the stars\n(Ibn Sīnā 1298/1880, 75). According to the Neoplatonic quadrivium, the science of the config-\nuration [of the universe] (ilm al-hay'a) is the third of the fundamental mathematical sciences.\n83",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 701.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 413.0,
        "r": 639.0,
        "t": 698.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 324.0,
        "r": 638.0,
        "t": 410.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 320.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 979.0,
        "r": 414.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "Sonja Brentjes\nIts only subdiscipline concerns the compilation of astronomical handbooks and almanacs (Ibn Sīnā\n1298/1880, 76). While the placement of the judgments of the stars by Ibn Sina has often been\ninterpreted by modern historians as downgrading them, this is questionable. At least, it was not\na new position when compared with the debates in the Hellenistic period about the question\nof whether Babylonian horoscopic astrology was a science and, if so, where it should be placed\n(Bowen 2007; Feke 2014, 297-8).\nAs seen in the brief survey of earlier classifications, even those scholars who considered the\njudgment of the stars as a species within one single science and equal in position and relevance\nto the configuration [of the universe], rarely saw the science of the judgments of the stars a field of mathe-\nmatical knowledge. The breaking apart of the two species and the equalization of medicine and\nthe astral sciences as disciplines of equal rank and structural composition, while already consid-\nered by Abū Ma'shar, appear as classificatory principles only in the 4th/10th century.\nIn the late 6th/12th century, the influential religious and philosophical scholar Fakhr al-Din\nal-Razi (d. 606/1210) declared the judgment of the stars and other occult sciences to belong to\nthe mathematical sciences (Melvin-Koushki 2017, 127). Under his impact and that of the Breth-\nren of Purity, as well as Ibn Sina, the identification of the parts of the astral sciences shifted back\nand forth between natural philosophy and mathematics. This remained a constant feature of the\ndebates in Islamicate societies until the 12th/18th century at the very least. A second significant\nfeature of those debates consists in partitioning the astral sciences into an increasing number of\ndisciplinary components, which were either portrayed as independent fields of knowledge or as\nsubdisciplines. A third aspect is the relative instability of meaning and of relationships between\nsuch designations. Similarly, outside of treatises on classification, for instance in biographical\ndictionaries or historical chronicles, meanings and relationships between the content of subdis-\nciplines remained unstable, as did the relationships to their practitioners.\n1.6.3 Debates on astral theories and practices\n1.6.3.1 Philosophical foundations\nA good number of the many ancient Greek texts translated into Arabic during the 2nd/8th,\n3rd/9th and 4th/10th centuries discussed the structure and properties of the universe. Among\nthem were Plato's (d. 348-347 BCE) Timaios and Galen's (129-216) commentary on it, Aris-\ntotle's (384-322 BCE) On the Heavens and Alexander of Aphrodisias's (late 2nd-early 3rd centu-\nries) commentary, John Philoponus's (d. 574) and Aristotle's Meteorology and Theophrastus's (c.\n371-287 BCE) texts on weather phenomena (Lettinck 1999; Taub 2003). Combined with claims\nand arguments from Ptolemy's Almagest and Planetary Hypotheses, these translations provided the\nastral sciences in Islamicate societies with theoretical foundations that remained largely operative\nfrom the 3rd/9th until the 12th/18th century, although different authors occasionally ques-\ntioned and critically discussed various components.\nPractitioners of the astral sciences believed that the universe was spherical and without void,\nthat the earth was spherical and immobile in its center and that the universe was divided into an\nimmutable part and a mutable part. The immutable part was filled by the fifth element ether. It\nbegan with the orbs supporting the moon and ended with the outermost sphere. The mutable\npart was the constantly changing world below the moon. It was composed of earth, as the heavi-\nest element, followed in ascending order by water, air and fire. The eternal bodies made up from\nether, from the moon outward, moved uniformly and in a circle around a center, preferably the\ncenter of the universe. The bodies of the sublunar world were as a rule composed of different\nparts of the four elements and characterized by different degrees of the two qualities (hot, cold;\n84",
      "bbox": {
        "l": 101.0,
        "b": 846.0,
        "r": 651.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 737.0,
        "r": 652.0,
        "t": 842.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 521.0,
        "r": 652.0,
        "t": 735.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 215.0,
        "b": 476.0,
        "r": 538.0,
        "t": 493.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 256.0,
        "b": 440.0,
        "r": 495.0,
        "t": 457.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 251.0,
        "r": 652.0,
        "t": 428.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 89.0,
        "r": 652.0,
        "t": 248.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 369.0,
        "b": 52.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "6": [
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nwet, dry) of each element that formed part of the mixture. They resulted from different processes\nof generation and decay. Their so-called natural motion (a motion not caused by compulsion)\nwent in a straight line to their natural place according to the heaviness of each body, depending\non the mixture of the two heavy (earth, water) and the two light elements (air, fire) that com-\nposed it. Heavy bodies moved downward, while light bodies moved upward.\nSo far, there is no overarching study of the process that led to the adoption of those natural\nphilosophical assumptions among experts in the mathematical sciences and, in particular, those\nwho focused partly or entirely on the astral sciences. Based on existing research on specific texts\nand scholars, it seems likely that the scholars who were primarily responsible for the acceptance\nof this set of beliefs during the 3rd/9th century were philosophers like al-Kindi, astrologers like\nAbū Ma'shar and physicians like Hunayn ibn Ishaq (d. 260/873).\nAl-Kindi addressed many questions concerning the universe, studying them from different\nperspectives. He was most interested in elucidating the connections between the celestial and\nterrestrial realms. He asked, for instance, how the planets can initiate transformations in the\nbodies of the sublunar world, if they consist of a different element, ether. How can they emit\nlight and heat, like the element fire, when they consist of such a profoundly different element?\nWhy is it proper to attribute specific effects to each planet when all of them consist of one and\nthe same element? As his fundamental position, al-Kindi declared that God is the cause for all\nthat happens in the universe. However, God does not act directly but is the remote agent cause.\nIn order to bring about change, the proximate agent causes are needed. These proximate agent\ncauses are the planets. Al-Kindi established this position by using Aristotle's theories of the four\ncauses (material, agent, formal, final), the four qualities (hot, dry, cold, wet) and the four ele-\nments (Adamson and Pormann 2012, 153-4). On how they achieve these changes, he offered\nthree different lines of argumentation in different treatises apparently written in different periods\nof his life. According to the earliest one, planets cause sublunar processes due to the heat and\nfriction that their movements create according to their speeds, sizes and distances. In another\naccount, perhaps formulated late in his life, al-Kindi argued that changes happen because both\nplanets and elements emit rays. In a third account, he attributed the planetary effects to math-\nematical proportions and symbolic analogies (Adamson and Pormann 2012, 154-5, 162-4;\nOrthmann 2016, 730; Adamson 2020). The last treatise deals with weather forecasting, while\nthe other two are cosmological and theological in orientation. These contradictory claims sug-\ngest that al-Kindi continued to reflect on the complex questions about the relationship between\nGod, the celestial realm and the sublunar world, without achieving a coherent theory. But he did\nargue throughout that cosmological theories appropriated from ancient philosophy, in particular\nAristotle, supported the fundamental Islamic beliefs in God's role in the world (Adamson and\nPormann 2012, 155-6).\nAl-Kindi also shared some Platonic views, for example, that \"the planets were rational, ...\nspiritual beings capable of intelligence and speech,\" and hence the causes and administrators of\neverything in the sublunar world. Their activities followed the command of the Prime Creator\nwho exercises through them control and providence over the sublunar world (Saliba 1994, 55;\nAdamson 2020). In the 4th/10th century al-Nawbakhti (d. c. 307/920) rejected such a position\nin a treatise specifically dedicated to this subject, Physical Arguments, Drawn from the Books of\nAristotle, Negating Those Who Have Claimed That the Heavenly Sphere is Living and Rational (Hujaj\ntabi'iyya mustakhraja min kutub Arisṭātālis fi l-radd 'ala man za'ama anna l-falak bayy natiq).\nAl-Kindi's erstwhile opponent and later enthusiastic student Abū Ma'shar profited not only\nfrom his teacher's knowledge of astral matters but also from his studies of Aristotelian and Neo-\nplatonic philosophy. Like him he explained planetary effects on the sublunar world as resulting\nfrom their differences in motion. He insisted on the existence of a First Cause that operates those\n85",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 863.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 755.0,
        "r": 638.0,
        "t": 860.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 305.0,
        "r": 639.0,
        "t": 752.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 161.0,
        "r": 641.0,
        "t": 302.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 639.0,
        "t": 158.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 370.0,
        "t": 64.0
      }
    }
  ],
  "7": [
    {
      "label": "section_header",
      "text": "Sonja Brentjes\nmotions like a distant force and which he identified with God (Orthmann 2016, 730-1; Abū\nMa'shar 2019, 1: 12). The motions of the planets are the cause of the movement of the sublunar\nelements and allow their potentiality for change to actualize. This impact over a distance is only\npossible because the sublunar elements are inherently susceptible to it (Abū Ma'shar 2019, 1: 11).\nAbū Ma'shar combined these basically Aristotelian ideas with Platonic concepts such as the form\nthat is the defining feature of each thing and operates like an artisan, while the four sublunary\nelements are its tools. The most powerful of all the planets is the sun (Abū Ma'shar 2019, 1:12).\nWhile those and other concepts and claims serve to justify the reality and the scientific nature\nof the art of judgments (astrology), the cause and regulator of all planetary activities and effects\nis God alone.\nSome scholars also challenged the philosophical assumptions summarized above either in\npart or as a whole. Among them were Thabit ibn Qurra (d. 288/901), al-Bīrūnī (362-d. after\n444/973-d. after 1053), 'Umar al-Khayyam (439-c. 517/1048-c. 1123) and perhaps also al-Kühi\n(2nd half 4th/10th century) and al-Isfizări ([late 5th-early 6th/11th-early 12th centuries;] Rashed\n2009, 696-9). These challenges may have emerged (at least partly) from some of the epistemo-\nlogical views expressed by Hellenistic scholars, in particular Ptolemy. But there is not enough\nresearch to come to a definitive conclusion. Thabit ibn Qurra may have even questioned the\nentire physical doctrine of Aristotle (Rashed 2009, 676-7). But we cannot be certain because\nnot enough of his treatises on these issues have survived. The surviving fragments indicate his\nrejection of Aristotle's theories of natural place, the nonexistence of the void, the definition of\ntime as a measure of celestial movement and some of the properties of movement. He also seems\nto have been indecisive about the role of the Prime Mover in the movements of the spheres\n(Rashed 2009, 683-99). Al-Bīrūni is well known for his rejection of several Aristotelian natural\nphilosophical doctrines in his letters to Ibn Sina (al-Biruni and Ibn Sina 1970). His letters express\ncuriosity, challenge, criticism and dissatisfaction. But there are no studies yet of the philosophical\npositions he took in his later works. In general, this is also true for the overarching question of\nwhich philosophical positions astral experts held in different times and regions.\nAs a whole, however, according to our current knowledge, Aristotelian natural philoso-\nphy formed a stable theoretical foundation on which the astral experts practiced their crafts\nwhether mathematical or more speculative. Aristotelian doctrines were incorporated into\nmanuals or synopses of astronomical matters, usually following the geometrical propositions,\nmostly taken from Euclid's (3rd century BCE) Elements. An example is Athir al-Din al-Abhari's\n(d. between 660/1263 and 663/1265) Concise [Book] on the Science of the Configuration [of the\nUniverse] (Mukhtaşar fi ilm al-hay'a). He opened the second chapter with the simple acknowledg-\nment that natural philosophy provides the basis for astronomical knowledge:\nIt has been established in the natural sciences that the celestial bodies are equal in their\nparts and natures, that their figures are spherical, that they move in circular (forms),\nthat there is no beginning in them for a straight inclination; that the place of the earth\nis in the middle of the world.\n(MS Paris, BnF, Arabe 2515, fol. 5b, 10-13)\nThe above mentioned author/s of the Treatises of the Bretren of Purity (Rasa'il Ikhwan al-ṢŞafa)\ntreated natural philosophical doctrines as well-accepted underpinnings of the astral sciences. In\ntheir 3rd epistle titled Astronomy (astrunumiya) they confirm that the impact of the stars on the\nsublunar world is due to the movements of the planetary orbs and the planets, that the theory of\nthe four qualities applies to the zodiacal signs and that all celestial orbs are spherical and move in\ncircular motions. They also likened the planets to spirits and the zodiacal signs to bodies (Ikhwan\n86",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 774.0,
        "r": 653.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 467.0,
        "r": 653.0,
        "t": 770.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 323.0,
        "r": 654.0,
        "t": 464.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 129.0,
        "b": 234.0,
        "r": 627.0,
        "t": 302.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 380.0,
        "b": 216.0,
        "r": 625.0,
        "t": 230.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 654.0,
        "t": 194.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 369.0,
        "b": 51.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "8": [
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nal-Safa'2015, 25, 31-2). They presupposed more specific beliefs about the material nature of the\nplanets as round and luminous bodies and the orbs as spherical, transparent and hollowed-out\nbodies (Ikhwan al-Safa'2015, 25-6).\nDespite the substantial difference in mathematical content and overall religious outlook, this\nepistle has several features in common with al-Biruni's Book of Instruction on the Elements of the\nArt of Astrology (Kitāb al-Tafhim li-awa'il şina'at al-tanjim), dedicated in 420/1029 to Rayḥāna, a\nyoung woman probably from Khwarazm (al-Birūni 1934). Both are teaching texts, both illus-\ntrate concepts and claims with diagrams, and both simplify the access to scholarly matters by\nusing comparisons with things from everyday life. The sphere of the moon encloses the lightest\nelement air \"like the shell of an egg encloses its egg white\"; the earth is compared to the yolk\nof the egg and the outermost, perpetually moving sphere is likened to a wheel (Ikhwan al-Safa'\n2015, 26-7, 46).\nHistorians of astronomy often argue that natural philosophy played its most important role in\nthe development of non-Ptolemaic planetary models (Chapter II.6). Aristotle and his followers\nascribed the discussion of the \"essence\" (structure and properties) of the universe as a whole\nto natural philosophy and not to the astral sciences. Also, no text specifically devoted to the\nmeaning of natural philosophical teachings for the astral sciences is known to have been written\nby scholars of the early Abbasid caliphate. However, Morelon emphasized that several of their\nextant writings are concerned with this topic (Morelon 1999, 115). He showed, for example,\nfor the treatise of the Banu Mūsā (3rd/9th century) On the Solar Year (Kitab fi sanat al-shams) -\nfalsely attributed to Thabit ibn Qurra (d. 288/901) - that it interweaves natural philosophy and\nmathematical astronomy. An analogous point was made by Ragep in his discussion of al-Battani's\n(244-317/858-929) description and criticisms of ancient and contemporary theories, observa-\ntions and the philosophical groundings of celestial movements (Ragep 1996).\nIndependently from Morelon and Ragep, Orthmann, a historian of the Persianate world and\nthe social impact of astrology, emphasized that models of the universe were questioned from\nphilosophical, scientific and religious positions (Orthmann 2016). Major points concerned the\nstructure and properties of the universe as a whole and its parts.\nOne of those discussions concerned the existence of spheres beyond the sphere of the\necliptic (the path of the mean sun, also called the sphere of the zodiac or the sphere of fixed\nstars), the eighth and perhaps outermost sphere. Following Aristotle, Ptolemy had declared the\nmovements of the heavens to originate due to a Prime Mover situated in the sphere beyond\nthe ecliptic. In the 3rd/9th century, the Banu Mūsā rejected the existence of such a ninth\nsphere in their Book on the Motions of the Celestial Spheres (Kitāb Harakat al-aflāk). The brothers\nexplained the daily motion by the rotations of each single sphere from the moon to the fixed\nstars (Casulleras 2007, 1: 93). One of the them, Ahmad, reportedly delivered a geometrical\nproof against the existence of the ninth sphere (Casulleras 2007, 1: 93). In the following cen-\nturies, arguments for more spheres than eight were also offered due to other observational\nresults. An important issue was the precession of the equinoxes. According to Ptolemy this slow\nmovement along the ecliptic of the two points of intersection between the ecliptic and the\ncelestial equator was due to the slow eastward rotation of the sphere of the fixed stars around\nthe ecliptic poles. Another phenomenon seemingly requiring additional external spheres was\nthe apparently changing obliquity of the ecliptic (the angle of intersection between the ecliptic\nand the equatorial planes) which was explained by increasingly complex theories of trepidation\n(Ragep 1996). Identifying in the 4th/10th century the ancient divine Prime Mover or the First\nCause with Allah, facilitated the model's spread beyond the circles of astral experts. Two cen-\nturies later, scholars engaged in planetary theory defined the ninth sphere as a fixed coordinate\nsystem (Ragep 1996, 286).\n87",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 899.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 737.0,
        "r": 638.0,
        "t": 896.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 521.0,
        "r": 638.0,
        "t": 734.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 449.0,
        "r": 638.0,
        "t": 518.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 638.0,
        "t": 446.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 370.0,
        "t": 64.0
      }
    }
  ],
  "9": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "Sonja Brentjes\nThe position of Mercury and Venus with regard to the sun was apparently first formulated\nas a question of symmetry. In a letter on weather forecasting, a subfield of the astral sciences,\nal-Kindi argued that four spheres existed on each side of the sun (al-Kindi 2000, 245-6). The\nupper spheres were those of Mars, Jupiter, Saturn and the fixed stars. The lower spheres consist,\nin addition to the sphere of the moon, of three single spheres for the following pairs: Venus and\nMercury; fire and air; water and earth. Al-Kindi believed that Mercury and Venus were equidis-\ntant from the sun and hence should be placed in a single sphere together (al-Kindi 2000, 245-6).\nHis justification for putting water and earth, as well as fire and air, in single spheres reflects\nAristotelian physics: water and earth are both cold and heavy, move downward to the center and\ndo not form clearly ordered spheres, as earth rises above water in many places (continents and\nislands). They were often treated as forming a composite sphere. Similarly, air and fire are both\nhot and light, move upward and may not be separated from each other by a simple geometrical\nboundary (al-Kindi 2000, 245).\nAl-Kindi's statements resemble opinions already held in antiquity. They were particularly\nprominent among Roman writers (Eastwood 2007, 36-7, 49). We do not know if other scholars\nin Islamicate societies subscribed to al-Kindi's views. There are, however, some diagrams in Ara-\nbic and Persian texts that present at least the sublunar world in agreement with al-Kindi's model.\nA comment by Nasir al-Din al-Ṭūsi (597-672/1201-1274), in his Recension of the Almagest (Tabrir\nal-Majisti), also might point to a longer life of this view. He discussed earlier observations of the\ntransits of Venus. Some of these are clearly spurious, but others are possibly correct. Using this\nevidence, he rejected the ideas that the two inferior planets are in the sphere of the sun and that\nthe centers of their epicycles coincide with the center of the sun's body (Mozaffari 2016, 276,\nno. 40).\nAl-Kindi's placement of Mercury and Venus is a special form of one of the three opinions\nheld by ancient and medieval scholars about where they move: both below the sun, both above\nthe sun or Mercury below and Venus above the sun. According to Ptolemy, deciding this ques-\ntion with certainty was impossible due to a lack of observations, the difficulty of observing the\noccultation of a large body (the sun) by a much smaller body (a planet) and the long periods\nbetween the occurrence of such occultations (as is the case for Venus; Goldstein 1972, 43).\nBecause of the accepted Aristotelian principle of the unchangeable celestial world, the observa-\ntion of any dark spot on the solar surface would have been (mis)taken for the transit of one of\nthe two inner planets (Goldstein 1972, 44).\nAlthough the worlds below and above the moon were rigidly separated doctrinally, natural\nphilosophy delivered the basis for analogical arguments about the impact of the planets on the\nsublunar world. The sun was recognized as causing the seasons and the change between day and\nnight, the moon as connected to rain and other forms of humidity, and the planets as contri-\nbuting their shares to the temperatures during the seasons (Abū Ma'shar 2019, 9, 225, 257, 259).\nDiscussions about tides linked them primarily to lunar movements. In particular, Abū Ma'shar's\nsubstantial deliberations in the Great Introduction to Astrology were picked up repeatedly by writers\nabout terrestrial matters (Abū Ma'shar 2019, 5, 19, 263-86).\n1.6.3.2 Debates on astronomical problems\nImportant theoretical work began as early as the 3rd/9th century dealing with three big topics -\nthe structure of the universe and the movement of the celestial bodies, the constructions of\ninstruments and the solution of the three tasks related to the religious duties of Muslims (first\nvisibility of the crescent after New Moon, prayer times and prayer directions). These themes\nwere picked up time and again until the end of the period covered in this chapter (and beyond).\n88",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 719.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 539.0,
        "r": 652.0,
        "t": 716.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 377.0,
        "r": 652.0,
        "t": 536.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 233.0,
        "r": 652.0,
        "t": 374.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 228.0,
        "b": 188.0,
        "r": 523.0,
        "t": 204.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 89.0,
        "r": 653.0,
        "t": 176.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 369.0,
        "b": 51.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "10": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nHere I focus on the first topic as it belongs in a narrower sense to the theoretical debates (for the\nother two topics see Chapters IV.2, IV.3, V.4, VI.2).\nAlmost all issues of the first topic were related to studies of Ptolemy's Almagest. A set of them\nconcerned the observed changes of the obliquity of the ecliptic, the equinoctial points and\nthe solar eccentricity, the definition and the determination of the length of the solar year and\nthe motion of the solar apogee. The most important works on those subjects were written in\nBaghdad, Ghazna and Toledo. Their authors evaluated observations, recomputed astronomical\nmagnitudes and devised qualitative or quantitative geometrical models.\nIn the treatise on the Solar Year, the Banu Mūsā rejected Ptolemy's claim that the movements\nof the sun, the moon and the fixed stars were interconnected and hence his convention that the\ntropical year (the time in which the sun travels all the way around the ecliptic) could be taken\nas the standard year in astronomy and astrology. They argued for the sidereal year (the time of\none revolution of the sun with regard to the fixed stars, in modern terms about 1 h 20 m longer\nthan the tropical year), which they considered of the same length as the anomalistic solar year\n(the time of one revolution of the sun with regard to its apogee, in modern terms some 2 h 55\nm shorter than the sidereal year). Their arguments went back and forth between natural philo-\nsophy, mathematical astronomy and observations. Their arguments made use of solar observations\nthat the Banu Mūsā brothers had executed in Baghdad, together with what they perceived as the\ncritical spirit of ancient Greek astronomy. They presented their own observations not merely as\nnew observational results but as part of a history of observations, which included-as an impor-\ntant method - an explicit criticism of earlier observations by ancient scholars (Neugebauer 1962;\nMorelon 1994, 116; Chapter II.7).\nThe observed variability of precession and the decrease of the value of the obliquity of the\necliptic motivated some scholars of the 3rd/9th or 4th/10th centuries to assume a periodicity\nof the two phenomena (Neugebauer 1962, 290). In a treatise called On the Motion of the Eighth\nSphere extant only in Latin translation (Liber de motu de octaue sphere) - also attributed falsely\nto Thabit ibn Qurra - these issues are represented in the first known qualitative geometrical\nmodel (Neugebauer 1962, 291-9; for possible authors of the Arabic treatise see Samsó 1994, I:\n15, 2020[CB], 585). The model resulted from and contributed to the continued discussion of\nwhat was called trepidation or the motion of accession and recession. The assumption, already\nformulated in late antiquity in Greek and Indian works but without geometrical models, was\nthat the equinoctial points move forward and backward at a rate of 1°/80 years along an arc of\n8°. In the ancient mathematical model, the longitude of a star will decrease during the forward\nwest-to-east movement (accession). During the backward east-to-west movement (recession) it\nwill increase again until it reaches its original value.\nTrepidation theory was significantly reinterpreted, although the beginnings are not well\nknown (Ragep 1996, 283-8). Al-Battānī (244-317/858-929) described the results of this pro-\ncess of reformulation in his astronomical handbook as a physical and cosmological interpretation\nof trepidation (Ragep 1996, 271). According to this interpretation, the stars oscillate because\nof a movement of the ecliptic orb. This movement is described as occurring in addition to the\nwest-east movement of the fixed stars (precession). Al-Battani criticized trepidation because\nthere are several consequences resulting from this version which are in conflict with Aristotelian\ncelestial physics (for a discussion, see Ragep 1996).\nDespite the work done in the East, trepidation theory became truly influential only in\nal-Andalus and the Maghrib from the 5th/11th to the 8th/14th century (Comes 2001; Samsó\n1994, I). According to the historical records, the theory was picked up from a treatise written\nin Baghdad and further developed in the circle around Sa'id al-Andalusi (419-462/1029–1070)\nin Toledo. A later member, Ibn al-Zarqallu (d. 493/1100) proposed three different trepidation\n89",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 917.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 809.0,
        "r": 638.0,
        "t": 914.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 557.0,
        "r": 639.0,
        "t": 806.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 324.0,
        "r": 639.0,
        "t": 554.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 179.0,
        "r": 638.0,
        "t": 320.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 89.0,
        "r": 637.0,
        "t": 176.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "11": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 979.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "text",
      "text": "Sonja Brentjes\nmodels in his Treatise on the Motion of the Fixed Stars (Maqala fi barakat al-iqbal wa-l-idbar). They\nsubstantially shaped the further development of astronomical theory and handbooks among\nhis successors in the West. Samsó's analysis of the three models brings to light the fact that Ibn\nal-Zarqallu privileged ancient and Abbasid scholars over Andalusians, and his own recomputed\ndata over observational data (for the details of the models and Samsó's analysis, see Samsó 2020,\n592-610). In the 7th/13th and later centuries, observations undertaken in the Maghrib con-\ntradicted values given in Andalusian astronomical handbooks based on a trepidation model. As\na result, trepidation models were first criticized and then fell out of use in the Maghrib. This\nchange was supported by the values for the obliquity of the ecliptic and the precession of the\nequinoxes found in material arriving in the Maghrib from Ayyubid and Mamluk Egypt and\nSyria (Samsó 2020, 610-41).\nUnderlying many of the debates mentioned here and those going beyond the available scope\nof this chapter are two more general issues: (1) the relationship between observation, calculation\nand theoretical interpretation and (2) the necessity (or not) to engage critically with the practical\nand theoretical results of previous scholars back to antiquity. Time and again, scholars of the\nperiod under discussion formulated opinions on the merits as well as errors of previous results\nand their causes. In response, they offered new mathematical solutions, theoretical insights and\nverifications of observations, reinforcing the identity of the astral sciences and at times even\nchanging their direction (see, e.g., Morelon 2009, 613-17).\n1.6.3.3 Is the science of the judgment of the stars a science?\nThe classification literature summarized earlier explained what kind of science astrology\nwas either mathematical or physical and its status and rank. Other kinds of texts dealt\nwith the larger question inherited from ancient scholars: whether it was a science at all,\nwhat characterized the true expert of the astral sciences and which people were acceptable\npractitioners as opposed to charlatans. Following Ptolemy, writers addressing these questions\ndefended the scientific character of both species or fields of knowledge. They acknowledged\nepistemological differences between the mathematical and physical parts. The results of the\nmathematical parts were certain, due to infallible, rational proofs. But the conclusions of\nthe physical part were at best conjectural, as they were drawn from observing the nature of\nplanetary influences on the life on earth. In addition, some writers argued for the existence\nof possible knowledge (not only of necessary knowledge), as well as the creation of know-\nledge through methods of analogy and comparison (Burnett 2002, 206-10). They promoted\nthe application of tools from logic, the execution of careful, individual observations, and the\nreliance on long-term observational results from competent astral experts of the past (Burnett\n2002, 212).\nKüshyār ibn Labban (late 4th-early 5th/10th-11th centuries) formulated these positions in\nfavor of a nondeterministic science, also subscribed to by al-Kindi, Abū Ma'shar and al-Qabişi,\nas follows:\nThe first division of the science of the stars is that for which there is geometrical\nproof... the second is the science that is grasped by experience... and analogy....\nMost people reject the second science and claim that it concerns things that happen\nby accident and there is no demonstration in it. But we say that, so far as accidents\nare concerned, when it lasts long or occurs in most circumstances, then they have the\nforce of demonstration.\n90\n(Burnett 2002, 202)",
      "bbox": {
        "l": 101.0,
        "b": 755.0,
        "r": 652.0,
        "t": 950.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 611.0,
        "r": 652.0,
        "t": 752.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 170.0,
        "b": 569.0,
        "r": 583.0,
        "t": 585.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 291.0,
        "r": 652.0,
        "t": 557.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 239.0,
        "r": 652.0,
        "t": 287.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 128.0,
        "b": 112.0,
        "r": 624.0,
        "t": 215.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 510.0,
        "b": 93.0,
        "r": 623.0,
        "t": 107.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 369.0,
        "b": 53.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "12": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nThe questions formulated by al-Qabişi for testing astral experts who approached his princely\npatron leave no doubt that the scientific character of both parts of the astral sciences depended\non the relationship between them. An expert on the science of the judgments of the stars had to have\nmastered the Almagest, natural philosophy, instrumental techniques, geometry and arithmetic.\nIn his refutation of ten kinds of criticisms against astrology, Abū Ma'shar explains that experts\nin mathematical astronomy are insufficiently trained if they do not know natural philosophy or\npractice the science of the judgments of the stars, because the latter is the fruit of astral knowledge\n(Burnett 2002, 209; al-Qabişi 2004, 6-7). This view on the connectedness of mathematical\nastronomy and astrology was still held in the early 9th/15th century, when either the Timurid\nprince Iskandar Sultan or possibly one of his court astrologers wrote in the preface to an other-\nwise lost scientific summa that the science of the configuration [of the universe] is the foundation of\nthe noble science of the stars and the latter the fruit of all the parts of mathematical astronomy\n(Brentjes 2009, 465).\n1.6.3.4 Methods for houses, rays and progressions\nThe most important discussions on astrological methods and their mathematical implementa-\ntion took place in astronomical handbooks and specialized treatises (Kennedy and Krikorian\n1972, 3-4; Casulleras and Hogendijk 2012). They concern three fundamental theories that\nhistorical actors considered interrelated: (1) the theory of houses, (2) the theory of aspects and\n(3) the theory of rays. Houses (also translated as places; not to be confused with the domiciles of\nthe planets) resulted from the division of the ecliptic circle or the zodiacal belt into 12 parts.\nThey could either have fixed or mobile limits, often defined by the projection of divisions\nfrom an auxiliary great circle like the equator onto the ecliptic (Kennedy 1996). Similarly,\nthere were different views on how to determine the seven astrological aspects, significant\npoints of rays allegedly cast by a planet, and predictions for any given date by progressions.\nCasulleras and Hogendijk have traced nine methods for projecting rays and identified six\nmethods for predictions made by progression (Casulleras 2009; see Casulleras and Hogendijk\n2012 for a survey of the older literature, editions and translations of primary sources and the\ndetails of the general themes, as well as their respective methods). They consider methods\n(also called systems) as different when their geometrical definitions are not mathematically\nequivalent (Casulleras and Hogendijk 2012, 37). As a result, the computations employed can\nalso differ. Some of the systems are mathematically interrelated, while others are indepen-\ndent. The applied mathematical practices are nontrivial and should thus be acknowledged as\nvaluable contributions to the history of the mathematical sciences in Islamicate societies (see,\nfor instance, Hogendijk 2015, 285).\nThe fact that the different methods were unevenly distributed and evaluated in different\nareas of the Islamicate world points to locally specific developments and perspectives (Casul-\nleras and Hogendijk 2012, 45, 73, 77-8, 82; Chapters V.3, V.4 and VI.2). The evaluation\nby practitioners concerned eight issues related to each other in different ways. The first four\nwere the effectiveness, reliability and applicability of each of the methods for specific pla-\nnetary and imagined celestial positions and the soundness of a method. These formed one\ncomplex. The relationship between methods and the possibility of extending a method to\na more complex case reflect a second set of questions. The remaining two issues were the\nexact or approximate character of the computations and were related to a methodological\nproblem also raised outside the astral sciences. This also applies to the question of which\nmistakes various authors had committed (Casulleras and Hogendijk 2012, 43, 45, 56-7, 59,\n63-4, 70, 73, 81, 83, 91).\n91",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 719.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 191.0,
        "b": 674.0,
        "r": 535.0,
        "t": 691.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 305.0,
        "r": 639.0,
        "t": 662.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 90.0,
        "r": 638.0,
        "t": 302.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 357.0,
        "b": 51.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "13": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 979.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "Sonja Brentjes\n1.6.4 Mathematical practices\nThe main mathematical skills people working on astral matters needed to possess began with the\nabilities to add, subtract, multiply, divide and extract roots in the sexagesimal system (a positional\nsystem with basis 60). They needed to know the relevant great and small circles, arcs and angles\non the celestial and terrestrial spheres and how to do geometrical constructions with a ruler and a\ncompass. They had to be able to transform verbal statements into plane or spherical diagrams and\nvice versa. In more advanced mathematics, they needed to handle proportions between numbers\nor geometrical magnitudes, work with trigonometric magnitudes and relations, trisect arcs or\nangles, to project elements of a spherical surface or a plane unto another plane and make a linear\ninterpolation between two values. More rarely quadratic interpolations were used. Last, they had\nto be able to translate geometrical problems or procedures into arithmetical or algebraic ones and\nthus recognize equivalences between problems from different fields of the mathematical sciences,\nwhich allowed them to search for arithmetical or algebraic solutions (Chapters 1.5 and 1.7).\nThe more proficient experts among them knew how to make theoretical claims and prove\nthem with methods taken from Arabic translations of Euclid's Elements and the Data (Dedomena),\nPtolemy's Almagest, the treatises on the sphere by Autolycus of Pitane (d. c. 250 BCE), Theodosius\n(late 2nd century BCE) and Menelaus (fl. 100), as well as new trigonometric tools derived from\ntranslations of Sanskrit astral texts and their further elaborations in the 3rd/9th and 4th/10th\ncenturies (Chapters 1.5, 1.7, 1.8). They executed complicated calculations and complex geome-\ntrical constructions. They were also able to check the methods applied by other practitioners and\npoint out their mistakes and theoretical or practical shortcomings. Sometimes scathing remarks\nof this kind permeate the works of several scholars of the astral sciences, among them al-Birūni\nand Ibn Mu'adh (Casulleras 2004, 387).\nAn entire literary genre of this kind of critical engagement with the foundations and practices\nof the scholarly field developed in medicine, philosophy, some of the religious sciences (Chapters\n1.11 and 1.12) and in the astral sciences.\nDifficult mathematical problems and complex procedures to solve them were applied not\nonly in those parts of the astral sciences that lacked astrological applications, but also in proce-\ndures needed for producing horoscopes, such as the projection or casting of rays, or the division\nof a chosen great circle for determining the houses with fixed or mobile limits (Hogendijk\n1989, 2005; Casulleras and Hogendijk 2012; Casulleras 2020-2021). The mathematical proce-\ndures used for such higher-level astrological practices were the same that the experts used for\ncalculations and constructions in the mathematical part of the astral sciences (astronomy). The\nsame holds for proofs and demonstrations or the preference of exact solutions over approximate\nones. Exact solutions occur primarily in discussions of theoretical problems of the astral sciences.\nCasulleras assumes that more complex formulations of theories and their procedures led to an\nincrease in scholarly reputation, which in turn inspired the creation of more difficult theories\ninvolving efforts to find more sophisticated mathematical solutions (Casulleras 2004, 385-6).\nApproximate methods, on the other hand, seem to have dominated the daily practice of horo-\nscope casting, computation of astronomical and astrological tables and the determination of prayer\ntimes and prayer directions. Arithmetical procedures that required only the use of tables seem\nto have been preferred over geometrical methods (Casulleras 2004, 388, 392-7; Casulleras and\nHogendijk 2012, 76). Practicing astrologers could also work with astrolabes, which are effectively\nanalog computers. Some specimens are known or described in texts that include special plates or\nplates with sets of lines for astrological tasks (Hogendijk 2005, 98-9; Casulleras 2013; Casulleras\nand Hogendijk 2012, 50-3, 55 et al.; see the latter for their reservations about the usability of\nsome of those plates because of the agreement of the geometrical representation for several of the\n92",
      "bbox": {
        "l": 272.0,
        "b": 933.0,
        "r": 481.0,
        "t": 949.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 708.0,
        "r": 652.0,
        "t": 921.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 528.0,
        "r": 652.0,
        "t": 705.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 474.0,
        "r": 652.0,
        "t": 525.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 258.0,
        "r": 652.0,
        "t": 471.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 96.0,
        "r": 653.0,
        "t": 255.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 369.0,
        "b": 51.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "14": [
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nmethods). The use of an armillary sphere, as well as a globe, was discussed by Jewish scholars at\nthe court of Alfonso X of Castile ([r. 1252-1284]; Casulleras and Hogendijk 2012, 52).\n1.6.5 Final remarks\nThis chapter has focused on themes that are only partly included in surveys of the history of\nastronomy in Islamicate societies. Astrology was excluded until very recently (Burnett 2007;\nMorrison 2013). A survey of the various complex and difficult mathematical methods used for\npredictions of the future still needs to be written. It is not possible to separate astrology from\nmathematical astronomy on the grounds that it is not considered a science today. If we did this,\nwe would also have to abandon mathematical astronomy, since its natural philosophical founda-\ntions and its models are also faulty and equally contradict reality as understood today. The themes\npresented here indicate the fruitfulness of studying the different parts of the astral sciences as a\nunified field of knowledge interrelated by epistemological and natural philosophical issues of\ngreat importance, a broad range of mathematical methods and sociocultural contexts.\nNote\n1 Consolidated bibliography.\nBibliography\nSources\nal-Birūni, Abū 1-Rayhan. tr. Wright, R. R. 1934. Kitab al-Tafhim li-awa'il sina'at al-tanjim [The Book of\nInstruction in the Elements of the Art of Astrology] (Written in Ghaznah, 1029 A.D.). London: Luzac.\nReproduced from British Museum MS. Or. 8349.\nal-Birūni and Ibn Sina. ed. Nasr, S. H. and Mohaghegh, M. 1970. Al-asila wa-l-ajwiba [Questions and\nAnswers]. Tehran: Shūrai-yi 'äli-yi hunar u-farang.\nIkhwan al-Safa'. ed. and tr. Ragep. E. J. and Mimura, T. 2015. On Astronomia: An Arabic Critical Edition and\nEnglish Translation of Epistle 3. Epistles of the Brethren of Purity. Oxford: Oxford University Press.\nal-Kindi. ed., tr. and com. Bos, G. and Burnett, C. 2000. Scientific Weather Forecasting in the Middle Ages: The\nWritings of Al-Kindi. London and New York: Kegan Paul International.\nal-Qabişi. eds. and trs. Burnett, C., Yamamoto, K. and Yano, M. 2004. Al-Qabisi (Alcabitius): The Introduction\nto Astrology. Editions of the Arabic and Latin Texts and an English Translation. London and Turin: The War-\nburg Institute and Nino Aragno Editore.\nal-Tawhidi, Abū Hayyan. ed., tr. and ann. Bergé, M. 1963-1964. \"Épitre sur les sciences (Risāla fi l-'ulum)\nd'Abū Hayyan al-Tawhidi (310/922 (?) - 414/1023). Introduction, Traduction, Glossaire Technique,\nManuscrit et Édition Critique,\" Bulletin d'études orientales 241-77, 279-83, 285-98, 300.\nMS London, BL, Or. 1992.\nManuscripts\nMS New York, Pierpont Morgan Library, M. 788.\nMS Paris, BnF, Arabe 2515.\nMS Paris, BnF, Supplément Turc 242.\nResearch literature\nAdamson, P. 2002. \"Abū Mašar, al-Kindi, and the Philosophical Defense of Astrology,\" Recherches de Théol-\nogie et Philosophie médiévales 69: 245-70.\n93",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 917.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 290.0,
        "b": 876.0,
        "r": 436.0,
        "t": 889.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 683.0,
        "r": 639.0,
        "t": 860.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 346.0,
        "b": 641.0,
        "r": 380.0,
        "t": 655.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 615.0,
        "r": 251.0,
        "t": 628.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 615.0,
        "r": 251.0,
        "t": 628.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 317.0,
        "b": 569.0,
        "r": 410.0,
        "t": 586.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 337.0,
        "b": 537.0,
        "r": 389.0,
        "t": 549.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 480.0,
        "r": 639.0,
        "t": 524.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 449.0,
        "r": 638.0,
        "t": 478.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 420.0,
        "r": 638.0,
        "t": 448.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 390.0,
        "r": 638.0,
        "t": 418.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 345.0,
        "r": 638.0,
        "t": 388.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 300.0,
        "r": 638.0,
        "t": 344.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 319.0,
        "b": 250.0,
        "r": 407.0,
        "t": 267.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 182.0,
        "r": 352.0,
        "t": 240.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 228.0,
        "r": 233.0,
        "t": 240.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 211.0,
        "r": 352.0,
        "t": 225.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 198.0,
        "r": 233.0,
        "t": 211.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 182.0,
        "r": 285.0,
        "t": 195.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 298.0,
        "b": 139.0,
        "r": 428.0,
        "t": 153.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 98.0,
        "r": 638.0,
        "t": 126.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 54.0,
        "r": 369.0,
        "t": 64.0
      }
    }
  ],
  "15": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "section_header",
      "text": "Sonja Brentjes\nAdamson, P. 2006. Al-Kindi. New York: Oxford University Press.\nAdamson, P. 2020. \"al-Kindi,\" in Zalta, E. N., ed. Stanford Encyclopedia of Philosophy. Spring 2020 Edition.\nhttps://plato.stanford.edu/entries/al-kindi/#Cos.\nAdamson, P. and Pormann, P. E., trs. 2012. The Philosophical Works of al-Kindi. Karachi: Oxford University\nPress.\nBevilacqua, A. 2018. The Republic of Arabic Letters: Islam and the European Enlightenment. Cambridge, MA:\nBelnap Press.\nBowen, A. C. 2007. \"The Demarcation of Physical Theory and Astronomy by Geminus and Ptolemy,\"\nPerspectives on Science, 15.3: 327-58.\nBrentjes, S. 2009. \"The Interplay of Science, Art and Literature in Islamic Societies before 1700,\" in Dev,\nA., ed. Science, Literature and Aesthetics. History of Science, Philosophy and Culture in Indian Civilization. Vol.\nXV.3. New Delhi: PHISPC, Centre for Studies in Civilizations, 453-86.\nBrentjes, S. 2010. Travellers from Europe in the Ottoman and Safavid Empires, 16th-17th Centuries. Seeking,\nTransforming, Discarding Knowledge. London: Routledge, Variorum.\nBurnett, Ch. 2002. \"The Certitude of Astrology: The Scientific Methodology by al-Qabişi and Abū\nMa'shar,\" Early Science and Medicine 7.3: 198-213.\nBurnett, Ch. 2007. \"Astrology,\" in El-3, 2007-2: 165-75.\nCallatay, G. de. 2013. \"Magia en al-Andalus: Rasail Ijuan al-Safa', Ruthat al-bakim y Gayat al-bakim (Picatrix),\"\nal-Qantara 34.2: 297-344.\nCasulleras, J. 2004. \"Ibn Mu'adh on the Astrological Rays,\" Suhayl 4: 385-402.\nCasulleras, J. 2007. \"Banu Mūsa,\" in Hockey et al., eds. [CB], 1: 92-4.\nCasulleras, J. 2009. \"Métodos para determinar las casas del horóscopo en la astrología medieval árabe [Methods\nfor Determining the Houses of the Horoscopes in Medieval Arab Astrology],\" Al-Qantara 30.1: 41-67.\nCasulleras, J. 2013. \"The Instruments and the Exercise of Astrology in the Medieval Arabic Tradition,\"\nArchives internationales d'histoire des sciences 63.170-1: 517-40.\nCasulleras, J. 2020. \"Horoscope,\" in EI-3, 2020-1: 50-6.\nCasulleras, J. and Hogendijk, J. P. 2012. \"Progressions, Rays and Houses in Medieval Islamic Astrology: A\nMathematical Classification,\" Suhay! 11: 33-102.\nComes, M. 2001. \"Ibn al-Ha'im's Trepidation Model,\" Suhayl 2: 291-408.\nEastwood, B. S. 2007. Ordering the Heavens. Roman Astronomy and Cosmology in the Carolingian Renaissance\n(History of Science and Medicine Library 4). Leiden and Boston: Brill.\nFeke, J. 2014. \"Meta-mathematical rhetoric: Hero and Ptolemy against the philosophers,\" Historia Mathe-\nmatica 41.3: 216-76.\nFeke, J. 2018. Ptolemy's Philosophy. Mathematics as a Way of Life. Princeton: Princeton University Press,.\nGoldstein, B. R. 1972. \"Theory and Observation in Medieval Astronomy,\" Isis 63.1: 39-47.\nHogendijk, J. P. 1989. \"The Mathematical Structure of Two Islamic Astronomical Tables for 'Casting the\nRays,\" Centaurus 32: 171-202.\nHogendijk, J. P. 2005. \"Applied Mathematics in Eleventh Century Al-Andalus: Ibn Mu'adh al-Jayyani and\nAstrological Houses and Aspects,\" Centaurus 47: 87-114.\nHogendijk, J. P. 2015. \"Al-Biruni on the Computation of Primary Progression (tasyir),\" in Burnett, C.\nand Greenbaum, D. G., eds. From Masha'allah to Kepler: Theory and Practice in Medieval and Renaissance\nAstrology. Lampeter: Sophia Centre Press, 279-308.\nKennedy, E. S. 1996. \"The Astrological Houses as Defined by Medieval Islamic Astronomers,\" in Casul-\nleras and Samsó, eds. [CB], 2: 535-78 (Reprint: Astronomy and Astrology in the Medieval Islamic World.\nAldershot: Variorum, XIX).\nKennedy, E. S. and Krikorian, H. 1972. \"The Astrological Doctrine of \"Projecting Rays',\" Al-Abbath 25:\n3-25 (Reprint: Kennedy, E. S. et al. 1983. Studies in the Islamic Exact Sciences. Beirut: American Uni-\nversity of Beirut, 372-84).\nLettinck, P. 1999. Aristotle's Meteorology and Its Reception in the Arab World: With an Edition and Translation of\nIbn Suwär's Treatise on Meteorological Phenomena and Ibn Bajja's Commentary on the Meteorology. Leiden: Brill.\nMelvin-Koushki, M. 2017, \"Powers of One: The Mathematicalization of the Occult Sciences in the High\nPersianate Tradition,\" Intellectual History in the Islamicate World 5: 127-99.\nMorelon, R. 1994. \"Tabit b. Qurra and Arab Astronomy in the 9th Century,\" Arabic Sciences and Philosophy\n4.1: 111-39.\nMorelon, R. 1999. \"Astronomie physique et astronomie mathématique dans l'astronomie précopernici-\nenne,\" in Rashed, R. and Biard, J., eds. Les doctrines de la science dans l'antiquité à l'âge classique. Leuven:\nPeeters, 105-29.\n94",
      "bbox": {
        "l": 338.0,
        "b": 980.0,
        "r": 414.0,
        "t": 993.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 937.0,
        "r": 446.0,
        "t": 949.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 907.0,
        "r": 651.0,
        "t": 934.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 877.0,
        "r": 652.0,
        "t": 905.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 847.0,
        "r": 651.0,
        "t": 874.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 817.0,
        "r": 651.0,
        "t": 845.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 772.0,
        "r": 651.0,
        "t": 814.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 742.0,
        "r": 651.0,
        "t": 769.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 712.0,
        "r": 651.0,
        "t": 739.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 697.0,
        "r": 404.0,
        "t": 709.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 667.0,
        "r": 651.0,
        "t": 694.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 652.0,
        "r": 512.0,
        "t": 665.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 637.0,
        "r": 468.0,
        "t": 650.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 607.0,
        "r": 652.0,
        "t": 635.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 577.0,
        "r": 651.0,
        "t": 605.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 562.0,
        "r": 397.0,
        "t": 575.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 532.0,
        "r": 652.0,
        "t": 560.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 518.0,
        "r": 488.0,
        "t": 530.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 487.0,
        "r": 652.0,
        "t": 514.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 457.0,
        "r": 651.0,
        "t": 485.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 442.0,
        "r": 632.0,
        "t": 454.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 427.0,
        "r": 580.0,
        "t": 439.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 397.0,
        "r": 651.0,
        "t": 424.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 367.0,
        "r": 651.0,
        "t": 394.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 322.0,
        "r": 652.0,
        "t": 364.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 277.0,
        "r": 652.0,
        "t": 320.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 233.0,
        "r": 652.0,
        "t": 275.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 102.0,
        "b": 202.0,
        "r": 653.0,
        "t": 229.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 172.0,
        "r": 652.0,
        "t": 199.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 143.0,
        "r": 652.0,
        "t": 169.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 101.0,
        "b": 98.0,
        "r": 652.0,
        "t": 140.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 369.0,
        "b": 53.0,
        "r": 383.0,
        "t": 64.0
      }
    }
  ],
  "16": [
    {
      "label": "section_header",
      "text": "The astral sciences up to the 13th century\nMorelon, R. 2009. \"The Astronomy of Thabit ibn Qurra,\" in Rashed, R., ed. Thabit ibn Qurra. Science and\nPhilosophy in Ninth-Century Baghdad. Berlin and New York: Walter de Gruyter, 601-18.\nMorrison, R. G. 2013. \"Islamic Astronomy,\" in Lindberg, D. C. and Shank, M. H., eds. The Cambridge\nHistory of Science. 6 vols. Vol. 2: Medieval Science. Cambridge: Cambridge University Press, 109-39.\nMozaffari, S. M. 2016. \"A Forgotten Solar Model,\" Archive for History of Exact Sciences 70: 267-91.\nNeugebauer, O. 1962. \"Thábit ben Qurra 'On the Solar Year' and 'On the Motion of the Eighth Sphere\",\"\nProceedings of the American Philosophical Society 106.3: 264-99.\nOrthmann, E. 2016. \"Philosophy and Natural Science,\" in Rudolph et al., eds. [CB], 727-33.\nPlofker, K. 2007. \"Fazari: Muḥammad ibn Ibrahim al-Fazārī,\" in Hockey et al., eds., 1: 362-3.\nPtolemaeus Arabus et Latinus. \"AstroBibl. 3. Middle Ages (500-1450). 3.3. Islam/Arabic World,\" https://\nptolemaeus.badw.de/astrobibl/section/G\nRagep, F. J. 1996. \"al-Battānī, Cosmology, and the Early History of Trepidation in Islam,\" in Casulleras\nand Samsó, eds., 1: 267-98.\nRagep, E. J. 2009. \"Astronomy,\" in El-3, 2009-1: 120-50.\nRashed, M. 2009. \"Thabit ibn Qurra, la Physique d'Aristote et le meilleur des mondes,\" in Rashed, R., ed.\nThabit ibn Qurra. Science and Philosophy in Ninth-Century Baghdad. Berlin: Walter de Gruyter, 675-714.\nRussell, G. A., ed. 1994. The 'Arabick' Interest of the Natural Philosophers in Seventeenth Century England.\nLeiden: Brill.\nSaliba, G. 1982. \"Astronomy/Astrology, Islamic,\" in Strayer, R. J., ed. Dictionary of the Middle Ages. 13 vols.\nVol. 1. New York: Scribner, 616-24 (Reprint in Saliba 1994 [CB], 66-84).\nSamsó, J. 1994. \"Andalusian Astronomy: Its Main Characteristics and Influence in the Latin West,\" in\nSamsó, J., Islamic Astronomy and Medieval Spain. Aldershot: Variorum, I.\nTaub, L. 2003. Ancient Meteorology. New York: Routledge.\nURL https://journals.openedition.org/mideo/3397?lang=ar\n95",
      "bbox": {
        "l": 257.0,
        "b": 979.0,
        "r": 471.0,
        "t": 994.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 922.0,
        "r": 638.0,
        "t": 950.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 892.0,
        "r": 638.0,
        "t": 920.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 877.0,
        "r": 599.0,
        "t": 890.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 847.0,
        "r": 637.0,
        "t": 875.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 832.0,
        "r": 576.0,
        "t": 845.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 817.0,
        "r": 574.0,
        "t": 830.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 787.0,
        "r": 638.0,
        "t": 815.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 757.0,
        "r": 638.0,
        "t": 785.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 742.0,
        "r": 390.0,
        "t": 755.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 712.0,
        "r": 638.0,
        "t": 740.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 683.0,
        "r": 638.0,
        "t": 710.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 88.0,
        "b": 652.0,
        "r": 638.0,
        "t": 680.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 622.0,
        "r": 638.0,
        "t": 650.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 606.0,
        "r": 392.0,
        "t": 620.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 89.0,
        "b": 592.0,
        "r": 406.0,
        "t": 605.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 356.0,
        "b": 54.0,
        "r": 370.0,
        "t": 64.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 740,
      "h": 1046
    },
    "2": {
      "w": 740,
      "h": 1046
    },
    "3": {
      "w": 740,
      "h": 1046
    },
    "4": {
      "w": 740,
      "h": 1046
    },
    "5": {
      "w": 740,
      "h": 1046
    },
    "6": {
      "w": 740,
      "h": 1046
    },
    "7": {
      "w": 740,
      "h": 1046
    },
    "8": {
      "w": 740,
      "h": 1046
    },
    "9": {
      "w": 740,
      "h": 1046
    },
    "10": {
      "w": 740,
      "h": 1046
    },
    "11": {
      "w": 740,
      "h": 1046
    },
    "12": {
      "w": 740,
      "h": 1046
    },
    "13": {
      "w": 740,
      "h": 1046
    },
    "14": {
      "w": 740,
      "h": 1046
    },
    "15": {
      "w": 740,
      "h": 1046
    },
    "16": {
      "w": 740,
      "h": 1046
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}