{
  "1": "El mundo como una manzana en la palma de la\nmano: el pomo y su relación con\nla cartografia medieval\nSandra SÁENZ-LÓPEZ PÉREZ\nInstituto de Historia (Dpto. Historia de la Ciencia), CSIC\nsandra.saenz-lopez@cchs.csic.es\nRESUMEN\nEste artículo centra su atención en el pomo-una insignia de poder con la que se recrea el mundo en\nmanos del soberano- y, concretamente, en la vinculación que durante la Edad Media mantuvo con la\ngeografia y la cartografia en su concepción formal y simbólica. Dada la escasez de ejemplares conser-\nvados, se recurrirá a fuentes iconográficas, ya que es en imágenes de emperadores, reyes y también de\nCristo como el Salvador, donde el orbe se presenta como un elemento definidor de la retratística del\npoder medieval.\nPalabras clave: pomo, regalia insignia, Edad Media, mapa, Claudio Ptolomeo, Henricus Martellus\nGermanus, Cristo Salvador.\nThe world as an apple on the hand: the orb and its relationship with me-\ndieval cartography\nABSTRACT\nThis article focuses on the orb-an insignia of power that situates the world in the hands of the sove-\nreign-, and the connection that it had in the Middle Ages with geography and cartography, both in form\nand symbolism. Due to the shortage of preserved examples, iconographic sources will be relied upon, as\nit is within portraits of emperors, kings and also Christ as the Savior where the orb appears as a defining\nelement of the medieval image of power.\nKey words: orb, regalia insignia, Middle Ages, map, Claudius Ptolemy, Henricus Martellus Germanus,\nChrist the Savior.\nLa autora quiere agradecer a Marta Serrano Coll los interesantes comentarios que de ella recibiera\ndurante la realización de este artículo, así como a Therese Martin sus orientaciones previas.\nAnales de Historia del Arte\n537\n2013, Vol. 23, Núm. Especial (II), 537-549\nISSN: 0214-6452\nhttp://dx.doi.org/10.5209/rev_ANHA.2013.v23.42853",
  "2": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\nEl mundo es esférico, como una manzana\nEl pomo, también referido como manzana (del latin pomum), orbe o globo, forma\nparte del repertorio de regalia insignia que define la simbólica del poder en la Edad\nMedia'. Su forma redonda evoca el mundo que se deposita en manos del soberano\npara que lo proteja y gobierne, y ese mundo es, efectivamente, esférico. La idea de la\nesfericidad de la Tierra, atribuida a Pitágoras (ca. 585-ca. 495 a.C.) por el historiador\ngriego Diógenes Laercio (siglo III d.C.) en sus Vidas, opiniones y sentencias de los\nfilósofos más ilustres (VIII, 15), perduró prácticamente de forma continua a lo largo\ndel Medievo². Muchos mapas medievales representan la Tierra como circular y plana\npor la dificultad que supuso la conquista gráfica de la tercera dimensión y porque a la\nhora de cartografiar el mundo, solamente se ilustraba la pequeña porción terrestre que\nemergía de una esfera mayoritariamente compuesta de agua³. El monje franciscano\nMatfre Ermengaud (fl. 1288-1322) afirmaba en su Breviario de amor (1288-1292)\nque\n\"El agua del mar ciñe y cubre la tierra por todas partes excepto por una, que Dios\nnos dejó para que podamos habitar en ella. Y, en comparación, la parte que el agua deja\nal descubierto es muy pequeña, tan pequeña como lo que sobresaldría de una manzana\nmetida en el agua. Y la parte de la tierra tiene venas de agua que la atraviesan, pues de\notro modo se secaría en exceso y se convertiría en polvo\".\nEs decir, la tierra es como una manzana que flota en el agua³. La traducción cien-\ntífica de esta imagen cósmica podría tener su eco en representaciones como la que\n1 En el Medievo, las insignias de soberanía, entre las que figura el pomo, fueron referidas como potestatis\nfasces, indumenta regalia, insignia regalia, tal como recoge O. PÉREZ MONZÓN, \"Iconografia y poder\nreal en Castilla: las imágenes de Alfonso VIII\", Anuario del Departamento de Historia y Teoría del Arte, 14\n(2002), p. 36, nota 108. LG. BANGO TORVISO rechaza el término generalizado de regalia, y propone el de\nregalia insignia, que aquí seguimos, en \"Regalia insignia: las señas de identidad del monarca y su linaje\",\nAlfonso X El Sabio, Murcia, 2009, pp. 42-52.\n2 Dentro de la amplia bibliografia referente a la esfericidad del mundo en la Edad Media, véase R. SIMEK,\n\"The Earth as the Protected Centre of a Finite Universe and the Earth as the Yolk in the Cosmic Egg\" y \"The\nShape of the Earth\", Heaven and Earth in the Middle Ages. The Physical World before Colombus, Woodbridge,\n1996, pp. 6-23 y 24-38, respectivamente, y \"Sphère ou disque? La forme de la Terre\", Dossier pour la science,\n37 (2003), pp. 32-36. Existieron sin embargo ciertas excepciones, especialmente desde el ámbito religioso,\nque defendieron la planitud del mundo. Así lo hicieron Lactancio (ca. 260-ca. 320), un escritor cristiano de\norigen norteafricano, en sus Instituciones divinas (III, 24), y el viajero, teólogo y geógrafo bizantino Cosmas\nIndicopleustes (siglo VI) en su Topografia cristiana (esp. Libros II y IV).\n3 Para la relación de agua y tierra en el mundo medieval, véase K.A. VOGEL, \"Das Problem der relativen\nLage von Erd- und Wassersphäre im Mittelalter und die kosmographische Revolution\", Mitteilungen der\nÖsterreichischen Gesellschaft für Wissenschaftsgeschichte, 13 (1993), pp. 103-143; y S. GANDZ, \"The\nDistribution of Land and Sea on the Earth's Surface According to Hebrew Sources\", Proceedings of the\nAmerican Academy for Jewish Research, 22 (1953), pp. 23-54.\n4 A. FERRANDO y V. MARTINES, \"Traducción\", Breviari d'amor de Matfre Ermengaud: (Biblioteca\nNacional de Rusia, Isp. Fv. XIV.NI): libro de estudios, [s.1.], 2007, p. 295.\n5 Los manuscritos iluminados del Breviario de amor de Matfre Ermengaud incorporan la representación\nde la esfera de la tierra flotando en la esfera del agua; véase C. MIRANDA GARCÍA-TEJEDOR, \"Los\nmanuscritos con pinturas del Breviari d'amor de Matfre Ermengaud de Béziers. Un estado de la cuestión\",\nJ. YARZA, La miniatura medieval en la Península Ibérica, Murcia, 2007, pp. 313-373; e \"Iconografia del\n538\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549",
  "3": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\nfigura en la copia manuscrita de finales del siglo XIV del Tratado de la Esfera (siglo\nXIII) de Johannes de Sacrobosco (Fig. 1), donde queda patente que la esfera de la\ntierra (en el centro del universo) no comparte el mismo centro que la esfera del agua\n(la siguiente inmediata), de forma que parece flotar, dejando emerger parte de ella.\naq obfithe io lant\nmuenti Omnia pechi mo\nHas bilut evahir quran\nmids porbinte f\nmagmi me\nmoni budy\nfere mot och moni d\ndf Quepos pin menfur\nbol-364-dieby4-hour\nmegl\nfug\nClay Stam\nlune\nFiggle\nFig. 1. Diagrama del universo en una copia manuscrita de finales del siglo XIV del Tratado\nde la Esfera (siglo XIII) de Johannes de Sacrobosco. Biblioteca de la Universidad de Sala-\nmanca (Ms. 2662, fol. 8v).\nLa esfericidad de la tierra, e igualmente su símil con una manzana, fueron reite-\nrados por el enciclopedista francés Gautier o Gossouin de Metz (siglo XIII), quien\nsugería un hipotético viaje alrededor del mundo en su Image du monde:\n\"La tierra es redonda, y si no hubiera obstáculos, un hombre podría recorrerla, como\nuna mosca circula alrededor de una manzana; dos hombres podrían separarse, mar-\nchando en direcciones opuestas, uno hacia el Este, otro hacia el Oeste, de forma que se\nreencontrarían en las antipodas\".\n'Breviari d'amor\". Escorial, Ms. S.I.3, Madrid, Biblioteca Nacional, Ms. Res. 203\", Tesis Doctoral, Madrid,\nUniversidad Complutense de Madrid, 2002, vol. 1, pp. 463-465.\n6 Biblioteca Universitaria de Salamanca (Ms. 2662, fol. 8v).\n7 Traducción a partir de la edición francesa de O.H. PRIOR (ed.), L'image du monde de maître Gossouin.\n[También atribuido a Gautier de Metz.] Rédaction en prose. Texte du manuscrit de la Bibliothèque nationale,\nfonds français No. 574, avec corrections d'après d'autres manuscrits, Lausana- Paris, 1913, pp. 93-94; para\notra edición francesa de este texto, véase Ch.-V. LANGLOIS, La vie en France au Moyen âge du XIIe au\nmilieu du XIVe siècle, III: La connaissance de la nature et du monde d'après les écrits français à l'usage des\nlaïcs, Paris, 1927, pp. 164-165.\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549\n539",
  "4": "Sandra Sáenz-López Pérez\nEl pomo, insignia de soberanía\nEl mundo como una manzana en la palma de la mano...\nComo las restantes insignias de soberanía, principalmente junto con las vestiduras, la\ncorona y el cetro, el pomo tiene su origen y fundamento en la etiqueta imperial roma-\nnas. Emperadores romanos, y por extensión dioses del panteón clásico, fueron retra-\ntados con el mundo en la mano. Este gesto y el objeto en sí pasaron a la Edad Media\npara definir el poder de nobles, reyes y emperadores, y también de la divinidad. En\nesta transmisión de la Antigüedad al Medievo, el pomo y la forma de sostenerlo ex-\nperimentaron una serie de transformaciones. Frente a la preeminencia alcanzada por\notras insignias -por ejemplo el cetro, que era portado en la mano derecha como signo\njerárquico de distinción, el pomo adquirió un estatus inferior, pues era colocado\ngeneralmente en la mano izquierda y podía ser utilizado por las soberanas. Además,\npasó a estar coronado por una cruz y/o flor de lis, símbolos ambos del mundo cristia-\nnizado que el soberano, en calidad de vicario de la divinidad, debía preservar 10. Así\nse desprende, por ejemplo, de los Castigos e documentos del rey don Sancho IV, un\ntratado castellano destinado a la educación del príncipe heredero de finales del siglo\nXIII, en el que se describen las regalia insignia de \"vn rey muy noble\", entre las que\nse incluye un pomo que, nótese, está referido como \"manzana\":\n\"En la su mano siniestra tenie vna mançana redonda toda de oro, e encima de la\nmançana, vna cruz de oro. E la mançana es a semejança del regno que deue tener el rey\nen su mano e apoderarse del\"!!.\nA pesar de ser un elemento habitual en la retratística del poder en la Edad Media,\nson muy escasos los ejemplares de pomos medievales que han llegado a la actualidad\ny, además, dentro de la Europa medieval, no alcanzaron la misma popularidad en\ntodos los territorios. Fue sin duda en el Sacro Imperio Romano Germánico donde los\nsoberanos se identificaron de forma más clara con esta insignia y, consecuentemente,\nson muchos los pomos germanos conservados y muy numerosos los retratos de em-\nperadores que los exhiben. Frente a esto, en los reinos franceses e hispánicos el pomo\ntardó en cobrar importancia 12, despuntando en cierta medida la Corona de Aragón,\n8 Para el pomo, véase el excelente trabajo de P.E. SCHRAMM, Sphaira, globus, reichsapfel: wanderung\nund wandlung eines herrschaftszeichens von caesar bis zu Elisabeth II, Stuttgart, 1958.\n9 Véase M. SERRANO COLL, \"Iconografia de género: los sellos de las reinas de Aragón en la Edad Media\n(siglos XII-XVI)\", Emblemata, 12 (2006), pp. 15-52; y \"Los signos del poder: regalias como complemento a\nlos emblemas de uso inmediato\", Emblemata, 17 (2011), p. 141.\n10 C. DELGADO VALERO concedió a la flor de lis de las insignias de soberanía un significado cristológico\nen \"La corona como insignia de poder durante la Edad Media\" y \"El cetro como insignia de poder durante\nla Edad Media\", Arte hispano-musulmán (artículos). Homenaje a Clara Delgado Valero, Madrid, 2001, pp.\n549-564 y pp. 565-579. Inicialmente, el primero de estos artículos fue publicado en Anales de Historia del\nArte, 4 (1993-1994), pp. 747-763 y el segundo, en Actas del X Congreso del CEHA, Los clasicismos en el arte\nespañol, Madrid, 1994, pp. 45-52.\n11 A. REY (ed.), Castigos e documentos para bien vivir ordenados por el rey don Sancho IV, Bloomington,\n1952.\n12 P.E. SCHRAMM, Las insignias de la realeza en la Edad Media española, Madrid, 1960, pp. 63 y\n126-128, para el caso del pomo en Castilla; y I.G. BANGO TORVISO, \"De las insignias reales en la España\n540\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549",
  "5": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\ndonde se introdujo en la coronación de Pedro II en 1204, cuando el papa Inocencio\nIII le otorgó este símbolo en detrimento de los derechos antes exclusivos del em-\nperador¹³, y donde cobró especial importancia a partir de Pedro IV el Ceremonioso\n(1336-1387)\nLos pomos medievales llegados a la actualidad son mayoritariamente aquellos que\nformaban parte del ajuar funerario de emperadores y reyes, quienes habitualmente se\nhacían enterrar con sus insignias de soberanía, generalmente no las originales, sino\ncopias de las que habían utilizado en vida. Así por ejemplo, según recogen Jerónimo\nZurita en los Anales de la Corona de Aragón y, posteriormente, Jerónimo de Blancas\nen las Coronaciones de los reyes y reinas de Aragón, el rey Fernando I de Aragón,\nmuerto en 1416, había pedido en su testamento (dictado en Perpiñán, el 10 de octubre\nde 1415), ser enterrado con vestiduras e insignias reales -entre las que figuraba el\npomo-, semejantes a aquellas con las que había sido coronados.\nPomos con cruz de remate han sido encontrados en los sarcófagos de emperadores\ndel Sacro Imperio Romano Germánico, como Enrique III (m. 1056) 16, Lotario II o III\n(m. 1137)17 o Segismundo (m. 1437)18, así como en el de Rodolfo I, rey de Bohemia\n(m. 1307). Igualmente interesante para los pomos funerarios es el grabado con los\nrestos del emperador Federico II Hohenstaufen (m. 1250), realizado por Francesco\nDaniele durante la apertura del sarcófago en las labores de restauración de la Catedral\nde Palermo entre 1781 y 1799, y publicado en I regali sepolcri del Duomo di Palermo\nriconosciuti ed illustrati, Nápoles, 1784. La imagen muestra que el cuerpo del sobe-\nrano fue embalsamado y enterrado con sus correspondientes insignias -vestimenta,\ncorona, espada y el orbe-; este último, descrito por el propio Daniele como \"il pomo\no globo di metallo, mancante però della sua croce; e trovossi pieno di terra\"20, parece\nhaber caído rodando junto a la cabeza del difunto.\nOtros pomos también del Sacro Imperio Romano Germánico fueron ilustrados en\nun grabado de Johann Adam Delsenbach realizado en Nuremberg en 175121. Fue en\nesta ciudad alemana donde se depositaron, entre 1424 y 1796, gran parte de lo que\nactualmente se conoce como el Tesoro del Reich o Imperial (las insignias imperiales\nmedieval\", M.L. MELERO MONEO, et alii (eds.), Imágenes y promotores en el arte medieval. Miscelánea en\nhomenaje a Joaquín Yarza Luaces, Barcelona, 2001, p. 66.\n13 P. E. SCHRAMM, op. cit., 1960, p. 129.\n14 Para el estudio del monarca en la Corona de Aragón y de su recurso al pomo como insignia regia véanse\nlos trabajos ya citados de M. SERRANO COLL, así como su Tesis Doctoral, \"La imagen figurativa del rey de\nAragón en la Edad Media\", Tarragona, Universitat Rovira i Virgili, 2005.\n15 Véase J. DE BLANCAS, Coronaciones de los reyes y reinas de Aragón, Zaragoza, 1641, pp. 90-91.\n16 Museo Diocesano de Espira, Alemania.\n17 Herzog Anton Ulrich-Museum, Braunschweig, Alemania.\n18 Historisches Museum, Budapest.\n19 Catedral de San Vito, Praga. Para estos y otros pomos funerarios, véanse las ilustraciones en P.E.\nSCHRAMM, op. cit., 1958, tafel 31, abb. 61a y 61b; tafel 31, abb. 62; tafel 40, abb. 81c; y tafel 43, abb. 89a.\n20 VV.AA., Il sarcofago dell'imperatore, Palermo, 2002, vol. 2; F. DANIELE, I regali sepolcri del Duomo\ndi Palermo (reproducción de la 2ª ed., Nápoles, 1859), p. 106.\n21 Dicho grabado fue publicado por DELSENBACH en el Wahre Abbildung der sämtlichen\nReichskleinodien..., Nuremberg, 1790. Esta imagen está digitalizada en <http://www.bildindex.de/\nobj00111714.html#home> (última consulta: 14 de enero de 2013).\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549\n541",
  "6": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\nde los reyes de los pueblos germánicos y emperadores del Sacro Imperio Romano\nGermánico), concretamente el grupo llamado Nürnberger Kleinodien (las joyas de\nNuremberg). En el grabado de Delsenbach figura el anverso y reverso de Der Reichs-\napfel, el pomo imperial más importante conservado de la Edad Media, conocido por\nsu nombre (\"el orbe\") en alemán, realizado posiblemente en Colonia en el siglo XII\npara la coronación de Enrique VI (en 1191) o Felipe de Suabia (en Mainz, 1198), o\npara un rival de este último, Ottón IV de la dinastía de Welf (en Aquisgrán, 1198)22.\nJunto a este figuran en el grabado otros dos pomos desaparecidos. A pesar de la apa-\nrente semejanza de los tres, un cotejo detallado revela interesantes diferencias, tanto\nen el cuerpo esférico como en las cruces de remate.\nUna apreciación semejante de diferencias formales en pomos ilustrados es la que\nplantea Amadeo Serra Desfilis en su estudio del rollo genealógico de la Corona de\nAragón (ca. 1410), conocido como la Genealogía de Poblet por conservarse hoy en\nla biblioteca de ese monasterio. Este investigador señala que la cruz del pomo del\nrey Martín I el Humano (1396-1410) es muy diferente de las cruces de Sobrarbe que\ncoronan los orbes de sus predecesores, con lo que \"este detalle abre el interrogante\nde si la cruz, casi flordelisada más que patada, pudiera ofrecer la imagen de una\nnueva pieza del tesoro real destinada a reemplazar la que había pertenecido a Pedro\nel Ceremonioso\"23. Otro detalle de la Genealogía de Poblet, concretamente el arre-\npentimiento que muestra que el iluminador, una vez concluido el retrato del conde de\nBarcelona Ramón Berenguer IV, borró los florones de su tocado para transformar con\nello una corona real en condal (en una garlanda o diadema ricamente decorada)24, pa-\nrece avalar la fidelidad de esta obra en la representación de las insignias, lo que, con-\nsecuentemente, reafirma la idea de que las diferencias de los orbes no respondían a la\nimaginación del artista, sino a una copia de la realidad. Es interesante notar, por otra\nparte, que el conde de Barcelona figure con un orbe crucifero en su mano izquierda,\nlo que sería interpretado en este caso como símbolo de soberanía, es decir, no como\nuna insignia regia, pues no se corrigió como sí lo fue la corona real.\nEl pomo tripartito de \"T en O\": origen y evolución\nSi miramos con estos mismos ojos la variedad de pomos ilustrados existentes en las\nartes figurativas de la Edad Media, podríamos plantear que las diferencias formales\nno son mero artificio decorativo de los autores de esas imágenes, sino que responden\na una evocación de distintos modelos. De todos ellos, el más frecuente es el que de-\nnominaremos a partir de ahora \"pomo tripartito\". La insistencia de su representación\nen manos de emperadores, reyes, nobles y también de la divinidad, así como la abun-\n22 Kunsthistorisches Museum, Viena, Weltliche Schatzkammer (n.° inv. SK WS XIII 2). Para una imagen\ne información de esta insignia, véase http://www.kaiserliche-schatzkammer.at/en/visit/collections/secular-\ntreasury/selected-masterpieces/ (última consulta: 14 de enero de 2013).\n23 A. SERRA DESFILIS, \"La historia de la dinastía en imágenes: Martín el Humano y el rollo genealógico\nde la Corona de Aragón\", Locus amoenus, 6 (2002), p. 69. La cursiva es mía para enfatizar.\n24 Este arrepentimiento, apreciado por E. TORMO, Las viejas series icónicas de los reyes de España,\nMadrid, 1916, p. 61, fue reiterado por M. SERRANO COLL, op. cit. 2011, pp. 132-133.\n542\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549",
  "7": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\ndancia de ejemplares suntuarios llegados de entre las regalia insignia de los siglos\nposteriores-desde el XVI hasta la actualidad2-, hace sospechar que este tipo de in-\nsignia hubiera existido ya en la Edad Media, aunque no se haya conservado ninguno\nde ellos. Quizá ya habrían desaparecido del Tesoro Imperial germánico cuando en\n1751 Johann Adam Delsenbach hizo su grabado de las joyas de Núremberg, pues el\nlibro de reliquias Wie das hochwirdigist...., realizado en 1487 también en Núremberg\n(donde, como decíamos, se guardaban esas regalia insignia), sí incorpora una enta-\nlladura en la que hacen su aparición dos de estos pomos tripartitos26.\nEl pomo tripartito resulta de dividir horizontalmente la esfera por la mitad y nue-\nvamente una de estas mitades entre dos, de forma vertical. En su concepción formal\nguarda una muy estrecha relación con las fuentes cartográficas medievales, concre-\ntamente con los mapas esquemáticos tripartitos de \"T en O\" (Fig. 2). La \"T\" es una\nrepresentación estilizada de los tres canales hídricos que separan los tres continentes\nentonces conocidos: el brazo horizontal izquierdo es el Tanais (Río Don), el derecho\nel Nilo y el astil vertical el Mar Mediterráneo27; la \"O\" es el océano circundante que\nabraza la tierra, como si de un río se tratara. Asia se localiza en la mitad superior y\nen la inferior, Europa a la izquierda y África a la derecha. Estos mapas están orienta-\ndos en el sentido literal de la palabra, es decir, Oriente se dispone arriba, en la parte\npreeminente según la jerarquía espacial medieval cristiana. El protagonismo que aca-\npara este continente se debe a que es por donde sale el sol -astro intimamente asocia-\ndo a la divinidad28- y donde se encuentra el paraíso terrenal, tal como está recogido\nen Génesis (II, 8) y como muestran muchos mapas medievales29. Aunque la concep-\nción del mundo tripartito y esas divisiones naturales de los tres continentes tienen su\norigen en la Antigüedad 30, estas nociones geográficas se asimilaron en la Edad Media\ncon el relato bíblico del reparto del mundo entre los tres hijos de Noé - Sem, Jafet y\nCam- tras el diluvio universal³¹. Por ello, muchos de estos mapas aluden textual y\ngráficamente a esta distribución de las tierras y a quienes fueron sus herederos³2.\nLos mapas de \"T en O\" son, de toda la cartografia medieval, los más numerosos\ncuantitativamente y los que mayor popularidad alcanzaron en el tiempo: los más\nantiguos que conservamos están datados en los siglos VII-VIII y continuaron reali-\n25 Por ejemplo, Isabel II de Inglaterra portó este tipo de pomo en su coronación el 2 de junio de 1953.\n26 Bayerische Staatsbibliothek, Múnich (4 Inc.c.a. 514). Este incunable está digitalizado en\n<http://dfg-viewer.de/show/?set%5Bmets%5D=http%3A%2F%2Fdaten.digitale-sammlungen.\nde%2F-db%2Fmets%2Fbsb00011304_mets.xml> (última consulta: 5 de febrero de 2013).\n27 J.T. LANMAN defiende una vinculación entre la \"T\" y la cruz de Cristo en \"The Religious Symbolism\nof the T in T-O maps\", Cartographica, 18:4 (1981), pp. 18-22; para una aproximación a los mapas de \"T\nen O\", véase L.S. CHEKIN, Northern Eurasia in Medieval Cartography: Inventory, Texts, Translation, and\nCommentary, Turnhout, 2006, pp. 27-74.\n28 Por el Este sale el sol, el astro creado por Dios antes que al hombre para que iluminara el mundo\n(Génesis, 1:16), y Dios es identificado con la luz según Juan (8:12).\n29 Véase A. SCAFI, Mapping Paradise. A History of Heaven on Earth, Londres, 2006.\n30 Véase por ejemplo POMPONIO MELA, Corografia (1:8) (siglo I).\n31 Génesis (9:18-10).\n32 Véase C. VAN DUZER y S. SÁENZ-LÓPEZ PÉREZ, \"Tres filii Noe diviserunt orbem post diluvium:\nThe World Map in British Library Add. MS 37049\", Word & Image, 26:1 (2010), pp. 21-39.\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549\n543",
  "8": "Sandra Sáenz-López Pérez\nTopolamalup Labo eneo denuco cer\ncompofuerfpfennium-dumans factum.\nOdoman\nAnguftus\nEl mundo como una manzana en la palma de la mano...\neber\ndr:\naa\nfair\nfit\nORBIS T\nTIRR\nORIINS\nSem accepie re\nra reporacam\nSTA\nEUROPA LIBIA\nTaferrer\nram frig\ndidef\nSeptentri\nonale\nCamer\nram cal\nDam fesle\neet mont\nDianam\nΟ\nJarit\nclaufir pras\nhombo\nane ifto odo\nalop\nuf sec\n2.11.\ngufto regume no\nFig. 2. Izquierda: El emperador Augusto con un orbe tripartito de \"T en O\" en la mano,\nen el Liber floridus de Lambert de Saint-Omer (ca. 1250-1275). Bibliothèque nationale de\nFrance, París (Ms. lat. 8865, fol. 45r). Derecha: Orbis terrae tripartitus (mapa de \"T en O\")\ndel Beato de Saint-Sever (tercer cuarto del siglo XI). Bibliothèque nationale de France, París\n(Ms. Lat. 8878, fol. 7r).\nzándose a lo largo de toda la Edad Media33. Su auge influyó en la imagen del mundo\nsimbolizada en el pomo, hasta el punto de que podríamos hablar de \"pomo tripartito\nde 'T en O\"\". Entre los muchos ejemplos existentes en las artes figurativas medievales\nseñalaremos dos de ellos significativos por su variado enfoque: el emperador Augusto\naparece retratado en un manuscrito del Liber floridus de Lambert de Saint-Omer (ca.\n1250-1275) con un orbe de \"T en O\" en su mano izquierda (Fig. 2), donde se indican,\ncomo en los mapas, los nombres de los tres continentes (Asia, Europa y Affrica) 34.\nIgualmente, con un orbe de \"T en O\" figura Cristo Niño a hombros de San Cristóbal en\nel retablo de este santo realizado en el siglo XIV35. En este caso, la tripartición del mun-\ndo evoca el aire (el cielo con el sol, la luna y estrellas), el agua (peces) y la tierra (casti-\nllos), algo que igualmente encontramos con cierta frecuencia en mapas medievales, por\nejemplo, en la representación del mappamundi de la tumba de Darío del Alexander in\n33 Aparece en la edición impresa de las Etimologías de San Isidoro realizada en Augsburgo en 1472 por\nGünther Zainer, y es el primer mapa impreso.\n34 Bibliothèque nationale de France, París (Ms. lat. 8865, fol. 45r).\n35 Museo Nacional del Prado (n.° cat. P03150). La imagen está digitalizada en <http://www.museodelprado.\nes/coleccion/galeria-on-line/galeria-on-line/obra/retablo-de-san-cristobal/> (última consulta: 5 de febrero de 2013).\n544\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549",
  "9": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\nhistorienbijbel (Utrecht, 1467) 36, donde esos tres elementos de la naturaleza están a la\nvez asociados con los nombre de los tres hijos de Noé³7.\nTal es la relación entre este modelo cartográfico y esta insignia de soberanía que en\nmuchos casos se llegó a reiterar en esta última la aparente planitud del mundo que evo-\ncan las imágenes cartográficas. Muchas otras imágenes medievales del mundo tripartito\nsupieron simular el sentido esférico de la Tierra, otorgando a la \"T\" una forma tridimen-\nsional. Así ocurre en la imagen del poeta inglés John Gower (ca. 1330-1408) disparando\nflechas a una esfera en un manuscrito de su Vox Clamantis (Voz del Profeta) de 1399-\n140838: nuevamente la esfera tripartita encarna tres de los elementos naturales (aire, tierra\ny agua). Esta misma esfericidad aparece en algunos pomos ilustrados, muy especialmente\na partir del siglo XV y del desarrollo de la pintura flamenca. La técnica al óleo permitía\nrepresentar mediante un sistema de veladuras una esfera cristalina, que a su vez, permitía\ntransparentar la parte posterior de la \"T\" tridimensional. Así aparece, por ejemplo, en el\nSalvator mundi (ca. 1500-1510) del pintor flamenco Quentin Massys39 o, dentro del ám-\nbito hispano-flamenco, en el Salvador de Pedro Berruguete (ca. 1490)40 (Fig. 3).\nFig. 3. Cristo Salvador del mundo de Pedro Berruguete (ca. 1490) con un orbe tripartito en\nla mano. Museo Diocesano de Palencia (n.° inv. IIC-4-120-002-0010). Fotografia: Antonio\nRubio López (Palencia).\n36 Koninklijke Bibliotheek (Biblioteca Real), La Haya (Ms. 78 D 39, fol. 370r). La imagen está digitalizada en\n<http://manuscripts.kb.nl/zoom/BYVANCKB%3Amimi_78d39%3A370v_min (última consulta: 5 de febrero\nde 2013). Para los mapas de la tumba de Dario en los manuscritos iluminados del Alexander in historienbijbel,\nvéase N.R. KLINE, Maps of medieval thought: the Hereford paradigm, Woodbridge, 2003, p. 178.\ns\n37 La tierra, el agua, el aire son, recordemos, tres de los cuatro (junto con el fuego) elementos del mundo sublunar\nartistotélico, que heredó la cosmología medieval como se puede apreciar en el universo de Sacrobosco (Fig. 1).\n38 University of Glasgow, Special Collections (Ms. Hunter 59, fol. 6v). La imagen está digitalizada en <http://\nspecial.lib.gla.ac.uk/manuscripts/search/detail_c.cfm?ID=34369> (última consulta: 5 de febrero de 2013).\n39 North Carolina Museum of Art, Estados Unidos (K-1688). La imagen está digitalizada en <http://\nlibrary.artstor.org/library/ExternalIV.jsp?objectId=8DtZYyMmJloyLyw7eDt5R340> (última consulta: 5 de\nfebrero de 2013).\n40 Museo Diocesano de Palencia (n° inv. IIC-4-120-002-0010).\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549\n545",
  "10": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\nPero esas imágenes esféricas de cristal no deben de ser entendidas como meros\nalardes técnicos de la pintura flamenca al óleo, sino como evocaciones de la concep-\nción medieval del universo, en la que se sintetizan las ideas aristotélicas y ptolemai-\ncas y la teología cristiana. El universo era concebido esférico, finito y geocéntrico.\nLa Tierra, compuesta de las sustancias materiales tierra, agua, aire y fuego, estaba\nubicada en el centro y a su alrededor, ocho esferas homocéntricas con los planetas\nconocidos (incluidos el sol y la luna) y las estrellas fijas, hechas de una sustancia\ncristalina y transparente, giraban gracias al Primum mobile o Primer motor\" (Fig. 1).\nEse universo cristalino es pues el que reproducen las pinturas anteriores en manos de\nla divinidad. Y si bien sobre el cristal esférico de Massys se reflejan edificios y torres\ntípicamente flamencos, que quizá evocan el mundo habitado o el lugar de realización\nde esta obra¹², la esfera de Berruguete deja además entrever otra esfera en su interior,\nsobre la que se levantan esquemáticas imágenes de ciudades, y que podríamos iden-\ntificar con la Tierra 43.\nAsimismo, es interesante señalar que, tal como se aprecia en estos pomos, con el\ntiempo, la \"T\" -ese convencionalismo geográfico con el que se dividía el mundo en\ntres continentes y se daba preeminencia a Asia- se invierte, muy probablemente para\nconvertirla en estructura de soporte de la cruz, con la que se coronan los orbes. Esta\ninversión de la \"T\" trajo consigo una pérdida de la resonancia cartográfica original de\nlos mapas de \"T en O\". Solo así se explica que estos pomos alcanzaran gran éxito a\npartir del siglo XVI, cuando la tradicional división tripartita del mundo entró en crisis\na raíz del descubrimiento de América44.\nEl pomo geográfico y la cartografía del siglo XV\nAsí pues, a medida que la historia se aproxima hacia su modernidad, la referencia\ngeográfica y el sentido simbólico de la \"T en O\" del pomo tripartito se van desva-\nneciendo. Pero las conexiones de esta insignia con la geografía y la cartografia no\ndesaparecen, sino que se materializan en otro modelo de pomo, al que llamaremos\n\"pomo geográfico\", por primar en su concepción formal un dibujo más realista del\nmundo. Detrás de ese realismo geográfico se encuentran los avances cartográficos\nque tuvieron lugar en Florencia en el siglo XV y que determinaron el final de la\n41 Para una aproximación a la cosmología medieval, véase R. SIMEK, op. cit.; E. EDSON, Medieval\nViews of the Cosmos, Oxford, 2004.\n42 Considero interesante recoger otro ejemplo semejante que aparece en una pintura alemana de Cristo\nbendiciendo con donante y su familia (1575-80) del Metropolitan Museum of Art, Nueva York (17.190.13-\n15), donde se muestra el orbe tripartito con la imagen de la ciudad de Hamburgo en su interior, posible origen\nde la familia. La imagen está digitalizada en <http://www.metmuseum.org/toah/works-of-art/17.190.13-15>\n(última consulta: 5 de febrero de 2013).\n43 Esta misma imagen de la Tierra contenida dentro del universo cristalino aparece en otras pinturas\ncontemporáneas, como el orbe en manos del Cristo bendiciendo (1494-1496) de Fernando Gallego del Museo\nNacional del Prado (n° cat. P02647). La imagen está digitalizada en <http://www.museodelprado.es/coleccion/\ngaleria-on-line/galeria-on-line/obra/cristo-bendiciendo/> (última consulta: 5 de febrero de 2013).\n44 La imagen esférica de la Tierra y su representación en época moderna será abordado en un futuro\ntrabajo.\n546\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549",
  "11": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\ncartografia medieval y el nacimiento de la moderna. Por un lado, la recuperación\nen Occidente de la Geografia de Claudio Ptolomeo (ca. 100-ca. 170), llegada a Flo-\nrencia a finales del siglo XIV entre los manuscritos traídos de Constantinopla por\nManuel Chrysoloras, y traducida al latín por este y por Jacopo Angeli (1406-1409) 45.\nLa gran popularidad alcanzada por esta obra ptolemaica radica en que explicaba,\npor primera vez de forma científica, cómo proyectar una esfera sobre una superficie\nplana y, consecuentemente, cómo hacer mapas. Paradójicamente, la Geografia de\nPtolomeo acabó resultando no solo útil para trasladar la esfera al plano, sino también\npara recrear la imagen tridimensional del mundo sobre un soporte bidimensional,\nen definitiva, para el tema que aquí nos interesa: la representación de la Tierra en los\npomos u orbes ilustrados. En la preocupación artística por mostrar gráficamente la\nllamada \"tercera proyección\", donde el geógrafo griego se cuestiona \"de qué modo\npuede representarse en un plano el hemisferio visible de la Tierra contenido bajo\nuna esfera armilar\" (Libro 7, cap. 6)47, un autor anónimo incorporó entre 1503-1516\nuna imagen que resolvía esta cuestión en un manuscrito florentino de la Geografia\nde Ptolomeo, realizado hacia 147048 (Fig. 4): sobre la esfera de la Tierra se proyecta\nun mappamundi ptolemaico, en el que solamente se cartografia el mundo conocido\n(el resto queda en blanco)49. Esta solución artística a la tercera proyección fue tan\nsolo superada en 1525 por Alberto Durero, autor de la correspondiente imagen en la\nedición impresa de Willibald Pirckheimer, realizada en Estrasburgo en 152550. En su\ngrabado, Durero se ajustó más a las leyes de la perspectiva al disminuir la distancia\nentre los meridianos según aumentaba su distancia respecto del ojo del espectador,\ncreando así el artificio de un globo tridimensional.\nComo protagonista destacado de la cartografia del siglo XV hay que hacer, por otro\nlado, mención a Henricus Martellus Germanus, un cartógrafo que vivió y trabajó en\nFlorencia entre 1480 y 1496, y que hacia 1489 o 1490 realizó un mappamundi que,\naunque deudor de la influencia ptolemaica, adquirió personalidad propia: renunció\nal océano Indico ptolemaico como un mar interior, y al hacerlo, rompió la unión de\n45 Para la Geografia de Ptolomeo, véase P. GAUTIER DALCHÉ, La Géographie de Ptolémée en\nOccident (IV-XVIe siècle), Turnhout, 2009; y Z. SHALEV y C. BURNETT (eds.), Ptolemy's Geography in\nthe Renaissance, Londres, 2011.\n46 Al respecto, debemos de señalar la vinculación que existió entre la Geografia de Ptolomeo y la\nperspectiva lineal, descubierta por Filippo Brunelleschi hacia 1410; véase S.Y. EDGERTON Jr., \"Florentine\nInterest in Ptolemaic Cartography as Background for Renaissance Painting, Architecture, and the Discovery\nof America\", Journal of the Society of Architectural Historians, 33:4 (1974), pp. 275-292; y A. CATTANEO,\n\"Map Projections and Perspective in the Renaissance\", Z. SHALEV y C. BURNETT (eds.), op. cit., 2011,\npp. 51-80.\n47 C. PTOLOMEO, Cosmografia de Ptolomeo, Burgos, 2010, p. 263.\n48 Bibliothèque nationale de France, París (Ms. Latin 4801, fol. 74r).\n49 D. BUISSERET, La revolución cartográfica en Europa: 1400-1800. La representación de los nuevos\nmundos en la Europa del Renacimiento, Barcelona, 2004, Lámina VI.\n50 El ejemplar de esta edición de la Biblioteca Nacional de España, Madrid (GMG/1051) está digita-\nlizado en\n<http://bibliotecadigitalhispanica.bne.es:80/webclient/DeliveryManager?pid=3156056&custom\natt_2=simple_viewer> (última consulta: 5 de febrero de 2013). Aunque el grabado no está firmado por Du-\nrero, su autoría está confirmada gracias a la correspondencia mantenida entre Pirkheimer y Johann Tscherte,\narquitecto imperial en Viena, donde se menciona esta esfera y afirma que ha sido realizada por Alberto Durero,\namigo común de ambos; véase T. S. MOORE, Albert Durer, Whitefish, 2004, pp. 77-78.\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549\n547",
  "12": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\nFig. 4. Izquierda: Detalle de la ilustración anónima de la esfera armilar realizada entre 1503-\n1516 en un manuscrito florentino de la Geografia de Ptolomeo de ca. 1470. Bibliothèque\nnationale de France, París (Ms. Latin 4801, fol. 74r). Derecha: Detalle del orbe que sostiene\nen su mano el Salvator mundi de Marco d'Oggiono (ca. 1500). Galleria Borghese, Roma (n.°\ninv. 435).\nAsia y África, diseñó el Extremo Oriente con la llamada \"cola de dragón\" y dibujó el\ncontorno completo de África, alusivo a su circunnavegación, que enfatizó rompiendo\ncon su extremo sur el enmarcamiento del mapa³¹.\nLa influencia de las cartografias de Claudio Ptolomeo y de Henricus Martellus\nGermanus se hace presente en el primer globo terráqueo conservado, obra del ale-\nmán Martin Behaim (1492)52. Muy similar en su imagen geográfica es el orbe que\nsostiene en su mano el Salvator mundi de Marco d'Oggiono (ca. 1500)53, donde a los\nelementos de la tradición ptolemaica, como la localización de la triangular Trapobana\n(Sri Lanka) en el ecuador, se suman otros martellianos: Asia con \"cola de dragón\" o\nÁfrica completamente circunnavegada (Fig. 4). También similar es el orbe con el que\nun personaje, quizá el propio Claudio Ptolomeo, aparece retratado por Rafael Sanzio\nen La escuela de Atenas (1509-1512) de la Stanza della Segnatura de los Palacios Va-\nticanos. Por último, estos rasgos definidores de la cartografia moderna se dejan sentir\ncon mucha claridad en el pomo de coronación de Eric XIV rey de Suecia (1561) 54,\nque aunque conserva la estructura tripartita de la \"T en O\" se ha desprendido ya de la\nreminiscencia cartográfica medieval (Fig. 5).\n51 Para una aproximación a Henricus Martellus Germanus, véase E. EDSON, The World Map, 1300-1492:\nThe Persistence of Tradition and Transformation, Baltimore, 2007, pp. 215-219.\n52 Germanisches Nationalmuseum, Nuremberg (n. inv. WI 1826). Para esta obra, véase el clásico, de aún\ngran vigencia, E.G. RAVENSTEIN, Martin Behaim, his life and his globe, Londres, 1908.\n53 Galleria Borghese, Roma (n° inv. 435).\n54 Tesoro del Palacio Real, Estocolmo. Resulta también interesante el \"pomo geográfico\" con la \"T en\nO\" invertida que sostiene en sus manos el Cristo Salvador en una pintura de un seguidor de Leonardo da\nVinci de hacia 1510, conservada en el Museo de Bellas Artes de Nancy (n.° inv. 28). Para este orbe, véase V.\nDROGUET y T. CRÉPIN-LEBLOND (eds.), Le Roi et l'Artiste. Françoise ler et Rosso Fiorentino, París,\n2013, p. 59. Gracias a Francisco de Asís García, por señalarme la existencia de este cuadro.\n548\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549",
  "13": "Sandra Sáenz-López Pérez\nEl mundo como una manzana en la palma de la mano...\nCAEDIAT\nASTA\nRICA\nARABD\nMELIN DA\n558\nOCEANI\nFig. 5. Pomo de coronación de Eric XIV rey de Suecia (1561). Tesoro del Palacio Real,\nEstocolmo.\nA modo de conclusión\nA lo largo de la historia, emperadores, reyes, nobles y la divinidad han sostenido el\nmundo en su mano en un gesto eterno que, traspasando toda connotación política,\nsupo evocar tan bien el poeta inglés William Blake en su Auguries of innocence (Au-\ngurios de inocencia) de hacia 1803:\nTo see a World in a Grain of Sand\nAnd a Heaven in a Wild Flower\nHold Infinity in the palm of your hand\nAnd Eternity in an hour55.\n55 D.V. ERDMAN (ed.), The Complete Poetry & Prose of William Blake, Berkeley-Los Angeles, 2008, p.\n490. Gracias a Elisa Garrido, por llamarme la atención de estos versos.\nAnales de Historia del Arte\n2013, Vol. 23, Núm. Especial (II), 537-549\n549"
}