{
  "1": [
    {
      "label": "page_header",
      "text": "Publ. Astron. Obs. Belgrade No. 91 (2012), 371 - 375",
      "bbox": {
        "l": 195.0,
        "b": 1042.0,
        "r": 581.0,
        "t": 1057.0
      }
    },
    {
      "label": "page_header",
      "text": "Poster",
      "bbox": {
        "l": 676.0,
        "b": 1044.0,
        "r": 718.0,
        "t": 1056.0
      }
    },
    {
      "label": "section_header",
      "text": "DESCRIPTION OF THE EARTH IN THE WORKS OF ARABIC GEOGRAPHERS FROM IX TO XII CENTURY",
      "bbox": {
        "l": 243.0,
        "b": 855.0,
        "r": 670.0,
        "t": 894.0
      }
    },
    {
      "label": "section_header",
      "text": "I. CVIJANOVIC",
      "bbox": {
        "l": 408.0,
        "b": 813.0,
        "r": 505.0,
        "t": 828.0
      }
    },
    {
      "label": "text",
      "text": "Institute of History, Knez Mihailova 36, 11000 Belgrade Frana Levstika 12, 11000 Belgrade",
      "bbox": {
        "l": 295.0,
        "b": 780.0,
        "r": 619.0,
        "t": 806.0
      }
    },
    {
      "label": "key_value",
      "text": "E-mail: irena.cvijanovie@yahoo.com",
      "bbox": {
        "l": 352.0,
        "b": 764.0,
        "r": 562.0,
        "t": 777.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 766.0,
        "r": 399.0,
        "t": 777.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 402.0,
        "b": 764.0,
        "r": 562.0,
        "t": 777.0
      }
    },
    {
      "label": "text",
      "text": "Abstract. The works of Arabic writers provide data about shape, position and size of the Earth, planets and zodiac signs. They include preserved maps of Ibn Haukal, AL-Masudi and AL-ldrisi. Al-Masudi (871-956/7) made a map of the world and wrote that the Earth is round, before the Christians in Europe were ready to accept that idea. The famous geographer and cartographer Alldrisi (IX/X., died in 903/913.) has lived on the court of Norman king Roger II of Sicily, and after his death on the court of his son William I on Sicily, where he obtained the data from European and Arabic geographers. On the basis of this data he wrote a work known entitled Roger's book. Besides this important work he made a celestial globe and a map of the world in the shape of a silver disk. The lines that marked the borders of seven regions of the inhabited world were engraved on this disk. The ‘Arabs had excellent knowledge of Greek astronomy and accepted their division of the world in seven climatic zones.",
      "bbox": {
        "l": 195.0,
        "b": 581.0,
        "r": 717.0,
        "t": 746.0
      }
    },
    {
      "label": "text",
      "text": "First Arabie maps were made according to the map of Ptolemy, a classical as- tronomer, geographer and mathematician from Alexandria. During the reign of Theo- dosius and Justinian, the interpretation that the Earth is round and that it represents only a small part of the Universe was forbidden. Early medieval Arabie writers in- cluded in their maps of the world the Arabic lands in Asia and North Arfica, than Byzantine Empire, lands of Franes, Gals, Langobards, land of Slavs, Russians, Bul- gars, Turks, Alans, Hazars, as well as lands from Persia to India and China. For them, well known part of the world ended with the Atlantic Ocean, ie. West Sea and the Pacific, ie. Big Sea. Idrisi, Ibn Rosteh, Ibn Haukal and Al-Masudi gave a division on seven climatic zones.",
      "bbox": {
        "l": 195.0,
        "b": 375.0,
        "r": 717.0,
        "t": 540.0
      }
    },
    {
      "label": "text",
      "text": "Ibn Rosteh, Abii ‘Ali Ahmed ibn Umar ibn Rosta Isfahani, (IX/X century, died in 903/913.), is a Persian geographer who wrote in Arabic.’ In his work Kitab al- a’lak An-Nafisa VII he gave a particularly beautiful description of Constantinople, Byzantine provinces, the land of Slavs, Bulgars, Russians and Khazars.” He probably wrote from 290-300/903-13. From his detailed work, which could be classified in short",
      "bbox": {
        "l": 195.0,
        "b": 289.0,
        "r": 717.0,
        "t": 371.0
      }
    },
    {
      "label": "footnote",
      "text": "TG, Pella, Langue ef itérature Arabes, Paris 1970, 154-156.",
      "bbox": {
        "l": 211.0,
        "b": 263.0,
        "r": 531.0,
        "t": 275.0
      }
    },
    {
      "label": "footnote",
      "text": "bn Rosteh, Kitab al-a Tak An-Nafisa VI, in: BGA, ed. De Goeje, Lugduni-Batavorum (Leiden) 1802; 8. Maqbul Ahmad, in: The Encyclopedia of Inlamvol. If, ed. B. Lewis, VL. Ménage, Ch. Pellat, J. Schacht, Leiden, London 1986, 92.",
      "bbox": {
        "l": 196.0,
        "b": 221.0,
        "r": 717.0,
        "t": 260.0
      }
    },
    {
      "label": "page_footer",
      "text": "371",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 466.0,
        "t": 213.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 418.0,
        "b": 1048.0,
        "r": 494.0,
        "t": 1058.0
      }
    },
    {
      "label": "text",
      "text": "encyclopedia of history and geography, it can be seen that the author was very well educated and talented in writing. In the first chapters he deals with the shape of the Earth, signs of the zodiac, planets, position of the Earth and its size. He further on deals with mathematics and astronomical geography, and cites his sources. A description of the Earth, nations and roads follows after introduction. Ibn Rosteh wrote that the Earth is a sphere and that the Ocean takes up to 24.000 miles, in other words that it is a big circle, a diameter of approximately 7.636 miles, and that there are exactly 21.600 towns in the world.",
      "bbox": {
        "l": 195.0,
        "b": 889.0,
        "r": 717.0,
        "t": 1021.0
      }
    },
    {
      "label": "text",
      "text": "ALIstakhri, Abu Ishak Ibrahim ibn Muhamad al-Parisi al-Istakhri, (X century, born around 900) was famous only for one of his works. He wrote mostly about Islamic lands and the Mediterranean with a description of added maps (fig. 1). His work Kitab al-masilik wal mamélik (The Book of roads and kingdoms), can be dated only on the basis of the described events about 950/1 (934). It has become very popular. There are few early and shortened editions, as well as a translation to Persian, that are quite different.",
      "bbox": {
        "l": 195.0,
        "b": 770.0,
        "r": 717.0,
        "t": 886.0
      }
    },
    {
      "label": "text",
      "text": "Tbn Haukal, Abu'l-Kasim ibn ‘Ali al-Nasibi (ibn Mumamad 2) ibn Haukal, (X century, died after 977.) is an Arabie geographer and chronicler. He was born in Nisibis (Nasibin) in Mesopotamia. By request of Al-Istakhri, he has edited his geo- graphical maps, enlargened the text, and published it under his name in 976/7 under the title Al-Masdlik w'al-Mamalik (Roads and kingdoms), known also under the ti- tle Kitab Strat al-ard (The Book about description of the Earth). Ibn Haukal was the best representative of geographers that wrote on the basis of their own trips and direct observations.‘ His descriptions were precise and very useful for travelers. The map Surat al-Ardh (Picture of the Barth), includes detailed description of Muslim Spain, Italy, Byzantine Empire (fig. 2). With this map he gave a description of Kiev, mentioned the road of Volga Bulgars and Khazars.* The main difference between the work of Ibn Haukal and Al-Istakhri is that he describes Islamic lands of West Europe and North Africa. The authors did not copy maps, but they made them indepen- dently. Ibn Haukal, in contrast to his predecessor, has added a description of a map in the chapter about each region. Besides Ibn Haukal’s work published by M. J. De Goeje in 1873., we know of one more abridged edition of an anonymous author from 1233.",
      "bbox": {
        "l": 195.0,
        "b": 486.0,
        "r": 717.0,
        "t": 768.0
      }
    },
    {
      "label": "text",
      "text": "Al-Masudi, Abul Hasan Ali ibn Husain Ali al-Masudi, (IX/X century, 871-956/7.) has introduced a thematic method of writing by Arabs. Instead of writing about events in chronological order, he has grouped them around dynasties, kings and nations.? He was born in Baghdad, where he spent his youth. He was one of the ‘most educated Arabs of his time. Al-Masudi knew history, geography, astronomy, zo- ology and sciences related to Islam. Searching for a new knowledge he left his native town for a trip through Asiatic and African countries to the east and Spain on the west. In the book Kitab at-Tanbih wa'l —Ischraf he has explained his philosophy about minerals, plants and animals. Unfortunately, only a part of this book is preserved.",
      "bbox": {
        "l": 195.0,
        "b": 329.0,
        "r": 717.0,
        "t": 480.0
      }
    },
    {
      "label": "footnote",
      "text": "36. Brockelmann, Geschichte der arabischen Litteratur, Leipaig 1909, 114",
      "bbox": {
        "l": 212.0,
        "b": 303.0,
        "r": 604.0,
        "t": 315.0
      }
    },
    {
      "label": "footnote",
      "text": "4A. Miquel, in: The Encyelopedia of Islam,vol. Ill, ed. B. Lewis, V. L. Ménage, Ch. Pellat, J Schacht, Leiden - London 1986, 786-788.",
      "bbox": {
        "l": 195.0,
        "b": 276.0,
        "r": 717.0,
        "t": 301.0
      }
    },
    {
      "label": "footnote",
      "text": "5A. Miquel, in: ‘The Encyclopedia of Islam, vol. VII, ed. C.B. Bosworth, E. Van Donzel, W-P. Heinrichs, Ch. Pellat, Leiden ~ New York 1993, 492-493.",
      "bbox": {
        "l": 195.0,
        "b": 248.0,
        "r": 717.0,
        "t": 275.0
      }
    },
    {
      "label": "footnote",
      "text": "SILA-R. Gibb, Arabic Literature, Oxford 1963, 81-83.",
      "bbox": {
        "l": 211.0,
        "b": 236.0,
        "r": 493.0,
        "t": 248.0
      }
    },
    {
      "label": "footnote",
      "text": "7G. Wiet, Introduction a la littérature arabe, Paris 1966, 120-121.",
      "bbox": {
        "l": 212.0,
        "b": 222.0,
        "r": 556.0,
        "t": 234.0
      }
    },
    {
      "label": "page_footer",
      "text": "372",
      "bbox": {
        "l": 444.0,
        "b": 202.0,
        "r": 468.0,
        "t": 213.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 1049.0,
        "r": 717.0,
        "t": 1058.0
      }
    },
    {
      "label": "text",
      "text": "In one part of this work he mentiones Christian authors that he knew and comments their works. He made a map of the world and wrote that the Earth is round, before the Christians in Europe were ready to accept that idea (fig. 5). He wrote the ency- clopedia of the world history, Akhbar az-zaman (History of time) in thirty volumes, but there is only one that is preserved in Vienna.* There is one incomplete copy of this work, prepared by Burkgardart, in the library of St. Sofia in Istanbul, w consists of 20 big volumes. At the begining of this work it can be seen that at least 10 copies are missing. In Bodlean library in Oxford there is a manuscript, supposed to be one volume of Al-Masudi’s history. He has prepared an addition under the title Kitab al-Awsat in which he explained historical events in chronological order. His tory of time has come to us in abridged edition under the title Muraj adh-dhahab wa ma’adin al-jawahir (Golden meadows and mines of precious stones).? According to the words of the author the work got this name because it includes traditions, history and all other fields of science. For the first time one Arabic author has combined history and geograph for this historical-geographical work including, as an addition to the Arabic text, a translation of Plato, Aristotle and Ptolemy. The first edition of this book was edited in 943., than he has finished a new one in Basra in 947. and the last one in 956. in his work. He has used at least sixty five written sources",
      "bbox": {
        "l": 195.0,
        "b": 721.0,
        "r": 718.0,
        "t": 1021.0
      }
    },
    {
      "label": "text",
      "text": "ALldrisi, Abu ‘Abdallah Muhammad ibn Muhammad ibn ‘Abdallah ibn Idris (middle of XII century, 1099/1100-1164/5/6), the best known Arabic geographer, was born in Ceuta, as a son of Spanish-Arabie parents. After studies in Cordova, in Muslim Spain, he spent several years traveling through North Africa, Middle East, Enrope, and arrived to Palermo in 1138., invited by the king of Sicily. He was famous geographer and cartographer on the court of Norman king Roger II of Sicily, and after his death of his son, William I.\"° His work Kitab nuzhat al-musgat fi ihtiraq al-afaq was ordered by the king.\"' He wrote on the basis of the data of observers that were sent from different countries and on the basis of the impressions from his own trips. Besides this important work, he has constructed a celestial sphere and a map of the world in the shape of a silver disk for his sponsor Roger II (fig. 3,6). There are lines engraved on the disk, that marked the borders of seven regions of the inhabited world. Barons from Sicily have raised against William in 1169, and burned many documents and books including new Latin edition of Idrisi’s book. The map and the silver disk disapeared. His book was the first geographical work edited in Europe in 1154. (1192?), under the title Kitab muzhat al-Musqat fi dhikr al-amsar wa-laqtar wa-l-buldan wa-l-juzur wa-l-mada’in wa-l-affiq (The book for those who want to read descriptions of metropolis, regions, countries, islands, towns and regions).!? Tt was included in the cathalog as De geographia universalis, but without a text in Latin. Tt is known under the title Al-Kitab al-Rudjar (Roger's book), because it was written",
      "bbox": {
        "l": 195.0,
        "b": 383.0,
        "r": 717.0,
        "t": 718.0
      }
    },
    {
      "label": "footnote",
      "text": "®Gh, Pellat, in: The Encyclopedia of Islam, vol. VI, ed. C.B. Bosworth, E. van Donzel, B. Lewis, Ch, Pella, Leiden 1991, 784-789,",
      "bbox": {
        "l": 195.0,
        "b": 342.0,
        "r": 717.0,
        "t": 368.0
      }
    },
    {
      "label": "footnote",
      "text": "5. Brockelmann, Semitistik, Leiden 1954, 287-288.",
      "bbox": {
        "l": 210.0,
        "b": 329.0,
        "r": 482.0,
        "t": 341.0
      }
    },
    {
      "label": "footnote",
      "text": "10M Tolmacheva, ‘The Medieval Arabic Geographers and the Beginings of Modern Orientalism, International Journal of Middle Bast Studies, Vol. 27, No. 2. (May, 1995), pp. 141-156.",
      "bbox": {
        "l": 196.0,
        "b": 303.0,
        "r": 717.0,
        "t": 327.0
      }
    },
    {
      "label": "footnote",
      "text": "\\ The Encyclopedia of Islam,vol. Il, ed. B. Lewis, V.L. Ménage, J. Schacht, Leiden, London 1986, 1032",
      "bbox": {
        "l": 195.0,
        "b": 276.0,
        "r": 717.0,
        "t": 301.0
      }
    },
    {
      "label": "footnote",
      "text": "V2ALIdrisi, Kitab Nushat al-Musgat fi Ihtirag al-Afag, Beirut 1980; In Latin title was Oblectatio disiderantis in descriptione civitatum prineipalium et tractum et provinciarum et insularum et ur- bium et plagarum mundi (Rome: Typografia Medici, 1952). B. Baldi has translated it on Italian {in 1600,, and incomplete edition is now at the University in Montpellier.",
      "bbox": {
        "l": 195.0,
        "b": 222.0,
        "r": 717.0,
        "t": 274.0
      }
    },
    {
      "label": "page_footer",
      "text": "373",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 468.0,
        "t": 212.0
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 418.0,
        "b": 1048.0,
        "r": 494.0,
        "t": 1058.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 198.0,
        "b": 843.0,
        "r": 453.0,
        "t": 1015.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 479.0,
        "b": 841.0,
        "r": 714.0,
        "t": 1010.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 1: Al-Istakhri’s world map.",
      "bbox": {
        "l": 233.0,
        "b": 809.0,
        "r": 428.0,
        "t": 824.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 2: Ibn Haukal’s world map, oriented with South at the top.",
      "bbox": {
        "l": 503.0,
        "b": 793.0,
        "r": 701.0,
        "t": 824.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 479.0,
        "b": 643.0,
        "r": 713.0,
        "t": 762.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 215.0,
        "b": 643.0,
        "r": 459.0,
        "t": 754.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 3: Al-ldrisi’s Tabula Rogeriana, oriented with South at the top.",
      "bbox": {
        "l": 218.0,
        "b": 594.0,
        "r": 441.0,
        "t": 625.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 4: Ibn Haukal’s world map, Mediterranean area only.",
      "bbox": {
        "l": 507.0,
        "b": 594.0,
        "r": 703.0,
        "t": 625.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 493.0,
        "b": 347.0,
        "r": 681.0,
        "t": 563.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 214.0,
        "b": 348.0,
        "r": 427.0,
        "t": 558.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 5: Mas’udi’s world map, reconstruction.",
      "bbox": {
        "l": 229.0,
        "b": 311.0,
        "r": 411.0,
        "t": 340.0
      }
    },
    {
      "label": "caption",
      "text": "Figure 6: Al-Idrisi’s world map, oriented with South at the top.",
      "bbox": {
        "l": 497.0,
        "b": 308.0,
        "r": 679.0,
        "t": 340.0
      }
    },
    {
      "label": "page_footer",
      "text": "374",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 467.0,
        "t": 213.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 1049.0,
        "r": 717.0,
        "t": 1058.0
      }
    },
    {
      "label": "text",
      "text": "by the order of the king.\"",
      "bbox": {
        "l": 195.0,
        "b": 1007.0,
        "r": 359.0,
        "t": 1023.0
      }
    },
    {
      "label": "text",
      "text": "‘The medieval Arabic astronomers wrote that the Barth is round, before the Chris- tians in Europe were ready to accept that idea. They have preserved the works of Greek astronomers during Dark Ages.",
      "bbox": {
        "l": 195.0,
        "b": 957.0,
        "r": 718.0,
        "t": 1004.0
      }
    },
    {
      "label": "section_header",
      "text": "Bibliography",
      "bbox": {
        "l": 410.0,
        "b": 914.0,
        "r": 502.0,
        "t": 928.0
      }
    },
    {
      "label": "list_item",
      "text": "Alldrisi: Kitab Nuzhat al-Musqat fi Ihtirag al-Afag, Bejrut 1989.",
      "bbox": {
        "l": 195.0,
        "b": 889.0,
        "r": 591.0,
        "t": 902.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 889.0,
        "r": 591.0,
        "t": 902.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Ablstakhri: Via regnorum, descriptio ditionis moslemicae, in: BGA, ed. De Goeje, Lugduni-Batavorum (Leiden), 1870.",
      "bbox": {
        "l": 195.0,
        "b": 860.0,
        "r": 717.0,
        "t": 888.0
      }
    },
    {
      "label": "list_item",
      "text": "ALMasudi: Kitab at-Tanbih Wa'l -Ischrab in: BGA, ed. De Goeje, Lugduni-Batavorum (Leiden) 1894",
      "bbox": {
        "l": 195.0,
        "b": 833.0,
        "r": 717.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "ALMasudi: Murtj adh-dhahab wa ma’adin al-jawahir, Beirut 2005,",
      "bbox": {
        "l": 195.0,
        "b": 818.0,
        "r": 599.0,
        "t": 832.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 818.0,
        "r": 599.0,
        "t": 832.0
      }
    },
    {
      "label": "list_item",
      "text": "Bagrow, L.: Die geschichte der kartographie, Berlin 1951.",
      "bbox": {
        "l": 195.0,
        "b": 804.0,
        "r": 537.0,
        "t": 818.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 804.0,
        "r": 537.0,
        "t": 818.0
      }
    },
    {
      "label": "list_item",
      "text": "Brockelmann, C.: Geschichte der arubischen Litteratur, Leipzig 1909.",
      "bbox": {
        "l": 195.0,
        "b": 790.0,
        "r": 610.0,
        "t": 803.0
      }
    },
    {
      "label": "list_item",
      "text": "Brockelmann, C.: Semitistik, Leiden 1954.",
      "bbox": {
        "l": 196.0,
        "b": 775.0,
        "r": 442.0,
        "t": 789.0
      }
    },
    {
      "label": "list_item",
      "text": "Cuntz, 0.: Die geographie des Ptolemaeus, Berlin 1923.",
      "bbox": {
        "l": 195.0,
        "b": 763.0,
        "r": 527.0,
        "t": 776.0
      }
    },
    {
      "label": "list_item",
      "text": "The Encyclopedia of Islam, vol. VII, ed. C-B. Bosworth, B. Van Donzel, W.P. Heinrichs, Ch, Pellat, Leiden - New York 1993.",
      "bbox": {
        "l": 196.0,
        "b": 734.0,
        "r": 717.0,
        "t": 762.0
      }
    },
    {
      "label": "list_item",
      "text": "The Encyclopedia of Islam, vol. VI, ed. C.E. Bosworth, E. van Donzel, B. Lewis, Ch. Pellat, Leiden 1991,",
      "bbox": {
        "l": 198.0,
        "b": 707.0,
        "r": 717.0,
        "t": 734.0
      }
    },
    {
      "label": "list_item",
      "text": "The Encyclopedia of Islam,vol. III, ed. B. Lewis, V.L. Ménage, Ch. Pellat, J. Schacht Leiden, London 1986.",
      "bbox": {
        "l": 197.0,
        "b": 678.0,
        "r": 717.0,
        "t": 706.0
      }
    },
    {
      "label": "list_item",
      "text": "Gibb, H. A. R: Arabic Literature, Oxford 1963.",
      "bbox": {
        "l": 196.0,
        "b": 664.0,
        "r": 479.0,
        "t": 677.0
      }
    },
    {
      "label": "list_item",
      "text": "Tbn Haukal: Via et regna, descriptio ditionis moslemicae, in: BGA, ed. De Goeje, Lugduni-Batavorum (Leiden), 1897.",
      "bbox": {
        "l": 196.0,
        "b": 636.0,
        "r": 717.0,
        "t": 664.0
      }
    },
    {
      "label": "list_item",
      "text": "Ibn Rosteh: Kitab al-alak An-Nafisa VII, in: BGA, ed. De Goeje, Lugduni-Batavorum (Leiden) 1892",
      "bbox": {
        "l": 196.0,
        "b": 609.0,
        "r": 717.0,
        "t": 635.0
      }
    },
    {
      "label": "list_item",
      "text": "Leithauser, J.G.: Mappae mundi, Berlin 1958.",
      "bbox": {
        "l": 196.0,
        "b": 594.0,
        "r": 469.0,
        "t": 608.0
      }
    },
    {
      "label": "list_item",
      "text": "Pellat, C.: Langue et littérature Arabes, Paris 1970.",
      "bbox": {
        "l": 195.0,
        "b": 580.0,
        "r": 502.0,
        "t": 593.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 580.0,
        "r": 502.0,
        "t": 593.0
      }
    },
    {
      "label": "list_item",
      "text": "‘Tolmacheva, M.: The Medieval Arabic Geographers and the Beginings of Modern Oriental- ism, International Journal of Middle East Studies, Vol. 27, No. 2. (May, 19",
      "bbox": {
        "l": 196.0,
        "b": 551.0,
        "r": 716.0,
        "t": 579.0
      }
    },
    {
      "label": "text",
      "text": "Wiet, G Introduction a la littérature arabe, Paris 1966.",
      "bbox": {
        "l": 195.0,
        "b": 538.0,
        "r": 533.0,
        "t": 551.0
      }
    },
    {
      "label": "footnote",
      "text": "The Eneyeloped 1986, 1035, of Islam, vol. III, ed. B. Lewis, V.L. Ménage, J. Schacht, Leiden, London",
      "bbox": {
        "l": 196.0,
        "b": 222.0,
        "r": 717.0,
        "t": 249.0
      }
    },
    {
      "label": "page_footer",
      "text": "375",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 468.0,
        "t": 212.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 918,
      "h": 1188
    },
    "2": {
      "w": 918,
      "h": 1188
    },
    "3": {
      "w": 918,
      "h": 1188
    },
    "4": {
      "w": 918,
      "h": 1188
    },
    "5": {
      "w": 918,
      "h": 1188
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}