{
  "1": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 1042.0,
        "r": 581.0,
        "t": 1057.0
      }
    },
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 676.0,
        "b": 1044.0,
        "r": 718.0,
        "t": 1056.0
      }
    },
    {
      "label": "section_header",
      "text": "Publ. Astron. Obs. Belgrade No. 91 (2012), 371-375\nPoster\nDESCRIPTION OF THE EARTH IN THE WORKS OF\nARABIC GEOGRAPHERS FROM IX TO XII CENTURY\nI. CVIJANOVIĆ\nInstitute of History, Knez Mihailova 36, 11000 Belgrade\nFrana Levstika 12, 11000 Belgrade\nE-mail: irena.cvijanovic@yahoo.com\nAbstract. The works of Arabic writers provide data about shape, position and size of the\nEarth, planets and zodiac signs. They include preserved maps of Ibn Haukal, Al-Masudi\nand Al-Idrisi. Al-Masudi (871-956/7) made a map of the world and wrote that the Earth\nis round, before the Christians in Europe were ready to accept that idea. The famous\ngeographer and cartographer Al-Idrisi (IX/X., died in 903/913.) has lived on the court of\nNorman king Roger II of Sicily, and after his death on the court of his son William I on\nSicily, where he obtained the data from European and Arabic geographers. On the basis\nof this data he wrote a work known entitled Roger's book. Besides this important work he\nmade a celestial globe and a map of the world in the shape of a silver disk. The lines that\nmarked the borders of seven regions of the inhabited world were engraved on this disk. The\nArabs had excellent knowledge of Greek astronomy and accepted their division of the world\nin seven climatic zones.\nFirst Arabic maps were made according to the map of Ptolemy, a classical as-\ntronomer, geographer and mathematician from Alexandria. During the reign of Theo-\ndosius and Justinian, the interpretation that the Earth is round and that it represents\nonly a small part of the Universe was forbidden. Early medieval Arabic writers in-\ncluded in their maps of the world the Arabic lands in Asia and North Arfica, than\nByzantine Empire, lands of Francs, Gals, Langobards, land of Slavs, Russians, Bul-\ngars, Turks, Alans, Hazars, as well as lands from Persia to India and China. For\nthem, well known part of the world ended with the Atlantic Ocean, ie. West Sea and\nthe Pacific, ie. Big Sea. Idrisi, Ibn Rosteh, Ibn Haukal and Al-Masudi gave a division\non seven climatic zones.\nIbn Rosteh, Abu 'Ali Ahmed ibn Umar ibn Rosta Isfahani, (IX/X century, died\nin 903/913.), is a Persian geographer who wrote in Arabic. In his work Kitab al-\na'lak An-Nafisa VII he gave a particularly beautiful description of Constantinople,\nByzantine provinces, the land of Slavs, Bulgars, Russians and Khazars. He probably\nwrote from 290-300/903-13. From his detailed work, which could be classified in short\n1C. Pellat, Langue et littérature Arabes, Paris 1970, 154-155.\n2Ibn Rosteh, Kitab al-a'lák An-Nafisa VII, in: BGA, ed. De Goeje, Lugduni-Batavorum (Leiden)\n1892; S. Maqbul Ahmad, in: The Encyclopedia of Islam, vol. III, ed. B. Lewis, V.L. Ménage, Ch.\nPellat, J. Schacht, Leiden, London 1986, 92.\n371",
      "bbox": {
        "l": 243.0,
        "b": 855.0,
        "r": 670.0,
        "t": 894.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 408.0,
        "b": 813.0,
        "r": 505.0,
        "t": 828.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 295.0,
        "b": 780.0,
        "r": 619.0,
        "t": 806.0
      }
    },
    {
      "label": "key_value",
      "text": "",
      "bbox": {
        "l": 352.0,
        "b": 764.0,
        "r": 562.0,
        "t": 777.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 353.0,
        "b": 766.0,
        "r": 399.0,
        "t": 777.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 402.0,
        "b": 764.0,
        "r": 562.0,
        "t": 777.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 581.0,
        "r": 717.0,
        "t": 746.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 375.0,
        "r": 717.0,
        "t": 540.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 289.0,
        "r": 717.0,
        "t": 371.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 211.0,
        "b": 263.0,
        "r": 531.0,
        "t": 275.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 221.0,
        "r": 717.0,
        "t": 260.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 466.0,
        "t": 213.0
      }
    }
  ],
  "2": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 418.0,
        "b": 1048.0,
        "r": 494.0,
        "t": 1058.0
      }
    },
    {
      "label": "text",
      "text": "I. CVIJANOVIĆ\nencyclopedia of history and geography, it can be seen that the author was very well\neducated and talented in writing. In the first chapters he deals with the shape of\nthe Earth, signs of the zodiac, planets, position of the Earth and its size. He further\non deals with mathematics and astronomical geography, and cites his sources. A\ndescription of the Earth, nations and roads follows after introduction. Ibn Rosteh\nwrote that the Earth is a sphere and that the Ocean takes up to 24.000 miles, in\nother words that it is a big circle, a diameter of approximately 7.636 miles, and that\nthere are exactly 21.600 towns in the world.\nAl-Istakhri, Abu Ishak Ibrahim ibn Muhamad al-Farisi al-Istakhri, (X century,\nborn around 900) was famous only for one of his works. He wrote mostly about\nIslamic lands and the Mediterranean with a description of added maps (fig. 1). His\nwork Kitâb al-masâlik wa'l mamálik (The Book of roads and kingdoms), can be\ndated only on the basis of the described events about 950/1 (934). It has become\nvery popular. There are few early and shortened editions, as well as a translation to\nPersian, that are quite different.\nIbn Haukal, Abu'l-Kasim ibn 'Ali al-Nasibi (ibn Mumamad ?) ibn Haukal, (X\ncentury, died after 977.) is an Arabic geographer and chronicler. He was born in\nNisibis (Nasibin) in Mesopotamia. By request of Al-Istakhri, he has edited his geo-\ngraphical maps, enlargened the text, and published it under his name in 976/7 under\nthe title Al-Masâlik w'al-Mamâlik (Roads and kingdoms), known also under the ti-\ntle Kitāb Surat al-ard (The Book about description of the Earth).3 Ibn Haukal was\nthe best representative of geographers that wrote on the basis of their own trips and\ndirect observations. His descriptions were precise and very useful for travelers. The\nmap Surat al-Ardh (Picture of the Earth), includes detailed description of Muslim\nSpain, Italy, Byzantine Empire (fig. 2). With this map he gave a description of Kiev,\nmentioned the road of Volga Bulgars and Khazars.5 The main difference between the\nwork of Ibn Haukal and Al-Istakhri is that he describes Islamic lands of West Europe\nand North Africa. The authors did not copy maps, but they made them indepen-\ndently. Ibn Haukal, in contrast to his predecessor, has added a description of a map\nin the chapter about each region. Besides Ibn Haukal's work published by M. J. De\nGoeje in 1873., we know of one more abridged edition of an anonymous author from\n1233.\nAl-Masudi, Abul Hasan Ali ibn Husain Ali al-Masudi, (IX/X century, 871-956/7.)\nhas introduced a thematic method of writing by Arabs. Instead of writing about\nevents in chronological order, he has grouped them around dynasties, kings and\nnations. He was born in Baghdad, where he spent his youth. He was one of the\nmost educated Arabs of his time. Al-Masudi knew history, geography, astronomy, zo-\nology and sciences related to Islam. Searching for a new knowledge he left his native\ntown for a trip through Asiatic and African countries to the east and Spain on the\nwest. In the book Kitâb at-Tanbih wa'l-Ischrâf he has explained his philosophy about\nminerals, plants and animals. Unfortunately, only a part of this book is preserved.\n3C. Brockelmann, Geschichte der arabischen Litteratur, Leipzig 1909, 114.\n4A. Miquel, in: The Encyclopedia of Islam, vol. III, ed. B. Lewis, V. L. Ménage, Ch. Pellat, J.\nSchacht, Leiden - London 1986, 786-788.\n5A. Miquel, in: The Encyclopedia of Islam, vol. VII, ed. C.E. Bosworth, E. Van Donzel, W.P.\nHeinrichs, Ch. Pellat, Leiden New York 1993, 492-493.\n6H.A.R. Gibb, Arabic Literature, Oxford 1963, 81-83.\n7G. Wiet, Introduction a la littérature arabe, Paris 1966, 120-121.\n372",
      "bbox": {
        "l": 195.0,
        "b": 889.0,
        "r": 717.0,
        "t": 1021.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 770.0,
        "r": 717.0,
        "t": 886.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 486.0,
        "r": 717.0,
        "t": 768.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 329.0,
        "r": 717.0,
        "t": 480.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 212.0,
        "b": 303.0,
        "r": 604.0,
        "t": 315.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 276.0,
        "r": 717.0,
        "t": 301.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 248.0,
        "r": 717.0,
        "t": 275.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 211.0,
        "b": 236.0,
        "r": 493.0,
        "t": 248.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 212.0,
        "b": 222.0,
        "r": 556.0,
        "t": 234.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 444.0,
        "b": 202.0,
        "r": 468.0,
        "t": 213.0
      }
    }
  ],
  "3": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 1049.0,
        "r": 717.0,
        "t": 1058.0
      }
    },
    {
      "label": "text",
      "text": "DESCRIPTION OF THE EARTH IN THE WORKS OF ARABIC GEOGRAPHERS FROM IX TO XII CENTURY\nIn one part of this work he mentiones Christian authors that he knew and comments\ntheir works. He made a map of the world and wrote that the Earth is round, before\nthe Christians in Europe were ready to accept that idea (fig. 5). He wrote the ency-\nclopedia of the world history, Akhbar az-zaman (History of time) in thirty volumes,\nbut there is only one that is preserved in Vienna.8 There is one incomplete copy of\nthis work, prepared by Burkgardart, in the library of St. Sofia in Istanbul, which\nconsists of 20 big volumes. At the begining of this work it can be seen that at least\n10 copies are missing. In Bodlean library in Oxford there is a manuscript, supposed\nto be one volume of Al-Masudi's history. He has prepared an addition under the title\nKitab al-Awsat in which he explained historical events in chronological order. His-\ntory of time has come to us in abridged edition under the title Muruj adh-dhahab wa\nma'ādin al-jawāhir (Golden meadows and mines of precious stones). According to\nthe words of the author the work got this name because it includes traditions, history\nand all other fields of science. For the first time one Arabic author has combined\nhistory and geography in his work. He has used at least sixty five written sources\nfor this historical-geographical work including, as an addition to the Arabic text, a\ntranslation of Plato, Aristotle and Ptolemy. The first edition of this book was edited\nin 943., than he has finished a new one in Basra in 947. and the last one in 956.\nAl-Idrisi, Abu 'Abdallah Muhammad ibn Muhammad ibn 'Abdallah ibn Idris\n(middle of XII century, 1099/1100-1164/5/6), the best known Arabic geographer,\nwas born in Ceuta, as a son of Spanish-Arabic parents. After studies in Cordova, in\nMuslim Spain, he spent several years traveling through North Africa, Middle East,\nEurope, and arrived to Palermo in 1138., invited by the king of Sicily. He was famous\ngeographer and cartographer on the court of Norman king Roger II of Sicily, and\nafter his death of his son, William I.10 His work Kitab nuzhat al-mušqat fi ihtiraq\nal-afaq was ordered by the king. 11 He wrote on the basis of the data of observers that\nwere sent from different countries and on the basis of the impressions from his own\ntrips. Besides this important work, he has constructed a celestial sphere and a map\nof the world in the shape of a silver disk for his sponsor Roger II (fig. 3,6). There are\nlines engraved on the disk, that marked the borders of seven regions of the inhabited\nworld. Barons from Sicily have raised against William in 1169, and burned many\ndocuments and books including new Latin edition of Idrisi's book. The map and the\nsilver disk disapeared. His book was the first geographical work edited in Europe in\n1154. (1192?), under the title Kitab nuzhat al-Mušqat fi dhikr al-amsar wa-l-aqtar\nwa-l-buldan wa-l-juzur wa-l-mada'in wa-l-afaq (The book for those who want to read\ndescriptions of metropolis, regions, countries, islands, towns and regions). 12 It was\nincluded in the cathalog as De geographia universalis, but without a text in Latin. It\nis known under the title Al-Kitab al-Rudjar (Roger's book), because it was written\n8Ch. Pellat, in: The Encyclopedia of Islam, vol. VI, ed. C.E. Bosworth, E. van Donzel, B. Lewis,\nCh. Pellat, Leiden 1991, 784-789.\n\"C. Brockelmann, Semitistik, Leiden 1954, 287-288.\n10M. Tolmacheva, The Medieval Arabic Geographers and the Beginings of Modern Orientalism,\nInternational Journal of Middle East Studies, Vol. 27, No. 2. (May, 1995), pp. 141-156.\n11 The Encyclopedia of Islam, vol. III, ed. B. Lewis, V.L. Ménage, J. Schacht, Leiden, London\n1986, 1032.\n12 Al-Idrisi, Kitab Nuzhat al-Mušqat fi Ihtiraq al-Afaq, Bejrut 1989; In Latin title was Oblectatio\ndisiderantis in descriptione civitatum principalium et tractum et provinciarum et insularum et ur-\nbium et plagarum mundi (Rome: Typografia Medici, 1952). B. Baldi has translated it on Italian\nin 1600., and incomplete edition is now at the University in Montpellier.\n373",
      "bbox": {
        "l": 195.0,
        "b": 721.0,
        "r": 718.0,
        "t": 1021.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 383.0,
        "r": 717.0,
        "t": 718.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 342.0,
        "r": 717.0,
        "t": 368.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 210.0,
        "b": 329.0,
        "r": 482.0,
        "t": 341.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 303.0,
        "r": 717.0,
        "t": 327.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 276.0,
        "r": 717.0,
        "t": 301.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 222.0,
        "r": 717.0,
        "t": 274.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 468.0,
        "t": 212.0
      }
    }
  ],
  "4": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 418.0,
        "b": 1048.0,
        "r": 494.0,
        "t": 1058.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 198.0,
        "b": 843.0,
        "r": 453.0,
        "t": 1015.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 479.0,
        "b": 841.0,
        "r": 714.0,
        "t": 1010.0
      }
    },
    {
      "label": "caption",
      "text": "I. CVIJANOVIĆ\nFigure 1: Al-Istakhri's world map.\nFigure 2: Ibn Haukal's world map,\noriented with South at the top.\nFigure 3: Al-Idrisi's Tabula Rogeriana,\noriented with South at the top.\nFigure 4: Ibn Haukal's world map,\nMediterranean area only.\nFigure 5: Mas'udi's world map,\nreconstruction.\n374\nFigure 6: Al-Idrisi's world map,\noriented with South at the top.",
      "bbox": {
        "l": 233.0,
        "b": 809.0,
        "r": 428.0,
        "t": 824.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 503.0,
        "b": 793.0,
        "r": 701.0,
        "t": 824.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 479.0,
        "b": 643.0,
        "r": 713.0,
        "t": 762.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 215.0,
        "b": 643.0,
        "r": 459.0,
        "t": 754.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 218.0,
        "b": 594.0,
        "r": 441.0,
        "t": 625.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 507.0,
        "b": 594.0,
        "r": 703.0,
        "t": 625.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 493.0,
        "b": 347.0,
        "r": 681.0,
        "t": 563.0
      }
    },
    {
      "label": "picture",
      "text": "",
      "bbox": {
        "l": 214.0,
        "b": 348.0,
        "r": 427.0,
        "t": 558.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 229.0,
        "b": 311.0,
        "r": 411.0,
        "t": 340.0
      }
    },
    {
      "label": "caption",
      "text": "",
      "bbox": {
        "l": 497.0,
        "b": 308.0,
        "r": 679.0,
        "t": 340.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 467.0,
        "t": 213.0
      }
    }
  ],
  "5": [
    {
      "label": "page_header",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 1049.0,
        "r": 717.0,
        "t": 1058.0
      }
    },
    {
      "label": "text",
      "text": "DESCRIPTION OF THE EARTH IN THE WORKS OF ARABIC GEOGRAPHERS FROM IX TO XII CENTURY\nby the order of the king. 13\nThe medieval Arabic astronomers wrote that the Earth is round, before the Chris-\ntians in Europe were ready to accept that idea. They have preserved the works of\nGreek astronomers during Dark Ages.\nBibliography\nAl-Idrisi: Kitab Nuzhat al-Mušqat fi Ihtiraq al-Afaq, Bejrut 1989.\nAl-Istakhri: Via regnorum, descriptio ditionis moslemicae, in: BGA, ed. De Goeje,\nLugduni-Batavorum (Leiden), 1870.\nAl-Masudi: Kitâb at-Tanbih Wa'l-Ischrab in: BGA, ed. De Goeje, Lugduni-Batavorum\n(Leiden) 1894.\nAl-Masudi: Muruj adh-dhahab wa ma'adin al-jawahir, Beirut 2005.\nBagrow, L.: Die geschichte der kartographie, Berlin 1951.\nBrockelmann, C.: Geschichte der arabischen Litteratur, Leipzig 1909.\nBrockelmann, C.: Semitistik, Leiden 1954.\nCuntz, O.: Die geographie des Ptolemaeus, Berlin 1923.\nThe Encyclopedia of Islam, vol. VII, ed. C.E. Bosworth, E. Van Donzel, W.P. Heinrichs,\nCh. Pellat, Leiden - New York 1993.\nThe Encyclopedia of Islam, vol. VI, ed. C.E. Bosworth, E. van Donzel, B. Lewis, Ch.\nPellat, Leiden 1991.\nThe Encyclopedia of Islam, vol. III, ed. B. Lewis, V.L. Ménage, Ch. Pellat, J. Schacht,\nLeiden, London 1986.\nGibb, H. A. R.: Arabic Literature, Oxford 1963.\nIbn Haukal: Via et regna, descriptio ditionis moslemicae, in: BGA, ed. De Goeje,\nLugduni-Batavorum (Leiden), 1897.\nIbn Rosteh: Kitab al-a'lák An-Nafisa VII, in: BGA, ed. De Goeje, Lugduni-Batavorum\n(Leiden) 1892.\nLeithäuser, J. G.: Mappae mundi, Berlin 1958.\nPellat, C.: Langue et littérature Arabes, Paris 1970.\nTolmacheva, M.: The Medieval Arabic Geographers and the Beginings of Modern Oriental-\nism, International Journal of Middle East Studies, Vol. 27, No. 2. (May, 1995).\nWiet, G.: Introduction a la littérature arabe, Paris 1966.\n13 The Encyclopedia of Islam, vol. III, ed. B. Lewis, V.L. Ménage, J. Schacht, Leiden, London\n1986, 1035.\n375",
      "bbox": {
        "l": 195.0,
        "b": 1007.0,
        "r": 359.0,
        "t": 1023.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 957.0,
        "r": 718.0,
        "t": 1004.0
      }
    },
    {
      "label": "section_header",
      "text": "",
      "bbox": {
        "l": 410.0,
        "b": 914.0,
        "r": 502.0,
        "t": 928.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 889.0,
        "r": 591.0,
        "t": 902.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 889.0,
        "r": 591.0,
        "t": 902.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 860.0,
        "r": 717.0,
        "t": 888.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 833.0,
        "r": 717.0,
        "t": 860.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 818.0,
        "r": 599.0,
        "t": 832.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 818.0,
        "r": 599.0,
        "t": 832.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 804.0,
        "r": 537.0,
        "t": 818.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 804.0,
        "r": 537.0,
        "t": 818.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 790.0,
        "r": 610.0,
        "t": 803.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 775.0,
        "r": 442.0,
        "t": 789.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 763.0,
        "r": 527.0,
        "t": 776.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 734.0,
        "r": 717.0,
        "t": 762.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 198.0,
        "b": 707.0,
        "r": 717.0,
        "t": 734.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 197.0,
        "b": 678.0,
        "r": 717.0,
        "t": 706.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 664.0,
        "r": 479.0,
        "t": 677.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 636.0,
        "r": 717.0,
        "t": 664.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 609.0,
        "r": 717.0,
        "t": 635.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 594.0,
        "r": 469.0,
        "t": 608.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 580.0,
        "r": 502.0,
        "t": 593.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 580.0,
        "r": 502.0,
        "t": 593.0
      }
    },
    {
      "label": "list_item",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 551.0,
        "r": 716.0,
        "t": 579.0
      }
    },
    {
      "label": "text",
      "text": "",
      "bbox": {
        "l": 195.0,
        "b": 538.0,
        "r": 533.0,
        "t": 551.0
      }
    },
    {
      "label": "footnote",
      "text": "",
      "bbox": {
        "l": 196.0,
        "b": 222.0,
        "r": 717.0,
        "t": 249.0
      }
    },
    {
      "label": "page_footer",
      "text": "",
      "bbox": {
        "l": 444.0,
        "b": 201.0,
        "r": 468.0,
        "t": 212.0
      }
    }
  ],
  "_page_sizes": {
    "1": {
      "w": 918,
      "h": 1188
    },
    "2": {
      "w": 918,
      "h": 1188
    },
    "3": {
      "w": 918,
      "h": 1188
    },
    "4": {
      "w": 918,
      "h": 1188
    },
    "5": {
      "w": 918,
      "h": 1188
    }
  },
  "_heron_version": "1.0",
  "_heron_threshold": 0.6
}