{
  "1": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 1\t\r\n \r\nFrom a discussion of the mapping of the world before the 15th\r\ncentury period of discovery one learns that the concept of a\r\nland-enclosed Indian Ocean that was accepted by first century\r\nCE Claudius Ptolemy (#119) and passed on by him in the text\r\nand maps of his Geography was little more than an inherited\r\nscientific hypothesis, of interest chiefly to the learned men of\r\nhis day. Before Ptolemy’s time popular knowledge and\r\nconjecture pointed to an open Indian Ocean and a peninsular\r\nAfrica, and there is reason to believe that this conception of\r\nworld geography was a commonplace in the minds of the\r\nsailors and merchants of Europe when this great book was\r\nlater put into print with maps in 1477. Though little more\r\nthan conventionalized pictures of the earth and its waters, the\r\necclesiastical maps of the Middle Ages retained the truth in\r\nrespect to a junction between the Indian Ocean and a\r\ncontinuous ocean stream surrounding the land mass which\r\nmade up the known world of Europe, Asia, and Africa. The\r\nmost reliable maps of the period were the portolan charts,\r\nconstructed upon the basis of the actual experiences of\r\nmariners. Upon certain of these, proceeding from the period\r\nbefore the revival of the Ptolemaic maps, was shown a clear understanding of the Indian\r\nOcean, of the peninsular character of Africa, and of the Far East as seen by Marco Polo,\r\nan embodiment of the best knowledge of the day. The Martellus Germanus 1489 map of\r\nthe world ( see monograph #256 on this website) and the 1492 globe of Martin Behaim (#258),\r\nthe earliest terrestrial globe known to us, show before the discovery of America a picture\r\nof Africa, the Indian Ocean, and the Far East little different in its broadest features from\r\nthe actuality with which we are familiar.\r\n The possibility of ocean navigation between Europe and Asia tended to be\r\ndismissed by late-medieval geographers and cartographers for a range of not always\r\nconsistent reasons. According to Lawrence C. Wroth in his book The Early Cartography of\r\nthe Pacific, the European maps which have come down from the centuries before the Age\r\nof Discovery period fall into three broad categories: the maps of Claudius Ptolemy\r\n(#119), the ecclesiastical maps (#2XX), and the portolan charts (#250), respectively the\r\nlearned, the popular, and the utilitarian modes of representing on a plane the picture of\r\nthe earth and its parts. Throughout the first fifteen centuries of the Christian era these\r\nthree distinct types of map production are seen as parallel streams of which the first\r\nserved the scholar, the second the uncritical people, and the third the mariner. The\r\nscientific map of Claudius Ptolemy and the utilitarian portolan chart have become,\r\nthrough a natural evolution, the land map and the sea chart in common use today. They\r\nsurvived and developed because the scientific production learned to go to the utilitarian\r\nfor its subject matter, while the utilitarian borrowed from the scientific its learned\r\nsystem of construction. The ecclesiastical map underwent a certain degree of\r\ndevelopment in the embodiment of new geographical data, but, do to its function and\r\npurpose, it remained throughout its history unaffected by the superior construction of\r\nthe other forms, and was without influence upon their evolution. It had its origin in the\r\nprimitive geographical conceptions of the ancient Greek world, and it retained its\r\narchaic form throughout the three thousand years or so of its currency. In this opening",
  "2": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 2\t\r\nchapter of our discussion we shall be looking at Africa, the Indian Ocean, and eastern\r\nAsia successively through the eyes of Claudius Ptolemy, the churchmen who created the\r\necclesiastical maps, and the makers of the portolan charts.\r\n In 1970, Jacques le Goff stated that the medieval Western world had no\r\nsubstantial knowledge about the ‘realities’ of the Indian Ocean. More precisely, he\r\nargued that it was only by 1415 that the Indian Ocean was perceived as an ‘open sea’\r\nconnected to other large bodies of water. Previously, Latin-Christian authors had\r\ndepicted it as closed or landlocked. While most medieval world maps do not conform to\r\nmodern notions of precision and accuracy, this does not mean that no precise\r\ninformation about trading routes and seaways to India were available. For example,\r\nseveral 13th century world maps already depicted the Indian Ocean as connected to a\r\nlarger Ocean that was believed to encompass the world. A closer look at travelogues and\r\nother texts reflecting the geographical knowledge of the period also demonstrates that\r\nfrom the 14th century onwards, this Ocean was no longer perceived as an unnavigable\r\nbarrier that surrounded the known world. Quite the contrary, the Ocean and the seas\r\nwere seen as forming a system of interconnected water-bodies. This knowledge resulted\r\nprimarily from the “interplay between geo- graphical thought and social (navigational,\r\nmercantile) practice.”\r\n The oldest existing world map\r\nascribed to Ptolemy dates back to the year\r\n1297. This manuscript map was produced\r\nand drawn by a team under the Byzantine\r\nmonk Maximus Planudes (1260-1330) who\r\nworked in Constantinople at that time. The\r\ncore question is now: what happened during\r\naround 1,150 years after Ptolemy? Was there\r\na stand-still in the history of geography and\r\ncartography? In the article “Fuat Sezgin and\r\nthe Re-writing of the History of Geography”\r\nby Detlev Quintern, he concludes that this\r\nappears highly improbable. Against this\r\nbackdrop the history of cartography is\r\nconfronted with several problems. Fuat Sezgin discovered many non-Ptolemaic\r\nelements in several of the surviving maps, among them the drawing of a second more\r\nsouthern latitude below the Equator. This is only one among many details analyzed by\r\nFuat Sezgin and which make it seem plausible that the Maʾmun geographers and their\r\nfollowers had an important impact on the so-called Ptolemaic maps which circulated\r\nfrom early 14th century onwards in more than twenty manuscripts before book printing\r\nstarted.\r\n Often histories of cartography qualify the Ptolemaic maps as scientific break￾through towards modern world maps, compared to the mainly mythological\r\nmappaemundi in European medieval times which were more an eschatological guide than\r\nmaps of the world (e.g. the Hereford and the Ebstorf mappae mundi dating both back to\r\naround 1300 #224 and #226).\r\n Fuat Sezgin developed a convincing and comprehensive answer after more than\r\nthirty years of extensive and intensive research in the Geschichte des Arabischen\r\nSchrifttums (Vol. 10, 11., 12, 13).\r\n ",
  "3": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 3\t\r\n \r\n Ptolemaic World Map by Maximus Planudes, 1297, Codex Seragliensis GI 57,\r\nTopkapı Museum, Istanbul (#119)\r\n \r\nOn the world map of Planudes, ascribed to Ptolemy, the Indian Ocean is\r\ndepicted as an inland lake, surrounded by a landmass, corresponding to an old belief\r\nthat was already questioned by Alexander the Great when he reached the Indian coast.\r\n It is an open question why the Ptolemaic world maps reproduced this obsolete\r\nand outdated cartographic depiction that was long before corrected by Arabic\r\ncartography. We still find the outdated over-extension of the length of the\r\nMediterranean (63 degrees) and the “melon-shape” of the Caspian Sea.\r\n The Geography of Claudius Ptolemy of Alexandria, while initially developed in\r\nthe second century CE, was first given printed publication at Vicenza in 1475; its earliest\r\nedition with maps was that which appeared at Bologna in 1477, bearing the incorrect\r\ndate, 1462. The world map in that book and the map of eastern Asia, entitled in later\r\neditions Undecima Asie tabula, displayed no greater knowledge of the Far East than had\r\nbeen embodied in them when they were first constructed by the Alexandrian\r\ngeographer about 150 CE. It has been generally accepted that the maps in the existing\r\nmanuscripts and early printed editions of the Geography go back to Ptolemy himself.\r\nFrom this general statement Father Joseph many historians excepts the all-important\r\nworld map, which in their opinion was constructed by Agathodaemon, an Alexandrian\r\ngeographer and an early editor of Ptolemy. Nils Adolf Erik Nordensklold’s Facsimile￾Atlas, discounts the part of Agathodaemon in the making of the sectional maps of the\r\nGeography but is not specific on the question of the world map. But whatever may be\r\nsaid it is clear that in its main features the world map is the graphic expression of",
  "4": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 4\t\r\nPtolemy’s text, especially of Books I and VII. Because of this circumstance it seems\r\nproper to refer to the mappemonde in the Geography as the Ptolemaic world map. \t\r\n In the Ptolemaic world map of 1477, as in those of all 15th century editions of the\r\nGeography, the far eastern extremity of Asia is shown throughout its length as unbroken\r\nland, bounded by a meridian running about fifteen degrees east of the Malay Peninsula.\r\nThis was Ptolemy’s 180º east longitude, the eastern limit of his oikoumene [the inhabited\r\nworld of Europe, Asia, and northern Africa, so far as revealed to him and the men of his\r\nday]. Beyond that meridian lay unknown land. Ptolemy knew the world was round and\r\nthat somewhere to the east of that unknown and very extensive area lay a great ocean.\r\nHe must have believed, as Columbus believed later, that this was the ocean which\r\nwashed the western coast of Europe, but as the whereabouts and shape of its eastern or\r\nAsiatic shore were unknown to him he eschewed guesswork and left out of his world\r\npicture the unknown land and unknown sea of eastern Asia, making his boundary the\r\nsharpest and most definite possible, that is, a meridian of longitude.\r\n In another aspect of his eastern picture Ptolemy displays what may seem a\r\nperversion of truth rather than ignorance or excessive caution. Upon his world map, a\r\nlandmass bearing the legend Terra incognita runs due east from Africa at 15º south\r\nlatitude and joins a non-existent southward extension of eastern Asia, specifically of that\r\nsection we call today Vietnam, Laos, and Cambodia, having at its southern extremity\r\nCambodia and Malaysia. This concurrence of imaginary landmasses unites the\r\ncontinents of Africa and Asia and makes of the Indian Ocean a land-enclosed sea. Such a\r\nconception of the Indian Ocean was not, however, a new and radical theory advanced\r\nby the Alexandrian geographer. Its statement in his text and its portrayal upon his world\r\nmap present a notable instance of the length to which a scholar will go in the application\r\nof a hypothesis. The Homeric conception of the world (#105) as a flat, circular disc of\r\nland surrounded by a continuous ocean stream remained a popular notion in the Greek\r\nworld even after many philosophers and scientists had accepted the theory of the\r\nsphericity of the earth enunciated by the Pythagoreans and subjected to theoretical proof\r\nby Aristotle. That new theory raised the question of the comparative extent and weight\r\nof the land and water masses of the world and their distribution with respect to one\r\nanother. One school of scientists maintained the continuous ocean theory of the older\r\nGreek world, asserting that on the sphere, as on the flat disc postulated by their\r\nforefathers, the landmass of the known world was encompassed by confluent oceans. In\r\ntheir conception the Atlantic Ocean, the Arctic, and the Indian Ocean merged to form a\r\nsingle body of water that surrounded the continents of Europe, Asia, and Africa. In the\r\nsecond century BCE, however, the continuous ocean theory was questioned by\r\nHipparchus, who set forth in place of it the hypothesis of land-enclosed oceans, the great\r\nmarine basins of the Atlantic and Indian Oceans, the Mediterranean, and the Caspian\r\nSeas. Hipparchus, astronomer and general scientist of the second century BCE, was not\r\nthe inventor of the theory of land-enclosed oceans but merely its outstanding proponent,\r\nwho put it into circulation and invested it with his authority. Before his time it had been\r\nmentioned as a not too unbelievable current theory by Aristode, who, however, in\r\nanother work expressly made denial of its possibility. So much curious and rich learning\r\nhas gone into the discussion of this subject.\r\n Marinus of Tyre, the celebrated geographer of the first century CE, accepted the\r\nHipparchian hypothesis, and Ptolemy, obedient to these forerunners and masters of his\r\nthought, gave it the weight of his authority.",
  "5": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 5\t\r\n The incorrect southward extension of eastern Asia that we observe upon the\r\nworld map of Ptolemy was a tradition of the Alexandrian school of geographers which\r\nhe accepted without question. The extension of Africa eastward to a junction with the\r\nfalse Asiatic projection seems also to have been a part of his heritage from the past. In\r\nthe era of Hipparchus, three centuries before Ptolemy’s time, the Egyptian Greeks,\r\nintermediaries in the commerce between Europe and Asia, knew the eastern coast of\r\nAfrica chiefly from voyages made upon the Red Sea. Sailing the length of that body of\r\nwater from ports near its head they had upon their right hand an African coast that\r\nturned sharply to the east beyond the Strait of Bab-el-Mandeb and ran in that direction\r\nuntil it reached the Indian Ocean at Cape Guardafui. But the voyages of these men of the\r\nsecond and third centuries BCE did not carry them far beyond the Strait, certainly not\r\noften as far as Cape Guardafui. Their business was to meet at Moosa in Yemen on the\r\nRed Sea the Arab traders who brought to them at that place the wares of India and even\r\nof lands beyond the Ganges. It was the policy of the Arabs, firmly maintained for\r\ncenturies, to discourage whatever inclination the Egyptians may have had towards the\r\nestablishment of direct trade relations with the people of those distant countries. The\r\nsouthern shore of the Gulf of Aden was hardly known to them, therefore, from personal\r\nexperience. They knew of its easterly direction beyond Bab-el-Mandeb, but until about\r\n100 BCE they did not know, nor were they told by the Arabs, that at Guardafui the\r\nAfrican coast made a right-angle turn southward and thereafter ran for some thousands\r\nof miles in a general southwesterly direction. Towards the end of the second century\r\nBCE, about the year 115 of that era, Eudoxus, returning from India to Egypt, was blown\r\nout of his course along the Arabian coast and driven southward down the African coast\r\nbelow Cape Guardafui. It was probably because of his report of this event that\r\nArtemidorus, writing about 100 BCE could know that the African coast turned around at\r\nthe “Southern Horn,” that is, Guardafui, though he stated that nothing was really\r\nknown of the coast beyond that headland. Not knowing of its change of direction they\r\nmust have conceived of it as continuing indefinitely its eastward trend. What the traders\r\nand mariners may have suspected we do not know, but it is plain that the geographers\r\nfound it easy to let that coast run eastward in their imaginations until it met the equally\r\nfalse southern extension of the Asiastic coast which tradition had placed upon their\r\nmaps. Such a solution was especially easy for the followers of Hipparchus, committed to\r\nthe theory of land-enclosed oceans. This conception was accepted by Marinus of Tyre\r\nand from him was taken over by Ptolemy. But Marinus and Ptolemy expressed it with a\r\ndifference, for by their time conditions had changed. The power of the Arabs had\r\nweakened, and the men of Egypt were customarily voyaging to Cape Guardafui,\r\nrounding its corner, and progressing south and southwest along the Indian Ocean coast\r\nof Africa as far as Rhapta at about 8º S latitude. They had knowledge, furthermore, of\r\nthe promontory called Prasum five degrees further south. Ptolemy portrayed this new\r\ndata upon his maps, but unfortunately for his reputation as a geographer he was not\r\nsatisfied to record only what he knew to be fact, the knowledge acquired from the actual\r\nexperience of the mariners and traders of the two centuries preceding his day. He had a\r\ntradition and an inherited theory to maintain. In his obdurate attachment to the tradition\r\nof an eastward extension of Africa and to the theory of land-enclosed oceans, he made a\r\nninety-degree change of direction at Prasum and carried his African coast eastward\r\nacross the Indian Ocean until it joined the imaginary southward extension of Asia at the\r\nplace called Cattigara.\r\n ",
  "6": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 6\t\r\n Cape Guardafui.\r\n \r\n It has been suggested by all who have given thought to the subject that when\r\nPtolemy compiled his book and maps in the middle of the second century CE there was\r\ncurrent along the docks and in the warehouses of Egypt and Mediterranean Europe\r\nfuller information than he recorded about the Indian Ocean and its shores. It seems,\r\nindeed, that knowing so much he might have known more, that he might, indeed, have\r\nknown as much as his predecessor, the anonymous Egyptian-Greek merchant who\r\nabout 60 CE composed for the mariners and traders of his time the work we know as The\r\nPeriplus of the Erythraean Sea. One of the routes detailed in that book of sailing directions\r\nleads us down the Red Sea, through the Gulf of Aden, around Cape Guardafui, and\r\nsouthward to Rhapta, situated, as already said, on the east coast of Africa at about 8º S\r\nlatitude {present-day Tanzania]. Describing Rhapta and other neighboring markets\r\nalong that coast, the author of the Periplus writes: “. . . beyond these places the unexplored\r\nocean curves around toward the west, and running along by the regions to the south of Aethiopia\r\nand Libya and Africa, it mingles with the western sea.?” Ptolemy could also have known the\r\naccount given by Herodotus of the circumnavigation of Africa in the seventh century\r\nBCE by Phoenicians sent forth by Necho, King of Egypt; and he might have learned\r\nfrom Strabo and Pliny of the attempt of Eudoxus to make that navigation from west to\r\neast, inspired by the rumor that the Phoenicians in Spain followed that route to Somali\r\nand Arabia in order to be free of the intermediation in their trade of the Ptolemaic rulers\r\nof Egypt. But these stories of a circumnavigation of Africa were tradition and hearsay\r\nand, in his consideration, of little weight against the belief of Hipparchus and Marinus\r\nof Tyre that the Indian Ocean was cut off from the Atlantic by an African barrier.\r\nCape\tGuardafui\t",
  "7": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 7\t\r\n Alexander’s conquest of India had disclosed an empire rich in possibilities of\r\ntrade, and the rulers of the Greek state that he had set up in Egypt persisted in their\r\nefforts to establish a direct route to the Indus by way of the Red Sea and the Indian\r\nOcean. Those efforts, as we have seen, were long frustrated by the insistence of the Arab\r\nupon his position as carrier and middleman. But by the second century BCE we find the\r\nPtolemies sending their ships beyond the Strait of Bab-el-Mandeb to trade along the\r\nArabian coast and even, in 120 and 115 BCE, sending Eudoxus to India upon\r\nindependent voyages. But in proportion as the Arab dominance began to weaken at this\r\ntime so did the energy of the Ptolemies. They were kept out of the Persian Gulf by the\r\nSeleucids of Syria, the rival Greek rulers in Asia, and, when the Seleucid power had\r\nwaned, by the Parthians. Decayed though it was, the Arab power remained sufficiently\r\ngreat to prevent their sailing to Guardafui. A change of great moment occurred,\r\ntherefore, in the history of this commerce between East and West when in 30 BCE Egypt\r\ncame under the rule of Rome. Roman money and Roman enterprise gave it new life. The\r\nEgyptian fleets in the reign of Augustus went both to India and to Guardafui and\r\nbeyond, and there was instituted at once a new era in world commerce that was to\r\nendure until the close of the second century CE, when all things Roman suffered a\r\ndecline.\r\n Sometime in the course of this ceaseless effort by the Egyptians to reach India\r\noccurred an event, or a series of events, which immensely facilitated the navigation\r\nupon which their commerce rested. The Indian voyages of Eudoxus in 120 and 115 BCE\r\nwere coasting voyages of a tedious character. It was inevitable that sooner or later\r\nsomeone would strike out boldly on a direct course from Bab-el-Mandeb to the Indian\r\npeninsula, riding before the southwest monsoon that blew steadily from May to\r\nOctober. It is commonly said that this feat was accomplished by the Greek mariner\r\nHippalus, who about 47 CE made the first voyage from the Arabian coast across the\r\nupper part of the Arabian Gulf direct to the mouth of the Indus, carried thither rapidly\r\nand with comfort by the monsoon. The historians who fix this date for the Hippalus\r\nvoyage add that by 50 CE a succession of experimental voyages had resulted in even\r\nmore direct courses across the Gulf, from Bab-el-Mandeb or from Guardafui, and in\r\nlandfalls farther and farther south on the Indian coast until the port customarily attained\r\nwas Muziris, now Cranganore, a town near the tip of the great peninsula. All this was\r\nbefore the time of Ptolemy the geographer. Because of it the shape of India was known\r\nto his contemporaries. Strangely, it seems to have been concealed from him. His\r\nportrayal of that land upon his maps seems to go little beyond the knowledge attained\r\nthrough the voyage of Nearchus from the mouth of the Indus to the head of the Persian\r\nGulf, made four centuries earlier at the behest of Alexander the Great.\r\n But Ptolemy’s eastward extension of the African coast and his failure to portray\r\nIndia as a peninsula are not the only evidences we have that the world map of the\r\nAlexandrian was an unsatisfactory record of the geographical knowledge of his day. In\r\nthe course of the enlarged commerce that followed the discovery by Hippalus of the\r\ndirect course to India, a mariner named Alexander coasted the eastern shores of the\r\nIndian peninsula, rode the monsoon across the Bay of Bengal to Lower Burma, sailed\r\nthence southward along the Malay Peninsula, found, and passed through, the Strait of\r\nMalacca, and continued northward by way of the Gulf of Siam to Cambodia and\r\nVietnam and probably beyond. The end of Alexander’s voyage was the city of Cattigara,\r\nthe exact location of which is uncertain. What is certain is that Cattigara did not lie where\r\nPtolemy had placed it, that is, on the Indian Ocean at 10º S latitude, marking the spot, so",
  "8": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 8\t\r\nto speak, where his imaginary African and Asiatic extensions join. Ptolemy knew of this\r\nvoyage to Cattigara made by Alexander the Mariner. In his Geography he discussed the\r\naccount of it he had received from Marinus of Tyre, but neither that account nor his own\r\nacumen led him to realize that Alexander had found an outlet from the Indian Ocean to\r\nthe seas beyond.\r\n There must, indeed, have grown out of the trade which followed the voyages of\r\nHippalus and Alexander a body of knowledge sufficiently full and exact to permit\r\nPtolemy to free the Indian Ocean from the southern barrier he gave it upon his world\r\nmap, and to open a way from it into the seas which washed the eastern coast of Asia. The\r\nPeriplus of the Erythraean Sea offers other testimony that such knowledge existed in\r\nPtolemy’s day, or, certainly, that it had existed shortly before. The author of the Peri￾plus seems to have believed not only that the Indian Ocean joined the Atlantic at the\r\nsouth of Africa, but that, sailing its eastern extremity, one might pass to \"the sea outside\r\nending in a land called This,\" whence were brought raw silk, silk yarn, and silk cloth.\"\r\nPtolemy could have known the Periplus with its account of an unobstructed eastern coast\r\nof Africa, its record of the exploit of Hippalus, and its assumption of a passage from the\r\nIndian Ocean to the China Sea, but it is by no means certain that he did know a book\r\nwhich in his day, a full hundred years later, may have lost whatever degree of currency\r\nit once possessed. But one may go too far, may rest too heavily upon the vagaries and\r\nthe sins of omission of the Alexandrian geographer. One need not, in truth, apologize\r\neither for the vagaries or for him. Whatever his sins, however rigid his theories, he\r\nremains the father of modern geography, the scientist who forced upon the world a\r\ncartographic system which takes into account the problems involved in projecting a\r\nsphere upon a plane and brought into common use the practice of locating places by\r\nreference to their latitude and longitude.\r\n If there were reasons, as set forth in the foregoing section, for thinking of\r\nPtolemy’s portrayal of the Indian Ocean and its coasts as anachronistic even in the\r\nsecond century of the Christian era, how much more potent are those which apply to the\r\neditions of the great work printed without addition, gloss, or amendment in text or\r\nmaps in the last quarter of the 15th century! This comment need not be interpreted as\r\nderogatory to the skill and intelligence of the 15th century editors of the book. It is a fair\r\ngeneralization to assert that the early recensions of ancient works in that and the\r\npreceding century were concerned chiefly with the presentation of the texts as received\r\nfrom the past. For those first scholars, warm with enthusiasm for the reborn knowledge,\r\nit was enough to collate and organize the records of the ancient culture every day being\r\nbrought to light in the libraries of monasteries, princes, and savants. Criticism,\r\nemendation, and development would come in due course.\r\n But even with so much said by way of extenuation, it sometimes seems that the\r\nfundamentalism, the reverence for the received ancient text displayed by the\r\nRenaissance scholar was carried to an extreme by the early editors of Ptolemy. Since the\r\nAlexandrian’s day much had been added to the world’s store of geographical\r\nknowledge when in the year 1410 Jacobus Angelus made the first translation of the\r\nGeography into the Latin. For one thing the Muslims in that period had become a great\r\nfigure in the world. Stimulated by their new and militant religion, they began in the\r\nseventh century the dissemination of their faith and the enlargement of their political\r\nand economic life. Rome and Constantinople were no longer the mistresses of the world.\r\nThe Muslims had pushed their conquests to the East and the West. Once more they were\r\nthe merchant and carrier of the Indian Ocean, the freighter of merchandise between Asia",
  "9": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 9\t\r\nand Europe, and the agent and middleman in that difficult commerce. It would have\r\nbeen strange if those far-wandering traders, sailors, and men-at-arms, bridging the\r\ncontinents by their conquests, had not carried to their European kingdoms some notion,\r\nhowever vague, of the lands and seas and peoples which lay beyond their stations on\r\nthe African coast and eastward of their empire in India. And yet it is a fact that little\r\nknowledge of the world is found upon the Islamic maps that have come down to us that\r\nhad not been recorded centuries earlier by Ptolemy.\r\n Nils Adolf Erik Nordensköld suggests in his Periplus that what was best in the\r\nIslamic maps was but Ptolemy in debased form. He has only mild praise even for the\r\nmuch lauded maps of Idrisi, the one engraved in circular form upon a silver plate for\r\nRoger II of Sicily in 1154, and the other a plane map of seventy sheets (#219) made about\r\nthe same time to accompany the Arab scholar’s own work, a detailed description of the\r\nknown world. In our present interest, however, those maps deserve consideration, for\r\nthey show an honest, if not always successful, effort to ascertain and record geographic\r\ntruth, and furthermore they correct the errors of Ptolemy in one important particular.\r\nIdrisi retains on his plane map the southern land boundary of the Indian Ocean, but he\r\nhas done away with the false southern extension of the coast of Asia and has opened the\r\nIndian Ocean to the eastern seas. His display of islands in the neighborhood of the\r\nMalay Peninsula shows plainly that an inquiring mind had been at work seeking\r\ninformation for a clear graphic record of that area. It has been pointed out that the place\r\nnames upon this map are those employed in the tales of Sinbad the Sailor, hero of the\r\nArabian Nights. There is a plausible literary theory that the Sinbad story was not wholly a\r\ncreation of the artistic imagination, but that in the adventures of this fictional personage\r\nis found summarized the experience of many generations of Arab traders and mariners\r\nin the isles and seas of the eastern Indian Ocean.\r\nUntil recent years we might have brought forward at this point a map that would\r\nhave demonstrated most satisfactorily the possession by the Renaissance world of full\r\nknowledge of the shape of Africa and the confluence south of it of the Indian and\r\nAtlantic Oceans. There was constructed in 1351 the portolan atlas which Nordenskiöld\r\ndesignates as the Atlante Mediceo (#233) and acclaims as a work of extraordinary\r\nsignificance. The map of Africa in this notable work shows that continent, more than a\r\ncentury before Bartholomeu Dias rounded the Cape of Good Hope, as a great\r\nsouthward-reaching peninsula thrust between the Atlantic and Indian Oceans. Since\r\nNordenskiöld’s time, however, close examination of this treasure of the Laurentian\r\nLibrary at Florence has shown that its portrayal of the southern portion of the continent\r\nis an addition of a later draughtsman. Just when this revision of the map was\r\naccomplished seems uncertain. In all probability the addition was made as the result of\r\nan increasing assurance on the part of the Portuguese of the early 15th century that Africa\r\nwas in fact such a peninsula as we now know it to be. But whatever the explanation may\r\nbe of this alteration in outlines, the map that suffered it may no longer be received as\r\nevidence that 14th century Europeans were aware of the peninsular form of that\r\ncontinent. More than a century elapsed after the construction of the Atlante Mediceo map\r\nbefore, in two maps of 1457 and 1459, Africa was so drawn as to leave little doubt that its\r\npeninsular character was understood by the cartographers responsible for the\r\ndelineation. In the Genoese world map (#248) and the Fra Mauro map (#249), the Indian\r\nOcean is shown as an open sea and Africa as a peninsula separating that ocean from the\r\nAtlantic. These maps were made some twenty years before the editors of Ptolemy, by\r\nimplication certainly, contradicted the geographical facts affirmed in their delineations.",
  "10": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 10\t\r\n \r\n al-Idrisi’s world map, oriented with South at the top, 21 x 30 cm (23 cm diameter), 1154\r\nBodleian Library, MS Pococke 375, dated 1553/960 H\r\n \r\n It is an historic fact that for more than half a century before the Ptolemaic map\r\nappeared in printed form explorers sent out by the Portuguese prince, Henry the\r\nNavigator, had been disregarding the picture of Africa set forth by the ancient\r\ngeographer. Stage by stage, they and their successors had been pushing their way down\r\nthe West African coast, intent upon rounding its extremity and making their way to the\r\nChristian Abyssinian kingdom of Prester John. The logic of this persistent exploration\r\npointed clearly to a belief in an open Indian Ocean on the part of Prince Henry and the\r\nlater Portuguese rulers and mariners whom he had inspired.\r\nThe final and the most effective criticism of the 15th century editors of Ptolemy’s\r\nGeography is based upon their failure to embody in the Ptolemaic maps the greatly\r\nexpanded knowledge of the world which through the narrative of Marco Polo’s travels\r\nin the Far East had been current in Europe for nearly two hundred years before the",
  "11": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 11\t\r\nperiod of their activities. His return from that voyage homeward from China to Venice\r\nin which Polo, passing through the strait of Malacca, had seen the waters of the South\r\nChina Sea merge with those of the Indian Ocean, and at that time we shall speak of\r\ncertain maps of the period before 1477 in which through the influence of Polo’s story the\r\nland barriers of the Indian Ocean at south and east had been removed and Ptolemy’s\r\neastern bounds of Asia extended to the Pacific shores and beyond.\r\nPortolano Laurenziano Gaddiano from the Laurentian Sea Atlas, Medicean Atlas, 1351 Biblioteca\r\nMedicea Laurenziana, Florence, Italy, originally oriented with South at the top (#233)\r\n \r\n \r\nClaudius Ptolemy, whose second-century CE Geographia achieved influence on\r\ncontemporary as well as historical geography across Europe, particularly after its\r\ntranslation into Latin in 1406, disrupted the common late-medieval world view of the\r\nhabitable world as a three-part orbis terrarum (circle of known inhabited lands or\r\noikoumene) surrounded and bordered by an ocean that becomes non-navigable and\r\nuninhabitable in the south because of the excessive heat of the so-called torrid zone. In its\r\nplace, however, Ptolemy’s Geographia set a detailed and, as it turned out, pervasive\r\nimage of an Indian Ocean bordered by a terra incognita that linked Africa and the South\r\nEast Asian promontory of Cattigara. In other words, the Indian Ocean after Ptolemy’s re￾introduction remained equally isolated, but in this case because it was land-locked. It\r\nshould be noted that during ancient and medieval times all of the human activity (i.e.,\r\ncommerce, trade, etc.) took place only in the northern reaches of the Indian Ocean. Due",
  "12": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 12\t\r\nto the plethora of languages and the state of marine technology, most interactions\r\namong the people of the Indian Ocean region, from Southeast Asia to Africa and the\r\nMiddle East was subject to misinterpreting geographic information (distances, landmass\r\ndescriptions, etc.), protectionism of trade routes (“secrets”) and conflicting information.\r\n Ptolemy saw the world as a complete sphere, but the inhabited area as only a\r\npart of it, stretching south some 16 degrees beyond the Equator, north to about the\r\nArctic Circle, east a little beyond Malaya, and bounded on the west by the Atlantic.\r\nAlthough his lists locate places by their geographical coordinates it is clear that these did\r\nnot all come from immediate observation but were worked out from whatever\r\ninformation was available, such as accounts of journeys giving distances from one place\r\nto another; this means that their appearance of great accuracy is often spurious.\r\n Ptolemy’s text concludes with “A descriptive summary of the map of the\r\ninhabited earth” and the statement: “That part of the earth which is inhabited by us is\r\nbounded on the east by the unknown land which borders on the eastern races of Greater Asia,\r\nnamely the Sinae and the Seres, and on the south by the likewise unknown land which encloses\r\nthe Indian sea and which encompasses Ethiopia south of Libya, the country called Agisymba, and\r\non the west by the unknown land encircling the Ethiopian gulf of Libya and by the Western ocean\r\nbordering on the western-most parts of Africa and Europe. . . .” . This statement, if it is indeed\r\nthat of Ptolemy, states the belief that the Indian Ocean was enclosed by land stretching\r\nfrom southern Africa all the way to eastern Asia.\r\n The oldest surviving manuscript of Ptolemy’s Greek text was copied more than a\r\nthousand years after he wrote it dates from the late 12th or early 13th century. Enough\r\nother copies survive from the 13th and 14th centuries to show that it was, perhaps had\r\nsuddenly become, a popular work in the Byzantine Greek cultural world. Some, not all,\r\nof these medieval manuscripts include maps, and of these there are two versions. In\r\nboth versions there is a world map, but one has 64 regional maps while the other,\r\nfollowing Ptolemy’s text more literally, has 26. These maps may or may not have been\r\ncompiled by Ptolemy himself. His book gives instructions for making the maps but does\r\nnot say in so many words that he has actually drawn them. They may have been\r\nconstructed from the text and added to the book by a copyist at any date between\r\nPtolemy’s own time and the earliest known manuscripts. There is also some reason to\r\nsuppose that the world map was constructed separately from the regional maps of either\r\nversion (see #119).\r\n Prior to the writings of Ptolemy, the Greeks developed observations about the\r\nsize and shape of the known world. Philosophers and historians such as Homer\r\nHecataeus, Eratosthenes, Strabo, Herodotus, and Crates wrote treatises describing their\r\nconcepts of the physical world.\r\n ",
  "13": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 13\t\r\n Ptolemy’s world map in the Ulm edition, 1482 (#119)\r\n ",
  "14": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 14\t\r\n \r\nThese Greek concepts included a round spherical earth with an all-encompassing world\r\nocean; and some also included an austral continent south of the oikoumene that some\r\nthought to provide “balance” and “symmetry” (#106).\r\n ",
  "15": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 15\t\r\n A reconstruction of the Greek frame of the world (after Reinaud) #106\r\n ",
  "16": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 16\t\r\n Crates concept of the world with four “balancing” landmasses (see #113)\r\n \r\n \r\nReconstruction of Pomponius Mela’s world view, 37 CE (see #116)\r\n \r\n ",
  "17": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 17\t\r\n As mentioned above, a tantalizingly brief story by the Greek historian Herodotus\r\nconcerns a sea voyage that took place during the 26th Dynasty reign of Necho II. He\r\nrelates the circumnavigation of Africa some 2,000 years before the Portuguese mariners\r\nof Vasco da Gama. We are not really given a reason for this expedition, though it would\r\nseem that such voyages were made for economic gain. Considering the control of the\r\nnorthern shores of the Mediterranean by the Greeks and of the southern coasts by the\r\nPhoenicians, the only region where Egypt, with its inferior fleet, might acquire some\r\ninfluence and wealth would have been Eastern Africa, where they had already\r\nestablished some trade. However, it has also been suggested that the voyage might have\r\nserved a military purpose.\r\n According to Herodotus, Necho II ordered a Phoenician-crewed fleet to leave\r\nEgypt from the east by way of the Gulf of Suez and to return via the Straits of Gibraltar\r\nat the Mediterranean's western mouth. Hence, he expected this expedition to navigate\r\naround Africa clockwise. This would be a long journey, in which the crew would help\r\nsupport themselves by establishing temporary settlements on land where they would\r\ncultivate crops during the voyage.\r\n According to the story, after two full years the fleet eventually rounded the\r\nPillars of Hercules (the Straits of Gibraltar), and returned to Egypt during the course of\r\nthe third year. Herodotus finishes the story with a surprising conclusion:\r\n \r\nThe Phoenicians made a statement that I myself do not believe (though others\r\nmay if they wish) to the effect that they sailed west around the southern end of\r\nAfrica, they had the sun on their right.\r\n \r\nThis is exactly what they would have seen going west around the Cape of Good Hope at\r\nthe southern tip of Africa, because the sun appears to the right when traveling westward\r\nin the southern hemisphere, but how could Herodotus have known this at such an early\r\ndate if the journey did not take place. Outside of Herodotus’ account, there is little or no\r\nevidence of such a voyage. However, most of his story appears to at least be plausible,\r\nand it should be noted that this voyage took place not so very distant from Herodotus’\r\nown time. His Histories were written in about 440 BCE, while Necho II came to the\r\nEgyptian throne in about 610 BCE.\r\n The Egyptians would have known, for some time, a certain length of Africa’s east\r\ncoast, for they had from earlier times been making visits to the Land of Punt. Though\r\nPunt’s exact location remains unknown, it was almost certainly on Africa's east coast\r\nsomewhat south of Egypt. The Phoenicians had been in contact with the Atlantic since\r\nthe trading port of Gadir (modern Cadiz) was founded in about 800 BCE. They also\r\npossessed ships that were capable of sailing through the Straits of Gibraltar and along\r\nthe North African coast, so technically a trip around Africa would have been possible. In\r\nfact, the winds and currents favor an east-west circumnavigation of Africa, and\r\nnavigation would have been no problem if they kept the coast in sight. Furthermore, the\r\nEgyptians had for many years undertook sea voyages to Byblos, on the Levantine coast,\r\nand to Punt by way of the Red Sea. Though the circumnavigation of Africa under Vasco\r\nda Gama, who sailed from Lisbon in Portugal to Calicut in India, took only ten months\r\nbetween 1497 and 1498, the two and a half year journey of the Phoenician ships also\r\nseems reasonable, especially considering their layover to replenish their supplies.\r\n The tale is also consistent with the foreign policy of Necho II, who sought to\r\nbenefit Egypt economically by improving access to sea routes. He is credited with\r\nprobably starting the construction (or restoration) of a canal some 85 kilometers long",
  "18": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 18\t\r\nand wide enough for sea going ships, connecting the Nile Valley with the Red Sea. This\r\ncanal, foreshadowing the modern Suez canal, later became an internationally important\r\ntrade route.\r\n Queen Hatshepsut's expedition to the Land of Punt was commemorated on a relief near Thebes in\r\nthe second century BCE, the basis for this drawing.\r\n \r\n However, while many readers of Herodotus have taken this story for granted, it\r\ndoes not in fact prove that Necho II’s fleet did circumnavigate Africa. It must be\r\nremembered that Herodotus’ Histories is an elaborate piece of rhetorical writing, and is\r\nnot an objective history, but rather a highly literary, as well as partisan, analysis of the\r\ncultural clash between the Greek and Persian cultures.\r\n According to Philippe Foret and Andreas Kaplony in The Journey of Maps and\r\nImages on the Silk Road, although the depiction of the Indian Ocean as an enclosed sea\r\nmay suggest a direct borrowing from Ptolemy, a more detailed observation suggests that\r\nthis was not the case. As is well known, Ptolemy surmised that the Chinese coast\r\nextends southward and the African coast eastward, so that they eventually join up.\r\nMuslim geographers were heavily influenced by Ptolemy, and their world maps often\r\nenvisage the coasts of Africa as running eastward parallel to the coasts of Southeast Asia\r\nand China. Other medieval Islamic geographers, including the two world maps found in\r\nthe late 12th century Kitāb Gharāʾib al-funūn wa-mulah al-ʿuyūn itself, known as the Book of\r\nCuriosities, allow for a narrow opening at the eastern edge of the Indian Ocean.\r\nMoreover, it seems that the author, while depicting the Indian Ocean as an enclosed\r\noval, still conceived of a passage between the Indian Ocean and the All-Encompassing\r\nOcean. A long legend to the left of the protruding mountain of Cape Guardafui notes\r\nthat: “The traveler here encounters the Land of the Zandj [East Africa] at the edge of the All￾Encompassing Ocean [al-Bahr al-muhif]. Whoever wants to go there [i.e., to the All￾Encompassing Ocean} is thrown back by the waves, but whoever seeks the Land of Zandj, the sea\r\nwaves come from behind [and assist him]”. In this passage, the author appears to suggest\r\nthat the open sea beyond the Horn of Africa does lead to the All-Encompassing Ocean, but\r\nthat the prevailing winds draw ships toward the shores of East Africa.",
  "19": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 19\t\r\n The depiction of the Indian Ocean here as an enclosed sea may be a result of\r\nstylistic considerations rather than geographical conception. The general shape of the\r\nIndian Ocean appears remarkably analogous to the Book of Curiosities’ depiction of the\r\nMediterranean Sea in a map that immediately follows. Both of these maps have no\r\nparallel in other geographical works, and both appear to be original to the author. The\r\nauthor of the Book of Curiosities was sufficiently acquainted with sailing on the eastern\r\nMediterranean as to be able to list, in correct sequence, more than a hundred bays, and\r\nreproduce the names of about a hundred islands. He was not, however, well informed\r\nabout the Asian coasts and islands and had recourse to the Akhbar al-Sin wa-l-Hind, Ibn\r\nKhurdadhbih, or other earlier sources. In June 2002, the Bodleian Library acquired an\r\nillustrated manuscript of this hitherto unknown Arabic cosmographical treatise, the\r\nKitāb Gharāʾib al-funūn wa-mulah al-ʿuyūn, known as the Book of Curiosities. The\r\nmanuscript is a copy, probably made in Egypt in the late 12th or early 13th century, of an\r\nanonymous work compiled in the first half of the 11th century in Egypt. The treatise is\r\nextraordinarily important for the history of science, especially for astronomy and\r\ncartography, and contains an unparalleled series of diagrams of the heavens and maps\r\nof the earth.\r\n \r\n The oldest extant rectangular world map, the late 12th or early 13th century\r\nBook of Curiosities’ Book 2, Chapter 2 (MS. Arab. c. 90, fols. 23b-24a). © The Bodleian Library.\r\n ",
  "20": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 20\t\r\n \r\n \r\n\tMap of the Indian Ocean: Book of Curiosities’ Book 2, Chapter 7: “On the cities and forts along\r\nthe shore [of the Indian Ocean]” (MS. Arab. c. 90, fols. 29b-30a). © Bodleian Library.\r\n ",
  "21": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 21\t\r\n The assumption that Ptolemy actually believed in an enclosed Indian Ocean has\r\nbeen debated. Historian Wilcomb Washburn, in an article published in 1985, argued that\r\nPtolemy and other geographers of his time and earlier did not believe in the closed\r\nIndian Ocean. Instead, according to Washburn, this idea emerged in the late Middle\r\nAges in relation to arguments between those who believed that the unknown portions of\r\nthe earth were primarily land versus those who believed that the unknown regions were\r\npredominantly seas. Washburn wrote that the “arbitrary character of the presumed\r\nsouthern border of the map and the southern border of the land on Ptolemy’s maps”\r\nsuggests errors of copyists. Though he had never made an actual count, Washburn\r\nthought that most of the printed editions of Ptolemy’s Geographia showed the enclosed\r\nIndian Ocean while many of the manuscript world maps had an open Indian Ocean. The\r\nareas in question should have been left as blanks if the mapmakers were being honest,\r\nbut because of “man’s compulsion to fill them in” the land bridge was added.\r\n One radical interpretation of the “enclosed sea” is worth noting. D.E. Ibarra\r\nGrasso, in 1970, proposed the thesis that Ptolemy’s enclosed sea is the Pacific Ocean. In\r\nthat case Cattigara is actually the west coast of South America. This idea has not received\r\nmuch support, as it would be very difficult to prove, but it is a stimulating idea in any\r\ncase, and one example of how different viewers may interpret maps in various ways.\r\n As previously stated, it was a text with maps that was translated into Latin by\r\nJacobus Angelus in about 1406 that first introduced Ptolemy’s Geographia into Western\r\nEurope. Its impact is shown by the number of surviving 15th century manuscripts of the\r\nLatin version and by the succession of early printed editions. The first, at Vicenza in\r\n1475, had no maps, but it was then published with maps at Bologna in 1477, Rome in\r\n1478 (40) and 1490, Ulm in 1482 and 1486, and so on. It is shown too by the way that\r\nother world maps published during this period quickly assimilated elements from\r\nPtolemy’s. Thus the map shown below that was copied by Pirrus de Noha in about 1414\r\n(#239) to illustrate a quite different geographical text of the Roman period, the\r\nChorography of the first century author Pomponius Mela (#116), takes from Ptolemy the\r\nfollowing: its land-locked Indian Ocean, the shapes of Malaya and Sri Lanka (Taprobana),\r\nthe Mediterranean Sea 20 degrees too long, the Mons Lune [Mountains of the Moon] as\r\nthe source of the river Nile, no clear indication of the shape of central-southern Africa or\r\nthe Far East, etc. This is an attempt to display only the oikoumene or known inhabited\r\nworld, not an attempt to display those parts still unexplored.\r\n Measuring 18 x 27 cm the de Noha parchment has been painted so that the\r\noceans and seas are displayed in blue (the Red Sea is an exception and is shown in red),\r\nthe mountains as symbolic sawtooths in brown on the natural colored parchment\r\nlandmasses and the text is in red. There is the influence of the portolan [nautical] charts\r\nwith regards to familiar coastlines, particularly the outlines of the Baltic and Caspian\r\nSeas, although Scandinavia is displayed as a massive peninsula with Greenland not yet\r\njoined to it, as it is in the later work of Clavus. Many of the geographical names in the\r\ncountries of the interior recall Ptolemy and a total lack of adornment such as castellated\r\ntowns, pictures or vignettes to occupy unknown areas.\r\n ",
  "22": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 22\t\r\n World map of Pirrus de Noha, 1414,\r\nshowing an enclosed Indian Ocean based upon Claudius Ptolemy (#239)\r\n \r\n ",
  "23": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 23\t\r\n A rare Ptolemaic world map included by Gregor Reisch, the compiler of the\r\nMargarita Philosophica [Pearl of Wisdom], shown below, was first published in Basel in\r\n1503; 10.6 x 15.9 inches, (27 x 40.5 cm). The world map shows the Indian Ocean enclosed\r\nby land. Reisch has added his observation on the supposed land connection between\r\nAfrica and the East, as follows: “Here is not land but sea, in which there are such islands not\r\nconceived of by Ptolemy”. In this way Reisch shows awareness of the voyages of Vasco da\r\nGama and possibly that of Christopher Columbus. Thus he refutes Ptolemaic\r\ngeography, but with words, not by changing the map. It was a time when new\r\ninformation about geography came to scholars regularly. This information had to be\r\nincorporated, somehow, into the classical view of the earth that was represented in the\r\nmaps of Claudius Ptolemy. The first edition of Gregor Reisch’s untitled map of the\r\nworld is widely regarded as the first printed map to provide information concerning\r\nColumbus’ discoveries in the New World. This is the first of four world maps by Reisch\r\nthat appeared in his Margarita Philosophica, first published in Frieburg in 1503.\r\n In addition to the important reference to Columbus’ discoveries, the map is also\r\nwidely recognized as the first map to incorporate a scale of measurements for longitude\r\nand latitude, a landmark scientific advance. The map is embellished twelve lively wind￾heads, one of which includes what is believed to be the first printed depiction of\r\neyeglasses. The stylized wind-heads are a significant departure from the traditional\r\ncherubic faces normally scene on 15th Century printed maps.\r\n The Margarita Philosophica is an encyclopedia of knowledge, including\r\ncommentaries on anatomy, astrology, astronomy, geometry, music, natural history,\r\nphilosophy, and geography. The map shows the oikumene, or the known inhabited\r\nworld. This was the world based on the geography of Ptolemy in the second century CE\r\nand features Europe, Asia, and Northern Africa, with the Indian Ocean shown as an\r\nenclosed sea. Of course, when this map was made the world was changing rapidly in\r\nterms of what Europeans knew about geography. This map contains a hint of those\r\nchanges, which is discussed below.\r\nThe world’s major river systems are clearly marked, especially the Ganges in\r\nIndia and the Nile in Africa. Typically, mapmakers thought the Nile River rose from\r\ntwin (here three) lakes south of the equator, which were near the Mountains of the Moon.\r\nStreams from the mountains fed the lakes. Ptolemy describes such a lakes-and￾mountains layout in his works, although the precise identification of the Mountains of the\r\nMoon may have been a fourth century addition to his text.\r\nIn the closed sea of the Indian Ocean lies a large island, Taprobana, which was\r\nwhat the Greeks called Sri Lanka. There were many rumors about the island in Europe.\r\nThe author of The Travels of Sir John Mandeville said that Taprobana was part of the\r\nkingdom of Prester John, as well as that the island had mountains of gold guarded by\r\nman-eating ants. He went on to explain that the island was the home of the Sciapodes, or\r\nmen with only one large foot, a detail he borrowed from Greek sources.\r\n ",
  "24": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 24\t\r\nPtolemaic world map by Gregor Reisch, 1503, showing an enclosed Indian Ocean even after the\r\nsuccessful circumnavigation of Africa by the Portuguese in 1497-99.\r\n \r\n As explained by Thomas Suarez in Shedding The Veil (p. 36), the map includes\r\n\"the first hint of Columbus’ discoveries on a printed map.” While the map is certainly\r\nPtolemaic in its overall geography, there is a note that suggests knowledge of the New\r\nWorld, on the land bridge connecting Southeast Asia to Africa. In Latin, \"Hic No Terra\r\nSed Mare E: In Quo Mire Magnitudis Isulae Sed Phtolomeo Fuerunt Incognitae.\" [here there is\r\nnot land but sea, in which there are such islands not known to Ptolemy]. Reisch may be\r\nreferring to several sets of islands, including Australasia or the Spice Islands of Maritime\r\nSoutheast Asia. However, it is most likely that he is referring to the islands of the\r\nCaribbean. Columbus had sailed west in search of Asia; when this map was made, he\r\nwas still actively promoting the idea that he had reached Asian islands, rather than\r\nAmerican. Hence, the location of the note concerning the discovery of the New World in\r\nthe land bridge is consistent with Columbus' belief that he had made contact with the\r\nislands off the coast of Asia.\r\nBelow is a typical Macrobius map (see #201) printed in 1483, where the sphere of\r\nthe earth is divided into the five climatic zones. The map is oriented with north at the\r\ntop, where the Northern, Frigid Zone lies. Below it lies the Northern Temperate Zone,\r\nwhich includes the whole of the inhabited world and most of the then known\r\nlandmasses. A small part of Africa extends into the Perusta [Torrid] Zone, too hot for\r\nliving creatures. Most of this zone is taken up by Alueus oceani [turbulent sea], whose\r\ncirculating currents oppose each other, creating the tides.\r\n To the south of the central Torrid Zone lies the unknown Southern Temperate Zone,\r\npurportedly occupied by the Antipodes. This zone is called Nobis Incognita that is\r\n“unknown to us”, implying that the creatures living in the zone are not descendants of",
  "25": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 25\t\r\nAdam. It must be noted that Macrobius was considered as a pagan writer and his maps\r\nare bereft of any religious references.\r\n In the Northern Temperate Zone the landmasses shown in this map are those of\r\nAsia, Africa and Europe, none of them named, while the countries of Britania, Ispania,\r\nAethiopia Perusta, Armenia and India are named. From the seas Mare Rubrum [the Red\r\nSea] is named.\r\n Below that is the 10th century Cottoniana or Anglo Saxon world map that displays\r\nan all encompassing world ocean, but no austrial continent.\r\n \r\n \r\nMacrobian world map, 1483, 14.3 cm diameter (#201)\r\nThe Huntington Library, San Marino, California (HEH 91528)\r\n ",
  "26": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 26\t\r\n The Cottoniana or Anglo-Saxon Map, c. 995, 21.2 x 17.6 cm, (#210)\r\nBritish Library, Cotton MS Tiberius BV, f.56v, oriented with East at the top, a world map that\r\ndisplays a circumfluent, all encompassing ocean\r\n ",
  "27": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 27\t\r\n A re-drawing of the Cottoniana/Anglo-Saxon world map\r\n ",
  "28": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 28\t\r\n From a very early date, the Indian Ocean, like the Mediterranean Sea, was\r\ntraversed by sailors, traders, religious men, and migrants moving in search of goods,\r\nnew lands, or the great unknown. Their movements were shaped by numerous factors,\r\nboth geographic and social in origin. Exchanges are not solely shaped by geographic and\r\neconomic factors, but also by systems of ideas and by the balance of power. Over\r\ncenturies, these exchanges transformed the Indian Ocean into a unified space. The\r\ncartographic representation of the Indian Ocean in the Middle Ages is a special case in\r\nthe history of cartography, still puzzling the historians of geography. The present\r\ncontribution offers some remarks on probabilities and patterns of knowledge\r\ntransmission across time and massive diversity of societies of the region and to assess its\r\nplace in the history of science and civilization. The source base is the corpus of medieval\r\nArabic compositions having to do with geography, travel, and sailing on the Indian\r\nOcean because it was these Arab traders and mariners who became the primary “links”\r\nbetween the Far East and Europe. Two vectors of knowledge transfer are explored: (1)\r\nbetween formal and informal geographical records and (2) between academic geography\r\nand the practical knowledge of the ocean and its coasts by Indian Ocean mariners.\r\n The earliest extant Arab/Islamic sources dealing with the Indian Ocean date to\r\nthe ninth century CE. It has been long established that the founders of Islamic world\r\ngeography relied significantly on Greek sources, in particular on the aforementioned\r\nGeographia of Claudius Ptolemy (c. 90 - 168 CE). The following discussion will first touch\r\non a few early examples illustrating the transmission of antique geographical\r\ninformation about the Indian Ocean in very general terms. One of the early Arab\r\ninterpreters of Ptolemy (both in astronomy and geography) was Muhammad ibn Musa\r\nal-Khorezmi, or Khuwarizmi (d. c. Anno Hegirae (A.H.) 232/846-847 CE. In the\r\ndescription of African coastal locations of the First Climate and those south of the\r\nequator, he transcribes a number of port cities with their geographical coordinates.\r\nThere is, however, no narrative describing the ocean in the imperfectly preserved unique\r\nmanuscript, although it probably existed because we can find a brief sketch in Kitab al￾Zij al-Sabi` of al-Battani (c. A.H. 244-317/858-929 CE), a later translator of Ptolemy’s\r\ntables other than al-Khorezmi, who provides the ocean’s dimensions. They had\r\nmeasured the Sea of India and say that its length, counting from the west to the east,\r\nfrom the limits of Ethiopia (al-Habash) to the borders of India (al-Hind) is 8,000 miles,\r\nwhile the width is 2,700 miles. It extends 1,900 miles south of the island of the Equinox.\r\nNear the land of Ethiopia the sea forms a gulf in the direction of the Barbara, called al￾Khalij al-Barbari (that is, Sinus Barbaricus); its length is five hundred miles and the width\r\nof its seabed is one hundred miles.\r\n Within a century from the first translation of Ptolemy, al-Battani’s data were\r\nadopted and transmitted further. The same numbers are quoted a few decades later in\r\nKitab al-`Unwan [Book of Chapter Titles] by the Christian historian Agapius of Manbij\r\n(mid-to late 10th century CE), who omits the tables of geographical coordinates, but\r\npreserves narrative sections about the earth and its regional divisions and includes the\r\nchapter “On the Seas, Gulfs, and Islands”.\r\n The monsoon climate of the Indian Ocean was known to the Hellenistic Greeks\r\nas shown in the Periplus of the Erythraean Sea (c. 70 CE). This book ascribes its discovery\r\nto the Greek navigator Hippalus (first century BCE). The same source credits Arab\r\nseamen with plying the sea routes of the Indian Ocean, at least of its eastern part, as far\r\nas Ceylon/Sri Lanka, or the Greek Taprobane.\r\n ",
  "29": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 29\t\r\n The earliest Arab reference to the regularity of Indian Ocean monsoons is to be\r\nfound in the Kitab al-Buldan [Book of Countries] c. A.H. 289-290/902-903 CE, by Ibn al￾Faqih al-Hamadani, one of the founders of Islamic descriptive geography:\r\nKnow that the Seas of Persia (Fars) and India are in fact one sea because they join\r\none another, except that they are unlike each other [for navigation]. . . As to the\r\nSea of India, shortly before the Spring Equinox, when the Sun is the constellation\r\nof Pisces, it becomes dark and hard. Many waves appear, and nobody sails it\r\nbecause of the dark clouds and storms while the Sun is in the Gemini. When the\r\nSun moves to the constellation of Virgo, the darkness of the sea dissolves and\r\nnavigation becomes easy, until the Sun again reaches Pisces. The Sea of Persia is\r\nnavigable in all seasons, but people refrain from sailing the Sea of India during its\r\nstormy period due to the darkness and difficulties. (Kubbel’ and Matveev,\r\n1960:72)\r\n \r\n In the 10th century, to the formal and general descriptions of the known parts of\r\nthe world are added travel accounts. Of these, The Marvels of India (`Adja’ib al-Hind, c. 953\r\nCE), are full of mirabilia stories and sailor adventures in ships, ports, and islands of the\r\nocean. In the case of the historian al-Mas`udi (d. A.H. 345-346/965 CE see monograph\r\n#212), to his awareness of formal geographies of the world and the region is added his\r\npersonal travel experience because of his first-hand knowledge of Arabia, India, Sri\r\nLanka and China as well as the East African coast. Mas`udi is familiar with classical\r\ngeographical place-names: he calls the western Indian Ocean the Habashi Sea, that is\r\nEthiopian, in the tradition of Greek usage of “Ethiopia” for not strictly Abyssinia (the\r\ntoponym derived from the Arab Habasha for Ethiopians, their neighbors across the Red\r\nSea), but also for sub-Saharan Africa as a whole. On the other hand, Mas`udi also\r\nindicates a degree of familiarity with Islamic maps of the region. In his Muruj adh￾Dhahab [Gold Meadows] he says: “The Sea of the Zanj and the Ahabish is to the right of\r\nthe Sea of India, even though their waters adjoin”. The words “to the right” indicate that\r\nMas`udi visualizes a cartographic representation of the ocean according to the dominant\r\nin Islamic cartography orientation to the South (some maps show orientation to the\r\nEast). For map examples, see those above and in monographs #211, #212, #213 and #214).\r\n Al-Mas`udi also knows of al-Khalij al-Barbari, or the Barbari Gulf of the Ethiopian\r\nSea, originating in Ptolemy’s Geography. The Arab ethnonym Barbara, in the context of\r\nnortheast Africa (as opposed to Barbar in North Africa), refers to Kushitic populations of\r\nSomali and the Red Sea coast in its southern part on the African side. Thus, Sinus\r\nBarbaricus or the “Barbari Gulf” of the Indian Sea is the Red Sea, and especially its\r\nsouthern part; the western part of the Indian Sea is also called the Habashi (that is,\r\nAbyssianian, or Ethiopian) Sea in earlier Arab geographies. The northern part of the Red\r\nSea is usually called Bahr al-Qulzum, so named after the port village of Clysma at the\r\nnorthern point of the Gulf of Suez; this name eventually drives out the use of the term al￾Khalij al-Barbari, except in old-fashioned retellings of the globe’s major geographical\r\nfeatures. On Ptolemy’s extant Latin maps, the Red Sea is named Sinus Arabicus, but a\r\nGreek manuscript map of Ptolemaic Aithiopia below Egypt, produced around 1400, shows\r\nthe name Barbarikios off the eastern seaboard. It should be noted that the red coloring,\r\nused in European mappaemundi for the Red Sea, was never applied in Islamic maps. The\r\n1482 print world map of Ptolemy shows the red tint applied not to the Red Sea itself, but\r\nto the part of the Arabian Sea that later became known as the Gulf of Aden.\r\n Thus, beginning with late-Hellenistic and early-Roman period and reaching into\r\nthe Islamic “Golden Age,” written evidence registers the Arab presence in the western",
  "30": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 30\t\r\nIndian Ocean; it confirms Arab knowledge of the sea and the use of Arabic as both a\r\nsource of information and medium of international communication and transmission of\r\nknowledge. By the 10th century Arabic scholarship had produced a synthesis of received,\r\npreserved older and newly developed knowledge. This body of classical Islamic\r\ngeography combined or absorbed, in varying degrees, these three recognizable, if not\r\nindependent, streams: (1) Greek ecumenic geography (largely, but not exclusively,\r\nPtolemy), (2) Arab-Islamic travel narratives, and (3) Islamic cartography. It will be\r\nnoticed that this list does not include Persian geography or a separate mention of Greek\r\ncartography. The former remains a lacuna, a question mark. Despite the evident, and\r\nrecognized, impact of pre-Islamic Persian geography on Islamic regional geography and\r\ndespite Persian participation in Indian-ocean trade and other maritime activities, well\r\nillustrated in the Marvels of India, since at least the Sassanid period, we lack tangible\r\nnarrative evidence of specific and identifiable Persian elements in the mainstream\r\nrepresentation of the Indian Ocean in early Islamic scholarship as a maritime entity\r\nbeyond a simple enumeration of the traditional “Seven Seas” (in parallel with the Seven\r\nClimates, the Persian kishvar-ha regions, as distinct from the latitudinal Greek κλἰματα).\r\n For the best example of Greek influence on Islamic geography, and cartography,\r\nwe first return to Ptolemy and then leap forward to the 12th century, when Muhammad\r\nal-Idrisi (A.H. 493-560/1100-1165 CE #219) produced a world geography and a related\r\nseries of maps considered the pinnacle of Arab-Islamic geography. Idrisi worked at the\r\nNorman court of Sicily where, under patronage of Roger II (1098-1154), he had access to\r\nboth Arab and European sources, some of which he names. Born in Morocco, Idirisi\r\ntraveled at least as far east as Asia Minor, but much of his book is data compiled from\r\nearlier works. The projection of Idrisi maps is uniquely original and has not yet been\r\nexplained. The undisputed and strongest systemic influence, however, came from\r\nPtolemy. The narrative follows the maps, observing the Greek system of the Seven\r\nClimates that start from the Equator and rise to the Northern Polar Circle. Idrisi adds a\r\nsection south of the equator and instead of degrees of latitude and longitude he breaks\r\nthe map up into ten sections per clime. In each section, major cities and geographical\r\nfeatures (sea, lakes, rivers, mountains) are named and described, with added\r\nethnographic and cultural information, sometimes contemporary and sometimes long\r\nsince outdated.\r\n As can be seen below, this rectangular map displays an open Indian Ocean that is\r\nheavily populated with large islands and is bordered on the South by a very eastwardly\r\nextended Africa. Idrisi’s Indian Ocean is open in the east, but in his sectional maps the\r\neastern coast of Africa turns east above the equator and forms the ocean’s south coast\r\nextending to Indonesia. Idrisi’s Geography (Kitab Nuzhat al-Mushtaq) in general had a\r\nstrong impact on Islamic world cartography and descriptive geography, especially in the\r\nwestern Islamic lands. While Ptolemy was not yet lost to Idrisi, the latter’s overall\r\ninfluence in some ways reduced the felt need for ancient authorities. References to\r\n“Sharif al-Idrisi” made citing Ptolemy less necessary for later compilators, at least in\r\ngeographical matters.\r\n ",
  "31": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 31\t\r\n A modern copy of\tAl-Idrisi world map from the Nuzhat al-mushtāq fi'khtirāq al-āfāq,\r\n a.k.a Tabula Rogeriana, oriented with South at the top, 1154,\r\nBibliotheque nationale de France (MSO Arabe 2221) as reconstructed by the German\r\ncartographer Konrad Miller in 1927 and published in Stuttgart in 1928;\r\nbetter known as “The large Idrisi map”, size: 195 x 92 cm. (#219)\r\n Index of the sectional maps in the Nuzhat Al-Mushtaq.\r\nThis line drawing is a simplification of Konrad Miller’s composite map showing what the sectional\r\nmaps (which are interspersed throughout the text in al-ldrisi’s Nuzbat al-tnushtaq) would look like if\r\njoined together. The climate numbers are given along the vertical axis, and the ten longitudinal\r\ndivisions are given across the top. The consecutive numbers sometimes used to refer to the sectional\r\nmaps are shown in the upper right corner of each section. Note that these delineations follow most\r\nclosely the Paris (MS. Arabe 2221) and Oxford (MS. Pococke 372) manuscripts. The exact depictions\r\nof coastlines, islands, and so forth, differ in other manuscripts.\r\nAfter Konrad Miller, Mappae arabicae: Arabische Welt- und Landerkarten des 9.-13. jahrhunderts, 6\r\nvols. (Stuttgart, 1926-31), Band 1, Heft 2\r\n \r\n ",
  "32": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 32\t\r\n Ibn Hawqal’s world map (#213), Arabic, 980 CE oriented with South at the top, 35 x 43 cm,\r\ndisplaying a circumfluent ocean, Africa extended broadly to the East and the Indian Ocean\r\nalmost completely enclosed. An interesting and speculative West African coastline, hinting at the\r\nGulf of Guinea. The Nile River seems to be the only river system deemed worthy of illustration.\r\nDistortion of Europe is great with Italy laying east-west. Particularly of interest here is the\r\ninclusion of the Antipodes or Southern Continent seemingly part of Africa.\r\n \r\nThe earliest set of maps to survive from the corpus of Islamic cartography are those that\r\naccompany the text Kitab surat al-ard [Picture of the Earth] of Abu al-Qasim Muhammad\r\nibn Hawqal [Haukal] in the manuscript dated 1086, found in the Topkapi Sarayi Müzesi\r\nKütüphanesi in Istanbul.\r\n \r\n ",
  "33": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 33\t\r\n Ibn Said al Maghribi (1250) Kitab Djoughrafiya fi l’ aqalim al Sab\r\n[Book of maps of the seven climes] This map is of the Indian Ocean. The original manuscript of\r\nIbn Said had no maps. The one was added in later centuries in copies of his work. They originated\r\nin Ibn Hawqal’s work (#221, #213)",
  "34": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 34\t\r\n \r\nWorld map of al-‘Umari (16th century), oriented with South at the top,\r\n 20 cm diameter, Topkapi Museum of Istanbul, #226.1\r\nshows an almost totally enclosed Indian Ocean\r\n \r\n It was crucial for the rapid and far reaching cartographic survey of the earth in\r\nthe Islamic culture area that the notion of the various oceanic basins being enclosed by\r\nland, as inherited from the predecessors Marinos and Ptolemy, was abandoned in favor\r\nof the concept of an insular configuration of the oikoumene [known inhabited world].\r\n This world map, created by Arab Islamic geographers upon commission of the\r\nCalif al-Ma’mun, already represents the oikoumene in an insular configuration. The\r\noceans are laid-out in a peculiar manner: the entire landmass of the oikoumene is\r\nsurrounded by an ocean of restricted navigability (al-bahr al-muhit) which in turn is\r\nenclosed by a second ‘obscure’ ocean that was considered unnavigable due to its\r\ndarkness. This concept alone would have discouraged potential adventurers from any\r\nattempt to reach Asia via the western route across the Atlantic as long as it held sway. It",
  "35": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 35\t\r\ntook in fact quite a long time until the theory of an unnavigable, dark ocean was\r\ndismissed for good. Abu Abdallah al-Zuhri, who revised the Ma’mun Geography in the\r\n6th/12th century, raised objections against the ‘dark zone’. At any rate, according to his\r\naccount the offshore distance known to be navigable had by this time been expanded to\r\n800 parasangs [ca. 2,400 Arabic miles or 4,800 km]. In this context an important yet still\r\nlittle known concept by al-Biruni (died 440/1048, #214.3) should be remembered. It states\r\nthat the oikoumene was enclosed by an all-embracing ocean that separates its western and\r\neastern (outermost) shores and possibly isolates also another continent or inhabited\r\nisland in between.\r\n The geographic work Masalik al-aNar fi mainalik al-amsar [Ways of Perception\r\nConcerning the Most Populous [Civilized] Provinces] was written by Ahmad ibn Yahya\r\nIbn Fadlallah al-‘Umari (died 1349), a distinguished administrator and author who\r\nwas active in Cairo and Damascus under Mamluk rule. He claims that this map is a\r\ncopy of the world map made by al-Mas’udi (#212) for Caliph al-Ma’mun (reigned\r\n813-833).\tThe world map shown above is reproduced in this manuscript of the work of\r\nal-‘Umari. The same manuscript also has maps of the first three climates. Although the\r\nclimates are not divided into sections, the general impression is that the maps are\r\nderived from those of al-Idrisi (#219). However, from its appearance it seems to have\r\nbeen compiled from the text of the Kitab bast al-ard fi tuliha wa-al-‘ard [Exposition of the\r\nearth in length and breadth] by Ibn Sa‘id (#221). Al-‘Umari’s text does mention a map\r\nand gives a few examples of longitude and latitude, but on the whole they do not\r\ncorrespond with positions given on the map.\t\r\n As mentioned above, the map’s landmass contours, including the plausible,\r\nthough inaccurate, longitudinal and latitudinal lines, roughly resemble reconstructions\r\nof al-Khwarizmi’s geographic table, which was directly influenced by Ptolemy’s\r\ngeographic treatise. Thus, it is possible that the map in Ways of Perception descended\r\nfrom maps made by the scholarly community under Caliph al-Ma’mun’s patronage,\r\nwhich included al-Khwarizmi. The map for Caliph al-Ma’mun was most likely drawn\r\nbased on al-Khwarizmi’s geographic treatise because al-Khwarizmi was one of the major\r\nscholars in Caliph al-Ma’mun’s academic institute, “The House of Wisdom.” Fuat Sezgin\r\nargues that the map is an exact copy of the world map of Caliph al-Ma’mun in the ninth\r\ncentury. With regard to the map’s contents, however, the name Sin al-Sin [China of\r\nChina] on the northern hemisphere’s eastern edge of Ibn Fadlallah al-Umari’s map does\r\nnot appear in al-Khwarizmi’s geographic table that merely documents al-Sin. The\r\npresentation of both al-Sin and Sin al-Sin (Chin and Machin in Persian) suggests that al￾Umari updated al-Khwarizmi’s geography using available contemporary information, in\r\nthe same way that al-Khwarizmi updated Ptolemy’s treatise in order to write his own.\r\n \r\n ",
  "36": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 36\t\r\n \r\nThe world map of Caliph al-Ma’mun from Ibn Fadlallah al-Umari’s (1301-1349) Masalik\r\nal-absar fi mamalik al-amsar [Ways of Perception Concerning the Most\r\nPopulous[Civilized] Provinces}, 26.5 cm diameter, oriented with South at the top.\r\nTopkapi Museum, Istanbul A.2797, fols. 292v-293r.\r\nThe longitude and latitudinal graticle, which is most uncharacteristic for manuscripts from the\r\n14th or even 15th century, appears to have been modified by a copyist at the time the map was\r\ndrafted, perhaps in the 16th century. This map is sort of a “compromise” by showing a navigable\r\npath around Africa, but also a nearly land-locked Indian Ocean\r\n ",
  "37": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 37\t\r\n The world map of Caliph al-Ma’mun from Ibn Fadl Allah al-‘Umari’s “Ways of Perception\r\nConcerning the Most Populous {Civilized] Provinces” (Masalik ai-absar fi mamalik al-amsar),\r\nre-oriented with North at the top.\r\nTranslated, from Fuat Sezgin’s “Science and Technology in Islam”\r\n \r\n ",
  "38": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 38\t\r\n Al-Wardi, oriented with South at the top (#214.1)\r\nWorld map in a 1481 Turkish manuscript of al-Wardi’s “Enumeration of Wonders”\r\nOriented with the South at the top, it shows the known world as a sphere surrounded by the\r\nEncircling Sea, which is enclosed by mountains. Mecca, shown unusually in graphic form, the\r\nfocal point of all spatial references, is near the center of the Arabian Peninsula, which is embraced\r\nby the Persian Gulf and the Red Sea in the shape of a crescent moon to signify the unity of the\r\ncelestial and terrestrial worlds, a unity of conjoined sacredness. Turkish Constantinople is a red\r\ncrescent “wall” or barrier against the “people of the cross”. At the top, Africa is extended the\r\nlength of the Indian Ocean, but unlike most of the contemporary Islamic world maps, here the\r\ncontinent does not entirely enclose the Indian Ocean; although most of the maps attributed to al￾Wardi display a very open-ended Indian Ocean. The Nile, drawn in red, takes a right-angle turn,\r\npossibly reflecting the river’s great bend. Library of Congress.\r\n ",
  "39": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 39\t\r\n A 1415 al-Wardi world map (oriented with South at the top) displaying a very open Indian\r\nOcean. The Museum of Islamic Art, Qatar, Ms 228.1998 (#214.1)\r\n \r\n ",
  "40": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 40\t\r\n In medieval European maps based upon the writings of Ptolemy the Indian\r\nOcean is enclosed. However, as have been seen above, it is not entirely enclosed on most\r\nIslamic maps. As mentioned above, an aberrant and as yet unexplained exception is the\r\nschematic map of the Indian Ocean in the recently discovered Book of Curiosities, thought\r\nto be produced in the late 11th century it therefore predates al-Idrisi. Islamic world\r\ngeographies consider the Indian Ocean an offshoot of the Surrounding Ocean [al-Bahr al￾Muhit]. The encyclopedist al-Biruni (c. A.H. 362-440/973-1048 CE, #214.3) explained this\r\nin Kitab al-Tafhim [Book of Instruction in the Elements of the Art of Astrology]:\r\n \r\nFrom the Eastern side, beyond the farthest limits of the land of China, the\r\nSurrounding Sea is likewise impassable. From it branches out a gulf that forms a\r\nsea that is named in each location by the name of the country it washes, so that at\r\nfirst it is the Sea of China, then the Sea of India. From the sea, in turn, branch our\r\ngreat gulfs that are separately named seas, such as the Sea of Persia and Basra…\r\n(Matveev and Kubbel, 1965: 113)\r\n \r\n Biruni (#214.3) is the only Islamic author who specifically articulates the\r\nundividsibility of the world’s oceans. In his other book, al-Qanun al-Mas`udi [Mas`ud’s\r\nCanon for Astronomy and Stars] he wrote about the Indian Ocean past southeast Africa:\r\n \r\nRegardless of such (great difficulties) there is no absolute obstacle for reaching\r\nthe Ocean Sea (Bahr Uqiyanus) through these narrows or from the south behind\r\nthese mountains. I have found indications that the two (seas) join together even\r\nthough I have not seen this with my own eyes. (Matveev and Kubbel, 1965: 125)",
  "41": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 41\t\r\n Another al-Idrisi’s world map, oriented with South at the top, 21 x 30 cm (23 cm diameter),\r\n1154, Bodleian Library, MS Pococke 375, dated 1553/960 H (#219)\r\n \r\n By contrast with sectional maps, the so-called round world map of Idrisi shown\r\nabove, lacking many if not most sectional details, became quite popular, and a version of\r\nit appears in manuscripts of Ibn Khaldun’s Muqaddima. Thus, with al-Idrisi, a\r\ncomprehensive picture of an open Indian Ocean is created, from Africa to China, but\r\ncertain lines of knowledge transmission wither away or become dormant.\r\n Idrisi’s superiority in both descriptive geography and cartography is unarguable,\r\nyet on the subsequent situation is somewhat paradoxical. Many later authors drew on\r\nal-Idrisi, but, considering the expansion of travel and production of new astronomical\r\ndata that might reasonably be expected to lead to growth of geography as a discipline,\r\nthere appears to be a lack of systemic originality and loss of precision in world\r\ngeography and cosmographical genre. The Idrisi sectional map system shown earlier on",
  "42": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 42\t\r\npage 31 was not used at all, nor further developed by later authors, although it was not\r\nlost. In terms of geographical data, the closest Idrisi follower is Ibn Sa’id al-Maghribi (c.\r\nA.H. 610-685/1214-1286 CE #221). His Geography of the Seven Climates follows the Idrisi\r\nnarrative according to the map sections, repeating much of his information, but for\r\nlocations Ibn Sa’id adds the coordinates. The round world map ascribed to Ibn Sa’id al￾Maghribi opens the Indian ocean wider toward the south than any Islamic world map\r\npreviously. He fills the ocean space with islands and, unable to accommodate all the\r\nplace-names provided by Idrisi on the East African coast, divides the southern African\r\ncontinent by a deep gulf, with double the coastline looking east.\r\n \r\n Ibn Sa’id’s world map from the Kitab al-bad’ wa-al-ta’rikh, 13th century\r\n(oriented with East at the top)\r\n28.5 cm diameter (#221)\r\n \r\n Expansion of Islam continued along the coasts of the Indian Ocean, whether in\r\nEastern Africa or Indonesia, as it did on the Indian subcontinent. New Islamic states\r\narose and maritime commerce prospered. The famous 14th century traveler Ibn Battuta\r\n(1304-1369) performed several voyages on the Indian Ocean and left a record of them in\r\nthe Rihla, [Book of Travels]. His experience in southeast Asia and somewhat hazy report\r\nof reaching China provide, at the very least, a personal confirmation, if not a case study\r\nof the widely reaching shipping and trade networks emanating from or converging on\r\ncertain vital points of destination – Red Sea ports for the annual Muslim pilgrimage,\r\nKilwa for the gold trade of the interior, Sri Lanka as the crossroads of the oceanic routes\r\nand a waiting-haven for the change of monsoon. While in India, he aspired to reach\r\nChina and discovered that the voyage could be made only on Chinese ships. Indeed, in",
  "43": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 43\t\r\nthe early 15th century China was to make the exploration by Zheng He of the Indian\r\nOcean an imperial project, though Arabic sources are silent about this.\r\n \r\n Al-Qazwini world map (#222) oriented with South at the top, from his Monuments of Places,\r\ncopy dated 1580, Walters Art Gallery, Baltimore, USA, Ref. W 593, ff. 52v-53r, 30.5 cm\r\ndiameter. Shows a nearly enclosed Indian Ocean with the usual easterly extension of Africa.\r\n \r\nThe map shown above indicates the extent of Islamic cartographers’ knowledge\r\nregarding the solar day cycles at extreme latitudes, though there is the possibility that\r\nthese legends may have been added to the 13th century original map by latter-date\r\ncopiers. Most of the map is occupied by Africa and the unknown southern lands, while\r\nEurope and Asia occupy most of the lower half at the map. The seven inscriptions in the\r\nleft specify the zones and give their dimensions. The sea to the left of the map (east) is\r\nthe Pacific Ocean and the one in the top middle is the Indian Ocean with the Arabian",
  "44": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 44\t\r\nSea. The peninsula surrounded by six islands is China, and to its right is the Indian Sea\r\n[Gulf of Bengal]. The other gulf further to the right, with three rivers pouring in, is the\r\nPersian Gulf. Next is Arabia shown as a circular bulge protruding into the Indian\r\nOcean/Arabian Sea, with Bahr-i-Kulzum [the Red Sea] at its west (right). The River Nile\r\nis shown with eight tributaries, which join together to flow into another lake and thence\r\nto the Mediterranean, which is the unevenly shaped sea connected at the right to the\r\nsurrounding ocean and named Bahr-i-Misr [Sea of Egypt]. The Black Sea branches from\r\nthe middle of the Mediterranean and extends northwards to join the ocean at the north\r\nof the landmass. The rivers Dejle [Tigris) and Forat [Euphrates] are shown connecting the\r\nMediterranean Sea to the Persian Gulf. Parts of the Caspian Sea are obscured by the\r\nclose binding in the centerfold of the map. The rivers Arax and Kura we also depicted\r\njoining and flowing into the Caspian, the former being connected to the River Tigris and\r\nthe latter to the Black Sea. Between the Tigris and Arax rivers the inscription Arminiya\r\n[Armenia] can faintly be made out. Armenia is flanked by the cities of Tabriz and\r\nErzrum. The small rectangular lake at the left (east) of the fold is the Sea of Aral, with\r\nthe rivers Jeihun [Oxus, or Amu-Darya] and Seihun [Jaxartes or Sir-Darya) rising from\r\nCentral Asia and flowing into it.\r\n No other Arab traveler left as comprehensive a record of personal voyages on the\r\nIndian Ocean, but a 13th century traveler in South Arabia related an extraordinary story\r\nabout the far and early reaches of the monsoon sailing routes. Writing about A.H. 624-\r\n627/1226-1230 CE, Ibn al-Mujawir describes maritime contacts between Madagascar,\r\nEast African coast, Aden, and eventually Siraf (the Persian Gulf port destroyed by an\r\nearthquake about 970):\r\nThe building of Aden. When the dynasty of the pharaohs came to an end, the\r\nplace fell into ruins as their dynasty disappeared. A group of fishermen settled\r\nthe island, fishing there. They remained a long time thus, provided with God’s\r\nsustenance and a livelihood, until some Madagscans [Ahl al-Qumr] arrived in\r\nships with lots of people and took control of the island after chasing out the\r\nfishermen by force. They settled the Summit of al-Jabal al-Ahmar, Huqqat and\r\nJabal a-Manzar, a mountain overlooking the boatyards. Traces of them still exist\r\nand their building remains in Stone and gypsum, brought from these wadis and\r\nmountains.\r\n \r\n This passage is quite rare in Arabic travel literature in providing a glimpse of\r\noceanic migration history that connects Malay and East African immigrants to South\r\nArabia and makes clear the northward direction of the movement, as distinct from the\r\nrelatively frequent mentions of southern Arabians (especially Omanis) sailing to East\r\nAfrica. Continuing the story of Aden, the author also describes the migrants’ vessels and\r\nthe sailing regime: The year Anno Hegirae (A.H.) 626 began 30 November 1228.\r\n \r\nThey used to come up from Madagascar, taking in Aden in one go in one\r\nmonsoon […] From Aden to Mogadishu is one monsoon, from Mogadishu to\r\nKilwah a second and from Kilwah to Madagascar a third. But [some] people\r\nwould turn the three monsoons into one: in 626 a ship sailed from Madagascar to\r\nAden in this way, setting sail from Madagascar, making for Kilwah, but\r\ndropping anchor in Aden. Their ships have outriggers on account of the\r\nnarrowness, rockiness and shallowness of their seas. When these people became\r\nweak and the East Africans got the better of them, they forced them out and took\r\nover their land and settled the wadi, a place that is now inhabited [by people] in\r\nreed huts. They were the first to build reed huts in Aden. When they had gone,",
  "45": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 45\t\r\nthe place fell into ruin and remained thus until the inhabitants of Siraf moved out\r\n[and settled there].\r\n \r\n In the 13th century Marco Polo claimed that Arab pilots had good nautical maps\r\nand used the Pole Star for guidance. Furthermore, in the early Portuguese records there\r\nare indications that Arab (or Muslim) navigators on the Indian Ocean, in addition to the\r\ntraditional compass and instruments for astronomical observations, also used nautical\r\ncharts or written sailing directions, but none have been found. It is as though academic\r\ncartography, too, remained irrelevant to mariners’ practical activity. Sea voyages were\r\nvery different in execution from land travel, and on the eve of the Portuguese era on the\r\nIndian Ocean, Arabic seafaring expertise was being recorded and shaped into formal\r\nencyclopedias and manuals. Naturally and necessarily, more than Arabs took part in the\r\nseafaring enterprise. Tradition and experience took centuries to produce an effective,\r\nthough diffuse body of knowledge, but in the 16th century the new global reality\r\ndramatically changed the dynamics of oceanic activity and signaled an end to the Arab\r\nchapter in the Indian Ocean story.\r\n It must be noted that all of the writings from ancient and medieval times about\r\nthe Indian Ocean primarily centered on only the northern portion. This is where all of\r\nthe commercial trading took place between and among the various ports from China,\r\nMalaysia, Sri Lanka, India, East Africa, the Middle East and, ultimately via Middle East\r\nintermediaries, to Europe. The southern extents of the Indian Ocean, then, and even\r\ntoday, were quite irrelevant. Whether a “southern continent”, or a land-bridge between\r\nAfrica and Asia, or a tightly strung series of islands existed in the southern reaches of\r\nthe Indian Ocean really did not have meaning to this on-going extensive trading activity.\r\nIt was only when the Europeans decided to try to eliminate the “middle-men” traders\r\nfrom the Middle East and try to develop trade directly with the Far East that the\r\ngeography of the southern and eastern Indian Ocean became a subject of interest.\r\n ",
  "46": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 46\t\r\n \r\nA major exception to the medieval perception that Africa and/or Asia extend in such a\r\nway as to form a land-bridge connecting the two continents is the 1402 Korean Kangnido\r\nmap, shown below (#236). Here is a map that displays a surprisingly realistic shape of\r\nthe African continent 90+ years before the first Europeans circumnavigated Africa. Also\r\nno “Tiger Leg”, or extension of Asia south and westward is shown.\r\n \r\n \r\nThe Ryukoku Kangnido: Honil kangni yoktae kukyo chi to 混一疆理歷\t代國都之圖\r\n[Map of Integrated Lands and Regions of Historical Countries and Capitals] Painted on silk,\r\n164 x 171.8 cm, 1402 Information Center, Kyoto, Japan (#236)\r\nDominated by an exaggerated China, India and Korea, Africa is shown much more realistically\r\nthan any European map of the period and, of course, the Indian Ocean is shown completely open.",
  "47": "Closing & Opening of the Indian Ocgan\n\n5.10\n\n47\n",
  "48": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 48\t\r\n Another exception during this period is the de Virga mappamundi shown below\r\n(#240). The delineation of Africa is unusual given that most European medieval world\r\nmaps show southern Africa as extending strongly eastward (see #242, #245, #246), or, as\r\nwith those based upon Ptolemy, showing an enclosed Indian Ocean (#239). The outline\r\nof de Virga’s Africa is quite intriguing given that the Portugal’s Bartolomeu Dias was\r\nstill over 70 years way from rounding the Cape of Good Hope.\r\n \r\n \r\n This map by the Venetian cartographer, Albertin de Virga, shows Marco Polo’s “Southern\r\nContinent” southeast of Asia. The island-continent is called “Ca-paru or Great India.” The map\r\nwas made between 1410 and 1414. (#240)\r\n ",
  "49": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 49\t\r\n Mapa Mondi Figura Mondi, 1442 world map by Giovanni Leardo (#242), 34.7 x 31.2 cm,\r\nBiblioteca Communale Library, Verona, Italy, showing Africa extended eastward and an open\r\nIndian Ocean (oriented with East at the top)\r\n ",
  "50": "Closing & Opgning of thg Indian Ocgan\n\nHot Desert\n\nBlack Red Sea\n| Sea\n\nEUROPE\n\neg\n$\na\na\n=\nrs)\n\nAFRICA\n\nMediterranean Sea\n\n50\n",
  "51": "Closing & Opgning of thg Indian Ocgan\n\nPietro Vesconte World Map, ca. 1321* Andrea Bianco World Map, 1436*\n\nGiovanni Leardo World Map, 1452-53* The Catalan-Estense Map, ca. 1450\n\nFra Mauro’s World Map,\n1459**\n\n51\n",
  "52": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 52\t\r\n \r\nFra Mauro's Mappamundi, 1459 (#249)\r\nwith an open Indian Ocean (oriented with South at the top)\r\n190.5 cm diameter\r\n \r\n ",
  "53": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 53\t\r\n \r\nThe following is an excerpt from Marianne O’Doherty’s article “Fra Mauro’s World Map\r\n(c. 1448-1449): Mapping, Mediation and the Indian Ocean World”. Begun around 1448\r\nand completed some time before 1459, Fra Mauro’s world map, illustrated in the figure\r\naccompanying this article, is a beautiful object. Its designer, Fra Mauro, was a fixture at\r\nthe Camaldulian monastery of San Michele on Murano, and worked on the map over a\r\nperiod of some years with the assistance of a workshop including fellow-monks and the\r\nVenetian galley captain and cartographer, Andrea Bianco. Around four meters square\r\nand mounted on boards that enable it to be hung on a wall, the map was clearly\r\nintended for display. The map as a whole is fascinating, and has been an object both of\r\nwonder and of scholarship for historians of cartography, exploration and culture for\r\nhundreds of years. Its representation of the Indian Ocean world has attracted particular",
  "54": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 54\t\r\nscholarly attention. Fra Mauro’s delineation of the Indian Ocean region is unusually\r\ndetailed; even a brief glance at the map shows the Ocean between Africa and China (the\r\nmap is oriented, like many Arab maps of the period, with the South at the top)\r\ndominating a large swathe of the map and dwarfing the Mediterranean towards which it\r\nreaches out. In his representation of the region, Fra Mauro clearly capitalized on\r\nVenice’s position as a hub in the exchange both of goods and knowledge between East\r\nand West. A network of linked legends spread out across the ocean’s surface traces the\r\nroutes of spices, luxury goods, and people between Indonesia and China, between China\r\nand Africa, between Arabia and South Asia, between the Indian Ocean world and the\r\nBlack Sea and, through the Black Sea, to Europe. However, the map does not merely\r\nreflect Western European conceptions of the Indian Ocean world and of its own\r\nrelationship with that world at the moment of the map’s production. Like all maps, this\r\nmap aims not simply to represent space, but to intervene in and manipulate its political\r\nand socio-spatial world. Certainly, the world projected in this map, and the activities it\r\nstimulated are, potentially, particularly significant: in 1459, records show that a copy of\r\nit — now lost — was made and sent to Alphonso V of Portugal, at the time sponsoring\r\nthe series of voyages down the western coast of Africa that would eventually take\r\nBartolomeu Dias and Vasco da Gama into the Indian Ocean. An understanding of this\r\nmap is therefore crucial to the wider project of understanding the historical\r\ndevelopment of relationships between Western Europe the Indian Ocean world.\r\n But the significance of this cultural artifact does not begin and end with its\r\nposition in a historical process of transition from what Chaudhuri has identified as a\r\nperiod of regional segmentation of trade between the Western Indian Ocean and the\r\nSouth China Sea to a period of European dominance in the Indian Ocean world\r\n(Chaudhuri, pp. 102-03). The map is a deeply complex artifact that is positioned\r\nintentionally by its cartographer in the role of mediator between Western Europe and\r\nthe Indian Ocean world; between oral and written systems of knowledge; between\r\nreality and representation, and, temporally, between ‘then’ and ‘now’. Fra Mauro’s\r\nworld map is the first surviving European map to represent the Indian Ocean world in\r\ndetail. However, as cartographic historian Angelo Cattaneo has pointed out, the map’s\r\nmajor cartographic innovation is not so much in the detail of its representation as in its\r\nassertion of the navigability and habitability of the oceanic space between east Africa\r\nand Southern China (Cattaneo, 2004, p. 210). One might, however, go further than this; on\r\nthe map, the Indian Ocean world comes across as positively crowded; populous and\r\nwell-traversed, it is a functioning cog in the economic machinery of the world. Indeed, in\r\nplaces, the crowdedness of the region outstrips the representative capacity of the map.\r\n‘In this sea’ he says of the Indian Ocean, ‘there are many islands that cannot be specially noted\r\nbecause of lack of space, but all are inhabited and very fertile in various precious spices and many\r\nother new things’. Images of islands, rigged ships, and legends crowd the region, as do\r\nthe witnesses that clamor to support Fra Mauro’s assertions about it: ‘[E]veryone’ — the\r\nimplication being that there are too many to name — who sails in the Sea of India says that\r\none loses sight of the Pole Star at Cape Chomari.\r\n Legends on the Fra Mauro map trace the routes of goods – notably spices –\r\nthrough the three major trade circuits of the pre-modern Indian Ocean (more or less\r\ncorresponding with, in modern terms, the Arabian Sea, the Bay of Bengal, and the South\r\nChina Sea). In one such legend, Indonesia, identified rather confusingly on the map as\r\ntwo islands called Greater and Lesser Java, is identified as housing a regional entrepôt\r\ncrucial in trade between Eastern Indian Ocean and the South China Sea. Goods are taken",
  "55": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 55\t\r\nfrom ‘the eight islands, in which grow fine spices’ around Lesser Java to Greater Java —\r\npossibly an amalgamation of Java and Sumatra — from which ‘one part [is sent] to Caiton\r\nand Cathay, another to Hormuz, Cide [Jidda] and Mecca, by the Sea of India, and the third is sent\r\nnorthwards across the Sea of Cathay’. Another inscription, this time at Hormuz, on the\r\nPersian Gulf, follows the same chain of people and goods to the Black Sea, the doorstep\r\nof the Mediterranean world. The ocean represented here is not just navigable: it is\r\noverlaid with a network of intersecting trade routes, routes that bear its influence deep\r\ninto continental Asia and Western Europe.\r\n The map represents the Indian Ocean, moreover, as not just internally navigable,\r\nbut as interconnecting with the Atlantic (and the yet unknown Pacific) Ocean.\r\nSubsequent historical events and developments in cartography have led us, of course, to\r\ntake the interconnectedness between Indian and Atlantic oceans for granted, a position\r\nthat makes it easy to underestimate the immense rhetorical effort that Fra Mauro puts\r\ninto persuading the map’s readers of this connection. The possibility of navigation\r\nbetween Europe and Asia tended to be dismissed by late-medieval geographers and\r\ncartographers for a range of not always consistent reasons. As mentioned above,\r\nClaudius Ptolemy, whose first-century Geographia achieved influence on contemporary\r\nas well as historical geography across Europe, particularly after its translation into Latin\r\nin 1406, disrupted the common late-medieval world view of the habitable world as a\r\nthree-part orbis terrarum (circle of lands or oikoumene) surrounded and bordered by an\r\nocean that becomes non-navigable and uninhabitable in the south because of the\r\nexcessive heat of the so-called torrid zone. In its place, however, Ptolemy’s Geographia set\r\na detailed and, as it turned out, pervasive image of an Indian Ocean bordered by a terra\r\nIncognita that linked Africa and the South East Asian promontory of Cattigara. In other\r\nwords, the Indian Ocean after Ptolemy’s re-introduction remained equally isolated, but\r\nin this case because landlocked.\r\n Against these two conceptions of an Indian Ocean isolated by geography,\r\nhydrography, or climate, Fra Mauro delineates one reached in the past and reachable\r\nagain in the future:\r\nSome authors write that the Sea of India is enclosed like a pond and does not\r\ncommunicate with the ocean. However, Solinus claims that it is itself part of the\r\nocean and that it is navigable in the southern and southwestern parts. And I\r\nmyself say that some ships have sailed it along that route. This is confirmed by\r\nPliny when he says that in his day two ships loaded with spices coming from the\r\nSea of Arabia sailed around these regions to Spain and unloaded their cargo at\r\nGibraltar [...]. Fazio [Degli Uberti] says the same; and those who have taken this\r\nroute, men of great prudence, agree with these writers.\r\nA clear sense emerges here of the passage between Indian and Atlantic oceans as not just\r\nnavigable in theory but navigated in fact. Indeed, in a later legend, Fra Mauro exploits\r\nhis privileged access to both European and Indian navigational knowledge, adducing\r\nthe authority on the one hand of ‘all those who were sent by his Majesty, King of Portugal’\r\nwho had sailed south-southeast along the west coast of Africa, and on the other of ‘a\r\nperson worthy of trust, who says that he sailed in an Indian ship caught in the fury of a tempest\r\nfor 40 days out in the Sea of India, beyond the Cape of Soffala and the Green Islands\r\n[unidentified] towards west-southwest’. Here, Fra Mauro exploits his position as mediator\r\nbetween geographers and witnesses, past and present, east and west, in order to assert\r\nthat ‘without any doubt that this southern and south-western part is navigable, and that the Sea\r\nof India is an ocean and not an inland sea. This is what is said by all those who sail this sea and\r\nlive in those islands’.",
  "56": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 56\t\r\n To present his Indian Ocean as reachable from the Atlantic, Fra Mauro’s map\r\nmust work precisely in this way. Scattered references to the circumnavigability of Africa\r\nfrom geographers’ and sailors’ reports thousands of years apart in time are compressed\r\ninto a single cartographic assertion; the past is plundered to serve a desired future. Yet\r\nthe act of mapping that desired future is, of course, an intervention that helps to bring\r\nthat particular future about.\r\n In his representation of the navigability and accessibility of the Indian Ocean,\r\nhistorian Marianne O’Doherty sees Fra Mauro exploit his position as adjudicating\r\nmediator between geography and eyewitness, between past texts and present map, in\r\norder to shape real contacts, relations and actions between the Mediterranean and\r\nIndian Ocean worlds. Yet this is not the only way in which Fra Mauro strategically\r\nmanipulates his intermediary role. The world map is a translation in the literal sense of\r\nthe word; it carries knowledge over, across both space and time and between cultures.\r\nTranslating in the most literal sense of the word, the map carries over to its Venetian\r\nreaders a myriad of toponyms and terms of Chinese, Indian, Arabic, Javanese, Malay or\r\nother Indian Ocean world origins. Arabic toponyms feature, for instance, along ‘the\r\nentire outline of the eastern coast of Africa to the south of the Horn of Africa’ according\r\nto the map’s editor. Locally-current names appear attached to many of the ports around\r\nthe Bay of Bengal and eastern Indian Ocean, from Paliechat [Pulicat] and Orica [Orissa]\r\non the east coast of India to Melacha [Malacca, Malaysia] in modern-day Indonesia. The\r\nmap uses the name Mihen, of Chinese derivation, for the region of Myanmar and of\r\nCimpangu (from China via Marco Polo) for Japan; represents Chinese Jih-pên kuo: Rashid￾al-Din. Such translations bring with them, of course, traces of the power-relations that\r\nproduced them; the map’s preponderance of toponyms of Arabic origin reflects\r\ncenturies of Arab dominance in the navigation of the western Indian Ocean, whilst it is\r\nthrough reports of the Mongol Kubilai Khan’s late-13th century designs on Japan,\r\nculminating in two attacks in 1274 and 1281, that news of that island filters through to\r\nEurope.\r\n In his depiction of the Indian Ocean, Fra Mauro places the local place names into\r\na distinct relationship with a conspicuously Latinate, largely Ptolemaic, European\r\nframework of knowledge about the region. Larger geographical and hydrographic areas\r\nand features are marked out on the map by Latinate, often Ptolemaic names, printed in\r\ndecorated, sometimes gold, capitals. On the land encircling the Indian Ocean we find\r\nAfrica, Ethyopia, Garamantia, Arabia Felix, Arabia Deserta, Arabia, Persia, Mesopotamia, India\r\nPrima (in the northern region of India) and India Seconda (Indo-Chinese regions and parts\r\nof south west China), names whose Latinity stands out when set against the\r\netymologically-diverse port and town names all around them, seen through the prism of\r\nFra Mauro’s own vernacular Venetian dialect. In the sea, we find the Sinus Ethyopicus\r\n[Gulf of Ethiopia], Sinus Arabicus [Arabian Gulf], Mare Arabicum [Arabian Sea]. Against\r\nthese, the probably Arabic Colfo de lasiavo [Gubbat Asiya] stands out as unusual. Mare\r\nIndicum is inscribed in gold-leaf capitals to the south of the Indian Ocean, between\r\nChancibar [Zanzibar] to the west and Diuamoal (one of the Maldives, from the Arabic\r\nDhibat-al-Mahal, according to Falchetta) to the east. The principle of selection that\r\nunderlies this balance between familiar Latinate and unfamiliar, etymologically diverse\r\nplace names is nowhere clearly articulated but occasionally hinted at. ‘This Abasia was\r\ncalled Agisimba by the cosmographers’ notes a legend close to the regional descriptor\r\nAbassia, signaling that Fra Mauro has updated a place name (in this instance Ptolemaic)\r\nwith one of Arabic derivation that he views as up-to-date.",
  "57": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 57\t\r\n It would be a mistake, however, to assume that Fra Mauro’s temporal\r\ntranslations are uniformly directed to translating the geography of the past into\r\ncontemporary terms, to create a geography for his future. In fact, there are occasions\r\nwhen the map’s concern seems to be to map the Indian Ocean world of recent report\r\nonto an Indian Ocean world of timeless myth and legend. To the south of a peninsula\r\nthat corresponds with the Malay Peninsula on modern maps, the map locates the island\r\nof Taprobana. An island located, according to the classical and late-antique geographies\r\nof Pliny the Elder, Ptolemy, and Solinus, close to India but so far to the south that it was\r\n‘formerly considered another world’ (Solinus, 53.1) Taprobana is normally thought by\r\nhistorical geographers to refer to Sri Lanka. However, a note adjacent to this island on\r\nFra Mauro’s map translates as ‘The Island of Siamotra, or Taprobana’, indicating that the\r\ncartographer identified modern Sumatra, of which Fra Mauro probably read or heard\r\nfrom the early-15th century Venetian traveler Niccolo Conti, as the Taprobane of the\r\nancient world. Particularly significant and surprising here is the balance the map arrives\r\nat between ancient and modern; the 15th century toponym Siamotra appears just once on\r\nthe map, whereas Taprobana(/e) appears in six separate legends. With Taprobane, the map\r\nappears to translate the geography of the present into the terminology of ‘the\r\ncosmographers’ he often associates with the past, rather than the reverse. Another act of\r\ntranslation that we might also classify as working from present to past is to be found in\r\nthe mapmaker’s depiction of Africa. Like many maps of the later Middle Ages and Early\r\nModern period, Fra Mauro’s mappamundi gives a physical location to one of medieval\r\nEurope’s most enduring legends: the priest-king Prester John.\r\n Clearly, part of the mapmaker’s role, in Fra Mauro’s view, is to mediate between\r\nthe geographical frameworks of ‘the cosmographers’, Christian tradition, and the\r\nknowledge of populations, navigators, and travelers about topographical, navigational\r\nand political detail. The map’s mediations are, moreover, not just geographical but also\r\ntemporal. It positions the map’s Indian Ocean world strategically in relation to a past\r\nsometimes distanced from and sometimes brought close to its present. However, it is not\r\njust the Indian Ocean world that is shaped by this process, but the image, role and status\r\nof the cartographer himself. Fra Mauro deploys both his locally-sourced Indian Ocean\r\nworld place names and cosmographic framework in such a way as to cement his own\r\nstatus as a knowledgeable cosmographer and his map’s status as up-to-date\r\ncosmography, the benchmark against which the outdated should be judged. The\r\nparticular focus of the cartographer’s efforts here is the recently-translated and\r\ninfluential work of Claudius Ptolemy, with which Fra Mauro’s map is constantly in\r\ntension.\r\n Fra Mauro’s problem is that whilst he wishes to define himself and his work\r\nagainst the amorphous group he calls ‘the cosmographers’, he nevertheless needs the\r\nframework for understanding the physical layout of the world that their efforts supply.\r\nIn the Indian Ocean region, this tension and its results are particularly clear in Fra\r\nMauro’s treatment of Ptolemy’s work. The map silently carries over Ptolemy’s\r\ngeographical framework and toponyms in too many places to cite, but borrowings relate\r\nto settlements (e.g., Stabana, Malaysia), regions and provinces (Arabia Dexerta,),\r\nmountains (Sardonis mountains, India), rivers (the Indus and its mouths), peninsulas and\r\npromontories (Satoris, on the Red Sea), gulfs and maritime regions (Gulf of Sabara; Sinus\r\nGangeticus), peoples (troglodites in East Africa; the Sale in Sailam). These borrowings\r\ncommonly appear unsignaled on the map. However, when Fra Mauro disagrees with\r\nPtolemy — as with Ptolemy’s depiction of the Indian Ocean as an enclosed basin — he",
  "58": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 58\t\r\nsharply foregrounds the completeness and newness of his own depiction and\r\ninformation against Ptolemy’s perceived limitations. ‘As I have said elsewhere’, he writes\r\ntersely of Persia, ‘this province of Persia is divided into eight kingdoms, and extends far beyond\r\nthe limited borders that Ptolemy gives it’. In a gulf at the furthest eastern edge of China, the\r\nmap highlights yet again its divergence from Ptolemy’s vision of an enclosed Indian\r\nOcean: ‘Southwards from this province of Serica [China], Ptolemy labels as terra ignota. Fra\r\nMauro identifies the Taprobana of classical geography with Sumatra of his\r\ncontemporaries. Rather unfairly singling out Ptolemy for criticism here, Fra Mauro’s\r\nnote reads that ‘Ptolemy, when wanting to describe Taprobana, simply described Saylam [Sri\r\nLanka]’.\r\n A whirlpool to the east of the Bay of Bengal is, the map comments, ‘very\r\ndangerous for sailors’. A chain of uninhabited islands that encompasses the Ocean to the\r\nsouth represents, according to an adjacent note, the southernmost limits of navigational\r\npractice:\r\nNote that when navigators see the birds of these islands, they think that they have\r\ncome too close to them and they pull away – because beyond these islands are the\r\nShadows, which are so dense that if a ship ventured into them it would not be\r\nable to go either backwards or forwards.\r\n \r\nThis legend does not attempt to plot the tenebre or scurita, the shadows or regions of\r\ndarkness that, according to the Ibn Majid’s late-15th century navigational manual,\r\ncircumscribed the Indian Ocean to the south and west. Rather, it attempts to plot the\r\npractice of navigators, who used the habits of birds to locate themselves and set courses.\r\nHere, the map mediates between practically-acquired, orally-transmitted knowledge\r\nand the theoretical knowledge of the world transmitted through geography and\r\ncartography.\r\n \r\n \r\n ",
  "59": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 59\t\r\nAndreas Walsperger’s world map, 1448 (#245), Biblioteca Apostalica Vaticana, Rome, Pal. Lat.\r\n1362b (oriented with South at the top), 57.5 cm diameter,\r\n showing a nearly enclosed Indian Ocean\r\n ",
  "60": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 60\t\r\n \r\n \r\nIn the 1485 Wieder-Woldan map (#255) shown below the Indian Ocean is shown totally\r\nenclosed. An obvious and retrograde feature of the map, when compared to earlier\r\nmaps, is that no consideration is given to the discoveries made in East Asia by medieval\r\nItalian explorers. In the representation of Africa the author was evidently guided by two\r\nleading principles: on the one hand, adherence to Ptolemy’s viewpoint as regards the\r\nland connection of South Africa and East Asia, and on the other hand, consideration of\r\nthe recent discoveries made by the Portuguese on the west coast of Africa, which,\r\nhowever, in no way contradicts Ptolemy’s conception. The effort to compare separate\r\nbays and points of the West African coast on the map with the actual ones in order to\r\nfind out how much of the Portuguese discoveries were known to our author would be in\r\nvain. The general impression can be gathered, however, that the navigation round the\r\nBay of Biafra (Cabo de Catarina 22° S latitude was reached by Ruy Sequeira in 1475) was\r\nthe last achievement in the exploration of the west coast of Africa recorded by the map.\r\nLater discoveries, made by Diogo Cão (1482-85) as far as Cape Cross (about 22° S) were\r\ncertainly unknown to the author of the map. Regarding the sources of the Nile, the",
  "61": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 61\t\r\nauthor tries to connect Ptolemy’s point of view with the medieval one based on a certain\r\ninterpretation of the Bible (the four rivers of Paradise: the Pison [Fison = Ganges] the\r\nGihon [Amu Darya/Blue Nile], the Hiddekce [Tigris] and the Euphrates), and shows one\r\nof them, flowing from the Lake of Paradise, running through the whole length of Africa\r\nand uniting the other sources coming from the mountains only in the middle of the\r\ncontinent. The author did not share the view of some of the medieval cartographers, as\r\nknown to us, that Africa was separated from Asia by a more or less wide and open\r\nocean, because he probably regarded Ptolemy as more trustworthy than Herodotus or\r\nIdrisi; for the rest, the difference between his representation of Africa and that of Idrisi\r\nand his adherents, regarding the southern extremity of Africa protruding far out to the\r\neast and the chain of islands adjacent to it stretching out in the direction of southeastern\r\nAsia, is not so great.\r\n As mentioned above, until the end of the 15th century, Ptolemy’s depiction of the\r\nworld was widely accepted as authoritative. A particularly noteworthy feature of his\r\nmap of the world, beyond the Arabian, Indian and Malay peninsulas, is a long, thin,\r\nsouthward extension of Asia named SINARVM SITVS [place of the Chinese], which is\r\njoined to Africa by way of a southern land mass, thus turning the Indian Ocean into a\r\nvast landlocked lake. Ptolemy’s representation was proved false when Bartolomeu Dias\r\nrounded the Cape of Good Hope in 1487– 1488. So two or three years later, when\r\nHenricus Martellus drew his four world maps, he opened up Ptolemy’s Indian Ocean\r\nsouth of Africa, removed the southern land mass and turned his southward extension of\r\nAsia into a long peninsula to which the name Dragon’s Tail has sometimes been applied.\r\nMartellus copied the western coastline from Ptolemy, together with three place-names:\r\nthose of two rivers, ambastus flu[uius] and s[a]enus flu[uius], and of the port city of\r\nCatigara. The other inscriptions on this peninsula, and on the land immediately north of\r\nit, were derived from Marco Polo.\r\n Three of Martellus’ maps are small. The contents of all three are broadly similar,\r\nalthough there are a few minor differences in the portrayal of northern Europe and\r\nsouthern Africa. The fourth map, in the Beinecke Library at Yale University (#256), is not\r\nonly much larger, measuring 79 × 48 inches (201 × 122 cm), but also has some significant\r\ndifferences. It is the only one to include indications of latitude and longitude and a\r\nrepresentation of Madagascar. To the east of the Dragon’s Tail peninsula, the sea, which\r\nis unnamed on the small maps but is here called OCEANVS INDICVS ORIENTALIS, is\r\nmuch more extensive and contains a number of large named islands. Regrettably, most\r\nof the inscriptions are illegible, but from the works of those contemporary cartographers\r\nsuch as Martin Behaim on his globe of 1492 (#258) and Martin Waldseemüller on his\r\nworld map of 1507 (#310), who copied its relevant parts, we can with some confidence\r\nsuggest that these islands are hypothetical representations of Asian islands mentioned\r\nby Marco Polo.\r\n ",
  "62": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 62\t\r\n Wieder-Woldan Map map, 1485, 17.5 cm diameter showing the infamous land-bridge\r\nbetween Africa and Asia, fully enclosing the Indian Ocean, with the four Biblical rivers (the\r\nPison [Fison = Ganges] the Gihon [Amu Darya/Blue Nile], the Hiddekce [Tigris] and\r\nthe Euphrates), emanating from the Lake of Paradise on the right (East) #255",
  "63": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 63\t\r\n Martellus world map, 1489, from his Insularium illustratum (#256)\r\nBritish Library, Add MS. 15760, fols. 68~69r,London, England; 46.5 x 30 cm/18.3”x11.8”\r\n \r\nThe two maps by Henricus Martellus shown here display the widely held belief in the\r\neastern extension of Africa (even after the discovery of the Cape of Good Hope) and in\r\nthe southwesterly extension of Asia, known as the Tiger Leg or Dragon’s Tail. On the\r\nworld map in his Insularium at the British Library, Martellus shows the results of\r\nBartholomew Dias’ rounding of the Cape of Good Hope in 1488, listing the names of the\r\nvarious ports and landmarks along the way. “Here is the true modern form of Africa between\r\nthe Mediterranean Sea and the southern Ocean, according to the Portuguese description,” says\r\nan inscription. Modern Africa is so long, however, that it breaks through the frame at the\r\nlower edge of the map. The Indian Ocean is open to the south, but Martellus retains its\r\neastern coast, which Ptolemy had called Sinae, home of the fish-eating Ethiopians. This\r\nwas the edge of Ptolemy’s map - he did not show the full extent of Asia, noting that\r\n“unknown lands” lay beyond. On the Martellus map there is a long peninsula to the east\r\nof the Golden Chersonese (Indochina), featuring the mysterious port of Cattigara. Unlike\r\nPtolemy’s Asia, Martellus’ version has an eastern coast with the island-bedecked ocean\r\nbeyond and additional names taken from Marco Polo. As mentioned above, the\r\npeninsula of Cattigara, i.e., the Dragon’s Tail/Tiger-leg, was copied on most of the world\r\nmaps of the first half of the 16th century, as the shape and extent of Asia was being\r\nsorted out. The coasts charted by Diaz have been fitted into the circular outline of the\r\nworld of the Fra Mauro planisphere (#249), representing such a marked trend to the\r\nsoutheast that the Cape of Good Hope seems to be due south of the Persian Gulf,\r\nwhereas it is due south of the Adriatic. The Indian Ocean is a little less open to the south",
  "64": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 64\t\r\non the Martellus maps, compared to the Fra Mauro planisphere. Due south of the Malay\r\npeninsula, at 28° S, there appears an enormous peninsula which widens and turns north\r\nto join China again with the largely circular concept of the Fra Mauro map. This\r\npeninsula does not exist in fact, and seems to be a repeat of the Donus Nicolaus map of\r\nthe world in the Ulm Ptolemy, cut away by the circular outline of Fra Mauro.\r\nWith the Tiger Leg or the Dragon’s Tail, there has been a controversial attempt to\r\nidentify it as an early map of South America, turning Ptolemy’s Sinus Magnus into the\r\nPacific Ocean. The corresponding coasts on the British Library Martellus uses a\r\nPortuguese map for them. Nevertheless, the Cape of Good Hope is at 45° S on the Yale\r\nMartellus map, the Tiger Leg extends to 33° S, and Africa breaks through the frame of the\r\nmap in both. One map has been copied from the other, at one-quarter the scale. The\r\nDragon’s Tail/Tiger-leg must have formed part of the map and the proposals that\r\nColumbus made to King John of Portugal in 1485, for it was embodied in Portuguese\r\ncartography thereafter for half a century. It was in the prototype drawn by\r\nBartholomew, copied by Martellus in 1489. The Behaim globe (#258) has placed it 30° S.\r\nThe Laon globe (#259), made in France about 1493 (probably by Bartholomew Columbus\r\nwhen he served Anne, Regent of France) has the Tiger Leg at 40° S. It is shown to be more\r\nthan 25° S in the Cantino map of 1502 (#306), Canerio map of 1504 (#307), the Waldseemüller\r\nmaps of 1507 and 1513 (#310) and many others. If purposeful, was one of the boldest and\r\ncleverest concepts of the Admiral.\r\n \r\nMartellus world map, 1490, 79 x 48 inches/201 x 122 cm, (#256)\r\nYale University Beinecke Library, New Haven, Connecticut\r\n ",
  "65": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 65\t\r\n \r\nThe famous “birth certificate” of America, the 1507 Martin Waldseemüller world map\r\n(the first to include the word “America” on a map) copies the Martellus’ “Tiger Leg” but\r\nprovides a much more accurate contour of the African continent.\r\n \r\n \r\n ",
  "66": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 66\t\r\n The 1507 world map by Martin Waldseemüller: (#310)\r\n53 x 94 inches (132 x 236 cm), woodcut on paper, 12 sheets designed to be joined.\r\n The Indian Ocean on the Waldseemüller map of 1507, the “Tiger Leg” on the right\r\n\t\r\nThe Indian Ocean area is very representative of the Ptolemaic character, albeit re￾interpreted by Waldseemüller, showing a typically enlarged Taprobana Insula (the\r\nlocation of which represents a juxtaposition of this island with Seylam [Sri Lanka] as\r\nfound on Fra Mauro’s map, a reduced Indian subcontinent, an exaggerated Madagascar\r\nand Zanzibar and a string of numerous islands (possibly representing confusion in the\r\nreports of the Maldives Islands and the Malay Archipelago) that seem to form a series of\r\nstepping stones leading to a mysteriously elongated southeast Asian peninsula labeled",
  "67": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 67\t\r\nIndia, located south and east of the Aureus Chersoneus [Malay Peninsula] - this extension\r\nof Indochina to 25° S, unlike the Martellus map which extends to 33° S, is a remnant of\r\nthe Ptolemaic land-link between Africa and Asia that had formerly enclosed the Indian\r\nOcean.\r\n \r\n ",
  "68": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 68\t\r\n \r\nKing-Hamy world map of 1502 (#307.1)\r\n \r\n \r\n \r\nKing-Hamy World Map\r\n #307.1\r\n5\r\n \r\nLOCATION: Huntington Library, HM 45\r\n \r\nSize: 53 × 77.2 cm\r\n \r\nREFERENCES:\r\n*Bagrow, Leo, History of Cartography, Plate LVIII.\r\nCortesão, A., Cartografia 1:176-77.\r\nCrone, Gerald R., Maps and their Makers, 5.\r\n*George, Wilma, Animals and Maps, Figure 3.1.\r\n*Gosling, W., Labrador, Its Discovery, Exploration and Development, pp. 59-60.\r\n*Hapgood, C. H., Maps of the Ancient Sea Kings (New York 1979) pp. 151-73.\r\n*Harrisse, H., The Discovery of North America, pp. 112, 431.\r\n*Levillier, R. Americo Vespucio (Madrid 1966) pp. 225-29, 266 n. 12 and 13, p. 288.\r\n*Marcel, G., Reproductions de cartes & de globes relatifs à la découverte de l’Amérique (Paris\r\n1894) 1:37-39, reproduction in volume 2, n. 11. N.\r\n*Nordenskiöld, A. E., Periplus (Stockholm 1897) pp. 128-29, Plate 45.\r\nWinter, H. “The Pseudo-Labrador and the Oblique Meridian,” Imago Mundi 2 (1937) pp.\r\n62, 71, 73.\r\n*Wolff, Hans, “The Munich Portolan Charts: Past and Present,” in Wolff, Hans (ed.),\r\nAmerica. Early Maps of the New World, p. 135.\r\n \r\n*illustrated\r\n \r\n \r\n ",
  "69": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 69\t\r\nThe King-Hamy Chart of 1502 (#307.1) is based partly on Ptolemaic and partly on\r\nportolano traditions, with recently discovered lands added by an early explorer, thought\r\nto be Amerigo Vespucci. The European section seemed to be based on the most accurate\r\nof the portolano [nautical] charts. This world map provides evidence of numerous and\r\nextensive geographical and geological changes since the first prototypes of its original\r\nlocal maps were drawn. It was interesting to note that in placing the center of the\r\nportolano chart in the Indian Ocean, the cartographer made it possible to construct a\r\nworld map embracing all of Europe, Asia, Africa and the Americas as well.\r\nOne of the greatest puzzles of the King-Hamy map is India. As shown in detail\r\nabove, India is depicted as a truncated peninsula, with a large landmass lying as an\r\nisland to the south. In an obviously controversial theory, Charles Hapgood and his\r\nstudents considered the possibility good that this was not a result of bad cartography,\r\nbut rather the influence of an ancient time when the plains of India were flooded and the\r\nsouthern part of the peninsula, ancient Draoidia, was an island. Because the mouths of\r\nthe Ganges River, across the whole extent of India, was correctly placed, and that the\r\nmap represents latitude and longitude fairly well, they proposed that Dravidia was\r\nperhaps the center of a great maritime civilization, and an advanced culture that was\r\nvery old when Egypt was young. Also, there is geological evidence for the flooding of\r\nthe northern plains of India, presented by A. K. Dey of the Geological Survey of India. In\r\na paper entitled “The Shores of India”, he followed elevated beaches into the interior as\r\nfar north as the estuaries of the Indus. There is also literary evidence, traditions of\r\nancient Indian literature, the Vedas, which tells of a time when Dravidia was an island.\r\n There are additional suggestions of geological changes on the King-Hamy map.\r\nThere is a vast extension southward of the Asian landmass, which interestingly, was also",
  "70": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 70\t\r\npostulated by Alfred R. Wallace, co-discoverer of the theory of evolution. He studied the\r\ndistribution of species in the islands of Indonesia and concluded there was much\r\nevidence for a very recent connection between Java, Sumatra, Borneo and the mainland\r\nof Australia. He also reported native traditions that placed this connection in the very\r\nrecent past, only a few thousand years ago.\r\n So it was that because of the exchanges and interactions of people and goods\r\nwithin this Indian Ocean region had primarily been relegated to the northern portion of\r\nthe ocean, the geography of that portion was fairly well known from ancient times, at\r\nleast to local mariners. The trade and commerce included many intermediaries that\r\nexchanged goods and services back and forth from Southeast Asia, India, Eastern Africa\r\nand the Middle East. Considering all of the different cultures, languages and\r\nmotivations, the cartography of this region was always subject to these influences and\r\nconflicting interests. Whether the Indian Ocean was a land-locked sea or and open ocean\r\nthat intermingled with the “world ocean” was not very relevant until the Europeans\r\nneeded to find a way to trade directly with the sources for spices and precious gems\r\nfound in the various ports of the Indian Ocean.\r\n \r\nConclusion\r\nThe belief in the geographic ‘ignorance’ of the ‘medieval West’ regarding the Indian\r\nOcean must now be considered outdated. One might even say that there was no region\r\nmore in the sights of late medieval European merchants, travelers, and missionaries than\r\nIndia—and possibly also China. In both the cases presented here, India formed the\r\ncenter and focal point of interest. In the eyes of European Christians, India and the\r\nIndian Ocean were both parts of complex and interrelated geographic settings with links\r\nthat reached as far as Europe. The geographic ideas behind these concepts quite\r\nnaturally entailed an awareness of the interplay between land and sea: on the one hand,\r\nmany crusade treatises explicitly described the position of Egypt as a link between the\r\nMediterranean and the Red Sea (or Indian Ocean). On the other hand, the Atlantic\r\nOcean was seen, since at least the 13th century, as a sea route to India. At first this was\r\nonly a theoretical notion, but after the voyages of Christopher Columbus it became a\r\ntangible one. Whereas Roger Bacon’s work proposed a theoretical crossing of the\r\nAtlantic Ocean to reach India, the first physical expeditions attempted instead to\r\ncircumnavigate Africa. We can assume that this was due to traditional geographical\r\nconceptions, which saw the Ocean as an unnavigable barrier surrounding the known\r\nworld; in this light, a voyage across it would have seemed far too hazardous an\r\nundertaking. e work of Roger Bacon and Pierre d’Ailly made this mental and nautical\r\nbarrier seem increasingly surmountable, and it was eventually overcome by Christopher\r\nColumbus. After his travels, the Atlantic Ocean rapidly became a navigable passage\r\nconnecting Europe and the lands thought to be parts of Asia.\r\nMedieval scholars, geographers, or seamen were well aware of the connective\r\nfunction of oceans and seas. However, the sources explored in this article do not\r\nnecessarily reflect on this geographical setting conceptually. The first reason for this is\r\nthat in both cases the sources clearly focused on an individual situation and not on\r\ngeography in a more general sense. Second, the driving forces behind both sources were\r\nprimarily economic ones (even in the case of the crusade treatises). From this\r\nperspective, practical analyses of specific trade routes and important ports were more\r\nuseful than abstract reflections on land— sea relations.",
  "71": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 71\t\r\nApart from theoretical reflections, the studies clearly show that in the later\r\nMiddle Ages trade and geographical knowledge were deeply connected. The crusade\r\ntreatises of Marino Sanudo (#228) and William of Adam included quite precise\r\ninformation about trade routes and the origin and availability of goods in specific\r\nregions, mainly India. The quest for a sea route to India (either around Africa or across\r\nthe Atlantic) was also driven by economic concerns. One might even argue that the focus\r\non land and sea as interrelated spheres was of importance first and foremost within\r\neconomic contexts. The excursus on the importance of maps partly supports this thesis:\r\nthe development of the portolan maps in the late 13th century mirrors the period’s\r\neconomic perspective on interconnected sea- and landscapes, although the historio￾graphical evidence shows that they were also of interest within a political milieu. To\r\nsum up, according to Christoph Mauntel, the two geographical settings comprised by\r\nthe terms entre mers and outremer reflect the awareness of many late medieval authors\r\nand cartographers that land and sea were deeply intertwined spaces.",
  "72": " Closing & Opening of the Indian Ocean\r\n5.10\r\n\t 72\t\r\nReferences:\r\nBerggren, J. L. and A. Jones, Ptolemy’s Geography: An Annotated Translation of the Theoretical\r\nChapters, 2000.\r\nCattaneo, Angelo, ‘Fra Mauro cosmographus incomparabilis and his mappamundi: documents,\r\nsources, and protocols for mapping’, in La cartografia europea tra primo Rinascimento e fine\r\ndell’Illuminismo, ed. by Diogo Ramada Curto, Angelo Cattaneo, and Andre Ferrand Almeida\r\n(Florence: Olschki, 2003), pp. 19-48.\r\n---------, ‘La Mappamundi di Fra Mauro, l’idea di oceano e le direzioni di navigazione all’alba\r\ndell’espansione europea’, in Mundus novus : Amerigo Vespucci e i metodi della ricerca storico￾geografica, ed. by Annalisa D'Ascenzo (Genoa: Brigati, 2004), pp.109-21.\r\nChaudhuri, K.N, Trade and Civilisation in the Indian Ocean: An Economic History from the Rise of\r\nIslam to 1750 (Cambridge: Cambridge University Press, 1985).\r\nCosgrove, Denis, ‘Introduction: Mapping Meaning’, in Mappings, ed. by Denis Cosgrove (London:\r\nReaktion, 1999), pp. 1-23.\r\nCrone, G. R., ‘Fra Mauro’s Representation of the Indian Ocean and the Eastern Islands’, in Studi\r\nColombiani, 3 vols (Genoa: Civico Istituto Colombiano, 1952), pp. 57-64.\r\nDalche, Patrick Gaultier,‘The reception of Ptolemy’s Geography (End of the fourteenth to\r\nBeginning of the Sixteenth Century)’, in Cartography in the European Renaissance, History of\r\nCartography, 6 vols (Chicago: University of Chicago Press, 1987-), 3.1, 285-358.\r\nDilke, O.A.W. “Cartography in the Byzantine Empire”, in History of Carttography, 1987.\r\nEdson, Evelyn, The World Map 1300-1492: The Persistence of Tradition and Transformation (Baltimore:\r\nJohns Hopkins, 2007).\r\nFalchetta, Piero, ‘Maps of the Eastern Islands (Sri Lanka, Sumatra, Java) in Venetian Cartography\r\nfrom Fra Mauro to Coronelli’, Journal of the International Map Collectors’ Society, 99 (2004) 47-55\r\nGoff, Jacques Le, “L’Occident me\" die\" val et l’Ocean Indien. Un horizon onirique”, Un autre\r\nMoyen Age, ed. Jacques Le Goff, Paris 1999, 269–286, here 269\r\nHapgood, C.H., Maps of the Ancient Sea Kings, Evidence of Advanced Civilization in the Ice Age,\r\nChilton Books, N.Y., 1966.\r\nHourani, George F., Arab Seafaring in the Indian Ocean in Ancient and Early Medieval Times, rev. and\r\ned. by John Carswell (Princeton: Princeton University Press, 1995; orig. publ. 1951).\r\nKubbel’, L.E. and V.V. Matveev, eds. and trans. Arabskie srednevekovye istochniki po etnografii i\r\nistorii narodov Afriki iuzhnee Sakhary [7th-10th centuries]. Moscow-Leningrad: Nauka. 1960.\r\nMatveev V.V. and L.E. Kubbel’, L.E., eds. and trans. Arabskie srednevekovye istochniki po etnografii i\r\nistorii narodov Afriki iuzhnee Sakhary. [10th-12th centuries] Moscow-Leningrad, Nauka. 1965.\r\nMauntel, Christoph, “Linking Seas and Lands in Medieval Geographic Thinking during the\r\nCrusades and the Discovery of the Atlantic World”,\tEntre mers—Outre-mer\r\nSpaces, Modes and Agents of Indo- Mediterranean Connectivity, 2018.\r\nLarner, John, ‘The Church and the Quattrocento Renaissance in Geography’, Renaissance Studies,\r\n12 (1998), 26-39.\r\nO’Doherty, M., “Fra Mauro’s World Map (c.1488-1449): Mapping, Mediation and the Indian\r\nOcean World”.\r\nSmith, G. Rex, A Travellers in Thireenth-Century Arabia: Ibn al-Mujawir’s Tarikh al-Mustabsir.\r\nLondon: Ashgate for the Hakluyt Society, 2008.\r\nWashburn, W. “A Proposed Explanation of the Closed Indian Ocean on Some Ptolemaic Maps of\r\nthe Twelfth-fifteenth Centuries”, Coimbra, 1985\r\nWroth, L.C., The Early Cartography of the Pacific, 1944, pp. 90-110.\r\n \r\n "
}