{
  "1": "An Unknown Source of al-Khwarizmi's Kitab şürat al-ard Miklós MARóTH Al-Khwarizmi composed his famous Kitab Șürat al-ard before 850 in the first half of the ninth century. There is no doubt that his description of the inhabited part of the world (seal gull) followed Ptolemy's Fetypapiki ipriynes. This basic observation is accepted by all scholars, but there are different views as to a number of details. One of the most interesting questions is, whether the Arabic text relies on the Greek original version directly, or else it is based on Syriac translation. The existence of a Syriac translation is attested by In al-Nadim. Writing on Ptolemy's Geography of the Inhabited Lands and Description of the Earth he states the followings: This book was in eight sections. Al-Kindi made a bad translation of it and then Thäbit [ibn Qurra] made an excellent Arabic translation. It is also extant in Syriac.' This book was in eight sections. Al-Kindi made a bad translation of it and then Thäbit [ibn Qurra] made an excellent Arabic translation. It is also extant in Syriac.' Al-Kindi and Thabit ibn Qurra were younger contemporaries of alKhwarizmi; consequently, it is not very likely that their translation of Ptolemy's Geography served as the main source for al-Khwarizmi's Kitah Strat al-ard. In this case one has to come to the conclusion that the unknown Syriac translation must have played an indispensable role in transmitting this piece of Greek geographic knowledge to the Arabs. Al-Kindi and Thabit ibn Qurra were younger contemporaries of alKhwarizmi; consequently, it is not very likely that their translation of Ptolemy's Geography served as the main source for al-Khwarizmi's Kitah Strat al-ard. In this case one has to come to the conclusion that the unknown Syriac translation must have played an indispensable role in transmitting this piece of Greek geographic knowledge to the Arabs. See Ihn al-Nadim, The Fihrist of al-Nadim. Tenth Century Survey of Muslim Culture, ed. and tr. by Bayard Dodge, Columbia University Press, New York-London, 1970, 2 vols., vol. 2, p. 640.",
  "2": "Nallino proved in one of his articles that none of the abovementioned options are satisfactory. The first must be rejected because the chronological difficulties cannot be explained in any way, whilst the second one is not supported by orthographic evidence: Talvolta la o greca è rappresentata da una à araba (p. es. Ottorogara per 'Отторокрра, Milibāgõn per Mndißokov), il che potrebbe forse indicare un'influenza siriaca; ma altre volte la o è rimasta anche nell'arabo (od almeno non è segnata con a. poiché il ins. non scrive le vocali brevi; p. es. Qatoraqțonyun = Karoupaktóviov. Eboraqun = \"Eßópaov), oppure si è mutata in u (p. es. Filümilyon = Dilouńhov, Masuryā = Macópa); quindi non si puó tirarne alcuna conclusione. La k è sempre resa da un q. - La O ed il x sono resi rispettivamente da I e da h, due lettere che l'alfabeto siriaco non possiede: ma anche ciò non prova nulla, giacché gli scrittori siri, per una tacita convenzione, rappresentano sempre le aspirate ® e x con 1 e k. laddove per le tenui t e k si servono delle enfatiche ! e q (...) però il fatto che qualche volta al i corrisponde pure la semplice 1, sembra far prevalere l'ipotesi d'una derivazione diretta dal Greco.* After this passage Nallino proceeds to prove that in al-Khwarizmi's transcription the Greek y is usually g instead of g, which would indicate a Syriac intermediate form. Not only does the rendering of certain Greek letters with certain Arabic letters prove a direct derivation from We have to conclude that neither the two Arabic translations nor the Syriac translation referred to by Ibn al-Nadim served as the main source for al-Khwarizmi. Nallino -who read Mas'üdi's Kitah altanbih- has found a solution to the dilemma in a section which follows here (in Nallino's Italian translation): Mas'üdi says in this passage that he has seen some good maps in Marinus' Geography: Greek original, but the absence of some errors (e. g. l1 = b) also seems to confirm the above conclusion. \" C.A. Nallino, \"Al-Khuwārizmi e il suo rifacimento della Geografia di Tolomeo\", in M. Nallino (a cura di), Raccolta di scritti editi e inediti V, Istituto per l'Oriente, Roma 1994, pp. 485-486.",
  "3": "e nella figura al-ma múniana eseguita per al-Ma'mun, intorno alla quale avevan lavorato insieme molti dotti del tempo. Ivi era stato rappresentato il mondo con le sue sfere celestici, i suoi astri, il continente, il mare, le terre abitate, le terre deserte, le regioni occupate da ciascun popolo, le grandi cittâ ecc. Questa figura è migliore delle precedenti che si trovano nella Geografia di Tolomeo, in quella di Marino ed altre. Examining how al-Khwarizmi described the inhabited part of the world, Nallino notes the strange fact that the colours of the mountains are indicated in the text, and that there are some remarks which say, without citing the names, that a \"river passes between a city and a mountain\".4 Seeking an explanation to these and similar expressions Nallino propounds his theory: Io non so spiegarmi un tal fatto se non ammettendo che alKhwärizmi abbia composto il suo libro per illustrare una serie di carte geografiche, anzi traendo da queste ultime tutto il materiale dell'opera sua, appunto come Tolomeo aveva ricavato la sua geografia da carte che si era prima costruito in base ad itinerari Se tale è la genesi del libro arabo si capisce il motivo dell'indicazione dei colori dei monti: questi, per maggiore chiarezza, erano variamente dipinti sulla carta.\"' Io non so spiegarmi un tal fatto se non ammettendo che alKhwärizmi abbia composto il suo libro per illustrare una serie di carte geografiche, anzi traendo da queste ultime tutto il materiale dell'opera sua, appunto come Tolomeo aveva ricavato la sua geografia da carte che si era prima costruito in base ad itinerari Se tale è la genesi del libro arabo si capisce il motivo dell'indicazione dei colori dei monti: questi, per maggiore chiarezza, erano variamente dipinti sulla carta.\"' This theory seems to be accepted by everybody. Kračkovskiy gives a general survey of the later history of research.\" Hans von Mžik says that al-Khwärizmi drew his map on the basis of another map, which was drawn following a Syriac text.? \" Al-Mas'üdi, Kitäb al-tanbih, BGA VIII, ed. M. J. de Goeje, Lugduni-Batavorum, 1894, p. 33. 5 Ibidem. · C.A. Nallino, \"Al-Khuwārizmi e il suo rifacimento della Geografia di Tolomeo\". cit. p. 483. • See 1. Yu. Krěakovskiy Arabskaya Geografičeskaya Literatura, Izbrannüye Sočineniya, vol. 4, Moskva - Leningrad 1957, p. 97. des Claudius Ptolemaeus von Muhammad ibn Müsă al-Hwärizmi, K. Akademie der Wissenschaften in Wien, hist.-phil. Classe, Denkschriften LIX, Abh. 4, Wien 1916,",
  "4": "Ernst Honigmann explains al-Khwārizmi's map as an attempt to unify the maps of Ptolemy and al-Ma'mün in one map.* Kračkovskiy himself cannot decide with whom to take sides: \"It is not entirely sure, which version was used by him, the Greek one or the Syriac translation\"? The problem, as has been pointed out by Nallino, is that the transcription of some names indicates a direct Greek source, whereas some others point to a Syriac intermediate form. If one tacitly adopts the view (as has evidently been done by the majority of scholars) that only one source can be taken into consideration, then this contradiction cannot be solved. Some circumstances compel us to re-examine certain facts which were observed and discussed by previous researchers. Nallino was the first scholar to call attention to the second important fact: The first fact is the arrangement of the material. The arrangement of the material in al-Khwārizmi's book is different from that in Ptolemy's Гешурафікі ińyno. The first book, containing the principles of cartography, and the eighth book, containing the comparative data, are absent. The geographic material in Books II-VII is arranged in a special way: Ptolemy enumerates cities, mountains, rivers, etc. in each one of the climates one after the other; while al-Khwārizmi enumerates first all cities in all the climates, then all mountains, countries, rivers, etc., in the same way.'\" Abbiamo già veduto che moltissimi monti e fiumi, e quasi tutte le isole (eccettuate le maggiori) rimangono senza nome; ora se alaccolto molti nomi affatto greci che più tardi scompaiono nella Khwärizmi rimaneggiava il testo di Tolomeo, perché mai avrebbe geografia araba [...] ed altri invece ne avrebbe taciuti in quelle stesse regioni, contentandosi dire \"monte, isola, fiume\" benché vi unisse tutte le cifre relative?'' pp. VI-VII; Id., 'Ptolemaeus und die Karten der arabischen Geographen\", in Mitteilungen der k. k. Geographischen Gesellscheft in Wien 58 (1915), p. 164. \" See I. Yu. Kračkovskiy, Arabskaya, cit., p. 96. * See E. Honigmann, Die sieben Klimata und die nòleIç Entionuoi, Carl Winter's Universitätsbuchhandlung, Hidelberg 1929, p. 156. '''See ibid., p. 94. \" C.A. Nallino, \"al-Khuwārizmi\" , cit., p. 484.",
  "5": "Nallino is right in drawing the conclusion: La cosa si spiega benissimo quando si ammetta che le carte geografıche su cul lavorava al-Khwärizmi indicavano in certi luoghi l'esistenza d'una città, d'un fiume, d'un monte, di un'isola, ma senza dar loro alcuna denominazione, appunto come avviene in ogni carta geografica.' La cosa si spiega benissimo quando si ammetta che le carte geografıche su cul lavorava al-Khwärizmi indicavano in certi luoghi l'esistenza d'una città, d'un fiume, d'un monte, di un'isola, ma senza dar loro alcuna denominazione, appunto come avviene in ogni carta geografica.' Nallino's hypothesis gives us a good explanation to some difficulties, such as: why al-Khwärizmi changed the arrangement of the traditional geographic material that one finds in Ptolemy's book which served as the ultimate source of his description of the world, and why he left unmentioned a lot of less important names, etc. If we assume that his immediate source was a world-map which had been made by al-Ma'mun's scientists and, while still extant in the ninth century, has remained unknown to us, then his departure from Ptolemy's description of the oikoumené can be explained and justified At the same time one has to realize that this theory does not enable us to give a satisfactory account of some other facts. Thus why are the names which are extant in al-Khwarizmi's book quoted in the Arabic text, while the others were left out? And why did al-Khwarizmi choose Гешурафки ipńynois, while Ptolemy's material is included in his work? Naturally we have to suppose that many scientists in Baghdad who participated in the preparation of the map of the celestial spheres and Thus the following problem arises. Nallino did not fail to prove that al-Khwärizmi's work is not a translation but a \"rifacimento\" of Ptolemy's book on the basis of an extant map of the inhabited part of the world, but he did not devote the necessary attention to the question of what the additional sources were that played a considerable role in the rearrangement of the material in al-Khwãrizmi's Kitab Surat al-ard and in sorting out the geographic names. stars together with the map of the inhabited world' did not confine themselves to one single geographic sourcebook. This assumption en- 12 C.A. Nallino, \"al-Khuwärizmi\", cit., p. 484. \" See al-Mas'üdi, Kitab al-tanbih, cit., p. 33.",
  "6": "ables us to explain why certain names are excluded from, and some others are incorporated into, al-Khwarizmi's description. On the basis of what was noted at the beginning about the names (i. e. that some of them postulate a transcription made directly from Greek, while some other transcriptions can be traced back to an intermediary Syriac translation) one should postulate the incorporation of the (otherwise unknown) Syriac geographic tradition too, in addition to the Greek material and the supposed world-maps. had a lot of books at their disposal; but it is naturally impossible to define which ones were accessible to them. Nevertheless, we can perhaps make an attempt to try to shed more light on the question. Those \"molti dotti\" (Nallino, p. 484) in al-Ma'mün's court surely Let us see a small section of al-Khwārizmi's map, that of Central Asia (from 91 to 150 degrees of longitude, from 35 to 80 degrees of latitude. Isbijab, al-Tarāz, Khwärizm, madinat al-Khazar, Nawikat are well ture. In the enumeration of cities it is obvious that the old Ptolemaic material has been replaced by the new knowledge of the Moslem travellers and administration.!4 In this map there are many cities which are completely unknown in Ptolemy's work. Ushrüsanat, Khujanda, Banäkath, Akhsikath, Täraband, known stations of the Arab itineraries in the Masalik wa mamalik litera- The names of countries as well as the names of rivers reflect the new and more reliable actual knowledge of the Moslem scholars as opposed to that of earlier world maps. These examples show that alKhwärizmi was ready to incorporate new data acquired from new sources and by personal investigation into the old framework inherited from Ptolemy. The names of countries as well as the names of rivers reflect the new and more reliable actual knowledge of the Moslem scholars as opposed to that of earlier world maps. These examples show that alKhwärizmi was ready to incorporate new data acquired from new sources and by personal investigation into the old framework inherited from Ptolemy. The problem of mountains is more complicated than the previous one. Ptolemy describes the mountains in Central Asia in his Гешурафкі upńynois and he gives the name of each one of them. In alKhwärizmi's Kitab Surat al-ard some of the mountains are marked by If one wishes to give an explanation for the fact that some Ptolemaic names are taken over while some others are left out of consideration, one will have to observe that the Arabic names of the mountains show name, some of them remain unnamed. All names mentioned in the Arabic text are originally Ptolemaic names in Arabic transcription. If one wishes to give an explanation for the fact that some Ptolemaic names are taken over while some others are left out of consideration, one will have to observe that the Arabic names of the mountains show name, some of them remain unnamed. All names mentioned in the Arabic text are originally Ptolemaic names in Arabic transcription. 14 See M. Maróth, \"Ptolemaic Elements and Geographical Actuality in alHuwarizmi's Description of Central Asia\", in Acta Antiqua Academiae Scientiarum Hungaricae 28/1-4 (1980), pp. 317-352.",
  "7": "the characteristic features of Syriac orthography as compared with the parallel Greek forms. If we wish to examine the question of a probable Syriac geographic tradition indicated by the transcription of names, it will be useful to turn to the well-known geographic section of Jacobus Edessenus's Hexameron.\" In this treatise we find the following description of the mountains in ('entral Asia: In sarmatia Asiatica hi montes celebres et insignes: Inriká quae dicuntur. et alii. quae Kepaúvia et Kaukúdia nuncupantur, et Kópağ, mons. Scythiae vero tum ei. qui in Sarmatia nominati sunt, tum Alavá qui dicuntur et Punká et praeter hos Opoacos mons et Aomoía, qui dicuntur, et alii nomine Tároupa et Luńßa (apud Ptol. Avapéa). Inter Scythiam interiore et exteriorem extenditur in longitudinem usque ad terram incognitam mons ille magnus, qui Tuaos dicitur. In Scythia exteriore et provincia Serium hi montes patent: Aujakía, Kasia. Hucusa, quibuscum in provincia Serium coniunguntur montes Avvißa. Heáyoupov, Oropokóppa, A quipa qui dicuntur.!\" Comparing the Latin translation of the Syriac text with our world-map one can notice a striking similarity between them. The first mountain mentioned in the text is Alavá which can be seen in al-Khwarizmi's map marked by the numbers 939-940. 'Poquikó is al-Khwärizmi's us ling) (927-928). The Ptolemaic Aoroia is named on the map as Lulêul indicated by the numbers 937-938. The Ptolemaic Tároupa is Lab da (941-942). Zuńßa is Liew (943-944). Al-Khwärizmi's 4i jül da is obviously a misspelling for ANARTA (947-948). In Scythia extra Imaum AuŞakia (in Ptolemy's book Auğakía) corresponds to used co (951952), Kaoia corresponds to Lulố J→ (871-872), Huda corresponds to jas a (825-826). In the North numbers 953-954 define a certain u* üüli which is the Ptolemaic Avvíßa. left out of consideration so far. In our Syriac source there are two further mountains which we have IS See 1. Hjelt (éd.), Etudes sur l'Hexaméron de Jacques d'Edesse notamment ''Ibid., p. 78. sur ses notions géographiques contenues dans le 3-ième traité, J.C. Frenckell et fils, Helsingfors 1892.",
  "8": "The first one is called \"Opoooos. This mountain may have alKhwarizmi's Lily! ut as its counterpart which in turn can be identified with Ptolemy's Nópoooov opos. This identification is justified by two facts: the position of the mountain on the one hand, and the fact that al-Khwarizmi's Arsana has no other linguistic equivalent in our Syriac text on the other. The second one is Juaos in Ptolemy's book. Al-Khwarizmi does not put this name on the map in his description of the inhabited world, but his follower known as Suhräb knows a mountain (821-822, and 1349-1350) under the name uw glail uta. Now we should examine the Syriac names of the mountains re- The two names Lulew and 'Jib do not constitute complicated questions. The Greek Tánoupa contains a n which should be transcribed as y in Arabic. The actual form with an f in the middle indicates a Syriac intermediate transcription. The word rinert in Jacobus's text shows that this intermediate Syriac form did indeed exist. ferred to recently. The name Luléw! corresponds to the Greek name Aotoia. If we asreceson, etc.). In this name the Greek -la ending is represented by the In these two cases it is obvious that the Arabic text depends on a Syrirect. The Arabic q cannot be explained, only if we assume that the Arab sume a Syriac transcription, then it should be regor, and this form is in fact attested in various orthographic variants (recraco, Syriac -re, as is proven by many examples.! In these two cases it is obvious that the Arabic text depends on a Syrirect. The Arabic q cannot be explained, only if we assume that the Arab sume a Syriac transcription, then it should be regor, and this form is in fact attested in various orthographic variants (recraco, Syriac -re, as is proven by many examples.! ac geographic source, even though their connection seems to be indiscribe put two dots instead of one on the letter f. To put it in another way: the Arabic map in the Abbasid court which has been described by al-Khwarizmi must also have been based on a Syriac source. This can be derived from a Syriac Cano. The graphic form of the Syriac word coincides with the line of the Arabic one, which by misplaced dots can be easily turned into its actual form: Wigw. The correct transcription of the Syriac -y- with one dot above the line transforms the letter from -y- into -n-, and one dot instead of two under the line A similar mistake in spelling can serve as the explanation for Lew. 17 For example see J. Tkatsch, Die arabische Übersetzung der Poetik des Aristoteles, Wien - Leipzig 1928-1932, 2 vols., vol. I, p. 208: Havia - Russ 18 The actual Syriac form in Jacobus' text is Ranas.",
  "9": "transforms the -b- into -v-. (In this context is worth mentioning that the Arabic text edited by Mžik has many letters without any dot.) for Anmaos, because of the strong similarity between the Syriac i and n. The Greek name \"luaos cannot be found in al-Khwärizmi's map, but Suhrab knows it as gail. The initial An- cannot be explained if we assume a direct transcription of the Greek form into Arabic. In Jacobus' Syriac text one finds the form consor, which is the correct transcription of Ptolemy's Greek name. The Syriac condor can be easily taken The names jo, lily!, jy!, Lew, compared with the Syriac version Knesai and Fire, cronio and ricar (927-928, 931-932, 939940, 825-826) do not furnish us with enough evidence to prove or to (871-872) contains at the end a typical Syriac transcription of the The names L! jul, jee 947-948, 951-952), when compared with Jacobus\" Rink, rhino seem to prove that the Syriac text which served as a source for the \"molti dotti\" of geography in Baghdad was not that of our Jacobus Edessenus. His rhinor cannot be misread as reject the existence of a Syriac intermediate form. The Arabic Lul Greek -ta as —va. In Jacobus' text one finds the form reone which is literally identical with al-Khwärizmi's Arabic name. The names L! jul, jee 947-948, 951-952), when compared with Jacobus\" Rink, rhino seem to prove that the Syriac text which served as a source for the \"molti dotti\" of geography in Baghdad was not that of our Jacobus Edessenus. His rhinor cannot be misread as reject the existence of a Syriac intermediate form. The Arabic Lul Greek -ta as —va. In Jacobus' text one finds the form reone which is literally identical with al-Khwärizmi's Arabic name. be te Syria and i are not interchangeable, due to their dissimilarity in shape. At the same time it can be observed that Greek loanwords which did not come to Arabic via Syriac transcribe the ending -a as *; or else the transcription of the final -a is simply omitted. The Arabic -ya at the end of the Arabic names, however, indicates a Syriac intermediary form. The letter s at the end of an Arabic word usually stands for a Greek -n. A possible Greek 'Avvißn is not known to me in the Greek geographic literature. In short, it seems to be impossible to explain the yet 1 am still inclined to see the traces of a possible unknown Syriac Turning to the last name we are confronted with special difficulties. The mountain marked by the numbers 953-954 is known in Arabic as sILy. On the basis of its position it can be identified with Ptolemy's Avvißa öpn. The Greek form is quite distant from the Arabic one, which must be the result of a serious mistake. The Syriac name in Jacobus's text is nor, which in its turn strictly corresponds to the Ptolemaic form. extant Arabic form on the basis of sources which are at our disposal, version in it, due to the correspondence of final -n in the Greek to the final s- in Arabic.",
  "10": "Having briefly reviewed the mountains of Central Asia I feel entitled to state that al-Khwärizmi's world-map drew on various sources. In addition to the Ptolemaic material some of them must have represented genuine Arabic knowledge obtained from the administration of the Islamic empire, as is evidenced by the original enumeration of cities;'\" some of which must have had Syriac sources. This fact, i.e. the mixed character of the orthography, can account for the apparent hesitation in the literature about the acceptance of the theory of either a unique Greek or a Syriac source. Both of these theories are wrong, because alKhwärizmi's map must rely indirectly on many different sources. Its direct source must have been al-Ma'mün's world map made in Bagh- It is very likely that Jacobus Edessenus was not among the sources of our scientists in Baghdad, as has been argued above. However, there is a striking similarity between Jacobus' text and al-Khwarizmi's map of the inhabited world. dad, as has been pointed out by Nallino. Jacobus does not enumerate all the mountains represented in the world maps. Ptolemy describes much more mountains than Jacobus. One can assume that Jacobus knew Ptolemy's map, then he made a se- A more careful comparison of Jacobus' text with the map of the inhabited world proves, however, that only the names mentioned in the Syriac text appear in the world map. The names which can be found in Ptolemy's text but cannot be found in Jacobus' text remain unmentioned in al-Khwārizmi's map. The similarity between the world map and the philosophically inspired geographic work of a Syriac speaking Father of the Church consists in the selection of names, and it cannot result merely from accidental coincidence. lection of his own. He quoted the names of the more important mountains, while leaving out of consideration the less important ones. The adoption of a similar method can be observed on al-Khwarizmi's map too. He represented a lot of mountains on his map, but only some of them are marked by name, while many others are nameless. One has to draw the conclusion that the postulated map in Baghdad was made by scientists who had the intention to make a \"revised and enlarged edition\" of Ptolemy's world map, as far as the delineation of mountains, rivers, and seas is concerned. (In our map, for example, the mountains 935-936, 933-934 are new in comparison to Ptolemy. They reflect a more detailed knowledge as compared to Ptolemy's map.) '' See M. Maróth, \"Ptolemaic Elements\", cit., pp. 317-352.",
  "11": "As regards the selection of names, it was done by scientists, and doing so they did not follow the lead of their professional masters in geography. The selection of names depends on a literature which is akin It is difficult to say with certainty who might have been the author of to the Syriac work of Jacobus Edessenus. It is difficult to say with certainty who might have been the author of to the Syriac work of Jacobus Edessenus. Jacobus's supposed source written in Syriac. Similarly, it is difficult to prove whether the Syriac work was a genuine one, or else it was only a translation of a Greek work. All we do know is that this work/these works must have given a bird's-eye description of the inhabited world. They did not mention every detail because they were only interested in the most important cities, mountains, rivers, lakes and seas. They only contain the most important geographic names. treatise also gives a bird's eye view of the world, without a compreies, and incidentally hints at certain mountains and lakes. The anonymous Syriac work (works) must have been similar to the geographic chapter of the well known deal jleil Jily. This short hensive list of mountains, rivers, lakes and seas. It contains a detailed description of the climates, references to countries and important cit- This example seems to suggest that there must have been a not professionally but philosophically oriented type of geography as well. This idea is supported by the fact that Jacobus' text belongs to a long chain of similar works, written by Fathers of the Church from Ambrosius through Chrysostomus, Lactantius, etc., until Jacobus. As has been suggested by the editor of Jacobus's text, his immediate predecessor was a well-known philosopher. As Arthur Hjelt tries to prove, the main source of Jacobus' Hexaméron was Philoponus's work known On the basis of all that has been said so far, one has to come to the conclusion that the ultimate source of this kind of description of the inhabited world is a literature which is based on Pseudo-Aristotle's De mundo.?' This short treatise neglects the description of the climates; consequently it does not contain a systematic description of mountains or rivers distributed into climates, as was done by Ptolemy. To my knowledge this was the first work which gave a bird's-eye view of the as Пері кобнологас.\"\" On the basis of all that has been said so far, one has to come to the conclusion that the ultimate source of this kind of description of the inhabited world is a literature which is based on Pseudo-Aristotle's De mundo.?' This short treatise neglects the description of the climates; consequently it does not contain a systematic description of mountains or rivers distributed into climates, as was done by Ptolemy. To my knowledge this was the first work which gave a bird's-eye view of the as Пері кобнологас.\"\" 2\" See A. Hielt (éd.), Études, cit., p. 10. 31 See Aristotle, On the Cosmos, ed. D.J. Furley, Harvard University Press, Cambridge, Mass.-London, 1978 (Loeb Classical Library), pp. 344-409; Aristoteles, Meteorologie. Über die Welt, Übersetzt von Hans Strohm, Akademie Verlag, Berlin 1970, in Werke in deutscher Übersetzung, herausgegeben von Erst Grumach; fortgeführt von | ellmut Flashar. Akademie Verlag, Berlin 1956-, pp. 237-352.",
  "12": "inhabited world. It contains a general survey of the oceans and seas, bays, islands and continents, as was done by Jacobus as well. PseudoAristotle, however, does not describe the mountains, nor does he mention the names of towns. Nevertheless, the method of description of the inhabited world in Jacobus's Hexaméron is identical to PseudoAristotle's method. Pseudo-Aristotle's De mundo, as I tried to point out in my recent works, must have been the handbook of geography in the ancient schools of rhetoric.\" This can be verified by the fact that it was rewritten in Latin by Apuleius,\" that, furthermore, it was known to the Fathers of the Church (as the names quoted above -Ambrosius, Chrysostomus, Lactantius- prove), and, lastly, that it was translated three times into Arabic.? The transcription of names and the text itself (omitted, inserted and misunderstood words) serve as evidence supporting our conviction that the Arabic text was translated from the Syriac version prepared by Sargis of Reshaina.? The first Arabic translation of this geographic treatise was made in the court of the Omayyad Caliph Hishām ibn 'Abd al-Malik as part of a novel in letters written in a Syrian school of rhetoric. This novel contains some treatises of Pseudo-Aristotle disguised as letters sent to Alexander the Great. All Latin writers and Fathers of the Church studied in schools of rhetoric. These schools represented the institutes of higher education in the classical Antiquity and early Middle Ages. What was to be regarded as generally obligatory knowledge of a well-educated person in geography, was defined by the curricula of the schools of rhetoric which, in turn, taught the elements of philosophy and sciences on an elementary level. The geographic material taught in the Greek schools of rhetoric both in Greece and the Greek-speaking oriental provinces turns up in al-Khwarizmi's world map. 22 See M. Maróth (ed.), The Correspondence between Aristotle and Alexander the 23 Apuleius Madurensis, De philosophia libri, ed. P. Thomas, Teubner, Lipsiae Great. An Anonymous Greek Novel in Letters in Arabic Translation, The Avicenna Institute of Middle East Studies, Piliscsaba, 2006, pp. 75, 81-90; Id., \"Science and Literature in the age of Hellenism\", in Acta Antiqua Academia Scientiarum Hungaricae 53/1 (2013), pp. 33-46. 1908, pp. 135-175. 24 See S.M. Stern, 'The Arabic Translation of the Pseudo-Aristotelian Treatise De mundo\", in Le Museon 77 (1964), pp. 187-204. pp. 81-83. 25 See P. Lagardius, P. Lagardii Analecta Syriaca, Teubner, Lipsiac 1858, pp. 134158; M. Maróth, The Correspondence between Aristorle and Alexander the Great, cit..",
  "13": "After the Muslim conquest of the former Greek and Roman territories these schools of the ancient Greek rhetoric continued their activity, but in the course of time they turned into special Christian institutes of education serving as channels to convey Greek knowledge to the new Islamic countries. As our example proves, these schools played a certain role in the development of the Muslim sciences. The relationship between the ancient schools of rhetoric and Islamic civilization is perhaps an unknown domain of the history of the Islamic sciences which deserves to be investigated in the future. ABSTRACTS It has been a long debated question what was the ultimate source of alKhwarizmi's Kitab strat al-ard. The author of the present paper supports Nallino's thesis which says that al-Khwarizmi described al-Ma'mun's already existing world-map in his book. The right question is thus: what are the sources of al-Ma mün's map. In the article arguments are put forward to prove that Ptolemy's Geographike hyphegesis served as a basis for the world-map, but also newly acquired materials from the al-masālik wa'lmamalik literature have been inserted. The names of mountains, etc., from Ptolemy's description of world appear on al-Ma'mün's map and, accordingly, in al-Khwärizmi's book only in selection and based on Syriac translation. The selection follows the tradition of the philosophically inspired geographic literature used in the schools of Greek rhetoric, starting with Ps.-Aristotle's De mundo, continued by the Greek and Syriac Church Fathers and by the Arabic translation of De mundo in the correspondence ascribed to Aristotle and Alexander. The same tradition is still living in the geographic section of the philosophical encyclopaedia of the Ikhwān al-Safa'. *** Déterminer qui est la source ultime de le Kitāb şurat al-ard d'al-Khwarizmi est une question débattue depuis longtemps. Dans la présente contribution nous soutenons la thèse de Nallino selon laquelle al-Khwārizmi décrirait dans son livre une carte du monde déjà en possession d'al-Ma'mün. À ce point, la question devrait être posée dans les termes suivants : quelles sont les sources utilisées pour la carte d'al-Ma'mün ? Les sujets abordés ici visent à prouver que la Geographike hyphegesis de Ptolémée a servi de base pour une carte du monde, mais que de nouveaux matériaux appartenant à la littérature al-masalik wa'l-mamalik ont été également utilisés. Par exemple, les noms des montagnes etc., qui viennent de la description du monde de Ptolémée, apparaissent sur la carte d'al-Ma'mun et, par conséquent, dans le livre",
  "14": "d'al-Khwarizmi, dans une sélection basée sur une traduction syriaque. La sélection suit la tradition de la littérature géographique inspirée par les écoles philosophiques de la rhétorique grecque, en commençant par le De mundo du pseudo-Aristote à travers les Pères de l'Église grecque et syriaque et la traduction en arabe du De Mundo dans l'échange de lettres entre Aristote et Alexandre. La même tradition se trouve dans la section géographique de l'encyclopédie des Ikhwān al-Safa'. *** Determinare quale sia la fonte ultima del Kitāh sürat al-ard di al-Hwarizmi è questione lungamente dibattuta. Nel presente contributo si sostiene la tesi di Nallino secondo la quale al-Hwarizmi avrebbe descritto nel suo libro una mappa del mondo già in possesso di al-Ma'mún. A questo punto la domanda dovrebbe essere posta nei seguenti termini: quali furono le fonti utilizzate per la mappa di al-Ma'mün? Gli argomenti discussi nel presente contributo cercano di dimostrare che la Geographike hyphegesis di Tolomeo servi da base per la mappa del mondo ma che vennero utilizzati anche nuovi materiali provenienti dalla lettura al-masālik wa'l-mamalik. Ad esempio i nomi di montagne e simili, provenienti dalla descrizione del mondo di Tolomeo, compaiono sulla mappa di al-Ma'mun, e di conseguenza nel libro di al-Hwärizmi, in una selezione basata su una traduzione siriaca. La selezione segue la tradizione della letteratura geografica di ispirazione filosofica propria delle scuole di retorica greche, cominciata con il De mundo dello pseudo-Aristotele e continuata dai Padri della chiesa greci e siriaci e dalla traduzione araba del De mundo nello scambio epistolare che sarebbe intercorso tra Aristotele e Alessandro. La medesima tradizione la si ritrova nella sezione geografica dell'enciclopedia filosofica degli Ihwān al-Șafa'."
}