{
  "key": "W277BB43",
  "title": "Le roman épistolaire classique conservé dans la version de Salim Ab l-'Ala",
  "refs": [],
  "citations": [
    {
      "page": 3,
      "marker": "1",
      "context": "le seul «siyasatnamah) arabe connu du moyen age occidental. En depit de son manque d'originalite Steinschneider"
    },
    {
      "page": 3,
      "marker": "2",
      "context": "l'avait memedefini «eine teilweisemiserable Compilation philosophierender Mystik und vulgaren Aberglaubens"
    },
    {
      "page": 4,
      "marker": "3",
      "context": "comme la preuve que ces auteurs connaissaient deja notre traite pseudo-aristotelicien"
    },
    {
      "page": 4,
      "marker": "4",
      "context": "qui avait puise dans ces encyclopedies dans le but de corser son propre texte"
    },
    {
      "page": 5,
      "marker": "6",
      "context": "de son etude sur les traductions arabes du II€p't, KOU/-,OV nous revela l'existence"
    },
    {
      "page": 6,
      "marker": "7",
      "context": "nous laissons de côté les problèmes, tout aussi importants, que cette œuvre pose au point de vue des contacts entre la naissante civilisation arabe et les anciennes cultures"
    },
    {
      "page": 8,
      "marker": "2",
      "context": "Ms. Fatih., fol. 109v : L. I~ J.,.o -;rl ~ ~ ~D. Dans la copie de l'original il y avait :"
    },
    {
      "page": 8,
      "marker": "3",
      "content": "Dans le ms. Fatih cette note est introduite par la remarque"
    },
    {
      "page": 9,
      "marker": "4",
      "context": "Voir les sincipit e de ces morceaux dans l'appendice."
    },
    {
      "page": 9,
      "marker": "5",
      "context": "Dans cette dernière partie, on rencontre de nouveau deux notes du même copiste."
    },
    {
      "page": 10,
      "marker": "6",
      "context": "On attribuera de même à 'Ali-bnu Muhammad les notes aux chapitres V et VI de la deuxième partie."
    },
    {
      "page": 10,
      "marker": "7",
      "context": "Elle contient une «risala» de Muhammad al Hasan al Hatimi mort en 998 (voir BROCKELMANN, GAL, I, 88)."
    },
    {
      "page": 11,
      "marker": "8",
      "context": "publiee par Cheikho 8, qui a donne aussi une deuxieme edition de la lettre d' Aristote"
    },
    {
      "page": 11,
      "marker": "9",
      "context": "et date de 724 h. C'est donc Ie plus ancien ms. de ce livre qu'on ait jusqu'ici retrouve"
    },
    {
      "page": 12,
      "marker": "10",
      "context": "gouverner les cites » 10. Et ce titre merite toute notre attention"
    },
    {
      "page": 12,
      "marker": "11",
      "context": "et Fatil;Q.11.Ainsi il nous a conserve des variantes remontant en partie"
    },
    {
      "page": 12,
      "marker": "12",
      "context": "forme archaique ne se retrouvant, a notre connaissance, dans aucun autre texte arabe 12"
    },
    {
      "page": 12,
      "marker": "13",
      "context": "celui de la version arabe « Kitab-al-alJ.laq» 13. Enfin, Ie ms. de Paris"
    },
    {
      "page": 12,
      "marker": "BEO, XIX",
      "context": "Voir notre article dans BEO, XIX."
    },
    {
      "page": 15,
      "marker": "17",
      "context": "On les a traduites pour lui et illes a mises en etat, Son recueil de lettres comprend environ cent feuiliets"
    },
    {
      "page": 16,
      "marker": "18",
      "context": "comment cet auteur connaissait deja une version arabe de la « Biographie d'Alexandre» du ps. CallistheneIS"
    },
    {
      "page": 16,
      "marker": "19",
      "context": "l'introduction a la piece XIV (la « Lettre du Palais d'Or ») derive, ainsi que M.Stern l'a demontre, de la description du temple"
    },
    {
      "page": 16,
      "marker": "20",
      "context": "On attribuera encore a cet auteur arabe le court debut des lettres XI et XII qu'il a ajoutees"
    },
    {
      "page": 16,
      "marker": "21",
      "context": "La preuve, nous la voyons dans I'introduction de la lettre XIII"
    },
    {
      "page": 17,
      "marker": "22",
      "context": "avait donne naissance aux /-L€Ta{3oAa{ de Demosthene le Thrace"
    },
    {
      "page": 17,
      "marker": "23",
      "context": "aux /-L€Ta1TOt-rJa€t> de Sopatros"
    },
    {
      "page": 17,
      "marker": "24",
      "context": "aux /-L€TaeppaaH> de Procope de Gaza, rheteur auquel le spectacle de la « gravite des chameaux I)"
    },
    {
      "page": 17,
      "marker": "25",
      "context": "nous trouvons encore un vers d'Hesiode qui correspond presque exactement au texte grec"
    },
    {
      "page": 18,
      "marker": "26",
      "context": "un vers inconnu d'Euripide"
    },
    {
      "page": 18,
      "marker": "27",
      "context": "enfin un vers de Pindare, dans Iequel le professeur Corbatto a reconnu la traduction du fragment 169 Snelle"
    },
    {
      "page": 18,
      "marker": "28",
      "context": "qui avait l'habitude de citer de Ionguesparties de l'original presque « in extenso I), quitte a en omettre d'autres"
    },
    {
      "page": 18,
      "marker": "29",
      "context": "car il ne savait manifestement rien de ces personnages"
    },
    {
      "page": 19,
      "marker": "30",
      "context": "historiographes arabes, pour autant que nous sachions, ont toujours ignore 30. De meme, on ne saurait imaginer"
    },
    {
      "page": 20,
      "marker": "31",
      "context": "que nous ne possedons qu'un choix des sentences prononcees par les philosophes a l'occasion de l'enterrement d'Alexandre 31;"
    },
    {
      "page": 20,
      "marker": "32",
      "context": "a en juger par les deux passages cites dans l'introduction 32, etait la meme qu'on retrouve dans les"
    },
    {
      "page": 21,
      "marker": "33",
      "context": "attribues It Hunayn 33. Or, on a depuis longtemps remarque que la lettre de ces"
    },
    {
      "page": 21,
      "marker": "34",
      "context": "version A du ps.Callisthene et du ms, Vulcan. 93 de Leyde 34. Ajoutons encore que les sentences"
    },
    {
      "page": 21,
      "marker": "35",
      "context": "Matrun, Bartus, Mirawis et Maymus dans 1'« Iskandarnamah » d'Ahmedi 35. II est vrai que, parmi"
    },
    {
      "page": 22,
      "marker": "36",
      "context": "Rufus qui vecut au Ier siecle de notre 36 ere et qui, dans l'"
    },
    {
      "page": 22,
      "marker": "37",
      "context": "d'Ahmedi, participe it ses funerailles 37. On voit combien on aurait tort"
    },
    {
      "page": 22,
      "marker": "38",
      "context": "philosophes 3S. Des condamnations si vehementes de la personne d'Alexandre ne sauraient avoir ete"
    },
    {
      "page": 23,
      "marker": "39",
      "context": "ce qui est d'ailleurs la these de M. Spitaler"
    },
    {
      "page": 23,
      "marker": "40",
      "context": "vraisemblablement de Themistius, incorpore dans la « Risdlat-al-Kindi fiI-hila Ii daf''i-l'al;1zan»"
    },
    {
      "page": 23,
      "marker": "41",
      "context": "les rattachait a la version arabe du ps.-Cellisthene"
    },
    {
      "page": 23,
      "marker": "42",
      "content": "L.c., p. 493, 495 et 497."
    },
    {
      "page": 24,
      "marker": "43",
      "context": "Ainsi, dans les (I Bocados d'oro»"
    },
    {
      "page": 24,
      "marker": "44",
      "context": "le Roi demande a sa mere seulement de preparer un splendide festin"
    },
    {
      "page": 24,
      "marker": "45",
      "context": "dans la version ethiopienne de l' (I Histoire de la mort d'Alexandre»"
    },
    {
      "page": 25,
      "marker": "46",
      "context": "afin de mieux exprimer sa nouvelle politique,il avait adopte dans ses lettres la formule"
    },
    {
      "page": 25,
      "marker": "47",
      "context": "il en existe encore deux specimens en plus de celui qu'a publie M. Spitaler"
    },
    {
      "page": 25,
      "marker": "48",
      "context": "la deuxieme lettre des Apophtegmes de"
    },
    {
      "page": 26,
      "marker": "49",
      "context": "celle qu'on lit dans le « Roman ethiopien d'Alexandre »"
    },
    {
      "page": 26,
      "marker": "50",
      "context": "le poete Abfr-l- 'Atahya connaissait deja les sentences"
    },
    {
      "page": 26,
      "marker": "51",
      "context": "Ie fragment inclus dans le « Conforto delle tristezze » de Elya al Gawhari"
    },
    {
      "page": 27,
      "marker": "52",
      "context": "detail omis dans les « Bocados d'Oro », Hunayn I et l' « Histoire de la mort d' Alexandre»"
    },
    {
      "page": 27,
      "marker": "93",
      "context": "Seuls al-Kindi et al-Gawhari nous ont conserve les dernieres paroles d'Olympie qui ont une fois de plus leur pendant exact dans le ms. Vulcan."
    },
    {
      "page": 27,
      "marker": "53",
      "context": "Seuls al-Kindi et al-Gawhari nous ont conserve les dernieres paroles d'Olympie qui ont une fois de plus leur pendant exact dans le ms. Vulcan. 93"
    },
    {
      "page": 27,
      "marker": "54",
      "context": "Par contre, c'est chez al-Gawhari et al-Mas'ftdi que nous retrouvons l'equivalent d'une autre phrase de la lettre grecque"
    },
    {
      "page": 27,
      "marker": "55",
      "context": "Quelques lignes plus loin, al-Kindi se rapproche de nouveau d'al-Mas'fid], alors que al-Gawhari et Hunayn I presentent une lecon manifestement erronee"
    },
    {
      "page": 27,
      "marker": "56",
      "context": "Enfin, nous retrouvons chez al-Mas'fidi une variante isolee, laquelle cependant est confirmee par Ies « rasa,'il»"
    },
    {
      "page": 28,
      "marker": "57",
      "context": "l' « incipit des lettres dans les « Bocados d'Oro» et dans le ms, Aya Sofya correspond assez bien"
    },
    {
      "page": 28,
      "marker": "58",
      "context": "celui du « Testament d' Alexandre» dans la version syriaque"
    },
    {
      "page": 29,
      "marker": "59",
      "context": "rien n'indique une telle connaissance"
    },
    {
      "page": 29,
      "marker": "60",
      "context": "les mots inseres dans le titre de ce chapitre « il avait bu un venin» ne sont qu'une glose"
    },
    {
      "page": 29,
      "marker": "61",
      "context": "Hunayn donne de cette visite une version qui differe Iegerement de celle d'al-Mubassir"
    },
    {
      "page": 30,
      "marker": "63",
      "context": "resumee par l'auteur de nos « morceaux choisis» 63. D'ailleurs, Ie theme de la prophetie revient"
    },
    {
      "page": 30,
      "marker": "62",
      "context": "« AlJ.bar-alIskandar» d'al-Mubassir, nous retrouvons l'episode de la maladie et de la mort naturelle de Philippe, episode repris litterale- 62"
    },
    {
      "page": 31,
      "marker": "64",
      "context": "ment de l'introduction qui, dans les « rasa'il », precede la piece VI 64. Desormais une conclusion"
    },
    {
      "page": 31,
      "marker": "65",
      "context": "emploie ce que je t'ai decrit et elles s'enfuiront 65}) · Impossible de ne pas entendre"
    },
    {
      "page": 32,
      "marker": "66",
      "context": "Alexandre ne peut etre qu'un talisman. On nous en parle d'ailleurs encore dans le « Sirr-al-asrar i 66."
    },
    {
      "page": 32,
      "marker": "67",
      "content": "suffisent a prouver que son auteur s'inspirait deja de notre lettre XI 67. Par consequent"
    },
    {
      "page": 32,
      "marker": "68",
      "context": "apocryphes arabes faisant d'Aristote, d'une part, l'adepte de la magie et l'inventeur de talismans 68;"
    },
    {
      "page": 32,
      "marker": "69",
      "context": "de l'autre, le theoricien de l'art militaire 69. Aussi ne saurait-on eviter de se demander"
    },
    {
      "page": 33,
      "marker": "70",
      "context": "conservees dans le ms. Vatican syriaque 209 70 faisaient leur tour partie de notre « Roman epistolaire"
    },
    {
      "page": 33,
      "marker": "71",
      "context": "« 'uzama\": qu'on retrouve dans la premiere lettre 71. D'autant que dans « as-Siyasatal-'ammiya»"
    },
    {
      "page": 34,
      "marker": "72",
      "context": "titre de « kavi », pris par l'Josro I, s'est bien vite perdu"
    },
    {
      "page": 34,
      "marker": "73",
      "context": "elles faisaient partie a leur tour d'un recueil de lettres qui ne devaient pas toutes concerner l'alchimie"
    },
    {
      "page": 34,
      "marker": "74",
      "context": "comment la tache d'organiser l'Empire et le souci d'achever la conquete du monde"
    },
    {
      "page": 35,
      "marker": "75",
      "context": "pecherait que ces lettres aient fait partie de notre Roman epistolaire"
    },
    {
      "page": 35,
      "marker": "76",
      "context": "qui nous oblige a envisager la possibilite qu'elle ait fait partie d'un cycle different"
    },
    {
      "page": 35,
      "marker": "77",
      "context": "Parmi les lettres resumees par Ibn Faqih, deux se rattachent a un episode"
    },
    {
      "page": 35,
      "marker": "78",
      "context": "al-Mubassir en avait entendu parler, mais ce dernier attribuait a Olympie"
    },
    {
      "page": 36,
      "marker": "79",
      "content": "reponse d'Aristote a Alexandre, resumee par al-Biruni"
    },
    {
      "page": 36,
      "marker": "80",
      "context": "conservees de nouveau et seulement dans deux traductions latines"
    },
    {
      "page": 36,
      "marker": "81",
      "context": "rejet de la theurgie et, par consequent, de la theorie du « haykal »"
    },
    {
      "page": 37,
      "marker": "82",
      "context": "monde musulman connaissait les legendes sur Dandamis"
    },
    {
      "page": 37,
      "marker": "83",
      "context": "probablement meme l'original de nos versions latines du « De Mirabilibus Indii »"
    },
    {
      "page": 37,
      "marker": "84",
      "context": "incompatibles avec l'orthodoxie islamique"
    },
    {
      "page": 37,
      "marker": "85",
      "context": "il fait allusion aux legendes des Coptes, entendons des anciens Aigyptioi"
    },
    {
      "page": 37,
      "marker": "86",
      "context": "exploit mentionne uniquement dans la redaction y du ps.-Callisthene"
    },
    {
      "page": 38,
      "marker": "87",
      "context": "ils ont fui devant lui chez les Gaulois 87. Encore, dans la « as-Siyasatal-'ammiya »"
    },
    {
      "page": 38,
      "marker": "88",
      "context": "Rappelons les resultats de l'etude de M. Simon sur les rapports entre I'episode de la conversion d'Alexandre au « Dieu vivant» dans la redaction f3 et dans la redaction y 88."
    },
    {
      "page": 39,
      "marker": "89",
      "context": "l'auteur de la redaction A de la «Biographie », qui date au plus tOt de la fin du VIle siecle 89"
    },
    {
      "page": 39,
      "marker": "90",
      "context": "le professeur Walzer preferait entendre qu'il s'agissait de la ville d'Amphissa 90."
    },
    {
      "page": 39,
      "marker": "91",
      "context": "cette lettre : «Cette expedition que tu as entreprise, cette guerre que tu as commencee, est un exploit unique, qui t'a conduit de ton pays au pays d'Asie. II faut que tu l'acheves et qu' apres cette victoire tu penetres dans la Perse 91 »"
    },
    {
      "page": 39,
      "marker": "92",
      "context": "Or, dans les «Agbaral-Iskandar » d'al-Mubassir 92, nous trouvons une indication assez analogue"
    },
    {
      "page": 40,
      "marker": "93",
      "context": "esperaient atteindre par la suite» 93. Nul doute que cette phrase appartient it l'auteur classique"
    },
    {
      "page": 40,
      "marker": "94",
      "context": "permettaient de gagner la gloire etemelle 94. A notre sens, l'accord textuel entre ces passages"
    },
    {
      "page": 40,
      "marker": "95",
      "context": "ou lJosro I se parait du titre de ytyu, ytyavTwv 95."
    },
    {
      "page": 41,
      "marker": "96",
      "context": "Aristote, parlant de sa jeunesse, raconte qu'il a rencontre Hippocrate 96 it Athenes"
    },
    {
      "page": 41,
      "marker": "97",
      "context": "les trois principes du « kosmos» (le « sensus mundanus» 97, Ia « hyle"
    },
    {
      "page": 41,
      "marker": "Pline, Hist. Nat., VII, 55, § 189",
      "context": "connue en Occident des le Ier siecle de notre era; (Pline, Hist. Nat., VII, 55, § 189 et Lucien"
    },
    {
      "page": 41,
      "marker": "Lucien de Samosate, Demonax, ch. 25",
      "context": "connue en Occident des le Ier siecle de notre era; (Pline, Hist. Nat., VII, 55, § 189 et Lucien de Samosate, Demonax, ch. 25)"
    },
    {
      "page": 42,
      "marker": "98",
      "context": "parlaient de l' EmuTporP~, de l' UATJ et definissaient le monde comme un TO I-\"~ DV 98"
    },
    {
      "page": 42,
      "marker": "99",
      "content": "P. FESTUGIERE, l.e., I, chap. IV"
    },
    {
      "page": 43,
      "marker": "100",
      "context": "le heros macedonien, desormais annexe par le christianisme 100, un « kosmokratOr»"
    },
    {
      "page": 43,
      "marker": "101",
      "context": "ce paien croyait aux propheties annoncant le retour de la vraie religion 101"
    },
    {
      "page": 43,
      "marker": "102",
      "context": "n'etaient pas etrangeres a l'enseignement d'Hermes 102. On connait la place"
    },
    {
      "page": 43,
      "marker": "103",
      "context": "traduits d'un recueil grec 103. 100 Voir l'etude de M. Simon"
    },
    {
      "page": 44,
      "marker": "104",
      "context": "Niesse, Pridik et, tout dernierement, le professeur Plezia 104 ont considere"
    },
    {
      "page": 44,
      "marker": "105",
      "context": "ainsi qu'Attale Ier avait fait les Galates 105. Mais, en general"
    },
    {
      "page": 45,
      "marker": "106",
      "context": "cite la « Physike akroasis »; il est vrai que c'est a propos de l'interet des jeunes hommes pour les legendes"
    },
    {
      "page": 45,
      "marker": "107",
      "context": "La solution definitive du problems des sources de cette lettre et des rapports entre l'hermetisme"
    },
    {
      "page": 46,
      "marker": "1",
      "context": "Le meme texte -et sous une forme plus complete -se retrouve dans les « Apophtegmes ~ attribues a l,Iunayn bn Ishaq"
    },
    {
      "page": 46,
      "marker": "2",
      "context": "KNUST, Mittheilungen aus dem Eskurial, p. 9"
    },
    {
      "page": 46,
      "marker": "2",
      "context": "note comment cette leeon est attestee deja dans les « Apophtegmes ~ attribues It l,Iunayn, KNUST, l.c., p. 36"
    },
    {
      "page": 47,
      "marker": "3",
      "context": "Un texte analogue se retrouve dans les « Apophtegmese attribues a J.Iunayn : ms, Escurial, KNUST, u; p. 13"
    }
  ],
  "summary": {
    "abstract": "This article examines the classical epistolary novel preserved in the Arabic version of Salim Abu-l-'Ala', focusing on the correspondence between Alexander and Aristotle. Grignaschi traces the textual tradition through multiple manuscript sources, particularly two Syrian-Egyptian manuscripts completed in the 8th century of the Islamic calendar, establishing their genealogical relationship and independence from one another. The study identifies sixteen pieces of correspondence, three of which were previously known, and demonstrates connections to earlier Arabic works such as al-Hikmat al-halida and the Sirr-al-asrar (Secrets of Secrets). Through careful collation of manuscripts held in Istanbul, Vatican, and European libraries, the author reconstructs the literary history of this important Greco-Arabic text and its transmission in medieval Islamic scholarship.",
    "contents": [
      {
        "heading": "Introduction and Research Background",
        "page": 211
      },
      {
        "heading": "Manuscript Sources and Description",
        "page": 213
      },
      {
        "heading": "Textual Notes and Copyist Annotations",
        "page": 214
      },
      {
        "heading": "Manuscript Relationships and Genealogy",
        "page": 216
      },
      {
        "heading": "Previously Known Pieces of the Correspondence",
        "page": 220
      },
      {
        "heading": "Additional Manuscript Evidence and Titles",
        "page": 222
      }
    ]
  }
}