{
  "1": "ExLibris\nRapidILL\nRapid #: -21262142\nCROSS REF ID: 4485644170007446\nLENDER:\nBORROWER:\nTYPE:\nJOURNAL TITLE:\nUUM (University of Utah) :: Marriott Library\nEZ9 (University of Exeter) :: Electronic\nArticle CC:CCL\nLe Muséon\nUSER JOURNAL TITLE: Museon\nARTICLE TITLE:\nARTICLE AUTHOR:\nLe roman épistolaire classique conservé dans la version de Salim Ab I-'Ala\nMario Grignaschi\nVOLUME:\nISSUE:\nMONTH:\n80\nYEAR:\n1967\nPAGES:\n211 - 264\nISSN:\n0771-6494\nOCLC #:\nProcessed by RapidX:\n9/13/2023 3:31:19 PM\nThe copyright law of the United States (Title 17, United States Code) governs the making of photocopies or other\nreproductions of copyrighted materials. Under certain conditions specified in the law, libraries and archives are authorized to\nfurnish a photocopy or other reproduction. One of these specified conditions is that the photocopy or reproduction is not to\nbe \"used for any purpose other than private study, scholarship, or research\". If a user makes a request for, or later uses, a\nphotocopy or reproduction for purposes in excess of \"fair use\", that user may be liable for copyright infringement. This\ninstitution reserves the right to refuse to accept a copying order if, in its judgment, fulfillment of the order would involve\nviolation of copyright law.",
  "2": "University of Utah Marriott Library ILL\nILLiad TN: 1813627\nARTS AND THAT OUR SITE AREAS SETTIN\nSeptember 13, 2023\nBorrower: RAPID:EZ9\nLending String:\nJournal/Book Title: Le Museón\nVolume: 80\nIssue:\nMonth/Year: 1967\nPages: 211 264\nArticle Author: Mario Grignaschi\nArticle Title: Le roman épistolaire classique\nconservé dans la version de Salim Ab l-'Ala\nCall #: ARC DS1 .M87 v.80 1967\nNotes:\nBilling Category: Exempt\nMaxcost:\nDelivery Method: Send via Odyssey\nemail:\nEMAIL:\nShipping Address:\nNEW: Electronic\nILL Number: -21262142\nNOTICE WARNING CONCERNING COPYRIGHT RESTRICTIONS\nThe copyright law of the United States [Title 17, United States Code] governs the making of photocopies or the other reproductions\nof copyrighted material.\nUnder certain conditions specified in the law, libraries and archives are authorized to furnish a photocopy or other reproduction. One\nof these specified conditions is that the reproduction is not to be used for any purpose other than private study, scholarship, or\nresearch. If a user makes a request for, or later uses, a photocopy or reproduction for purposes in excess of fair use, that use may\nbe liable for copyright infringement.\nThis institution reserves the right to refuse to accept a copying order if, in its judgment, fulfillment of the order would involve\nviolation of copyright law. No further reproduction and distribution of this copy is permitted by transmission or any other means.",
  "3": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\nCONSERVÉ DANS\nLA VERSION ARABE DE SÂLIM ABÛ-L-'ALÂ'\nEn 1959, nous avions été chargé par le professeur R.Morghen,\nprésident de l'«< Istituto Storico Italiano per il Medioevo »>, de préparer\nune monographie sur la version latine du «Kitâb-as-siyâsa fi tad-\nbîri-r-ri'âsa, al-ma'rufi bi Sirr-al-asrâr», le seul «siyâsatnâmah >>\narabe connu du moyen âge occidental. En dépit de son manque\nd'originalité - Steinschneider l'avait même défini «eine teilweise mise-\nrable Compilation philosophierender Mystik und vulgären Aberglau-\nbens >> 2-le << Sirr-al-asrâr» a eu, on le sait, parmi les Latins un succès\nextraordinaire, attesté par les deux cents manuscrits et plus existant\naujourd'hui encore dans les bibliothèques, et par les nombreuses\ntraductions dans les langues les plus diverses de l'Europe. De ce\nfait, Steinschneider lui-même l'avait admiscette œuvre méritait\nune étude particulière. Cependant nos travaux préparatoires avan-\ncèrent très lentement, surtout pour une raison d'ordre psychologique.\nTout en travaillant à recueillir et à collationner les textes des versions\narabes et des traductions en latin et en langues vulgaires, nous avions\nla sensation précise d'avoir affaire à un texte remanié par un écrivain\narabe relativement récent, qui aurait supprimé la partie proprement\npolitique de ce «siyâsatnâmah» pour y greffer de longs chapitres\nsur la magie, la médecine et la physionomie. Seuls les encouragements\nprodigués par le professeur Morghen nous ont empêché d'abandonner\nun travail que nous jugions stérile. Les nombreuses études modernes\nde cette œuvre, unanimes ou presque à attribuer le « Sirr-al-asrâr >>\nà Yuḥannâ-bnu Batrîq, nous aidaient fort peu. Aussi avons-nous\npris comme base de nos recherches le chapitre dédié à ce « siyâsat-\nnâmah» par Steinschneider dans son livre «Die hebräischen Ueber-\nsetzungen aus dem Arabischen », une véritable mine d'indications\n1 Publié par M. le prof. 'Adburraḥmân Badawi sous le titre\n,1954 Le Caire للنظريات السياسية في الاسلام\n2 STEINSCHNEIDER, Die Hebräischen Uebersetzungen aus dem Arabischen, p. 246.\n211",
  "4": "212\nM. GRIGNASCHI\nbibliographiques, qui nous amenèrent à concentrer notre attention\nsur deux oeuvres celle des «Ihwân-aş-şafa'» et le «Farâḥnâmah »\nde Manşûḥ Nawâli, un savant turc de la fin du XVIe siècle.\nL'étude du traité des «Ihwân-aş-şafâ» nous confirma définitive-\nment dans notre impression que le «Sirr-al-asrâr» ne pouvait être\nantérieur au XIe siècle. Il nous apparut que seule une erreur de mé-\nthode avait conduit à lui reconnaître une plus grande ancienneté.\nInfluencés, à leur insu, par la préface de cette oeuvre, les savants\nqui s'en étaient occupés, avaient toujours considéré la présence de\npassages parallèles au «Sirr-al-asrâr» dans les ouvrages des « Iḥwân-\naş-şafâ » et d'Ibn 'Abdi Rabbihi, comme la preuve que ces auteurs\nconnaissaient déjà notre traité pseudo-aristotélicien 3. Au fait, ce\nraisonnement devait être retourné et c'était au contraire l'auteur\ndu «Sirr-al-asrâr» qui avait puisé dans ces encyclopédies dans le\nbut de corser son propre texte 4.\nQuant au Farâḥnâmah de Manşûḥ Nawâlî, que nous avons étudié\nlors d'un long séjour à Istanbul en 1961, il se révéla comme une\ncompilation d'un caractère hétérogène, pour laquelle Nawâli avait\n3 Par ex. voir STEINSCHNEIDER, p. 257 et note 1076.\n4 Afin de l'établir, on n'a qu'à lire, dans la version de Manşûḥ Nawâli (ms. Hafiz\nef.-Süleymaniye 253, fol. 63 v), le début du bâb du Kitab-as-siyâsa fi tadbiri-r-ri'â-\nsa sur les qualités et le nombre des vizirs, ainsi que la manière de mettre à l'épreuve\nleur intelligence et leurs vues. L'auteur, qui assurément n'était pas un philosophe,\na cité en tête de ce bâble principe énoncé par les «Ihwân-as-safâ dans la le « risâla\ndu IIIe livre, savoir qu'il est indispensable de se connaître soi-même avant les choses\ndu monde (éd. de Bombay, t. III, p. 9, 1. 4-7). Après quoi, il a continué en copiant les\npages 7, 1. 24-fin; 8, 1. 1; 9, 1. 7-9; 11, 1. 27-fin; 12, 1. 1-2; 13, 1. 8-22, de cette même\n*risâla». De cette manière, il lui est arrivé, par mégarde, d'attribuer à l'âme universelle\nles puissances propres, d'après les Ihwân-as-safâ à l'âme végétative régissant le\nfoetus. De son côté, l'auteur du Sirr-al-asrâr a procédé exactement de la même\nfaçon. Il a ajouté aux extraits de l'encyclopédie des Ihwân-as-safà choisis par son\nprédécesseur un morceau de la page 8 (1. 1-18 et 20-26) de la même risâla»; il a replacé\nl'invitation à se connaître soi-même avant les choses du monde, à l'endroit où elle\nfigure dans l'encyclopédie; mais surtout il a omis les lignes 21-22 de la p. 13, peut-être\nparce qu'elles impliquaient le principe de la métempsychose. Enfin, il a ajouté à ces\npages la paraphrase de quelques extraits de la IVe risâla du III livre et de la Xe\nrisâla» du II livre. Mais il n'a pas remarqué l'erreur grossière qu'il y avait dans son\nmodèle et il a continué d'attribuer à l'âme universelle les puissances propres de l'âme\nvégétative!\n5 A la Bibliothèque du Saray, nous avons trouvé deux mss. de cette oeuvre : le ms.\nHazine 364 du scribe Meḥmed Bostânzâde, copié en 1050 h., et le ms. Emin Hazine.\n1349.",
  "5": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n213\nemployé des récits sur l'histoire d'Alexandre, récits du genre des\nlégendes recueillies par Bal'âmî et al-Mubaššir Ibn Fâtik, et un texte\ns'apparentant au «Sirr-al-asrâr», mais qui devait présenter des diffé-\nrences très remarquables. Or, nous avons eu la chance de retrouver\ndans le ms. 253 Hâfiz Efendi (Süleymaniye) la traduction turque\npar le même Nawâlî de ces légendes et de ce texte, intitulé « Kitâb-\nas-siyâsa fi tadbiri-r-ri'âsa» c'est-à-dire qu'il portait le titre qui,\ndans tous les mss arabes, figure en tête du «Sirr-al-asrâr ».\nIl nous apparut tout de suite que l'identité des titres n'était pas\nle fait d'une simple coincidence. On n'avait qu'à parcourir le livre\ntraduit par Nawâli pour se convaincre qu'il représentait la version\noriginaire du « Sirr-al-asrâr». Nous avons alors poursuivi nos recher-\nches dans les bibliothèques d'Istanbul dans l'espoir d'en retrouver\nle texte arabe. Elles restèrent sans succès, mais nous conduisirent\nà la découverte de deux autres volumes: le ms. Aya Sofya 4260 et\nle ms. Köprülü 1608, ce dernier, nous l'ignorions cependant à l'époque,\ndéjà étudié par Kraemer. Tous deux renfermaient un traité le « as-\nSiyasat-al-'âmmiya» qui se retrouve encore dans le ms. arabe 2422\nde la Bibliothèque Nationale de Paris. Bien entendu, ce dernier ms.\nn'avait pas échappé à Steinschneider; mais ce savant s'était fié à\nl'indication du catalogue, d'après lequel il s'agissait d'une simple\nvariante du «Sirr-al-asrâr». Par contre, déjà selon un examen super-\nficiel, la «as-Siyâsat-al-'âmmiya» se révéla être une version plus\nancienne encore du «Sirr-al-asrâr», et plus précisément la source\nde ce « Kitâb-as-siyâsa», que Nawâlî avait traduit en turc. Et qui\nplus est, dans le contexte du ms. Aya Sofya 4260, cette «as-Siyâsat-\nal-'âmmiya» acquérait une signification nouvelle. Elle venait con-\nstituer la pièce maîtresse d'un roman épistolaire arabe, dérivant,\nde toute évidence, d'un original hellénistique, rattaché de quelque\nmanière au Roman du ps.-Callisthène.\nDès lors, nous avons concentré notre attention sur ce dernier ms.\nSon étude nous prit un temps très long. Entretemps, la publication\npar M. le professeur Stern de son étude sur les traductions arabes du\nПepì кóσμov nous révéla l'existence à Istanbul du ms. Fâtiḥ 5323,\négal par son contenu au ms. Aya Sofya 4260, et attira notre attention\nsur les passages du «Kitāb at-tanbîh wa-l-išrâf» p. 202-203 et du\n«Kitab-al-buldân » d'Ibn-al-Faqih» p. 160. Et qui plus est, elle nous\n6 Le Muséon, 77 (1964) (The Arabic Translations of the Pseudo-Aristotelian Treatise\n*De Mundo»).",
  "6": "214\nM. GRIGNASCHI\npermit d'examiner à nouveau le résultat de nos propres recherches\nà la lumière des conclusions, auxquelles le professeur Stern était\nparvenu. Dès lors, il nous a semblé nécessaire de prouver ce que nous\navions considéré comme évident: savoir que les deux mss. d'Istanbul\nne nous ont pas transmis un simple recueil d'un auteur musulman\nde lettres ps. aristotéliciennes, mais bien un roman épistolaire hellé-\nnistique remanié par un écrivain arabe de l'époque omayyade. Cette\ndémonstration constituera l'objet de notre article. Aussi, pour n'en\npas dépasser les limites, laisserons-nous de côté les problèmes, tout\naussi importants, que cette œuvre pose au point de vue des contacts\nentre la naissante civilisation arabe et les anciennes cultures de l'Iran\net du monde classique ?.\nCe travail\nc'est pour nous un devoir et un plaisir de le souligner\nà cette place a été rendu possible par la bienveillance des Direc-\nteurs des principales bibliothèques d'Europe et d'Istanbul, qui ont\nmis à notre disposition les reproductions de mss indispensables à\nune telle recherche. En particulier, nous avons contracté une lourde\ndette de reconnaissance envers la direction de la Bibliothèque Vati-\ncane, à laquelle nous avons demandé non seulement les photographies\nde ses manuscrits, mais aussi les microfilms des livres que nous dési-\nrions consulter. De même, nous devons remercier ici notre ami, le\nprofesseur Muḥammad Hamidullah qui a eu l'amabilité de faire,\npour notre compte, des recherches dans les nombreux traités que\nnous n'avions pu trouver dans les bibliothèques d'Italie.\nI\nL'œuvre que nous nous proposons d'étudier dans cet article nous\na été conservée -nous venons de le dire par deux mss. Le premier,\nd'origine syro-égyptienne, fut achevé le 11 dû-l-hiğğa 714 h. et\nconstitué en << waqf» à la Bibliothèque Aya Sofya par le << Sulțân\nbn-as-sultan Mahmûd», ainsi que le déclare une apostille sur le pre-\nmier feuillet, par le « Sulțân Mahmûd bnu-Mustafâ » d'après la « țugrâ »\ndu sceau, c'est-à-dire le Sultan Mahmûd I. Le second ms., écrit en\n7 Voir notre article Les 'rasd'il 'Aristátálisa 'lá-l-Iskandar de Sálim Abu-l-'Ala'\nel l'activité culturelle à l'époque omayyade, dans le BEO, XIX.\n1 Ce codex cartaceus avait appartenu en 900 h. à un certain 'Abd-al-Qadir et à sa\nfamille habitant au Caire, ainsi que l'indiquent des notes apposées au recto du premier\nfeuillet non numéroté et au f. 145v.",
  "7": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n215\n716 h. que, nous connaissons seulement par un microfilm mis à notre\ndisposition par la Direction de la Bibliothèque Süleymaniye avec\nsa libéralité coutumière, avait été constitué en «waqf» à la Biblio-\nthèque de la Mosquée Fâtih par le même Mahmûd. On n'y retrouve\naucune indication sur le lieu de provenance, mais d'après une note\ndu recto du premier feuillet, il avait appartenu à la Bibliothèque\nde Bayazit II. Les mss Aya Sofya et Fâtiḥ contiennent tous deux\nles mêmes œuvres un choix des « conversations et de la correspon-\ndance entre Alexandre et son maître Aristote», au total seize pièces\nprécédées parfois d'une courte introduction, et un recueil de récits\nd'origine différente, se rapportant toujours à Aristote et à Alexandre.\nAu f. 122v du ms. Aya Sofya et au f. 109v du ms. Fâtiḥ, c'est-à-dire\nà la fin du dernier morceau des « Conversations et de la correspondance>>,\nse lisent trois notes presque identiques, si bien qu'on serait tenté\nde considérer le ms. Fâtiḥ comme une copie de celui de l'Aya Sofya :\n(1) كان على النسخة المنقولة هذه منها ما هذه صورته. هذا ما\nوجدته من محاوراته المسطورة و رسائله الأعلام المشهورة بخط المرجى\nبن المؤمل الكاتب النفري و ذكر أنه قابل بها عدة نسخ و صححها و\nقال ينبغي للقارئ لها أن لا يعجل إلى شك فيما يراه فله معنى صحيح\nيوضحه التأمل و مرت بي في النسخة زهقات و سهو أصلحتها بقدر\nفهمي و اجتهادي و ما نسبته إلا إلى طغيان القلم . فإن مر بالقارىء\nلهذه شيء من الزلل فا المرء معصوم من ذلك فليصلحه و يصفح عنه.\nوكتبها علي بن محمد بن أحمد بن القاضي الهمذاني الكاتب الفارفي\nحامدا لله على نعمه و أفضاله و فرغ من نقلها يوم الأربعاء مستهل\nالمحرم سنة إحدى وتسعين و أربع مائة لهجرة الرسول عليه السلام.\nوالحمد لله رب العالمين والعاقبة للمتقين ولا عدوان إلا على الظالمين",
  "8": "216\nM. GRIGNASCHI\nوصلواته على أكرم خلقه و خاتم رسله سيدنا محمد وآله و عترته\nالطاهرين.\n(۲) وقع إلى كتاب بعد فراغي من نقل الرسائل فيه الرسالة\nعن الاسكندر إلى والدته يعزيها و ألفاظ و حكم فلسفية لأرسطو\n(فاتح لأرسطوطاليس) و مواعظ و آداب رأيت اضافتها إلى رسائله.\n(۳) قوبل بها الأصل وصححت و ما وجد فيها من شيء\n.\nشك\nفيه أصلح باتفاق نسخة أخرى. فيجب أن لا يعجل إلى شك فيما\nيرى فيها.\nDans la copie, d'après laquelle on a transcrit la présente, il y avait des notes,\ndont voici la reproduction 2:\nI. «Voilà ce que j'ai trouvé des conversations [d'Aristote] mises par écrit et de\nses lettres, un texte (?) célèbre de la main du scribe de Niffar, Muraggå-bn-al\nMu'ammal. Celui-ci déclarait avoir collationné cette œuvre avec plusieurs manuscrits\net l'avoir corrigée. Il disait :\nLe lecteur ne doit pas se hâter de mettre en doute ce qu'il lit. Dans ce que j'ai\ncopié, il y a un sens exact que la réflexion éclaircira. Quand j'ai trouvé dans [ma]\ncopie des contresens et des négligences, je les ai corrigés, autant que mon intelli-\ngence et mes capacités me le permettaient. J'ai corrigé de même les fautes que\nje considérais comme des ,lapsus calami' Si des fautes de ce genre apparaissent\nau lecteur-ce que personne n'arrive à éviter complètement il lui appartient\nde les corriger et de les enlever ».\n-\nAli-bn-Muhammadi-bn-Ahmadi-bn-al Qadi-l-Hamadani, le scribe de Miyafa-\nraqin, l'a écrite en rendant grâce à Dieu pour la faveur de sa générosité à son égard.\nEt il a achevé sa copie le premier mercredi du mois de muharram de l'année 471 h.\nLa louange appartient à Dieu seigneur du monde, la récompense aux pieux,\nla haine seulement aux oppresseurs [f. 123v]. Et que la prière de Dieu soit sur la\nplus noble de ses créatures, le sceau de ses prophètes, notre seigneur Muḥammad,\nsur sa famille et sur Sa sainte maison ».\nII. Alors que j'avais déjà achevé de copier les lettres, un autre livre m'est\ntombé dans les mains, où il y avait une lettre d'Alexandre à sa mère pour la con-\nsoler; des enseignements et des sentences philosophiques d'Aristote; des exhor-\nDans la copie de . كان على نسخة الأصل هذا ما : 100 .Ms. Fatih, fol 2\nl'original il y avait : Voilà ce...».\net encore وايضا Dans le ms. Fatih cette note est introduite par la remarque 3",
  "9": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n217\ntations et des instructions. Aussi ai-je jugé convenable de les ajouter à ses lettres» 4 5.\nIII. Note marginale au f. 123r du ms. Aya Sofya.\nCette copie fut collationnée et corrigée d'aprés l'original et ce qu'on y a trouvé\nde douteux a été corrigé d'après une autre copie. Le lecteur ne doit pas se hâter\nde mettre en doute ce qu'il lit.\nL'absence ou presque de variantes, le fait que la note marginale\ndu ms. Aya Sofya se retrouve dans le texte du ms. Fâtiḥ où elle est\nintercalée entre les notes I et II, semblerait établir la dépendence\ndu ms. Fâtih de celui de l'Aya Sofya. Toutefois, en examinant les\ncorrections marginales aux textes de la «as-Siyasat-al-'âmmîya »,\nde la «<lettre d'Alexandre à sa mère» et du «Habar-ibtidā'i ta'limi\nArisțâțâlîsa» dans les deux mss, corrections qui sont toutes de la\nmain de nos copistes, nous avons relevé des anomalies. Par exemple,\ndans huit cas, le ms. Fâtiḥ a, dans son texte, les mêmes leçons et,\ndans les marges, les mêmes variantes que le ms. Aya Sofya. Il serait\ndéjà difficile d'admettre qu'un scribe aussi soigneux que celui du\nms. Fâtiḥ ait copié les leçons erronées du ms. Aya Sofya sans s'aper-\ncevoir tout d'abord des corrections fort lisibles dans les marges. Mais\nil y a plus dans trois passages dont l'un dans le « Habar ibtida'i\nta'limi Arisṭāṭālisa»\n-\n-\nle ms. Aya Sofya indique, en marge, des\n4 Voir les incipit de ces morceaux dans l'appendice.\n5 Dans cette dernière partie, on rencontre de nouveau deux notes du même copiste.\nLa première, au fol. 132r du ms. Aya Sofya et au fol. 121v du ms. Fâtiḥ, clôt les chapitres\nهذا الذي وجدته من كلام أرسطو و الحمد لله رب العالمين .IIIII et TV\nوصلواته على أكرم خلقه سيدنا محمد و آله و عترته الطاهرين وسلامه\nVoilà ce que j'ai trouvé des sentences d'Aristote. La louange appartient à Dieu Sei-\ngneur du monde et que Sa prière et Son salut soit sur la plus noble de ses créatures,\nnotre Seigneur Muḥammad, sur Sa famille et sur Sa sainte maison ». La deuxième, au\nfol. 134r du ms. Aya Sofya, est placée sous la rubrique Risalatu Abi 'Ali al Hasan\nيقول كاتبها كان الغرض في نقلها : .ibn Muhammad al Muzaffar al Hatim etc\nلألفاظ أرسطو و كلامه في الحكمة ليضاف إلى ما تقدم من رسائله ولم\nCelui qui a copié cette risala» dit: On l'a rattachée aux paroles\net aux sentences d'Aristote sur la sagesse, afin qu'elle soit ajoutée aux lettres précé-\ndentes et je n'ai cru devoir l'enlever de sa place. La même note figure au fol. 123r\ndu ms. Fâtih, mais on a omis les paroles Celui qui a copié cette risâla dit». Enfin une\ntroisième note est écrite en marge du fol. 145r du ms. Aya Sofya, à la fin de cette même\nCette copie a 6th collationnée قوبلت بالأصل ، صححت بقدر الطاقة : risala\navec l'original et a été corrigée dans les limites de [mes] capacités ». Elle n'a pas de pen-\ndant dans le ms. Fâtih.",
  "10": "218\nM. GRIGNASCHI\nvariantes meilleures, qui, dans le ms. Fâtih, se retrouvent dans le\ntexte. Néanmoins, dans ces trois cas, le scribe de ce dernier manuscrit\na, par la suite, rétabli dans les marges les leçons considérées comme\nerronées dans le ms. Aya Sofya!\nCes faits, en apparence contradictoires, ne peuvent avoir, ce nous\nsemble, qu'une seule explication. Le ms. Fâtiḥ 5323 n'est pas une\ncopie du ms. Aya Sofya 4260. Tous deux dérivent plutôt, à travers\nplusieurs intermédiaires, d'un archétype commun, celui du scribe\n'Ali-bnu Muḥammad de Mâyafâraqîn, et ils ont été corrigés à l'aide de\ncopies différentes de ce même archétype. C'est seulement de cette\nmanière qu'on arrive à comprendre le choix de leçons opposées par\nles deux copistes au moment de la revision de leur propre travail.\nNous nous sommes arrêté sur les rapports entre ces deux manuscrits\nen vue de l'interprétation des notes qu'on retrouve à peu près iden-\ntiques dans les deux volumes. En effet, après avoir constaté l'in-\ndépendance du ms. Fâtiḥ de celui de l'Aya Sofya, il en résulte aussi\nque les notes I et II, ne peuvent appartenir aux copistes de nos ms.,\nmais doivent remonter au scribe de l'archétype 'Ali-bnu-Muḥammad-\nal-Fâriqi. Mais alors, l'interprétation des notes,, qu'on retrouve\ndans nos mss, ne prête plus à équivoque ce fut 'Ali-bnu-Muḥammad\nqui ajouta au recueil de lettres ps. aristotéliciennes les récits sur\nAristote et Alexandre qui figurent dans les deux volumes et appar-\ntiennent donc à une anthologie du début du Ve siècle de l'hég. 7.\nPar contre, le choix de ces lettres n'a pas été l'oeuvre d'Ali-bnu-\nMuḥammad pas plus que de Murağğâ-bnu-l-Mu'ammal. En effet\nMurağğâ possédait plusieurs exemplaires de ce choix, lequel remonte\ndonc à une époque encore plus ancienne.\nDes seize morceaux de la correspondance entre Alexandre et Aris-\ntote conservés dans nos mss, trois -notons-le en passant - étaient\ndéjà connus. Les «conseils d'Aristote» se retrouvent dans la « al-Hik-\n6 On attribuera de même à 'Ali-bnu Muhammad les notes aux chapitres V et VI\nde la deuxième partie. Par contre, la note III et celle du dernier fol. du ms. Aya Sofya\nappartiennent sans aucun doute à un lecteur qui avait collationné une fois de plus le\ntexte de 'Ali-bnu Muhammad avec l'exemplaire de Murağğâ-bnu-Mu'ammal. Quant\naux corrections qui figurent dans les marges du ms. Aya Sofya, elles peuvent difficile-\nment remonter à cette première revision. A notre sens, elles sont plutôt l'œuvre du\ncopiste qui, évidemment, a corrigé son propre travail à l'aide d'un autre ma. dérivant\ntoujours de celui de 'Alf-bnu Muḥammad.\nElle contient une risâla de Muḥammad al Hasan al Hâtimi mort en 998 (voir\nBROCKELMANN, GAL, I, 88).",
  "11": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n219\nmat-al hâlida»; ils ont été publiés par Cheikho d'après le ms. Vatican\narabe n. 408 et récemment par M. Badawî dans son édition critique\nde l'œuvre de Miskawayh. L'e Epître sur l'Ethique», conservée dans\nle ms. Paris B.N., ar. chrét. 132, où elle porte le titre « maqâla fî-l-\ntadbir», a été de même publiée par Cheikho, qui a donné aussi une\ndeuxième édition de la lettre d'Aristote à Alexandre conservée dans\ndes feuillets rattachés au ms. Vatican arabe 408, et que Lippert avait\ndéjà éditée et traduite sous le titre de repi Baoλeías. Mais le ms.\nVatican arabe 408 contient un texte beacoup plus court que celui\ndes mss Aya Sofya et Fâtih. Selon toute vraisemblance, il s'agit\nd'un résumé dû à quelque copiste qui ne connaissait que la réponse\nd'Aristote. En effet, cette dernière circulait de bonne heure isolée,\ncar on la retrouve, dans sa forme complète, avec « l'Épître sur l'Éthique»\ndans deux mss de la Bibliothèque Aya Sofya, le ms. 2890 du 541 h. ⁹\net le ms. 2884 beaucoup plus récent.\nTous ces mss conservant des pièces séparées de notre œuvre ne\nprésentent de l'intérêt que pour une édition critique des textes. Par\ncontre, deux autres mss apportent des lumières nouvelles sur l'his-\ntoire de ce recueil de lettres ps. aristotéliciennes. Ainsi, le ms. Köp-\nrülü 1608, une copie de la fin du XVIe siècle, voire du début du XVIIe\nsiècle, d'une ancienne anthologie-laquelle ne contenait aucune pièce\npostérieure au XIe siècle nous a conservé l'entière « as-Siyasat-al-\n'âmmiya»; la correspondance sur les nobles perses faits prisonniers;\nla lettre d'Alexandre demandant à Aristote un traité sur le gouver-\nnement et la réponse du philosophe, intitulée ici « De la manière de\n8 Cheikho\nY, p. 50. Sur la base d'une apostille du copiste,\nCheikho en attribuait la traduction à 'Isâ-b. Abi Zur'a (946-1008 ère chr.). Nous avons\ncollationné le texte de Cheikho avec ceux des mss Aya Sofya 4260, 2884 et 2890. En\ndépit du nombre très élevé des variantes, il nous est apparu que le ms. de Paris ne nous\na pas conservé une nouvelle version de cette maqâla», mais bien un texte fort corrompu\ndérivant des rasâ'il». Dès lors, l'attribution de sa traduction à 'Isâ b. Abi Zur'a ne\nsaurait être retenue, puisque les rasâ'il étaient connues déjà au IIIe siècle de l'hég.\nAjoutons que le texte de cette lettre a été transcrit par Al-Mubaššir dans le chap. • Ah-\nbâr-Arisțâțâlis du Muhtar al Hikam, publié par M. Badawi.\nLe ms. Aya Sofya 2890 résulte de la réunion de deux volumes; le premier, du Kâtib\n'Ali b. 'Abdi-llahi-l-Hamawi, contient le Sirr-al-asrârs et date de 724 h. C'est donc le plus\nancien ms. de ce livre qu'on ait jusqu'ici retrouvé. Le deuxième volume, d'origine égyp-\ntienne, est mutilé. Il a été écrit par un certain Sulaymân 'Ali-l-Mutațabbib et, à la fin,\nوكان الفراغ من نسخها في شهر رمضان سنة ٥٤١. : on lit",
  "12": "220\nM. GRIGNASCHI\ngouverner les cités » 10. Et ce titre mérite toute notre attention, car\nprobablement il dérive de l'original grec. Mais, surtout, ce ms. nous\na conservé l'abrégé du nepi кóσμov qui, à l'origine, figurait dans\nnotre correspondance entre Alexandre et Aristote » 10bis.\nTout aussi intéressant est le ms. Paris B.N. 2422, bien qu'il contienne\nla seule «as-Siyasat-al-'âmmîya ». Il s'agit d'un ms. du début du\nVIIe siècle de l'hég. qui, vers le milieu, présente une large lacune;\nmais il ne dérive pas du choix de lettres qu'on rencontre dans les mss\nAya Sofya et Fâtiḥ 11. Ainsi il nous a conservé des variantes remon-\ntant en partie à l'œuvre originale. Nous apprenons par exemple que\nl'auteur de notre œuvre écrivait « Flâtûn » et «Für » au lieu d'« Iflâțân »\net de «Fûz»; «Iksandar» au lieu d'«Iskandar», une forme archaïque\nne se retrouvant, à notre connaissance, dans aucun autre texte arabe 12.\nDe plus, il indiquait le traité d'Aristote sur les mœurs par son titre\noriginal «Éthique à Nicomaque», titre ne figurant plus dans les mss\nAya Sofya et Fâtih, qui lui ont substitué celui de la version arabe\n«Kitâb-al-aḥlâq» 13. Enfin, le ms. de Paris nous a conservé les der-\nnières lignes de la «as-Siyasat-al-'âmmiya », dans lesquelles Aristote\ndéclare avoir répondu à une demande d'Alexandre.\nD'où l'importance de ce ms. pour l'histoire des lettres ps.-aristo-\nرسالة أرسطاطاليس إلى الاسكندر في سياسة المدن 10\n10bis Voir notre article dans BEO, XIX.\n11 Bien entendu, nous nous sommes posé le problème de l'origine des pièces conservées\ndans le ms. Köprülü 1608. Nous avons eu l'impression que l'auteur de cette anthologie\nne possédait pas un exemplaire complet des «rasâ'il», mais qu'il les connaissait à travers\nd'autres anthologies plus anciennes encore. Le ms. Köprülü fourmille de fautes, mais\nil nous a parfois conservé de meilleures leçons. Et qui plus est, il concorde assez souvent\navec les variantes qu'on retrouve dans les lettres d'Alexandre à Dârâ (Darius), aux\nArabes et à Fauz (Porus) appartenant à la as-Siyasat-al 'âmmiya et qui ont été\nreproduites dans le Kitâb-as-siyâsa fi tadbiri-r-ri'âsa » du début du Ve siècle de l'hég.\nDe ces lettres, Nawali nous a donné le texte arabe et la version turque. Il reste ainsi\nprouvé que ces variantes remontent à un exemplaire des rasâ'il au moins aussi ancien\nque celui de nos Morceaux choisis».\n•\n12 Par contre, ce ms. présente déjà l'altération du nom de Kuroš en Kâ'ûs (f. 14v).\nDans les autres ms. on retrouve tour à tour les formes\nfol. 29v et 48v; Fâtih fol. 26v et 42r) et\n13 Ms. Paris fol. 4v\nالأخلاق\nفي\nCe\n(recte\net\n(Aya Sofya\nSet (ms. Köprülü fol. 82r et 92v)\nals Is alians sill t\n; Aya Sofya fol. 20v; Fâtih fol. 21v :\npassage a été omis dans le ms. Köprülü.\nالكتاب",
  "13": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n221\ntéliciennes. D'ailleurs la «Siyâsat al-'âmmiya» en constitue la pièce\nmaîtresse, celle qui permet le mieux de se faire une idée de l'original\ngrec et à laquelle nous devrons nous adresser afin de tâcher d'établir\nl'époque de la traduction arabe.\nPour les buts de notre article, il nous suffira de nous arrêter briève-\nment sur le problème des titres et des introductions qui précèdent\nchaque pièce. Nous donnons en note ces titres d'après l'index qu'on\nretrouve au début des mss Aya Sofya 4260 et Fâtih 5323 14. Dans\nce dernier, le copiste leur a ajouté les « incipit » des différentes pièces,\ntandis qu'en marge un lecteur a transcrit de nouveau ces mêmes\ntitres en les abrégeant quelque peu et leur a ajouté (n. XVII) celui\nde la risâla» de Muḥammad b. al-Hasan-al-Hâtimi, comme si elle\nfaisait partie de ce recueil. Sur le recto du premier feuillet du ms.\n-\n1) في الحث على تعلم الفلسفة. - ٢ في استقدام أرسطو 14\n٤) رسالة أخلاقية. -\nلتعليم الاسكندر - (٣) جواب الاستقدام.\nه) عهد أرسطوطاليس للاسكندر (٦ تهنئة بفتح سقوثية وهي بلاد\nتهنئة بفتح انفیسان بلاد بابل - (۸) كتاب في\n-\nالمغرب.\nو استشارة الاسكندر في تدبير الملك\nالسياسة العامية مفصلا\nبقول مجمل\n-\n- ١٠) الجواب وتهنئة بفتح فارس - ١١) الاستشارة .1)\n١٢) الجواب يمنعه من ذلك -\n١٤) الذهبية في صفة العالم\nفي قتل ذوي الأخطار من الفرس. .\n-\n-\n۱۳) تهنئة بفتح أعمال خراسان\nوأنها أحسن من بيت الذهب المشاهد في بلاد الهند. - ٥١) رسالة\nشفاعية\n-\n(١٦) ما تخير من المراثي\nI. De l'incitation à l'étude de la philosophie; II. De la demande faite à Aristote d'in-\nstruire Alexandre; III De la réponse à cette demande; IV. L'Epitre sur l'Éthique;\nV. Les conseils d'Aristote à Alexandre; VI. Les félicitations pour la conquête de la Scy-\nthie, et c'est un pays de l'Occident; VII. Les félicitations pour la conquête d'Anfisân,\nle pays de Babylone; VIII. Le livre détaillé sur le gouvernement du peuple; IX. Con-\nseils demandés en termes généraux par Alexandre sur le problème du gouvernement\ndu Royaume; X. La réponse et les félicitations pour la conquête de la Perse; XI. La\ndemande adressée à Aristote à propos de la mise à mort des notables de Perse; XII. La\nréponse, dans laquelle il lui défend une telle mesure; XIII. Les félicitations pour la\nconquête des provinces du Khorassan; XIV. La lettre en caractère d'or sur la nature\ndu monde, laquelle est plus parfaite que le palais d'or, admiré par Alexandre dans le\npays de l'Inde; XV. Lettre de recommandation; XVI. Oraisons funèbres choisies.",
  "14": "222\nM. GRIGNASCHI\nكتاب الأحوال و الأخبار : Fatih figure aussi le prétendu titre du livre\nالاسكندرية و أخبار حكماء زمان الإسكندر المزبور في التواريخ\n«Le Livre des vicissitudes d'Alexandre, des traditions [sur sa vie],\net des notices sur les sages de l'époque d'Alexandre mentionné dans\nles traités d'histoire ».\nN'ayant à notre disposition qu'un microfilm, nous ne saurions\nnous prononcer sur le point de savoir si l'écriture est celle du copiste\nou du lecteur, dont nous venons de parler. En tout cas, ce qui est\ncertain c'est que le titre assez baroque du ms. Fâtiḥ correspond au\ncontenu de nos mss, qui ont ajouté aux «rasâ'il» (lettres) une antholo-\ngie de pièces se rapportant à Aristote et à d'autres philosophes. Mais\nil ne saurait appartenir aux «rasâ'il» elles-mêmes, où il n'est question\nque d'Alexandre et de son maître. Ces dernières devaient s'intituler\ntout simplement correspondance entre Aristote et Alexandre >>,\nainsi que l'indique une apostille, ajoutée par un scribe ottoman, au\ntitre du ms. Fâtih 15, apostille qui correspond presque textuellement\nà l'indication qu'on lit sur le premier feuillet, verso, du ms. Aya\nSofya 16. Il en résulte aussi que nos mss ne nous ont conservé que\n15\nيشتمل هذا الكتاب على مستحسن الرسائل التي دارت بين الاسكندر 1\nو أرسطاطاليس الحكيم لرسم خزانة العامرة السلطان الأعظم الأكرم\nملك رقاب الزمم ملجأ سلاطين العرب والعجم كهف المسلمين عون\nالفقراء والمساكين ابو الفتح السطان بن السلطان بايزيد بن محمد\nCe livre comprend les meilleures lettres échan ، بن مراد خان خلد الله سلطنته\ngées entre Alexandre et Aristote le Sage. Il appartient à la riche Bibliothèque du Sultan\ntrès grand, très savant, très miséricordieux, le Roi de fiers esclaves, le refuge des sultans\narabes et persans, le chef des musulmans, l'aide des pauvres et des faibles, le Sultan\nfils du Sultan, le Conquérant, le sultan Bayazid fils du sultan Mehmed, fils de Murad\nHân. Puisse Dieu faire durer son règne ».\nيشتمل هذا الجزء على مستحسن ما وجد من الرسائل و المحاورات 16\nالتي دارت بين الاسكندر ذي القرنين الملك وبين معلمه أرسطوطاليس الحكيم\nو ما تخير من المراثي في الاسكندر قول جماعة الفلاسفة و قوم من\n-Cette partie comprend les meilleurs nor بطانته يذكر مفصلا إن شاء الله تعالى.\nceaux qu'on a retrouvés des lettres et des conversations entre le roi Alexandre Du-l\nQarnayn et son maître, le sage Aristote, et ce qu'on a choisi des oraisons funèbres pour\nAlexandre. Ce sont les sentences d'un groupe de philosophes et de personnes de sa\nsuite. On les citera in extenso, s'il plaît à Dieu ».",
  "15": ":\nLE ROMAN ÉPISTOLAIRE CLASSIQUE\n223\ndes Morceaux choisis» de cette « Correspondance ». Or, une œuvre\nde ce genre est mentionnée par Ibn-al-Nadim, qui, dans son << Fihrist »>,\ndéclare Sâlim, surnommé Abû-l-'Alâ', secrétaire de Hišâm ibn\n'Abdi-l-Malik. Il était allié à 'Abd-al-Hamîd. C'était un écrivain\nfort éloquent et accompli. Il a traduit les lettres d'Aristote à Alex-\nandre. On les a traduites pour lui et il les a mises en état. Son recueil\nde lettres comprend environ cent feuillets » 17.\nBien entendu, nous ne nous cachons pas que le simple rapproche-\nment entre ce paragraphe du « Fihrist» et les indications de nos deux\nmss ne suffirait pas à attribuer la paternité de ces «rasâ'il » à Sâlim\nAbu-l-'Alâ'. Cependant un examen minutieux de la pièce VIII, la\n<as-Siyâsat al-'âmmiya» nous a permis de recueillir une longue\nsérie de passages qui confirment cette attribution. Il nous suffira\nici d'en indiquer les plus concluants que nous avons examinés et\npubliés dans notre article sur cette œuvre au point de vue de la civi-\nlisation omayyade. L'auteur arabe, par exemple, affiche au grand\njour son mépris pour les affranchis et pour les esclaves; quand il\nlui arrive de parler des hauts personnages, dont dépendait la vie du\nCalife, il ne mentionne guère le vizirat. L'armée arabe, qu'il décrit,\navait un caractère aristocratique, les « sufûf» constituaient sa forma-\ntion de bataille, les « kardûsa» n'étant mentionnées que comme des\nunités tactiques de la cavalerie turque, et les combats commençaient\nencore par les duels entre champions». L'ennemi que cet auteur\ncraignait le plus, c'étaient les Turcs. Quant aux Khorassaniens, ils\napparaissent dans cette «siyâsa» comme un peuple guerrier, dont\nil importait au calife de gagner la bienveillance. Nulle part on nous\ndit que cette population était acquise à la cause de la dynastie, ainsi\nque ce fut le cas à l'époque abbasside. Enfin, l'auteur de cette << siyâsa >>\ndevait occuper une place élevée à la cour de son souverain et nous\nsavons de Tabarî, d'Al-Kindi et d'al-Mas'udi qu'en fait Sâlim Abû-l-\n'Alâ' jouissait de la pleine confiance de Hišâm b. 'Abdi-l-Malik.\nChaque pièce, disions-nous, est encadrée par une introduction et\nM. Stern a déjà publié celle qui précède le «De Mundo ». Ces intro-\nسالم ويكنى أبا العلاء كاتب هشام بن عبد : 117 .Fihrist, p 17\nالملك و كان ختن عبد الحميد و كان أحد الفصحاء البلغاء و قد نقل\nمن رسائل أرسطاطاليس الى الاسكندر و نقل له و أصلح هو له رسائل\nمجموعة نحو مائه ورق",
  "16": "224\nM. GRIGNASCHI\nductions présentent des caractères fort différents. Ainsi, nous retrou-\nvons au début du livre «Un chapitre de la biographie d'Alexandre :\ncomment le royaume lui parvint», chapitre qui appartient, sans\ncontredit possible, à Sâlim Abû-l-'Alâ' et qui révèle comment cet\nauteur connaissait déjà une version arabe de la «Biographie d'Alex-\nandre du ps. Callisthène 18. De même l'introduction à la pièce XIV\n(la «Lettre du Palais d'Or ») dérive, ainsi que M.Stern l'a démontré,\nde la description du temple de Dionysos à Nysa qu'on retrouve dans\nles versions syriaque et arabe du ps. Callisthène 19. On attribuera\nencore à cet auteur arabe le court début des lettres XI et XII qu'il\na ajoutées, tout comme l'épître XIV, aux morceaux d'origine classi-\nque 20. Par contre, les autres introductions doivent remonter à\nl'épistolographe grec car elles renferment des renseignements néces-\nsaires pour l'intelligence des pièces elles-mêmes, renseignements\nqu'il n'aurait pas été facile à Sâlim de tirer de leur texte. Sans doute,\nl'écrivain arabe s'est borné à les remanier. La preuve, nous la voyons\ndans l'introduction de la lettre XIII 21. En effet, la lettre elle-même\nne mentionne nullement le Khorassan et ils est évident que, dans\nl'original, il n'était pas question d'une conquête de cette province,\nmais bien de l'expédition au bout du monde que, d'après les versions\nẞ et y du ps. Callisthène, Alexandre aurait entreprise au lendemain\nde la conquête de la Perse.\nTenons fermes ces quelques résultats qu'une analyse sommaire\ndes introductions nous a permis d'obtenir et qui nous seront une\n18 Nous donnons le texte de chapitre en appendice à notre article du BEO, XIX.\nSans aucun doute, le dernier paragraphe de ce «fasl min habari-l-Iskandar appartenait\nà l'origine à notre Roman épistolaire et servait d'introduction à la première lettre.\n19 Un résumé de l'ancienne version arabe nous a été conservé par la Nihâyat-al-\n'arab fi 'ahbari-f-Furs wa-l- 'Arab, où nous retrouvons l'épisode du temple de Nysa\n(ms. Cambridge Qq 225, fol. 75r).\n20 Voir Stern, p. 191, n. 10 et notre article dans le BEO, XIX.\nوسار الاسكندر عن أعمال فارس فلما حصل على رأس حد : 95 .Fol 21\nالبرية بين كرمان و خراسان قطعها في نفر يسير و ظهر على الخراسانية\nفملك بلادهم فكتب اليه أرسطو يهنئه باستيلائه على أعمال خراسان.\n* Alexandre s'avança au delà des provinces de la Perse et lorsqu'il parvint au bout\nextrême de la terre entre le Karmân (sic) et le Khorassan, il le traversa avec une petite\ntroupe d'hommes et triompha des Khorassaniens; alors Aristote lui écrivit pour le\nféliciter de la conquête des provinces du Khorassan».",
  "17": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n225\naide lors de l'étude de la pièce XVI. Désormais nous pouvons aborder\nle thème central de cet article, savoir la démonstration que les pièces\nI-X, XIII, XV et XVI de nos morceaux choisis» appartiennent\ntoutes à un seul roman épistolaire grec.\nEn ce qui concerne les morceaux III, V, VIII, IX, X et XIII, qui\nreprésentent les deux tiers du recueil, cette preuve nous est donnée\npar les sentences ps.-homériques, qu'on y rencontre, Le professeur\nCorbatto, de l'Université de Trieste, qui a eu la bonté de les examiner,\nnous a fait remarquer comment, dans deux ou trois cas, on croit\npercevoir un écho lointain du texte de l'Iliade et de l'Odyssée.\nCes sentences, que le traducteur arabe a considérées comme des\nvers parce qu'elles provenaient du « poète Homère», rappellent plutôt\nles perappáσeis de l'Iliade et de l'Odyssée. Dans les derniers siècles\nde l'hellénisme, on le sait, l'imitation de ces poèmes, qui auparavant\nn'avait été qu'un simple exercice dans les écoles de rhétorique, était\nparvenue à la dignité d'un genre littéraire indépendant et avait donné\nnaissance aux μεταβολαί de Démosthène le Thrace 2, aux μετα-\nποιήσεις de Sopatross et aux μεταφράσεις de Procope de Gaza24,\nrhéteur auquel le spectacle de la gravité des chameaux », notée\ndans notre sentence 11, devait être familier. La perte presque totale\nde ces oeuvres empêche toute tentative d'identifier la source de nos\nsentences et d'ailleurs elles peuvent fort bien être l'oeuvre de l'épis-\ntolographe lui-même. Par contre, elles ne sauraient aucunement\navoir été interpolées par Salim Abu-l-'Alä'.\nAussi donnons-nous en appendice le texte et la traduction des\nvingt citations ps.-homériques qu'on rencontre dans nos deux mss,\nparce que nous les considérons comme la preuve la plus concluante\ndu fait que les pièces où elles figurent, et en particulier la « as-Siyasat-\nal-'âmmiya», remontent à un original grec et faisaient partie de\nla même œuvre. A cet endroit, il ne sera pas superflu d'avertir que\ndans nos morceaux choisis» nous trouvons encore un vers d'Hésiode\nqui correspond presque exactement au texte grec 25, un vers inconnu\n22 Voir GEHRMANN, Demosthenis Thracis ueraßodŵr 'Odvooeias fragmenta, Königsberg\n1890 (diss.).\n23 Voir St. GLOCKNER, dans Rheinisches Museum, 1910.\n24 Voir A. BRINKMANN, ibid., 1908, et Photius, Bibliotheca, n. 160.\n25 Travaux et Jours, vers 216-217 : ὁδὸς δ᾽ ἑτέρηφι παρελθεῖν — κρείσσω ἐς τὰ δίκαια.\nان فعل الخير في الجملة أفضل من فعل الشر : Aya Sofya, fol. 90 r\n裴 Bref, il vaut mieux faire le bien que le mal».",
  "18": "226\nM. GRIGNASCHI\nd'Euripide 26 et enfin un vers de Pindare, dans lequel le professeur\nCorbatto a reconnu la traduction du fragment 169 Snelle 27.\nQuant aux morceaux I, II, VI et VII, où l'on ne rencontre pas ces\ncitations ps.-homériques, nous avons d'autres preuves de leur origine\nclassique et de leur appartenance à notre «Roman épistolaire ».\nD'ailleurs, l'absence de ces prétendus vers pourrait être causée par\nla technique de Salim Abû-l-'Ala'» qui avait l'habitude de citer de\nlongues parties de l'original presque « in extenso», quitte à en omettre\nd'autres 28. Dès lors, il risquait de retrancher les morceaux contenant\ndes vers, ce qui en effet lui arriva dans l'abrégé du Пepì кóσμov,\noù les deux derniers chapitres, précisément ceux qui renferment des\npassages de l'Odyssée, sont omis.\nEn ce qui concerne la première lettre d'Aristote à Philippe et la\nréponse du Roi (pièces I et II), il est à peine nécessaire d'apporter\nune preuve pour établir qu'elles appartiennent au «Roman épisto-\nlaire», car une citation ps.-homérique figure, nous l'avons dit, dans\nla IIe lettre adressée à Philippe (pièce III), et ces missives consti-\ntuent un tout. Ajoutons encore que, dans la pièce I, nous lisons qu'Alex-\nandre devait acquérir la sagesse d'Anäsūn, de Furflus et d'Alfasaris.\nOr, il est clair que l'auteur arabe avait trouvé ces noms dans l'ori-\nginal, car il ne savait manifestement rien de ces personnages 20. De\nplus, dans cette lettre, on rencontre un rónos remontant jusqu'à\nProdicus si Héraklès avait cherché seulement le plaisir et l'amour,\nil n'aurait jamais exécuté les douze travaux qui l'ont rendu célèbre.\nDes passages tout aussi probants se retrouvent dans les autres\nlettres. Dans les «Félicitations pour la conquête de la Scythie» (pièce\nVI), Aristote rappelle comment Darius (I) n'était pas parvenu à\n28 Aya Sofya f. 90r.:\nقول اوريفيذس ان كان ينبغي لأحد أن يثب\nParole d'Euripide: S'il appartenait à quelqu'un de\nfaire preuve d'une telle bravoure, c'est à lui d'en donner la preuve ».\n27 Nous devons à M. Corbatto, professeur à l'Université de Trieste, de nous avoir\nsignalé l'existence de ce fragment, ainsi que les analogies entre les vers ps-homériques\ncités par notre auteur et le texte classique. Fr. 169 Snelle: vópos ómávrwv Baouleus\nθνατῶν τε καὶ ἀθανάτων ἄγει δικαιῶν τὸ βιαιότατον ὑπέρτατα χειρί.\nان السنة تؤول بالأمور كلها إلى العدل وهي التي تحقق الحق لها قوة قوية\n• En vérité la loi reconduit toutes les choses à ce qui est juste; elle réalise la justice et\npossède la puissance ».\n28 Voir notre aperçu du résumé du Пepi kóoμou dans BEO, XIX.\n20 Ms. Fâtiḥ ; Aya Sofya, fol. 4 b Hiéron, Périclès et Phalaris?",
  "19": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n227\nvaincre le peuple de cette région, événement que les historiographes\narabes, pour autant que nous sachions, ont toujours ignoré 30.\nDe même, on ne saurait imaginer un écrivain arabe composant\nla Lettre d'Aristote à Alexandre pour le féliciter de la conquête\nd'Anfisân» (pièce VII). En effet, seul un auteur classique pouvait\nsavoir ou imaginer que les Grecs avaient soupçonné Alexandre de\nvouloir imposer sa domination sous le prétexte de combattre les\nPerses, ainsi que certains de leurs « princes » l'avaient fait par le passé.\nDes preuves de ce genre nous font malheureusement défaut pour\nles pièces IV, XV et XVI. Ce n'est pas que, à notre avis, leur origine\nhellénistique fasse de doute. La pièce IV, probablement en partie\nremaniée par Salim, met avec tant de vigueur l'accent sur la nécessité\nde la raideía, qu'il serait difficile de l'attribuer à un écrivain arabe\ndes premiers siècles de l'hég. De plus, elle se rapproche par ses argu-\nments à la pièce V et elle est rattachée si étroitement par l'introduc-\ntion aux autres lettres qu'on ne saurait douter de son appartenance\nau roman épistolaire.\n30 Aya Sofya, fol. 19 :\nوكفى بما صار اليه أهل سقوئية و ما نلتهم به عبرة\nفإن السقوثيين رجال أبطال و قد غزاهم دارا في جميع أهل آسية\nو هي اليوم أعمر ما كانت و أكثر أهلا وأراد استئصالهم فلم يقتدر على\nذلك و لا استطاع أن يحصرهم كما حصرتهم أنت و لم يبلغنا أن أحدا\nمن الملوك فيما مضى غلب على بلادهم وهم قد غلبوا على بلاد و آسية\nو بعض بلاد أورفي وثراقي و غيرها من بلاد الروم و أوغلوا فيها.\nأجمع\n* Il te suffira de songer au sort du peuple de Scythie. La victoire que tu as remportée sur eux,\ncomporte pour toi une leçon. En effet les Scythes sont des preux. Dârâ avait entrepris\nune expédition contre eux à la tête de l'Asie entière. Or la Scythie est aujourd'hui\nplus prospère et plus habitée qu'elle ne l'était à cette époque-là. Il voulait les détruire.\nMais il n'a pas pu réaliser son dessein. Il n'est pas parvenu à les cerner, ainsi que tu l'as\nfait. Nous n'avons pas entendu dire que quelque roi du temps passé ait conquis leur\npays. Eux, par contre, se sont emparés de tous les pays de l'Asie, de certains pays de\nl'Europe, de la Thrace de plus d'autres pays encore appartenant aux Rúm, et ils\nont pénétré jusqu'à l'intérieur de leur Empire. On ne saurait se soustraire à l'impression\nque les Scythes de l'épistolographe grec, lesquels étaient plus puissants que ceux du\ntemps de Darius I, n'étaient autres que les Huns. On comprendrait ainsi qu'il leur ait\nattribué d'une part la conquête de la Thrace et des incursions jusqu'à l'intérieur de\nl'Empire Romain, de l'autre la dévastation de l'Asie entière. Il faut sans doute penser\naux razzias des Houyounâ dans la Syrie, dont nous parle la chronique de Josué le Stylite,\net aux incursions des Sabirs dans l'Iran et dans l'Empire Byzantin.",
  "20": "228\nM. GRIGNASCHI\nDe son côté, la pièce XV, lettre d'intercession en faveur d'un cer-\ntain Arḥsâdîs ('Apžádns?) renferme des allusions aux interventions\nd'autres personnes en faveur de ce protégé d'Aristote. Assurément,\nelle n'a pas été inventée par Sälim qui, comme nous, ignorait tout\nde cet Arḥsâdîs. Cependant, rien ne prouve qu'elle ait fait partie\nde notre roman épistolaire. Tout au plus, pourrait-on dire qu'il n'est\nguère probable qu'on ait traduit en arabe une lettre aussi obscure,\nsi elle ne se trouvait pas dans un recueil d'épîtres ps.-aristotéliciennes.\nEt nous n'avons aucune raison de croire que les Arabes aient possédé\nd'autres romans de ce genre. Nul besoin d'ailleurs d'insister davan-\ntage sur ce morceau dont l'importance au sein de notre œuvre est\nnégligeable. Par contre, la pièce XVI revêt un intérêt exceptionnel\npour l'histoire du « Roman épistolaire » et de son influence sur la litté-\nrature arabe. Aussi le problème de savoir si elle a une origine classique\net, plus encore, si elle en fait partie, requiert-il une attention par-\nticulière.\nLa simple lecture de ce morceau, dont nous donnons la traduction\ndans l'appendice, suffit à établir quelques faits, savoir que nous\nne possédons qu'un choix des sentences prononcées par les philosophes\nà l'occasion de l'enterrement d'Alexandre 31; que ces sentences, dans\nles «rasâ'il», faisaient suite à une lettre d'Alexandre à Olympie et\nque cette lettre, à en juger par les deux passages cités dans l'intro-\nduction 2, était la même qu'on retrouve dans les « Apophtegmes >>\n31 On remarquera comment, dans nos mss, les sentences XII, XIII et XIV ont été\najoutées d'après un autre exemplaire des morceaux choisis». Elles sont introduites\npar l'observation d'autres sentences encore prononcées sur Alexandre et, de plus,\nles sentences VIII et XII ne sont que des variantes des sentences IV et IX.\nو لما اعتل الاسكندر العلة التي آيس فيها : 121 .aa Aya Sofya, fol\nمن نفسه كتب إلى والدته اصنعي صنيعا وادعي إليه من لم تصبه\nمصيبة. فلما وصل الكتاب بذلك اليها قالت لقد عزاني الاسكندر عن\nLorsqu'Alexandre نفسه ولما مضى لسبيله رثاه الناس فما قالته الفلاسفة\ncontracta la maladie qui le fit désespérer de la vie, il écrivit à sa mère : Prépare un repas\net invite ceux qu'aucun malheur n'a frappés.\nQuand la lettre contenant cette invitation arriva à sa mère, elle s'exclama: Alexandre\na voulu me consoler de sa propre mort».\nA son trépas les hommes les pleurèrent. Extraits des sentences prononcées par les\nphilosophes.",
  "21": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n229\nattribués à Hunayn 33. Or, on a depuis longtemps remarqué que\nla lettre de ces Apophtegmes», dans laquelle Alexandre ordonne\nà Olympie de ne pas admettre de personnes frappées par le malheur\nà son banquet funèbre, s'apparente à celle de la version A du ps.-\nCallisthène et du ms. Vulcan. 93 de Leyde 34.\nAjoutons encore que les sentences conservées par nos « morceaux\nchoisis» présentent une caractéristique tout à fait remarquable.\nLa littérature arabe compte, on le sait, un grand nombre de recueils\nde sentences prononcées aux funérailles d'Alexandre, dont les plus\nriches sont ceux de Hunayn et du ms. Köprülü 1608. Toutefois,\naucun des recueils que nous avons pu examiner, ne contient toutes\nles treize sentences de nos morceaux choisis», et tous, par contre,\nen citent un certain nombre, comme le démontre le tableau donné\ndans notre appendice.\nIl est ainsi établi que la pièce des «rasâ'il»>, dont le morceau XVI\nne nous a conservé qu'un choix, constituait l'archétype de tous les\nrecueils de ce genre qu'on rencontre dans la littérature islamique.\nEt cette pièce, ajoutons-le immédiatement, dérivait d'un texte grec.\nA notre sens, deux faits l'établissent. Dans nos textes arabes, nous\nlisons encore les noms de quelques-uns des auteurs de ces apophtegmes.\nOr, parmi ces noms, il en est que des auteurs musulmans auraient\ndifficilement pu inventer. Par exemple Milâtûs et Filiḥûn dans les\nmss Aya Sofya et Fâtih; Dorotheus chez Ta'âlibî; Nârûn, Ţiyâvûn,\nDimitr, Matrûn, Sisan, Filqațun chez Eutychius; Matrûn, Bartus,\nMirawîs et Maymûs dans l'« Iskandarnamah» d'Ahmedi 35. Il est vrai\nque, parmi les autres noms cités par Aḥmedî, Aristote est le seul\ncontemporain d'Alexandre. Des anachronismes tout aussi effarants\nreviennent dans les autres recueils. Dans une autre lettre, que nous\ncroyons appartenir à notre épistolographe, Alexandre parle d'un\n33 Voir MERKLE, Die Sittensprüche der Philosophen, Leipzig, 1921, et notre note 4\nà la pièce I de l'appendice.\n34 Le ms. Vulcan. 93 présente plusieurs anomalies; voir MERKELBACH, Die Quellen\ndes griechischen Alexanderromans, dans Zetemata, 9, p. 173); entre autres, il contient\nune liste des peuples vaincus par Alexandre, parmi lesquels figurent les Khazars et les\nRusses. On la retrouve seulement dans le ms. Bodleianus Barocc. 20.\n35 Ahmedi, on le sait, s'est servi de sources relativement recentes pour son poème,\ntel le Iskandarnámah de Nizâmi. Néanmoins son chapitre sur les sentences des philo-\nsophes dérive d'un texte plus ancien.",
  "22": "230\nM. GRIGNASCHI\nRufus qui vécut au Ier siècle de notre 36 ère et qui, dans l'«Iskandar-\nnamah» d'Aḥmedi, participe à ses funérailles 37. On voit combien\non aurait tort de nier l'origine hellénistique de ces sentences du fait\nde ces anachronismes, voire d'en rendre responsables les seuls écrivains\narabes.\nMais il y a une raison plus forte encore pour admettre l'origine\nclassique de nos sentences. Elles trahissent une animosité évidente\nà l'égard d'Alexandre, et, d'après les recueils de Mas'ûdî et d'Eutychius,\nRoxane aurait protesté contre les paroles des philosophes 38. Des\ncondamnations si véhémentes de la personne d'Alexandre ne sau-\nraient avoir été inventées par des musulmans, pour lesquels « Dû-\nl-qarnayn était le héros auquel Dieu avait parlé. Elles ne peuvent\nque remonter aux écrivains stoïciens.\nSi donc l'origine hellénistique de la lettre d'Alexandre à Olympie\n36 Ms. Vatican syriaque 209, fol. lv :\nفلما أدخلناها للخلاص بطريقة\nالكبرى التي استنبطها روفس الفيلسوف في تخليص الذهب و الفضة خرج\nQuand nous les avons soumis بكليته جرمها في غاية الصفاء واللين و الضياء.\nau raffinage selon la Grande Voie inventée par le philosophe Rufus pour purifier l'or\net l'argent, leur corps tout entier en sortit très pur, très malléable et très lumineux...\nدید روفس ای شه صاحب قرآن\nبو جهان\n-\nدون سنکدی اوجدن اوجه 37\nبو رسمه بكون\nسان كم عزل اند\n-\nكم\nرایتوکی بویله کم\nRafus s'exclama O Roi, né sous une conjonction propice des\nastres // Hier le monde t'appartenait d'un bout à l'autre, // A toi, que ce jour a jeté dans\ncette condition pitoyable. // Qui a renversé ton drapeau de cette manière ? (ms. Orient\n90, fol. 297r, Biblioteca Marciana, Venise).\n38 Notons que cette protestation de Roxane a été interpolée par Eutychius. Elle ne\nse retrouve ni dans le ms. Körpülü 1608 ni dans l' Histoire de la mort d'Alexandre ».\npar un auteur anonyme, qui a servi de la source à la Vie d'Alexandre, dont la Chro-\nnique d'Eutychius et le morceau du ms. Köprülü 1608 dépendent. Mas'âdi, par contre,\nattribue à Roxane exactement les mêmes paroles qu'Eutychius. Il semble que les écri-\nvains arabes aient possédé plusieurs recueils d'apophtegmes des philosophes sur l'en-\nterrement d'Alexandre et qu'ils y choisissaient des sentences selon leur goût personnel.\nNul doute qu'ils les modifiaient librement et qu'ils en créaient même des nouvelles.\nC'est sans doute de cette façon que s'explique la présence d'apophtegmes différents,\nmême dans des oeuvres ayant une source commune telles que l'Histoire de la mort\nd'Alexandre», le passage du ma. Köprülü et la Chronique d'Eutychius, ou les Apoph-\ntegmes de Hunayn et les Ahbar-al-Iskandar d'Al-Murbaššir.",
  "23": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n231\net des apophtegmes prononcés par les philosophes à l'occasion de\nl'enterrement du héros macédonien ne fait aucun doute, par contre\nleur appartenance à notre «Roman épistolaire» semble se heurter\nà deux difficultés.\nLa lettre grecque analogue à celle des «rasâ'il» se retrouve dans\nla «Biographie d'Alexandre » et, dès lors, il serait logique de supposer\nqu'elle appartenait plutôt au ps.-Callisthène, ce qui est d'ailleurs\nla thèse de M. Spitaler 39. De plus, l'épistolographe grec a exalté\ntout le long de ses lettres la figure d'Alexandre et on comprendrait\nmal qu'il ait prononcé à la fin une condamnation de sa politique\net de son rôle historique.\n-\nCependant il arrivait à notre épistolographe ainsi que nous\nle verrons par la suite d'employer des sources plus anciennes,\nsans s'apercevoir qu'elles ne cadraient pas avec ses propres idées.\nAussi pouvons-nous négliger cette contradiction pour nous concentrer\nsur le problème de l'origine de la lettre citée dans les «rasâ'il ».\nLes limites de cet article nous obligent à résumer les résultats de\nnos recherches sur ce point. Dans une étude écrite alors que les prin-\ncipales versions arabes de cette lettre étaient inédites, M. Walzer\nconsidérait qu'elle appartenait à un traité hellénistique, vraisem-\nblablement de Thémistius, incorporé dans la «Risâlat-al-Kindi fi-\nl-ḥila li dafi-l- 'aḥzân » 40. De son côté, M. Spitaler, auquel on doit\nune classification des lettres qu'on lit dans les «Apophtegmes »> attri-\nbués à Hunayn, dans le ms. Köprülü 1608, chez Eutychius, al-Kindi\net al-Mas'udi, les rattachait à la version arabe du ps.-Callisthène \"1.\nDans l'état présent de nos connaissances, jugeait-il, il serait impossible\nde reconstruire l'histoire de ces trois versions 42. En fait, on retrouve\ndans la littérature arabe d'autres spécimens encore de cette missive.\n39 Album Giorgio Levi della Vida, II, Trostbrief Alexanders an seine Mutter, p. 495.\n40 H. RITTER et R. WALZER, Studi su Al-Kindi II, Uno scritto morale inedito di Al-\nKindi (Temistio nepi dhunías (?), dans Memorie dell'Accademia dei Lincei, Se. Morali,\nVI, 8 (1938), p. 12 et 22.\n41 Se fondant sur leur ressemblance avec la lettre du ms. Vulcan. 93, M. Spitaler\ndistingue dans ces lettres trois classes. Dans la première, il réunit celles qui mentionnent\nle banquet funèbre d'Alexandre; dans la seconde, la lettre citée par Eutychius, où le\nbanquet est sous-entendu; dans la troisième, la deuxième lettre de Hunayn, où il n'est\nplus question du tout du festin. Nous garderons cette classification, tout en notant\nqu'il existe un autre type de lettre encore dans la Nihâyat-al'arab fi'ahbari-l-Furs\nwa l-'Arab (Cambridge ms. Qq 225 fol.78 r-v), composée par un auteur qui avait sous\nles yeux des textes des classes I et III.\n42 L.c., p. 493, 495 et 497.",
  "24": "232\nM. GRIGNASCHI\nAinsi, dans les « Bocados d'oro » 43, la traduction espagnole des « Mub-\ntâr-al ḥikam > nous lisons la lettre entière d'Alexandre à Olympie,\ndont al Mubaššir Ibn Fâtik avait donné dans l'original le seul «inci-\npit», parce qu'il l'avait déjà transcrite dans son «Târîḥ Kabîr ».\nÉvidemment un copiste des «Mubtâr-al-hikam» avait pris soin de\ncombler cette lacune et, par une heureuse coïncidence, son volume\nparvint aux mains du traducteur espagnol. Le fait que, dans la ver-\nsion espagnole, nous retrouvons l'« incipit» indiqué par al-Mubaššir\net, surtout, la concordance entre le texte espagnol de la lettre et la\nscène du banquet funèbre dans les «Abbâr-al-Iskandar » confirment\ndéfinitivement que les « Bocados d'Oro », nous ont gardé la lettre\ndu Târîb Kabir ».\nOr, cette lettre est presque égale à la missive n° I chez Hunayn\nà une différence près. Ainsi que le fragment conservé par Mas'udi,\nelle ignore le conseil donné par Alexandre à sa mère de bâtir une\nville afin d'y célébrer son banquet funèbre. Tout comme dans la\nlettre grecque du ms. Vulcan. 93, le Roi demande à sa mère seulement\nde préparer un splendide festin 44,\nC'est de même de la célébration d'un banquet et non pas de la con-\nstruction d'une ville qu'il est question dans la lettre conservée dans\nla version éthiopienne de l'« Histoire de la mort d'Alexandre >> 45.\nL'auteur de cette histoire suivait le récit du ps.-Callisthène sur l'em-\npoisonnement du héros macédonien; mais il ne renonça pas pour\nautant à rehausser sa narration par le texte d'une lettre d'Alexandre\nà Olympie se rapprochant de celle du «Tarih Kabir» et par la des-\ncription du banquet funèbre. Or, cette version fut reprise par Abû\nŠakar, Al-Makin et par l'auteur d'une « Vie d'Alexandre », aujourd'hui\nperdue, dont des fragments se retrouvent dans la Chronique d'Eu-\n43 KNUST, Mittheilungen aus dem Eskurial, p. 300.\n44 A notre sens, le témoignage des lettres des Bocados d'Oro », de Mas'udi et de\nl'e Histoire de la mort d'Alexandre» (voir note 45) indépendantes les unes des autres,\nest décisif. Il n'a jamais existé en grec de lettres, où Alexandre conseillait à sa mère de\nfonder une nouvelle ville. Ce conseil provient d'un écrivain arabe aimant les hyperboles.\nIl en découle aussi qu'Al-Kindi ne peut avoir trouvé cette leçon corrompue dans un\ntraité de Thémistius et doit avoir interpolé cette lettre dans sa risâla. D'ailleurs,\nil n'est peut-être pas exact de parler d'interpolation et il est possible que cette épître\nsoit une œuvre personnelle du philosophe arabe. Celui-ci l'aurait composée en emprun-\ntant ses argumenta et ses exemples à différentes sources grecques, tout comme, de\nson côté, Al-Qawhari mit à contribution, dans son traité analogue, la risâla » du même\nAl-Kindi et les Pères de l'Église.\n45 BUDGE, The Life and Exploits of Alexander the Great.",
  "25": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n233\ntychius, l'anthologie conservée dans le ms. Köprülü 1608 et dans\nle Roman Éthiopien d'Alexandre ». Ce dernier nous a conservé le\npassage de cette «Vie», dans lequel le roi proclamait que, afin de\nmieux exprimer sa nouvelle politique,il avait adopté dans ses lettres\nla formule De la part d'Alexandre, serviteur de Dieu »> 4. C'est\nl'intitulé même qu'on retrouve dans l'épître II\nhe\nlequel autrement n'apparaît pas dans les «Romans» arabes. Et cette\népître II n'est qu'un résumé maladroit de la lettre incorporée dans\nl'Histoire de la mort d'Alexandre», résumé qui omet le conseil\ndu roi à sa mère d'organiser un banquet funèbre et qui a obligé l'au-\nteur de cette «Vie» à renoncer à la scène du banquet lui-même.\nQuant à la version III de la «Lettre d'Alexandre », sans doute\nl'oeuvre d'un auteur se proposant de démontrer sa capacité de com-\nposer des variations sur le thème de la vanité de la vie terrestre,\npar lequel débute la version I, il en existe encore deux spécimens\nen plus de celui qu'a publié M. Spitaler 47. Le plus important nous\na été conservé par l'anthologie ajoutée à nos «<rasâ'il» dans les mss.\nAya Sofya et Fâtiḥ. A en croire les indications de l'auteur de cette\nanthologie, il se trouvait dans une œuvre de Madâ'in, qui l'aurait\nentendu réciter à la cour d'Al-Ma'mun par son secrétaire 'Amru-\nbnu-Mas'ada. En fait il s'agit d'une composition conservant encore\ncertains passages de la Lettre I qui ne figurent plus dans les autres\ntextes de cette classe 48 la deuxième lettre des Apophtegmes de\n46 L.c., Roman Ethiopien, p. 67: I lettre d'Alexandre à Dârâ.\n47 Nous les appellerons III A et III E afin de les distinguer de la deuxième lettre\ndes Apophtegmes de Hunayn (III H d'après la classification de M. Spitaler).\nفانك لم تكوني جاهلة : 4s Par exemple, nous lisons dans la lettre III A la phrase\nTu nignorais pas que je faisais partie des mortels a reprise ء باني من الذين يموتون\nlittéralement de la lettre I H et qui ne se lit pas dans III H. Un peu plus loin nous lisons:\nموقعه ولا\nمنك\nيحسن\nهذا و أنا أرجو أن تعزي به و أن\nقد كتبت كتابي\nتخلفي ظني ولا تحزني روحي فإني قد علمت يقينا أن الذي أذهب إليه\nde viens d'écrire cette lettre خير من المكان الذي أنا به و أكرم و أظهر\nparce que j'espère que tu en recevras de la consolation et qu'elle trouvera chez toi un\nbon accueil. N'agis pas contrairement à mon attente, n'afflige pas mon esprit. Je sais\navec certitude que l'endroit où je vais est meilleur, plus noble, plus lumineux que celui\ndans lequel je me trouve ». Or, cette phrase dérive directement de I H et, à son tour,\nواعلمي أني كتبت كتابي هذا و أنا : : a inspire un passage de III",
  "26": "234\nM. GRIGNASCHI\nHunayn et celle qu'on lit dans le «Roman éthiopien d'Alexandre » 49.\nAjoutons enfin que le poète Abû-l-'Atâhya (fin du IIe siècle de l'hég.)\nconnaissait déjà les sentences prononcées par les philosophes à l'occa-\nsion de l'enterrement d'Alexandre 50.\nDe ce que nous venons de dire, un premier fait se dégage avec\ncertitude. La lettre d'Alexandre à Olympie et les sentences pronon-\ncées pendant les funérailles du roi macédonien étaient connues dans\nle monde arabe bien avant l'époque d'Al-Kindi et de Hunayn. Encore,\nsi l'on examine de près les différents spécimens de la «Lettre I»>,\nauxquels il faudra ajouter le fragment inclus dans le « Conforto delle\ntristezze de Elya al Gawharf 51, on ne tardera guère à s'apercevoir\nqu'en dépit des variantes, ils procédent tous d'une seule traduction\nde l'original grec, original qui s'apparentait étroitement à celui du\nms. Vulcan. 93. Ainsi, par exemple, les fragments d'al-Kindi, d'al-\nGawhari et d'al-Mas'ûdî s'accordent entre eux et avec le ms. Vulcan.\n93 pour préciser qu'Alexandre désirait que son banquet funèbre fût\n»>\nأظن أنك تعزين به فلا تخلفي ظني و قد علمت أن الذي أذهب اليه\nفيه و أظهر Sache que je t'ai écrit cette lettre خير من الذي أنا\nparce que je compte que tu en recevras de la consolation. N'agis pas à l'encontre\nde mon attente. Tu sais que l'endroit où je vais est meilleur et plus lumineux que\nيا أم أني كنت بالموت موقنا و لم celui dans lequel je me trouver III H\nأكن أجهل مجيئته إلي و لا نزوله بي فاعتصمي بالصبر عنّي و اسلي\nعن البكاء علي فإن المكان الذي أذهب اليه خير من المكان الذي\n50 mère, je m'attendais à mourir. Je n'ignorais pas que la mort\nallait me rejoindre et descendre sur moi. Cherche refuge dans la résignation sur mon\nsort. Ne songe pas à pleurer pour moi. Car l'endroit où je vais, est meilleur, plus lumineux\nque l'endroit où je me trouvais ».\n49 En dépit des nombreuses modifications, on ne saurait douter que la lettre III\ndépend directement de la lettre III A. Nous y lisons, par ex. (p. 304): Hast thou not\nheard that He spoke to this world, when He created it, saying: 0 thou mother of death,\no thou heiress of sorrow », simple variante d'un passage de la lettre III A:\nst\nأنه قيل لهذه الدار حيث بنيت يا والدة الموتى و مرتجعة العطية و\nN'as-tu pas appris que, lors, de sa création, on a dit à ce monde:\no mère des morts, o celui qui exige la restitution des dons, qui détruit tout ce qui est\nsolide?».\n50 Voir Ta'alibi, Histoire des Rois perses, p. 445.\n51 Publié par M. G. LEVI DELLA VIDA, dans Mélanges Eugène Tisserant, II, p. 346-397.",
  "27": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n\"\n235\ncélébré dans une atmosphère joyeuse, détail omis dans les « Bocados\nd'Oro »>, Hunayn I et l'Histoire de la mort d'Alexandre »> 52. Seuls\nal-Kindi et al-Gawharî nous ont conservé les dernières paroles d'Olym-\npie qui ont une fois de plus leur pendant exact dans le ms. Vulcan.\n93 53. Par contre, c'est chez al-Gawharî et al-Mas'ûdî que nous retrou-\nvons l'équivalent d'une autre phrase de la lettre grecque 54. Quelques\nlignes plus loin, al-Kindi se rapproche de nouveau d'al-Mas'ûdî,\nalors que al-Gawharî et Hunayn I présentent une leçon manifeste-\nment erronée 55. Enfin, nous retrouvons chez al-Mas'ûdî une variante\nisolée, laquelle cependant est confirmée par les «rasâ'il » 56.\nNous avons jusqu'ici demandé à la lettre du ms. Vulcan.93 un cri-\ntère permettant de choisir parmi les différentes leçons des textes\narabes. Ces derniers, pris dans leur ensemble, permettent à leur tour\nd'arriver à quelques conclusions sur la forme originale de la lettre\ngrecque. Trois de nos missives (Bocados, Hunayn I, al-Kindi) préci-\nsent qu'Olympie devait convoquer le peuple de la Libye, de l'Europe,\nde l'Asie et de la Macédoine, détail qu'on ne retrouve pas dans le ms.\nليكون مأتها للاسكندر بالسرور : Mas'idi, Murad-ad-dahab 52\nخلاف مأتم الناس بالحزن\n... de manière que le banquet funèbre d'Alexandre\nsoit célébré dans la joie, contrairement aux banquets funèbres des hommes [du commun],\nqui sont consommés dans la tristesse ; ms. Vulcan. 93: ŏri où Búbeus áporov émoinga\nààà xapàs. Voir encore Al-Gawhari, I.c., p. 359 et Al-Kindi (WALZER, I.c., p. 36 et 37).\nإذ لست في المصائب مبدعة و لا مخصوصة بها : ... ,sa Al-Kindi\nCar [tu m'as enseignée] que je ne suis pas la première à étre على أحد من البشر\nfrappée par le malheur; que je ne suis pas plus atteinte que toute autre »; ms. Vulcan. 93:\nὡς ὅτι οὐ ξένον τι συνέβη τοῦτο ἀλλὰ (τὸ) τοῖς πᾶσι συμβᾶν καὶ συμβαῖνον. Voir aussi Al\nGawhari, l. c.\n54 Al-Gawhari, Lc. :\nفتنبهت حينئذ إلى ما ذهب إليه الاسكندر\nAlone elle comprit ce que son fils Alexandre s'était فيما عهده إليها في وصيته\nproposé par le conseil qu'il lui avait donné dans son testament; ms. Vulcan. 93 :.\nεὐθὺς οὖν ἐπέγνω ἡ μήτηρ αὐτοῦ τὴν σοφίαν αὐτοῦ καὶ ὡς ἐκ τῶν ὄντων (Bodl. Barac. 23\nζόντων) ἐξῆλθεν ᾿Αλέξανδρος καὶ χάριν παραμυθιάς ἔγραψεν ταῦτα. Voir aussi Mas adi, l.c.\nElle s'exclama ، وقالت ياسكندر ما أشبه أواخراك بأوائلك : ..ss Masidi, L\nQue tes dernières actions sont dignes de tes premières»; Al-Ġawhari, l.c. :\nQue tes premières actions ont été dignes de tes dernières + !\nOr done, mon fils ma . لقد عزاني ولدي بأحسن التعازي : .to Mas'idi, e\nconsolé par la meilleure des consolations >.",
  "28": "236\nM. GRIGNASCHI\nVulcan. 93. Nous avons aussi constaté que cette lettre s'ouvrait\npar des remarques sur la nécessité d'endurer la douleur avec dignité\net sur la nécessité de la mort, dont le conseil du banquet, n'était\nque la conclusion, alors que le ms. Vulcan. 93 commence ex abrupto :\nδεξαμένη μου ταύτην τὴν τελευταίαν γραφήν ...\nEnfin, le récit du banquet funèbre est, au point de vue artistique,\nbeaucoup mieux agencé en arabe, même s'il n'ajoute rien à la sèche\nnarration du texte grec. Dès lors, on peut formuler une première\nconclusion les mss. Vulcan. 93 et Bodleianus Baroccus 23 ne nous\nont conservé qu'un résumé de la lettre originale, laquelle a été inter-\npolée dans la «Biographie» à une époque relativement récente. Au\ndébut, elle n'appartenait pas au cycle du ps.-Callisthène.\n:\nA ce propos, il n'est pas sans intérêt de noter comment l'« incipit >>\ndes lettres dans les «Bocados d'Oro» et dans le ms. Aya Sofya 57\ncorrespond assez bien à celui du «Testament d'Alexandre » dans la\nversion syriaque 58. Nous croyons même entrevoir une affinité entre\nمن الاسكندر رفيق أهل الأرض بجسده قليلا و رفيق أهل السماء 57\nبروحه طويلا إلى والدته أرقية الحبيبة الرقيبة التي تحب التمتع\nDel part d'Alexan بولدها في دار الغرور و تكره مجاورته في دار الحبور\n*\ndre, qui restera peu de temps avec son corps en compagnie des habitants de la terre et\nrestera longtemps avec son âme en compagnie des habitants du ciel, à sa mère Urqiya,\nla chère amie, qui aime jouir de son fils dans le monde des vanités et déteste [l'idée]\nde lui être proche dans le monde de la joie.\nOn remarquera le nom d'Urqiya, recte Urfiya, donné ici à Olympie. Il aide à compren-\ndre la formation du nom de « Rûfiya », « Ruqiya» qu'on trouve dans la plupart des textes\narabes. La confusion entre re et 1 révèle son origine pehlvie. On ne s'étonnera pas\ntrop, car le nom de Růšanak dérive à son tour d'une source persane et non pas de la\ntraduction syriaque de la Biographies, où il est orthographié Rušanaq», forme\ngardée par le Roman éthiopien et à laquelle doit se rattacher la forme Rustaq\n(recte Rušanaq) de Hunayn. La traduction syriaque de la Biographie il ne faut\npas l'oublier n'a été que l'un des canaux par lesquels le monde islamique a connu\nla légende du héros macédonien (voir en particulier Israel FRIEDLANDER, Alexanders\nZug nach dem Lebensquell, dans Archiv für Religionswissenschaft, 13, 1910). Il faut\nsans doute expliquer par l'influence de ces différentes sources les quelques autres noms\ncités par Al-Mubaššir qui ne dérivent pas de la traduction syriaque (voir MESSNER,\n1.c., p. 623).\n58 Trad. Budge: From Alexander to Ammon and to my mother Olympias greeting.\nInasmuch as the Gods have willed that I should be taken from the assembly and dwelling\nof men to the assemblies and dwellings of the gods, I too have thought that it would\nbe expedient and helpful for me and I have thought that it would be right for me to\ninform you thereof. Do thou then, my mother, not be grieved nor distressed at my\ndeparture, for such is the will of God, but console thyself in thy wisdom and be glad ».",
  "29": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n237\nle début de l'épître du ms. Aya Sofya et les première lignes de ce\n* Testament ». Tout au moins, l'« incipit» de la lettre III Aya Sofya,\nd'une part contient l'idée affirmée expressément dans le « Testament >>\nde la version syriaque qu'Alexandre était sur le point d'abandonner\nle monde des vivants pour entrer dans le monde des esprits; de l'autre,\nil donne à Olympie les appellations (la chère, l'amie),\ncorrespondant à l'adjectif yλukurárn du ms. Vulcan. 93.\nIl nous reste encore à rechercher par quelle voie cette lettre est\narrivée dans le «Roman arabe d'Alexandre », car, même si l'on ne\nsaurait exclure la possibilité que les arabes aient connu des extraits\nde la rédaction A, rien n'indique une telle connaissance 59. Or, les\nlettres des «Bocados d'Oro » et des «Murûğ-ad-dahab » figurent\ndans des récits qui expliquent la mort d'Alexandre par une maladie.\nHunayn, il est vrai, mentionne le venin qu'on aurait donné à boire\nà Alexandre. Mais, en examinant attentivement ses « Apophtegmes »,\non s'aperçoit que, dans l'original, il était question de la maladie et\nque les mots insérés dans le titre de ce chapitre « il avait bu un venin >\nne sont qu'une glose 60. En effet, ce récit de Hunayn se trouve placé\ndans le même contexte que celui d'al-Mubaššir. Tous deux croyaient\nsavoir qu'Alexandre était mort après une visite à la ville des Gym-\nnosophistes. La seule différence, c'est que Hunayn donne de cette\nvisite une version qui diffère légèrement de celle d'al-Mubaššir 61.\nDonc, seul l'auteur anonyme de l'Histoire de la mort d'Alex-\nandre » rattache cette lettre à l'épisode de l'empoisonnement. Tou-\ntefois, les anomalies de sa lettre prouvent suffisamment qu'il s'agit\nd'un texte secondaire largement remanié.\nNotre lettre appartenait - on ne saurait plus longtemps en douter -\nà la version qui fait mourir Alexandre de maladie, version étrangère\nà la «Biographie », dont les différentes formes s'accordaient sur trois\npoints ayant aperçu les signes annoncés par une prophétie, Alex-\n59 Et qui plus est, la rédaction à contient déjà la deuxième version de la prophétie\ndu ps.-Méthode (voir Byz. Zeitschrift, 1900, p. 225). Or, nous avons des raisons de croire\nque même la première version de cette prophétie ne remonte guère plus haut que les\ndernières années du VIIe siècle. Dès lors, la rédaction A est vraisemblablement plus\nrécente que les rasâ'ils de Sâlim Abu-l-'Ala'.\nخبر الاسكندر في آخر علته لما أيقن بالموت و كان سقي سما و كتابه 00\nإلى أمه ينهاها عن الجزع و يأمرها بالصبر عنه\n61 Voir la traduction espagnole; KNUST, L.c., p. 39-40.",
  "30": "238\nM. GRIGNASCHI\nandre se rend compte qu'il ne guérira plus; il écrit alors à Olympie\nune dernière lettre; après son trépas, les philosophes se réunissent\nautour de son cercueil 62. Or, les deux derniers points se retrouvent\ndans la pièce XVI du « Roman épistolaire ». Seul le premier y manque,\nmais on ne s'étonnera pas trop, puisque l'introduction qui, dans les\n«rasâ'il», devait relier cette pièce aux autres, a été probablement\nrésumée par l'auteur de nos morceaux choisis » 63. D'ailleurs, le\nthème de la prophétie revient regulièrement dans les pièces de notre\nRoman épistolaire. C'est assez dire que, dans ses traits essentiels,\nla même version de la mort du roi macédonien figure aussi bien dans\nles «rasâ'il que dans la «Biographie» arabe d'Alexandre. Mais alors,\nà laquelle de ces deux oeuvres cette version appartenait-elle à l'origine ?\nUne seule réponse est possible à cette demande dans l'état présent\nde nos connaissances. Elle devait figurer dans notre « Roman épis-\ntolaire », car c'est seulement par cette hypothèse qu'on peut expliquer\nà la fois deux faits: l'interpolation d'un abrégé de cette même lettre\ndans une rédaction grecque récente du ps.-Callisthène et l'appari-\ntion, au sein de la «Biographie» arabe, d'une version de la mort\nd'Alexandre étrangère à la Biographie» grecque, mais d'origine\nhellénistique, ainsi que le prouvent les «Apophtegmes des philo-\nsophes ». On l'admettra d'autant plus facilement que, dans les << Ah-\nbâr-al- Iskandar» d'al-Mubaššir, nous retrouvons l'épisode de la\nmaladie et de la mort naturelle de Philippe, épisode repris littérale-\n62 D'après cette version, Alexandre serait tombé malade à Qumis pendant le voyage\nde retour vers Babylone et serait mort à Šahrzûr dans le Kurdistan. Avant de mourir,\nil aurait fait écrire une lettre à sa mère afin de la consoler. Un signe lui avait annoncé\nsa mort imminente; terrassé par la fièvre, il était descendu de cheval et s'était étendu\nsur un écu de fer à l'ombre d'un bouclier d'or. Reprenant ses sens, il se rappela comment,\nd'après une prophétie, son trépas aurait eu lieu sous un ciel d'or et sur une terre de fer.\nSelon Eutychius et al-Mubaššir, ce signe aurait été prévu par les astrologues. Eutychius\nprécise même que les astrologues l'avaient vu au moment de sa nauissance et en avaient\ninformé Olympie. Ta'alibi attribue le présage à Ptolomée Lagos, le Kitâb Istamâḥis\ncité dans + Picatrix (II, livre III, chap. VI) à Aristote qui en aurait informé Alexandre\npar lettre. Même dans le Roman éthiopien», p. 293, des signes, que le traducteur que\nspécifie malheureusement pas, annoncent à Alexandre que sa mort est imminente.\nSeul, Mas'udi n'en parle pas, tout en accueillant, dans ses Murug», la même version\nde la lettre à Olympie. Enfin, tous ces auteurs savent que les philosophes de la suite\nd'Alexandre ont prononcé des sentences à son enterrement.\n63 Nous disons bien l'auteur de nos morceaux choisis», puisqu'il est évident que\ncelui-ci a réuni sous une seule rubrique deux pièces à l'origine distinctes: la lettre d'Alex-\nandre à Olympie et les sentences prononcées pendant l'enterrement du héros.",
  "31": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n239\nment de l'introduction qui, dans les «rasâ'il», précède la pièce VI 64.\nDésormais une conclusion s'impose. Nos «morceaux choisis > nous\nont conservé, non pas un recueil islamique de lettres ps.-aristotéli-\nciennes, mais un véritable roman épistolaire hellénistique, non sans\nanalogie avec celui qui, d'après les recherches de M. Merkelbach,\na constitué la base de la «Biographie» du ps.-Callisthène. De la sorte,\nils fournissent une confirmation indirecte, mais non moins précieuse,\ndes thèses du savant allemand. Cependant, il ne nous ont gardé\nqu'une partie de ce << Roman ».\nTrois lettres d'Alexandre semblent avoir été omises\nprécisément\nles trois missives, auxquelles Aristote fait allusion dans ses réponses\net qui lui annonçaient la conquête de la Scythie et d' << Anfisân > et\nl'expédition au bout du monde. Mais d'autres coupures encore doivent\navoir été opérées par l'auteur de notre choix et celles-ci peuvent\navoir altéré profondément le caractère de l'original. En effet une\nphrase de la «as-Siyâsat-al-'âmmiya» laisse entrevoir comment le\nroman de l'épistolographe grec contenait aussi des enseignements\nmagiques. Au f. 74v du ms. Aya Sofya, nous lisons : « Quand tu\ndescendras dans un endroit infesté de vipères, emploie ce que je t'ai\ndécrit et elles s'enfuiront 65 »\nImpossible de ne pas entendre ces paroles comme une allusion à\nl'épisode bien connu des vipères attaquant les soldats d'Alexandre\ndans le «De mirabilibus Indie». Dès lors, ce qu'Aristote a décrit à\n•\n64 Rappelons que la version de la mort d'Alexandre donnée par le ps.-Callisthène\navait été traduite en arabe deux fois au moins l'une d'après le ⚫Roman syriaque »,\ndont Firdausi s'est inspiré, l'autre d'après une rédaction grecque proche de celle con-\nservée dans la version arménienne (voir WEYMANN, Die äthiopische und arabische\nÜbersetzung des ps.-Kallistenes, diss., Heidelberg, 1901). Cette version, notons-le en\npassant, ne contient pas de morceaux analogues à ceux du Roman arabes, ainsi que\nle croyait M. Merkelbach. Les trois pièces publiées en appendice à la Biographie > et\nqui n'ont pas été traduites par Raabe, appartiendraient, d'après l'éditeur de la version\narménienne, à la littérature populaire du moyen âge. Nous devons cette information\naux Pères Méchitaristes de Venise. Avouons cependant qu'il n'ext pas facile de faire\nremonter au Roman épistolaire l'assertion du Roman arabe selon laquelle Alex-\nandre serait mort dans le Kurdistan à Šahrzûr ou, d'après al-Mubaššir, dans le village\nde près de Sahrzûr. On pourrait, il est vrai, supposer, que notre épistolographe\ns'est inspiré de l'itinéraire conservé dans le Roman pehlevi, faisant revenir Alexandre\nde l'Inde en Babylone à travers l'Asie centrale. Autrement il faudrait penser, ainsi\nque le proposait Noeldeke (Beiträge, p. 47, n. 2), à une légende éclose autour d'un pré-\ntendu tombeau d'Alexandre.\n65\nفإذا نزلت موضعا كثير الحيات فاستعمل ما وصفت لك فإنها تذهب",
  "32": "240\nM. GRIGNASCHI\nAlexandre ne peut être qu'un talisman. On nous en parle d'ailleurs\nencore dans le «Sirr-al-asrâr». Enfin, rappelons-nous que, dans\nune autre épître à Alexandre, le «Kitâb-al-Isṭamâhîs», Aristote\nfait allusion à l'amulette «al-Amațîs» destinée à protéger le Roi\nde la neige et de la pluie, ce qui nous reporte une fois de plus au « De\nMirabilibus Indie». Certes, le «Kitâb-al-Istamaḥis», partiellement\nconservé par le ms. Oxford Marsh 556, n'appartient pas à notre\nRoman hellénistique. De cette œuvre, nous connaissons seulement\nles citations du ps. al-Magriți dans son « Picatrix », mais elles suffisent\nà prouver que son auteur s'inspirait dèjà de notre lettre XI 7. Par\nconséquent, il s'agit d'un traité magique islamique. Néanmoins, en\ntenant compte du passage de la «as-Siyasat-al-'âmmiya » que nous\nvenons de citer, il faudra bien envisager l'hypothèse que, tout comme\nce fut le cas pour le «Sirr-al-asrâr», le «Kitâb-al-Isṭamâhîs» est\nréellement dérivé d'une lettre de notre roman épistolaire à travers\ndes remaniements plus ou moins profonds. Surtout, ce dont on ne\nsaurait douter, c'est que notre roman contenait déjà des pages, dans\nlesquelles Aristote n'apparaissait plus seulement comme le sage\nphilosophe, le tenant du monothéisme, mais encore comme un magicien\net un alchimiste. Ce travestissement de la figure d'Aristote qui nous\ndérangeait si profondément dans le « Sirr-al-asrâr», remonte bien à\nl'original hellenistique, qui constitua donc le point de départ des\napocryphes arabes faisant d'Aristote, d'une part, l'adepte de la magie\net l'inventeur de talismans 68; de l'autre, le théoricien de l'art mili-\ntaire 69. Aussi ne saurait-on éviter de se demander si les deux lettres\n66 Sirr-al-asrár, p. 164.\n67 Picatrix II, p. 201-202.\n68 Voir le Kitâb-al-Istamâhis\net Ad-dabirat-al-Iskandariya, cette dernière\nétudiée partiellement par Ruska dans son article sur la Tabula Smaragdina ».\n•\nKitâb-as-siyâsa».\n69 Voir le Liber Aristotelis inscriptus ubi de recto ducis regimine agitur» (Bibli-\nothèque Vaticane, ms. arabe 509) et le Kitâb-al-hiyal wa-l-hurub. - Il s'agit là,\nnotons-le en passant, d'une littérature, dont les débuts remontent au moins au IVe siècle\nde l'hég., car le Kitâb-Istamâhis devait être connu déjà de l'auteur du Sirr-al-\nasrâr», et la risâla» du ms. Vatican arabe 509 de l'auteur du\nQuant au Kitab-al-hiyal wa-l- hurub, qui, d'après M. Ritter, appartiendrait au\nVe siècle de l'hég., il passa, tout comme le Sirr-al-asrâr», à travers maints remanie-\nments, ainsi que le prouvent les discordances entre l'index et la matière du livre et\nl'existence, dans le ms. III Ahmet kütüphanesi 3469 du Sérail, d'une version différente\nde celles des mas de Leyde et d'Aya Sofya.",
  "33": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n241\nconservées dans le ms. Vatican syriaque 209 70 faisaient à leur tour\npartie de notre Roman épistolaire ». Dans la première, Alexandre\ninforme Aristote qu'il a découvert dans l'Inde deux élixirs capables\nde transformer l'argent en or et le cristal en jacynthe. Dans sa réponse,\nle Philosophe» esquisse un court traité d'alchimie. Ayant peu de\nfamilarité avec l'alphabet karsûnî et aucune avec l'histoire de l'al-\nchimie, nous préférons laisser entier le problème de savoir si les\n<< recettes glorieuses» indiquées dans cette épître remontent réellement\nà l'époque hellénistique Alexandre parle de la «teinture >> des\nminéraux, concept datant de la première période de l'alchimie - ou\nsi elles ont été modifiées par un alchimiste arabe.\nQuoi qu'il en soit de ce problème, dans la première partie de sa\nréponse, Aristote rattache cette pseudo-science aux principes de la\nphysique classique et en donne une explication remarquable par sa\nclarté et par l'absence de tout penchant vers le mysticisme et la\ngnose. A n'en point douter, l'auteur de ces lettres se servait d'un\ntraité appartenant à la première période de l'alchimie grecque. Cepen-\ndant, croyons-nous, les lettres elles-mêmes datent d'une époque\nbeaucoup plus récente qu'un détail permet, peut-être, d'établir.\nDans sa réponse, Aristote décerne à Alexandre le titre peu commun\nde «wârit-al-ğabâbira», l'héritier des géants», voire l'« héritier\ndes puissants » et même l'héritier des tyrans »>, titre qui soulig\nnons-le tout de suite, ne se trouve pas dans notre « Roman »>. On\npréférera entendre l'héritier des puissants» et considérer le terme\nde «ğabâbira>> comme un synonyme de celui de « 'uzamâ' » qu'on\nretrouve dans la première lettre \"1. D'autant que dans « as-Siyasat-\nal-'âmmiya » (ms. Aya Sofya f. 60v) nous lisons\nEt leurs corps (des Sogdiens) sont forts». Cependant il est presque\ncertain que le traducteur arabe des lettres du ms. Vatican syriaque\n209 n'aurait pas employé l'expression de «ğabâbira», vocable qui,\nd'après le Qâmûs de la langue arabe, au sens figuré possède une nu-\nance péjorative, si l'original grec ou la version syriaque n'avait pas\n70 L'existence de ce ms. a été signalée déjà par Steinschneider, qui cependant n'avait\npas contrôlé l'indication du catalogue d'Assemani, d'après lequel il s'agirait de l'* Epis.\ntola ad Aristotelem de mirabilibus Indii ». En fait, il s'agit d'un ms. arabe de 14 feuillets,\nen caractères karšūni, copié à Rome par un certain Yusuf Baslûqiti en 1654.\nDu Roi Alexandre le » من سكندر الملك ملك المسكونة و وارث العظماء 7\nseigneur de la terre, l'héritier des puissants».",
  "34": "242\nM. GRIGNASCHI\ncontenu le terme de géant. Dès lors, il y a des chances très fortes\npour que le titre de cette lettre se rattache à celui de γίγας γιγάντων,\nen syriaque «ğabbara », mauvaise traduction du persan «kavi» (chef\nvaleureux) que Hosrô I avait adopté afin de marquer la continuité\nde son pouvoir avec celui des sept rois zoroastriens de l'Avesta 72.\nDans ce cas, les deux lettres, bien que conservées dans un ms. récent,\ndateraient de la deuxième moitié du VIe siècle, ou de la première\nmoitié du VIIe siècle, car le souvenir du titre de « kavi », pris par\nHosrô I, s'est bien vite perdu. Si l'on pouvait être certain qu'elles\nfaisaient partie de notre «Roman», le problème de l'époque de sa\ncomposition serait presque résolu. En effet, étant l'oeuvre d'un auteur\npalen, ainsi qui nous allons le voir il ne pourrait appartenir\nqu'au VIe siècle. Mais y a-t-il des raisons valables pour les attribuer\nà notre épistolographe? Nous devons avouer notre perplexité à ce\npropos. A en juger par la missive d'Alexandre, elles faisaient partie\nà leur tour d'un recueil de lettres qui ne devaient pas toutes concerner\nl'alchimie 73. Alexandre y fait allusion aux rapports envoyés précé-\ndemment à Aristote sur les pays qu'il avait conquis et souligne\ncomment la tâche d'organiser l'Empire et le souci d'achever la con-\nquête du monde, ne lui laissaient guère le loisir d'étudier ces élixirs\net l'obligeaient à avoir recours à son maître 74. On voit que rien n'em-\n-\n72 WIKANDER, Feuerpriester in Kleinasien und Iran, 1946, p. 151; BENVENISTE,\nM.O., XXVI-XXVII, p. 214, n. 3.\nفي الكتاب الصادر منا اليك : 7a La Lettre elle-même débute par les mots\nقبل هذا أيها العظيم وصفنا لك ما شاهدنا من ناحية الشمال و\nالمشرق و نحن واصفون لك في كتابنا هذا غريب ما وقفنا عليه من\nO Grand, dans ma lettre précédente, je t'ai décrit les régions\ndu Nord et de l'Orient que j'avais visitées. Dans cette lettre, nous te décrirons un prodige\ndes forces de la nature générale (?).\nفلما رددنا الفكرة في ذلك و أردنا الوقوف على حقيقته ، منعنا : 1.7 ,27 Fol 74\nعليه الاشتغال بتجهيز العساكر والجبوش و عمارة الثغور و اقامة ....... و\nملكناها\nبسط المعدلة في الرعايا الكثيرة و النظر في أحوال البلاد التي\nو الاجتهاد المثابت على حسن الوصول إلى لطف الاحتيال في الاستيلاء\n\"\nNous nous sommes mis à réfléchir sur ce problème et nous dési-\nrions en connaître la vérité, mais nous en avons été empêché par nos (autres) occupa-\ntions à préparer les soldats et les armées, à entretenir les villes, à organiser (mot illi-\nsible), à administrer la justice à nos nombreux sujets, à veiller sur les conditions des pays\nque nous possédons et à travailler sans relâche afin de trouver des stratagèmes efficaces\npour nous emparer des pays qui ne sont pas encore en notre possession.",
  "35": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n243\npêcherait que ces lettres aient fait partie de notre Roman épistolaire 75.\nDe plus, ainsi que nous allons le voir, ce dernier comprenait au moins\nune pièce appartenant à l'époque classique. Toutefois il faut signaler\nune difficulté. Deux thèmes principaux reviennent à travers notre\n«Roman»: le devoir d'Alexandre de conquérir la Perse pour venger\nles Grecs, et sa mission de rétablir l'ancienne Loi divine commune\naux Grees, aux Arabes (Juifs), aux Perses et aux Hindous. A n'en\npoint douter, le premier de ces thèmes correspondait à ce que notre\népistolographe avait trouvé dans ses sources, le deuxième à sa propre\nconception du rôle d'un «Kosmokratôr». Par contre, on n'y retrouve\njamais l'autre trait essentiel de la légende classique : le désir du Roi\nmacédonien de connaître les merveilles du monde. Or, c'est précisé-\nment ce trait qui est mis en vedette dans la correspondance du ms.\nsyriaque 209 de la Bibliothèque Vaticane, ce qui nous oblige à envi-\nsager la possibilité qu'elle ait fait partie d'un cycle différent 76.\nD'autres lettres encore semblent avoir appartenu à notre Roman\népistolaire, celles dont Ibn Faqih et Al-Birûnî nous parlent. Parmi\nles lettres résumées par Ibn Faqih 77, deux se rattachent à un épisode\ndu « De Mirabilibus Indii »>, celui des trésors pillés par l'armée macé-\ndonienne dans le Royaume de Porus, épisode qu'on rencontre seule-\nment dans les versions latines de cette épître. A leur tour, Ta'âlibî\net al-Mubaššir en avaient entendu parler, mais ce dernier attribuait\nà Olympie, et non pas à Aristote, l'idée d'avoir suggéré à Alexandre\nde faire parvenir en Grèce une description des endroits où il avait\ncaché ces richesses 78.\nOn n'hésitera pas à admettre l'appartenance de ces deux lettres aux\n25 Notons encore la fin de la lettre d'Alexandre (fol. 2v, 1. 2):\nالامعان في التفلسف و الخوض في الحكمة و الايغال في فتح البلاد و\nCar notre attention est سعة الملك للوقوف على عجائب الأمور وحقائقها\nde progresser dans la connaissance de la philosophie, d'avancer dans la sagesse, de pousser\nplus loin à conquérir les pays et à élargir le royaume, afin de parvenir à connaître les\nmerveilles (de l'Univers) et la vérité à leur propos+.\nسمع\nالكيان :\n76 Par souci de précision, ajoutons que, dans sa réponse, Aristote mentionne son\ntraité de Physique appelé ici ball full, alors que dans la ⚫ as-siyasat-al-'âm-\nmiya on rencontre le titre de\nToutefois cette divergence peut provenir\nde quelque copiste. Nous avons déjà constaté comment, dans les différents mss de l'e as-\nsiyasat-al-'âmmiya », l'Éthique à Nicomaque est devenue le Kitâb-al-ahlâq+.\n77 Kitáb al-Buldán, éd. DE GOEYE, p. 160.",
  "36": "244\nM. GRIGNASCHI\nrasâ'il», puisque, dans le résumé d'Ibn Faqih, elles figurent avec\ndes extraits de la «Siyâsat-al-mudun» et du début du résumé du\nTepi кóaμov. Par contre, il est beaucoup plus difficile de rattacher\nà notre «Roman» la réponse d'Aristote à Alexandre, résumée par\nal-Birûnî 7, à propos des questions posées par les Brahmanes sur les\nidoles que les Grecs adoraient. Ces demandes nous reportent à l'é-\nchange des missives entre Alexandre et Dandamis, conservées de\nnouveau et seulement dans deux traductions latines 80. Elles pré-\nsentent, on le sait, des interpolations chrétiennes et précisément\nune longue diatribe contre le polythéisme, à laquelle Alexandre ne\ntrouve rien à opposer. De la sorte, cette interpolation altère le carac-\ntère originaire de cette confrontation philosophique, à notre connais-\nsance la seule, dans la littérature hellénistique, où le représentant\ndu monde grec remportait la palme contre un sage oriental.\nIl est évident que l'auteur de la lettre résumée par al-Birûnî avait\nsous les yeux un exemplaire de cette correspondance contenant\nl'attaque contre les idoles, c'est-à-dire un texte qui peut difficilement\nêtre antérieur au IVe siècle de notre ère. Toutefois, cet auteur modifia\nle problème soulevé par l'interpolateur chrétien. La demande qu'il\nattribuait aux Brahmanes ne concernait plus le polythéisme, mais\nla présence de l'essence divine dans les idoles. La réponse d'Aristote\nqui déclarait n'en rien savoir, impliquait un rejet de la théurgie et,\npar conséquent, de la théorie du «haykal de l'hermétisme grec 81\net arabe.\nOr, nous avons vu comment l'auteur des lettres du ms. syriaque\n209 de la Bibliothèque Vaticane s'était soustrait aux croyances de\nson époque reliant le Grand Oeuvre aux initiations mystiques. Dès\nlors, on ne saurait exclure sans plus l'éventualité que l'auteur de\nnotre Roman »>, vraisemblablement le même que celui de la lettre\nps.-aristotélicienne sur l'alchimie, ait pris le contrepied des cory-\nphées du néoplatonisme et de l'hermétisme. Dans ce cas, il faudrait\nadmettre qu'il était proche de ces commentateurs très rares d'Aris-\ntote qui n'avaient pas tout oublié de l'esprit scientifique de leur\nmaître. Néanmoins, il existe aussi une autre possibilité. Le monde\n78 ZDMG, 1895, p. 595.\n79 L'Inde, texte arabe, p. 60.\n80 PFISTER, Kleine Texten zum Alexander-Roman, III.\n81 Voir par ex. Corpus Hermeticum, Asclepius, § 23-24.",
  "37": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n245\nmusulman connaissait les légendes sur Dandamis 82 et probablement\nmême l'original de nos versions latines du «De Mirabilibus Indii » 83.\nEn tenant compte de ces faits, dans l'état de nos connaissance, il\nest peut-être plus prudent d'attribuer la lettre ps.-aristotélicienne\ncitée par al-Birûnî à un auteur musulman au courant de l'existence\nde notre Roman épistolaire » et désireux de faire remonter au plus\ngrand philosophe de l'Antiquité une condamnation catégorique de\nla théorie du << haykal» et du «hulûl», incompatibles avec l'ortho-\ndoxie islamique 84.\nDemandons-nous maintenant si, abstraction faite des lettres du\nms. Vatican syriaque 209, il est possible de dater avec quelque pré-\ncision nos morceaux choisis», problème d'où dépend leur utilisation\npour l'histoire de la pensée politique du bas hellénisme.\nSelon toute vraisemblance, notre épistolographe était un grec\nd'Égypte ou de Syrie, car dans un passage, il fait allusion aux légen-\ndes des Coptes, entendons des anciens Alyúπrio 85. Il connaissait\nsans aucun doute la «Biographie d'Alexandre»; en effet, dans le\ncorps même de nos lettres, des passages entiers qui, en aucune façon,\nne sauraient être des interpolations d'un auteur arabe, sont repris\nde la «Biographie »; ainsi nous lisons que, dans une de ses expéditions,\nAlexandre avait occupé toute la Scythie, exploit mentionné unique-\nment dans la rédaction y du ps.-Callisthène 8. Différemment de cette\n82 Voir NÖLDEKE, Beiträge zur Geschichte des Alexanderromans (Denkschriften der\nK. Akademie der Wiss., Phil. hist. Cl., 38, Abb. 5, Vienne, 1890), p. 47-48.\n83 Dans les Murůğ-ad-dahab», II, p. 201, Mas'udi cite une lettre envoyée par le\nroi de l'Inde à Hosrô I; le titre semble renfermer un écho lointain de la description du\npalais d'or de Porus dans la version latine du De Mirabilibus Indii ». L'incipit semble\nمن ملك الهند وعظيم اركنة : inspire de la correspondance du pa.Callisthane\nالمشرق وصاحب قصر الذهب و ابواب الياقوت والدر (pxoresة)\n84 L'auteur du Kitab-as-siyâsa fi tadbiri-r-ri'âsa n'a guère eu de scrupules de faire\nprécéder l'Épitre d'Aristote par une lettre d'Alexandre demandant à son maître.\nun traité sur l'art politique. Or, dans l' as-Siyasat-al-'âmmiya», modèle du Kitâb-\nas-siyâsa, Aristote déclare à deux reprises qu'il écrit sa lettre en réponse à une demande\norale, qui lui a été adressée par le roi avant son départ. On voit combien de prudence.\ns'impose avant d'attribuer à notre roman les différentes lettres qu'on trouve éparses\ndans la littérature arabe.\n85 Ms. Aya Sofya, fol. 95v.\n86 Voir note 30. On remarquera que le ps.-Callisthène, y, I, 23, parle uniquement\nd'une victoire d'Alexandre contre les Scythes, tandis que notre épistolographe prétend\nsavoir que le roi macédonien avait occupé la Scythie tout entière. Nous avons ici un\nnouvel exemple des exagérations où notre épistolographe se complaisait.",
  "38": "246\nM. GRIGNASCHI\nversion, notre épistolographe place cette conquête après l'expédition\nen Occident et, par une nouvelle hyperbole, il prétend que les Romains\nne se sont pas bornés à faire acte de soumission au roi macédonien;\nils ont fui devant lui chez les Gaulois 87. Encore, dans la «as-Siyâsat-\nal-'âmmiya», Alexandre adresse à son armée une allocution farcie\nde traits empruntés aux légendes classiques, et qui fait pendant à\ncelle du chap. I, 37 du ps.-Callisthène; dans les deux cas, le discours\nest tenu en présence des ambassadeurs perses. Enfin, toujours dans\ncette «siyâsa», nous trouvons une lettre d'Alexandre adressée aux\nArabes pour les louer de leur foi monothéiste. Assurément, dans sa\nforme actuelle, cette épître appartient, presque en entier, à l'auteur\ndes « rasâ'il», mais une citation ps.-homérique prouve d'une manière\nincontestable qu'elle a remplacé une missive du «Roman épisto-\nlaire »>, dans laquelle, Alexandre signifiait sans doute son adhésion\nau culte du eòs Zówv. Ajoutons que, dans la «siyâsa », cette lettre\nprécède celle envoyée à Porus et une conclusion s'imposera notre\népistolographe connaissait une version du ps.-Callisthène contenant\nle long rapport à Olympie et à Aristote sur l'expédition en Occident.\nCe rapport on le sait figure aussi bien dans la rédaction ẞ que\ndans la rédaction y; mais il faut plutôt penser à cette dernière, car\nseule elle parle d'une expédition dans la Scythie. Ce qui d'ailleurs\nn'exclut nullement que l'auteur ait pu connaître différentes versions\nde la «Biographie ».\nLa rédaction y du ps.-Callisthène constitue donc le « terminus\npost quem de notre Roman épistolaire. Rappelons les résultats de\nl'étude de M. Simon sur les rapports entre l'épisode de la conversion\nd'Alexandre au «Dieu vivant» dans la rédaction ẞ et dans la rédac-\ntion 88. Dans cette dernière, Alexandre n'est plus reconnu comme\nوقد علمت ما كان من أهل رومية الداخلة في : az Aya Sofya, fol. 10r\nمثل هذه الحال وأنهم لما أضلتهم عساكرك أسلموا أطراف بلادهم\nJe anis ce qu'il advint du peuple de la Rome intérieure dans كلها ولجوا إلى فرنجه\n:\nune telle situation. Quand tes soldats les laissèrent s'enfuir, ils quittèrent tous leurs\npays et se sauvèrent en France; nous entendons dans la Gaule (voir note 105). Quant\nà l'expression 9, nous la traduisons le peuple de la Rome intérieure »,\nc'est-à-dire, de la Rome Occidentale», car les géographes arabes emploient souvent\npour distinguer des pays dloignés les uns des autres الداخلة et الخارجة les adjectifs\nmais habités par un même peuple.\n88 Revue d'histoire et de philosophie relifieuses 1941, n. 3.",
  "39": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n247\n* kosmokrator » par le Dieu des Juifs. Le titulaire du poivoir impérial\nest représenté désormais sous les traits d'un néophyte chrétien, mé-\ntamorphose inconcevable avant la conversion de Constantin.\nInversement, l'auteur de la rédaction à de la «Biographie », qui\ndate au plus tôt de la fin du VIIe siècle 8 connaissait déjà notre\n« Roman épistolaire », puisqu'il lui a emprunté sa propre version de\nla lettre d'Alexandre mourant à Olympie.\nQuatre siècles séparent donc le « terminus post quem » du « terminus\nante quem» de notre «Roman épistolaire ». Heureusement une allu-\nsion historique qu'on rencontre dans la «Lettre de félicitations pour\nla conquête d'Anfisân » permet de restreindre ce laps de temps. D'après\nla glose\nqu'on rencontre dans l'index, le « pays d'An-\nfisân »> ne serait autre que la Babylonie. Sans doute, il ne s'agit que\nd'une simple tentative de la part de Sâlim de localiser cette région\nd'après les données de la lettre. De son côté, le professeur Walzer\npréférait entendre qu'il s'agissait de la ville d'Amphissa 90. En fait,\nnous lisons dans cette lettre : « Cette expédition que tu as entreprise,\ncette guerre que tu as commencée, est un exploit unique, qui t'a\nconduit de ton pays au pays d'Asie. Il faut que tu l'achèves et qu'\naprès cette victoire tu pénètres dans la Perse \"». Or, dans les « Aḥbâr-\nal-Iskandar» d'al-Mubaššir 92, nous trouvons une indication assez\nanalogue: «Ensuite il marcha vers la Syrie et de la Syrie il marcha\nvers l'Asie Mineure ».\nMême si nous ne sommes pas en état de proposer une explication\nsatisfaisante du nom d'Anfisân», il faut admettre que notre épis-\ntolographe songeait à la conquête de la Phénicie, placée entre l'Égypte,\noù Alexandre avait fondé sa capitale et que, par conséquent, cet\nécrivain dénommait «son pays », et l'Asie Mineure. On l'admettra\nd'autant plus aisément que, précisément dans cette lettre, nous\ntrouvons la phrase suivante : « Je suis certain que, pour le peuple\nque tu as vaincu, son malheur présent va se transformer en un bon-\n89 Voir HELMUTH VAN THIEL, Die Rezension à des ps. Kallisthenes.\n90 Voir WALTER, Greek into Arabic, p. 139.\n91 Aya Sofya, fol. 24v :\nفإن هذه الغزاة التي غزوتها و الحرب التي\nأنشيتها واحدة متصلة من بلادك إلى بلاد آسية فليس يحسن بك أن\nتقعد عن التمام بل ينبغي لك أن تنفذ من فورك إلى بلاد فارس.\n92 ZDMG, n. 49, p. 589.",
  "40": "248\nM. GRIGNASCHI\nheur, ainsi que l'on raconte du peuple de Maron. Ces gens priaient\nDieu de faire descendre sur eux le malheur, en vue du bonheur qu'ils\nespéraient atteindre par la suite » 93.\nNul doute que cette phrase appartient à l'auteur classique et non\npas à Sâlim Abu-l-'Alâ', qui ne pouvait guère avoir de la sympathie\npour les minorités chrétiennes, moins encore les citer en exemple\nà son maître. De plus, l'expression d'e Ahlu-Märûnîya » correspond\nassez bien à celles qui, en syriaque, désignaient les moines du monas-\ntère de Saint-Maron dans la région d'Antioche. Or, en 517, les Jaco-\nbites avaient tendu un guet-apens aux moines de Saint-Maron, par-\ntisans du concile de Chalcédoine, en avaient massacré un grand nom-\nbre et, peut-être, dévasté leur couvent. Dans le mémorial soumis\nau pape Hormisdas I en 518 et dans une relation envoyée aux Églises\northodoxes, l'archimandrite de ce couvent parlait précisément de\nla joie avec laquelle lui-même et ses confrères avaient supporté ces\npersécutions, qui leur permettaient de gagner la gloire éternelle \"4.\nÀ notre sens, l'accord textuel entre ces passages des documents offi-\nciels de l'Église et la phrase que nous lisons dans la lettre d'Aristote\nde notre Roman, ne saurait être fortuit. L'épistolographe grec devait\navoir présent à l'esprit l'épisode de ces martyrs commémorés chaque\nannée le 31 juillet. D'autre côté, ses expressions semblent impliquer\nqu'un certain temps s'était écoulé depuis ce massacre. Ce qui nous\nramène vers la seconde moitié du VIe siècle, précisément à l'époque\nοὐ Hosro I se parait du titre de γίγας γιγάντων 45\nوأحسب هولاء القوم الذين ظفرت بهم سيكون الشر : 220 .Fol 03\nبهم خيرا كما يقال ان أهل مارونية دعوا ربهم أن\nالذي نزل\nينزل بهم شرا لخير رجوا أن يصيروا اليه بعقب ذلك.\n94 MANSI, VIII, col. 425 ... Nam etai patimur, gaudentes sustinemus, scientes\nquia non sunt condignae passiones huius temporis ad futuram gloriam quae revelabitur\nin nobis » (cfr. Rom., VIII, 18); col. 1130 : ἡμεῖς μὲν ἐπὶ τοῖς γεγενημένοις εἰκότως έσει\nμνυώμεθα πάθη καὶ ὁσίας πληγὰς ὑπὲρ χριστοῦ καὶ θεοῦ ἡμῶν μετὰ πάσης ἀγαθῆς ἐλπίδος\nπροφέροντες col. 1024 : οὐκ εστι νέος, ἀδελφοί, τῆς ἐκκλησίας οὗτος ὁ κόπος ... ἐν χείρᾳ ἔστι\nτοῖς ... τοῦ θεοῦ τὸ ... μετὰ τοῦ θανάτου τῶν σωμάτων τὴν ζωὴν κερδαίνειν τῶν ψυχῶν.\n载\n95 Nous avons déjà fait état de l'affinité entre le début de la lettre d'Alexandre mou-\nrant et le testament du Roman syriaque». Se fondant sur le fait que ce dernier\nsubstitue douze fois le nom de Hosrô à celui de Xerxès, Nöldeke inclinait à l'attribuer\nau règne de Hosró Parwiz. Il se peut toutefois que le traducteur perse songeât plutôt\nau roi Hosrô de l'Avesta. A notre sens, il faudra dater la traduction pehlevie du milieu\ndu VIe siècle, car la description du voyage d'Alexandre à travers l'Asie centrale, même\nsi elle remonte à des sources grecques, a été remaniée par un auteur perse (voir l'épisode",
  "41": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n249\nÉvidemment, nous attribuons ainsi à notre épistolographe un\ngrossier anachronisme. Mais, dans la fin de cette même lettre, Aris-\ntote, parlant de sa jeunesse, raconte qu'il a rencontré Hippocrate \"\nà Athènes et conseille à Alexandre de faire sa connaissance! On\npourrait hésiter à croire qu'un écrivain grec ait imaginé qu'Hippocrate\nétait un contemporain d'Alexandre, et préférer mettre cette phrase\nau compte du traducteur arabe. Mais l'auteur de ce passage savait\nque, dans sa jeunesse, Aristote avait vécu vingt ans à Athènes, détail\nque Sâlim Abû-l-'Alâ' pouvait difficilement connaître, qu'il était\nl'ami de Binûrqați (Xenocratès ?), que, grâce à Platon, il s'était lié à\n(?), bien que ce dernier n'appartînt pas à sa génération.\nDe nouveau, ce sont là des informations qui doivent remonter à\nnotre épistolographe, lequel assurément n'ignorait pas qu'Hippo-\ncrate était mort bien avant la naissance d'Alexandre; cependant,\ntout comme le ps.-Callisthène, il ne se souciait guère de la vraisem-\nblance historique. Nous ajouterons encore que la date que nous\nproposons pour notre roman épistolaire en nous fondant sur cette\nlettre s'accorde avec le jugement porté par Zacher sur les caracté-\nristiques linguistiques du seul fragment grec qui nous soit parvenu :\nl'épître d'Alexandre mourant à Olympie. D'après le savant allemand,\npour des raisons stylistiques et linguistiques, elle doit être l'œuvre.\nd'un auteur du Bas Empire, voire du début de la période byzantine.\nSur la personnalité de cet épistolographe, nous ne sommes en me-\nsure de donner qu'une seule précision. Ses sympathies allaient toutes\nà l'ancien monde classique. Ainsi, dans un passage de la «as-Siyasat-\nal-'âmmiya», il met dans la bouche d'Alexandre une longue profession\nde foi, qu'il a probablement tirée de «logoi» hermétiques à tendance\nmoniste, qui rapprochaient les trois principes du « kosmos » (le << sensus\nmundanus», la «hylè» et le monde) des termes de la première\ntriade de Proclus (le πέρας, Γἄπειρον et le μικτόν); de plus, tout en\ndu dragon des montagnes de l'Inde tué par des boulets de cuivre brûlant, l'ordalie\niranienne du métal fondu, tout comme le dêvâ » Kirm, le Dragon dans le Kârnâmak\nArtaxšėr-i- Pâpakân »). Or,cet auteur ne connaissait pas encore les Turcs. - Dans\nces conditions l'hypothèse s'impose que notre épistolographe possédait l'original gree\ndu Roman pehlevi et que, dans sa lettre d'Alexandre mourant à Olympie, il s'est borné\nà substituer aux dispositions du testament la parabole du Bouddhagosha (IIIe siècle\nav. J.-Chr.), connue en Occident dès le Ier siècle de notre ère; (Pline, Hist. Nat., VII,\n55, § 189 et Lucien de Samosate, Demonax, ch. 25).\n96 Ou Socrate, d'après une leçon conservée dans les marges de nos deux mss.\n97 Voir Asclepius (Corpus Hermeticum, II), à 32.",
  "42": "250\nM. GRIGNASCHI\nconservant le principe hermétique de la création volontaire du monde\npar la Divinité, ces logoi» employaient une terminologie néo-pla-\ntonicienne, parlaient de l'émiσrpoon, de l'An et définissaient le monde\ncomme un τὸ μὴ ὄν 08.\nLe P. Festugière, l'éminent spécialiste de cette période de la philo-\nsophie grecque, a montré de façon décisive que le «Corpus Herme-\nticum » n'a jamais été la Bible d'une religion, ce qui empêche de\nconsidérer la profession de foi d'Alexandre comme le Symbole de\nconventicules hermétiques. Le morceau aura sans doute été écrit\npar notre épistolographe pour le besoin de son œuvre; il n'ajoute\nrien d'essentiel à nos connaissances sur l'hermétisme.\nCependant, d'un autre point de vue, cette profession de foi hermé-\ntique mérite de retenir l'attention. Il ne s'agit pas d'un morceau à\neffet, composé dans des buts littéraires; elle correspond plutôt aux\nconvictions profondes de notre épistolographe, car elle explique\ncertains traits de son œuvre qui, autrement, seraient peu compré-\nhensibles. Alexandre y est représenté comme l'adorateur du Seul Dieu,\nd'un Dieu auquel il n'offre jamais de sacrifices; son but est celui de\nrestaurer la religion des Sages et des Rois anciens, la religion commune,\ndans le passé, aux Grecs, aux Perses, aux Arabes (Hébreux) et aux\nHindous. L'attribution d'un culte monothéiste à des peuples que,\nà la seule exception des Hébreux, les orthodoxes chrétiens et musul-\nmans s'accordaient à considérer comme des polythéistes, nous con-\nfirme définitivement que cette manière de concevoir la mission d'Alex-\nandre ne saurait être le fait de l'auteur des «rasâ'il» et que notre\népistolographe ne peut avoir été chrétien. Par contre, on comprend\naisément qu'un fidèle du Beòs ayvworos n'ait vu aucune contradiction\nà faire d'Alexandre l'adepte d'un culte monothéiste et en même temps\nle restaurateur de l'Ancienne Loi; et Aristote à instar d'Hermès\nSi, ubyt\nو\n98 Aya Sofya, fol. 45r:\nوهي\nفالرؤوس ثلاثة لا محالة\nالصورة و الثاني الهيولى و الثالث العدم لا بزمان و لا بمكان و\nالهيولى بالقوة والصورة بالفعل و العدم هو انقلاب الهيولى إلى ما\nهو بالفعل.\n• En vérité les principes sont au nombre de trois. Le premier et le\nplus noble, c'est la forme. Le deuxième, c'est la matière. Le troisième, c'est le néant\nen dehors du temps et de l'espace. Or, la matière est puissance, la forme actualité;\nle néant est le retour de la matière vers ce qui possède l'actualité ».\n99 P. FESTUOIÈRE, I.c., I, chap. IV.",
  "43": "Trismegiste\nmagicien.\n-\nLE ROMAN ÉPISTOLAIRE CLASSIQUE\n251\nun dévot de Dieu, un philosophe, un alchimiste et un\nNous croyons même que l'hermétisme aide à comprendre une\nanomalie plus profonde encore, que recèle notre «Roman ». A la\nrigueur, on arriverait à concevoir que l'un des derniers tenants des\nanciens cultes ait voulu faire du héros macédonien, désormais annexé\npar le christianisme 100, un kosmokratôr» professant la foi révélée\npar Hermès. Toutefois notre épistolographe ne se proposait pas en\npremier lieu d'exalter les anciens empereurs païens, ce qui aurait\npu correspondre à une volonté de polémiser contre l'Empire Chrétien.\nIl s'est plutôt préoccupé, tout le long de son œuvre, de donner des\nconseils moraux et politiques, d'indiquer les qualités indispensables\nà un souverain afin d'accomplir sa mission. Et cela, en dépit du fait\nqu'à cause de son adhésion à la religion ancienne il ne pouvait guère\nespérer se faire écouter par les souverains de la Nouvelle Rome. Il\nfaut admettre que ce païen croyait aux prophéties annonçant le retour\nde la vraie religion 101. Mais alors, son intérêt pour le problème politique\nintérêt assez rare chez les écrivains du Bas Empire se ratta-\ncherait de quelque manière à l'exaltation des «âmes royales >> et de\nla royauté, qu'on rencontre dans le «Corpus Hermeticum ». Proba-\nblement, le logos » XVIII de ce «Corpus» n'était à l'origine qu'un\ndiscours épidictique présentant tout au plus quelques points de\ncontact avec les thèses de l'hermétisme. Il n'en reste pas moins vrai\nque, pour l'auteur du «Corpus Hermeticum », l'exaltation des rois\net les admonestations assez banales de cette oraison n'étaient pas\nétrangères à l'enseignement d'Hermès 102. On connaît la place que\nStobée, dont le penchant pour l'hermétisme est assez évident,\nfait aux problèmes de la royauté dans le IVe livre de son Antho-\nlogie». Rappelons encore que, dans les «Muhtâr-al-ḥikam » d'al-\nMubaššir, nous retrouvons une longue série de conseils politiques\ndu Roi Ammon, le disciple d'Hermès, traduits d'un recueil grec 103.\n-\n100 Voir l'étude de M. Simon déjà citée; la Légende syriaque d'Alexandre publiée\net traduite par Budge, et la Légende conservée dans le Roman éthiopien ».\n101 Asclepius, § 26.\n102 Sur le problème du Logos XVIII et celui de l'origine du «Corpus Hermeticum »,\nvoir les conclusions de A.D. Nock (C.H., I, XLVIII et IL). Pour la théorie des âmes\nroyales», voir Stobée, frag. XXIV et les remarques du P. Festugière (l.c., I, p. 324 et\nsuiv.).\n103 Pour ce chapitre, Al-Mubaššir s'est servi d'un texte plus ancien, dont quelques\nextraits se retrouvent ancore chez Al-Qifți.",
  "44": "252\nM. GRIGNASCHI\nPeut-être s'agit-il de simples coïncidences, mais, dans l'étude de notre\n«Roman épistolaire », il faudra tenir compte de la possibilité que son\nauteur se soit inspiré de la morale et de la théosophie hermétiques\net ait voulu représenter, sous les traits d'Alexandre, le modèle de ce\nqui aurait dû être un véritable «kosmokratôr» élevé dans le culte\npurement spirituel que le prophète de l'Égypte avait révélé.\nEn tout cas, cet intérêt si marqué de notre épistolographe pour les\nproblèmes politiques, nous a valu la conservation partielle d'un traité\nclassique «L'art de gouverner les cités », qu'en dépit de l'avis con-\ntraire de Lippert et d'autres hellénistes, Niesse, Pridik et, tout der-\nnièrement, le professeur Plezia 104 ont considéré comme un écrit\noriginal d'Aristote.\nLa version complète de cette épître, qui d'ailleurs constitue la\nréponse à une lettre d'Alexandre dont la fausseté éclate aux yeux,\npermet d'exclure cette hypothèse. A part quelques allusions fort\nobscures qui, paraît-il, se rapportent à Ostanès, nous y lisons qu'Alex-\nandre se devait d'expulser les Perses de leur pays, ainsi qu'Attale\nIer avait fait les Galates 105. Mais, en général, le programme proposé\ndans cette lettre à Alexandre n'a rien de commun avec le rôle qui\nlui est dévolu dans «as-Siyâsat-al-'âmmiya ». Il devait venger les\ndestructions de Milète et d'Eréthrie, déporter les Perses, fonder de\nnouvelles cités et leur donner une constitution. C'est là le projet même\nque les Grecs philo-macédoniens du IVe siècle espéraient voir réalisé\npar Philippe et Alexandre. Dès lors, il n'est pas impossible que, pour\nla composition de cette épître, notre épistolographe se soit réellement\nservi d'un traité aristotélicien aujourd'hui perdu. D'ailleurs il avait\n104 Menander (Varsovie 1964), De Aristotelis epistula ad Alexandrum arabice tradita.\nA en juger par le court résumé latin de cet article, le professeur Plezia serait arrivé à\nla conclusion que la lettre en question aurait été écrite par Aristote lui-même et se\nrapporterait aux événements des années 331-330.\n105 Ms. Aya Sofya 4260, fol. 86r; Fâtih, fol. 76r: US &\nو أثرك في بلاد آسية فيكون ذلك كما يذكر انالوس بنقله أهل فرنجه من\nPar une telle mesure, ton souvenir et tes vestiges dureront en Asie et il t'ad-\nviendra ce qui arriva à Attale (I), dont on se souvient à cause du fait qu'il a déporté\nle peuple de France (c'est-à-dire de Galatie). Dans les ms. Aya Sofya 2890 28, fol. 128v,\nconnu par le professeur Plezia, et Köprülü 1609, fol. 132r, on lit\nau lieu de\nJ. Nous retrouvons ici le même type d'anachronisme que dans l'épisode des\nMaronites.",
  "45": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n253\nune connaissance, au moins superficielle, des œuvres de ce philosophe,\npuisque, dans un passage, il cite la «Physikè akróasis >; il est vrai\nque c'est à propos de l'intérêt des jeunes hommes pour les légendes,\ndont Aristote, à notre connaissance, ne parle pas dans la «Physique», 106.\nLa solution définitive du problème des sources de cette lettre 107\net des rapports entre l'hermétisme et l'idéologie politique de notre\népistolographe sera la tâche des spécialistes de la philosophie et de\nla civilisation hellénistiques. Dans cet article, il nous suffisait de démon-\ntrer comment les mss arabes nous ont conservé un roman épistolaire\ngrec et d'en indiquer l'importance même pour l'histoire de la dernière\npériode de la civilisation classique. Peut-être pourrons-nous un jour\napporter une contribution indirecte à ces études par une édition\nde la «as-Siyasat-al'âmmiya », qui nous intéresse, en tant qu'orien-\ntaliste, au point de vue de l'influence des théories classiques sur la\npensée politique de l'Islam.\nTrieste-Opicina,\nVia Nazionale, 12.\nMario GRIGNASCHI.\nالدليل على ذلك ما قلنا في سمع الكيان : 26 .Aya Sofya, fol 100\nLa preuve [de l'excellence. أن الصبيان يشتاقون إلى سمع الخرافات و الأحاديث\nde la philosophie] nous est donnée par ce que nous avons dit dans la Physike Akroasis\nsur le désir des jeunes hommes d'écouter les légendes et les contes».\n107 Dans l'étude de cette lettre, il faudra tenir compte que le texte original a été\nsoumis au moins à deux remaniements: le premier par notre épistolographe, le deuxième\npar l'auteur des rasâ'il ». Or, ainsi qu'il résulte de la pièce XIV, dont nous possédons\nà la fois l'original et le résumé, ce dernier avait l'habitude d'omettre des parties entières\ndu texte qu'il paraphrasait et de donner des résumés insipides des passages qui lui\nprésentaient des difficultés.",
  "46": "254\nM. GRIGNASCHI\nAPPENDICE I\n١) آيا صوفيا . ٤٢٦ ورقة ١٢٣ ب، فاتح ٥٣٢٣ ورقة. ۱۱ آ\nعن المدائني قال تحدث عمرو بن مسعدة بحضرة المأمون\nآ ورقة ١٢٤ آ ف ورقة ۱۱۱\nنسخة من الاسكندر رفيق أهل الأرض بجسده قليلا ......\nب ، ف ورقة ۱۱۳ ۲) ورقة ١٢٥\nخبر ابتداء تعليم أرسطو طاليس\nكان افلاطون الحكيم في زمان روقسطانيس الملك :\n۳) آورقة ۱۳۱ ب، ف ورقة ۱۱۹ ب\nوكتب أرسطو طاليس إلى تلميذه سلام عليك سلام تسمية (كذا)\nلا تسليم رضا [كذا (ف لا سلام رضاء) :\n2\n-\n1 Le même texte et sous une forme plus complète- se retrouve dans les + Apoph-\ntegmes attribués à Hunayn bn Ishaq (ms. Escurial 760, fol. 10r-v; ms. Köprülü 1608,\nfol. 14r; voir KNUST, Mittheilungen aus dem Eskurial, p. 9) JU\n:\n2 La même lettre se retrouve encore dans le ms. Köprülü 1608, fol. 25r, où cependant\nاسحق . و كان افلاطون المعلم الحكيم في زمن روفسطانيس.\nاما بعد سلام عليك سلام سنة لا سلام رضاء : Te incipit » a subi une alteration\nIl est intéressant de noter comment cette leçon est attestée déjà dans les Apophteg-\nmes attribués à Hunayn, ce qui permet de dater la lettre elle-même du IIIe siècle de\nl'hég. au plus tard (voir KNUST, l.ec., p. 36; ms. Escurial 760, fol. 29r:\nوكتب\nأرسطاطاليس إلى تلميذ له أخطأ عليه كتابا يقول في آخره و\nالسلام عليك سلام سنة لا سلام رضاء.",
  "47": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n255\nع) آ ورقة ١٣٣ آ ف ۱۲۱ آ\nوقال أرسطو طاليس في كتاب النفس. أما العقل فيشبه أن يكون\nجوهوا ما يكون في الانسان ولا يفسد.\nه آ ورقة ۱۳۳ ب، ف ۱۲۱ ب\nمن أخبار الفلاسفة و نوادرهم\nيقال أنه اجتمع جماعة من الحكماء في بيت الذهب و كان لهم مواضع\nيجتمعون فيها 3\n٦ آ ورقة ١٣٤ آ، ف ورقة ۱۲۳\nآ\nرسالة أبي على الحسن بن محمد بن المظفر الحاتمي في أغراض\nأبي الطيب أحمد بن الحسين المتنبي الموافقة لحكم أرسطوطاليس\nأما بعد فإن أحق ما احتكمت إليه النفوس أولى النظر الخ\n3 Un texte analogue se retrouve dans les Apophtegmes attribués à Hunayn: ms.\n°\nاجتماع آخر. اجتمع سبعة من حكماء : Esourial, fol. 13r (voir Krus\nوذكر حنين : 1,168 e Kapril ; اليونانيين في بيت الذهب فقالوا\nLa collation de أن سبعة من الفلاسفة اجتمعوا في بيت الذهب فقالوا\nces trois textes, sur lesquels nous espérons revenir, nous a cependant convaincu que les\nms. Aya Sofya et Fâtih nous ont seuls conservé le texte original de Hunayn qui, dans\nles autres ms., à été quelque peu résumée.",
  "48": "256\nM. GRIGNASCHI\nAPPENDICE II\nSentences\nps.-homériques citées dans le ms. Aya Sofya 4260\nPièce III\nآ ورقة ، (ب) وقال أوميرس الشاعر\nإن الحكمة تريد موضعا خاليا لترسخ في العقول و تفهم\nLe poète Homère a dit :\n« La sagesse requiert un esprit libre des passions afin de s'implanter\nsolidement dans l'intelligence et d'être comprise ».\nPièce V\nآ ورقة ۱۳ ب) وقد قال أوميرس الشاعر\nإن الأئمه يصلحون بفضلهم\nرعيتهم ولا يصلح الأئمه مؤتم\nLe poète Homère a dit :\n« Les chefs corrigent les sujets grâce à leur vertu; Le sujet ne peut\ncorriger les chefs ».\nوقد قال أوميرس الشاعر\nكل ضد مخالف ضده\nولا خير في شيء يزول و يذهب\nIII\nLe poète Homère a dit:\n« Tout contraire s'oppose à son contraire.\nIl n'y a rien de bon dans les choses qui déclinent et passent >>.\nآ ورقة 10 آ وقد قال أوميرس الشاعر\nلا مال يكفى عند ترك القناعة\nولا خير في المرء إذا لم يكن قانعا\nIV",
  "49": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\nLe poète Homère a dit :\n257\n« Aucune richesse n'est suffisante quand on s'est dépouillé de la\ncapacité de se contenter.\nIl n'y a rien de bon dans l'homme qui ne sait pas se contenter ».\nآ ورقة ١٤ ب و قد قال أوميرس الشاعر\nليس شيء أدنى من الكذب\nولا خير في المره حمذا كان كذابا\nLe poète Homère a dit :\nIl n'y a rien de plus bas que le mensonge.\nIl n'y rien de bon dans l'homme quand il a l'habitude de mentir».\nPièce VII\nآ ورقة ۲۷ (ب) وقد أحسن أوميرس الشاعر حيث يقول\nلا ينال المراتب السنية بخيل\nولا يرتقي على الدرجة العليا إلا كريم\nLe poète Homère a dit très bien :\n« L'avare n'obtient pas un rang élevé :\nSeul celui qui est généreux parvient à un haut rang».\nآ ورقة ٢٦ (ب) و قد أحسن أوميرس الشاعر حيث يقول\nلا يصلح المولع بالكذب لشيء\nحتى يصلح الثعلب للذئب\nVI\nVII\nLe poète Homère a dit très bien :\n«Celui qui aime le mensonge ne sert à rien, aussi longtemps que le\nrenard ne sera pas utile au loup ».\nورقة ۳۱ آ وقد أحسن أوميرس الشاعر حيث يقول\nما أبغض شيخا زانیا و فقيها فاجرا\nVIII\nLe poète Homère a dit très bien :\n« Qu'il est odieux un vieillard adultère et un homme de loi débauché ».",
  "50": "258\nM. GRIGNASCHI\nآ ورقة ( ب) إحفظ ما قال أوميرس الشاعر حيث يقول\nمن طمع أن يذهب على الناس مذهبه فقد جهل\nIX\nObserve (ô Alexandre) ce que le poète Homère a dit :\n«Celui qui désire que sa manière de se conduire devienne universelle,\nest ignorant ».\nآ ورقة ٣٤ (ب) وحقا أقول يا قوم ان أوميرس مصيب في\nقوله في اللغز\nإن الهيولى مثال الانثى والصورة مثال الذكر\nاصلحوا أنفسكم تصلح لكم آخرتكم\nX\nEn vérité je vous le dis, ô hommes, qu'Homère avait raison lorsqu'il\na dit, à propos de la métaphore:\n«La matière ressemble à la femme, la forme au mâle ». Corrigez\nvos âmes; la vie future sera bonne pour vous.\nآ ورقة ٤٤ آ كن على ما وصف أوميرس\nأسدا عند الحركة ، جملا عند السكون كالنمر\nالذي لا ينام وقت جوعه ولا يسهر وقت شبعه\nXI\nSois (ô Alexandre) comme Homère l'a indiqué :\n« Un lion dans le mouvement, un chameau dans le repos,\nUn tigre qui ne dort pas quand il a faim et ne veille pas quand il\nest rassasié ».\nورقة ٤٩ أ فهو كما قال أوميرس الشاعر\nفي الدم سيفه لا يرفع\nوأمواله تنفد و خراجه مع\nهذا ثقيل\nوخزائنه خراب و من يشكره قليل\nXII\n(Darius) ressemble à celui, dont le poète Homère a dit :\n<< Son épée est trempée dans le sang et jamais elle n'en est retirée;",
  "51": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\n259\nSes biens sont dilapidés bien que le tribut qu'il impose soit lourd.\nSon trésor est vide et ceux qui le louent, sont rares >>.\nآ ورقة ٥٦ ب) وقد استحسنت قول أوميرس حيث يقول\nالدنيا دار من نال مراتبها لم يفرح\nومن فقد الرئاسة فيها كان حقيرا\nLe poète Homère a très bien dit :\n* Le monde est une maison, dans laquelle celui qui obtient les hon-\nneurs n'en jouit pas.\nMais celui qui y perd le pouvoir devient méprisable ».\n(أ ورقة ٦٠ (أ) وهم كما قال أوميرس الشاعر\nسیدهم مسود و نذلهم غال في النذاله\nXIV\nIls (les Turcs) sont comme le poète Homère l'a dit :\n« Leur seigneur est noirci et les vils parmi eux dépassent les bornes\nde l'abjection ». 1\nآ ورقة ٦٢ آ و أنتم كما قال شاعر الروم\nفازوا بالفخر و علا كعبهم بالكرم\nوزان ذلك صبرهم على طلبته\nXV\nVous êtes (ô Arabes) comme ceux dont le poète des Grecs a dit :\n«Ils excellent grâce à leur illustration; leur gloire est illustre grâce\nà leur noblesse,\nLeur constance à la rechercher y ajoute encore du lustre ».\nPièce IX\nXVI آ ورقة ٧٧ (ب) و ذكرت قول أوميرس الشاعر\n1 Nous gardons le forme du ms. Aya Sofya parce qu'elle est confirmée par le\nms. de Paris. Cependant il serait, peut-être, préférable de lire (hardi, courageux),\n=\nدارا بالأمسى سيد مسود عال متبجر : car au f. Aya Sofya 5er nous lisons",
  "52": "260\nM. GRIGNASCHI\nلا وفاء لمن لم يحفظ المعروف\nو لا خير فيمن ضيع سيده\nJ'ai cité (aux assassins de Darius) les vers du poète Homère :\n« Il n'y a pas de loyauté à l'égard de celui qui ne se souvient pas des\nbienfaits.\nIl n'y a rien de bon pour celui qui cause la ruine de son maître ».\nXVII آ ورقة ۷۸ (ب) فقد قال أوميرس الشاعر\nذكره\nكل من سن خيرا بقي\nو لا خير فيمن يسن الشر\nLe poète Homère a dit :\n« Le nom de celui qui a donné de bonnes lois, survit.\nMais il n'y a rien de bon dans celui qui en donne de mauvaises >>.\nPièce X\nXVIII آ ورقة (ب) ذكر هذا الباب أوميرس الشاعر حيث قال\nان زاوس اب للأعلين و الأسفلين\nLe poète Homère a mentionné ce problème dans sa poésie, là où il\na dit :\n* En vérité Zeus est un père pour les plus grands et les plus humbles>>.\nXIX آ ورقة ۸۹ (ب) وقد أخبر أوميرس الشاعر أيضا يذم إفراط\nالغضب والحدة و المحك حيث يقول.\nان سقر وحدها\nهي التي\nلا يقنعها شيء\nأبدا\nLe poète Homère lui-même l'a dit, en condamnant l'excès de la\ncolère, de la violence, de la rixe :\n<< Le feu de l'Enfer, c'est le seul que rien ne parvient jamais à apaiser».",
  "53": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\nPièce XIII\nورقة ٩٦ آ وإنه لينبغى أن يقال فيها كما قال أوميرس في\nصانع منطقة هرقلس\nانه لو لم يكن صنع شيئا قط سواها\nلكفاه بصنعتها شرفا اذ اورد على\nالناس مثل تلك الصنعة\n261\nXX\nIl faudra vraiment dire à propos de cette expédition ce que le poète\nHomère a dit de celui qui a fabriqué la ceinture d'Héraklès :\n<< Même s'il n'avait créé rien d'autre, il lui suffirait la gloire d'avoir\nfabriqué cette ceinture,\nCar il a enseigné aux hommes un tel art>>.\nAPPENDICE III\nفاتح ٥٣٢٣ ورقة ۱۰۸ ب\nآيا صوفيا ٤٢٦٠ ورقة ١٢١ ب\nهما قالته الفلاسفة\nقال أحدهم لقد حركنا الاسكندر بسكونه\nوقال ارسطو طاليس. صدر عنا الاسكندر ناطقا و قدم علينا صامتا\nوقال آخر . خرجنا من الدنيا جاهلين و أقمنا فيها غافلين و نخرج\nعنها كارهين\nوقال ميلاطوس أيها الساعي المغتصب ، جمعت ما خانك عند\nالاحتجاج وودعك عند الاحتياج فلا قرابة يزورك و لا وزير ينقذك",
  "54": "262\nM. GRIGNASCHI\nوقال فيليمون. هذا يوم عظيم أقبل من شره ما كان مديرا و أدبر\nمن خيره ما كان مقبلا فمن كان باكيا على زوال ملكه فليبك\nومما قالته قرابته و خاصته\nقال أحدهم ما أرغبنا فيها فارقت و أغفلنا عما عاينت\nوقال فيليهون. اضمحل سلطانك كما اضمحل السحاب وعفت آثار\nملكك كما عفت آثار الرباب\nوقال آخر. أيها الساعى المغتصب جمعت ما خذلك و ولى عنك\nفلزمتك أوزاره وصار لغيرك هناؤه\nوقال آخر. يا من ضاقت عليه الأرض طولا وعرضا ليت شعرى\nكيف حالك فيما احتوى عليك منها.\nوقال آخر. كنت بالأمس للذهب جامعا واليوم الذهب قد جمعك\nوقال آخر ما أزهد الناس فيك وأرغبهم في تابوتك\nوايضا مما قيل فيه\nعهدي و ـب البلاد تضيق عنك فما حالك في ضيق ما اشتمل\nمنها عليك :\n2\nوقال آخر. يا من ذلل الأملاك كيف رأيت تذليل الموت اياك.\nوقال آخر. سفرة ما سافر مثلها بلا زاد ولا أعوان\nف الاخر\nف عليك منها",
  "55": "LE ROMAN ÉPISTOLAIRE CLASSIQUE\nExtrait des sentences prononcées par des philosophes.\n1) L'un dit: Alexandre nous a ému par son silence».\n263\n2) Aristote dit: Alexandre nous a quittés en parlant et revient à nous en silence ».\n3) Un autre dit : «Nous sommes venus au monde ignorants, nous y restons\ninsouciants [du futur] et nous en sortons à contre-coeur ».\n4) Milâtûs dit : «O collecteur brutal, tu as rassemblé ce qui t'a trahi quand tu\nvoulais t'en servir, ce qui t'a abandonné au moment du besoin. Ni les parents ne\npeuvent désormais te rendre visite, pas plus que les vizirs ne peuvent te sauver ».\n5) Polémon dit : « Voilà un grand jour. Il a amené le malheur qu'il tenait éloigné\net a fait fuir le bien qu'il apportait. Celui qui pleurait sur le passage de son royaume,\na bien de quoi pleurer».\nExtrait des sentences prononcées par ses parents et par ses familiers.\n6) L'un dit : « Qu'est-ce qui nous fait désirer ce dont tu t'es séparé, et nous\nfait oublier ce que tu as vu de tes yeux ? ».\n7) Filihûn dit : «Ton pouvoir a disparu comme une nuée emportée par le vent\net les traces de ton royaume se sont effacées comme s'effacent les traces des nuages\ninstables ».\n8) Un autre dit : «O collecteur brutal, tu as rassemblé ce qui t'a abandonné\net t'a tourné le dos. Tu en as pris sur toi tout le poids et d'autres que toi en pro-\nfiteront».\n9) Un autre dit: O toi, pour qui le monde était trop étroit en longueur et en\nlargeur, puissé-je comprendre comment tu te trouveras dans le peu de terre qui\nte renfermera > !\n10) Un autre dit : «Hier, tu ramassais l'or; aujourd'hui c'est l'or qui te renferme ».\n11) Un autre dit : « Que les hommes se passent [aisément] de toi et qu'ils con-\nvoitent ton coffre ».\nD'autres sentences encore prononcées sur Alexandre.\n12) Je le sais, l'étendue de la terre était étroite pour toi. Comment te trouveras-\ntu dans l'espace étroit qui te renfermera ? +\n13) Un autre dit : «O toi qui renversais les rois, comment as-tu considéré le\nfait que la mort t'ait renversé à son tour?>\n14) Un autre dit : «Voilà un voyage tel qu'Alexandre n'a jamais entrepris,\nsans provisions et sans compagnons ».",
  "56": "264\nM. GRIGNASCHI\nI\nMas'ûdi,\nHistoire Ta'âlîbî\nSahrestâni Eutychius Petrus Hunayn Mubaššir,\nkitâb-al-\nI\nMurûg\nAnonyme (Gurur)\néthiopienne\n(Kitab-al et ms.\nmilal)\nKöprülü\nAlphonsus Apophteg- Kitab el\nmes\nhikam\nFirdausî Ahmedi,\nŠahnamah Iskender-\nnâme\nΠ\n土\n土\nH\n土\n士(An.)\n土\nVI\nVII±\n士(An.) ±(An.)\nVIII\nIX\nX 士(An.)\nXI\nXII | ± (An.)\nXIII\nXIV\nN.B. An. = Analogue.\n士(An.)\nH\nH\n士(An.)\n士\n士(An.)\n±(An.)\n士(An.)\n士\n土(An.)\n士(An.)\n±(An.)\n士(An.)\n± (An.)\n车车\n±(An.)"
}